#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасы(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства)
	
	//--------------------------------------------------------------------------
	// © Шишка В.В. [17 августа 2021]  НАЧАЛО
	УчетСебестоимостиВРазрезеОрганизации = СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетСебестоимостиВРазрезеОрганизации;
	УправлениеНебольшойФирмойСервер.ВыполнитьКорректировкуВременнойТаблицыЗапасыПоУчетуВРазрезеОрганизаций(СтруктураДополнительныеСвойства);	
	// © Шишка В.В. [17 августа 2021]  КОНЕЦ
	//--------------------------------------------------------------------------
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасы.НомерСтроки) КАК НомерСтроки,
	//Paganini_ONESOFT-2657_
	|	ТаблицаЗапасы.Получатель_Транзитный,	
	//_Paganini_ONESOFT-2657
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ТаблицаЗапасы.ВидОперации КАК ВидОперации,
	|	ТаблицаЗапасы.ВалютаЦеныПолучатель КАК ВалютаЦеныПолучатель,
	|	ТаблицаЗапасы.ТипСчетаЗатрат КАК ТипСчетаЗатрат,
	|	ТаблицаЗапасы.КоррНаправлениеДеятельности КАК КоррНаправлениеДеятельности,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.СценарийПланирования КАК СценарийПланирования,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|	ТаблицаЗапасы.КоррСчетУчета КАК КоррСчетУчета,
	|	ТаблицаЗапасы.СчетУчетаРегл КАК СчетУчетаРегл, //+++
	|	ТаблицаЗапасы.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл, //+++
	|	ТаблицаЗапасы.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл, //+++ // Kuzmich, отменил комментирование, иначе вылетает ошибка при движении по резервам
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.КоррНоменклатура КАК КоррНоменклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.КоррХарактеристика КАК КоррХарактеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.КоррПартия КАК КоррПартия,
	|	ТаблицаЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаЗапасы.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
	|	НЕОПРЕДЕЛЕНО КАК ДокументПродажи,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказПродажи,
	|	ТаблицаЗапасы.КоррСчетУчета КАК СчетДт,
	|	ТаблицаЗапасы.СчетУчета КАК СчетКт,
	|	ТаблицаЗапасы.КоррСчетУчетаРегл КАК СчетДтРегл,
	|	ТаблицаЗапасы.СчетУчетаРегл КАК СчетКтРегл,
	|	ТаблицаЗапасы.ПеремещениеВРозницу КАК ПеремещениеВРозницу,
	|	ТаблицаЗапасы.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
	|	ТаблицаЗапасы.ВозвратИзРозницыСуммовойУчет КАК ВозвратИзРозницыСуммовойУчет,
	|	ТаблицаЗапасы.СчетУчетаВРознице КАК СчетУчетаВРознице,
	|	ТаблицаЗапасы.СчетУчетаНаценки КАК СчетУчетаНаценки,
	|	ТаблицаЗапасы.СчетУчетаВРозницеПолучатель КАК СчетУчетаВРозницеПолучатель,
	|	ТаблицаЗапасы.СчетУчетаНаценкиПолучатель КАК СчетУчетаНаценкиПолучатель,
	|	ТаблицаЗапасы.СчетУчетаВРозницеРегл КАК СчетУчетаВРозницеРегл,
	|	ТаблицаЗапасы.СчетУчетаНаценкиРегл КАК СчетУчетаНаценкиРегл,
	|	ТаблицаЗапасы.СчетУчетаВРозницеПолучательРегл КАК СчетУчетаВРозницеПолучательРегл,
	|	ТаблицаЗапасы.СчетУчетаНаценкиПолучательРегл КАК СчетУчетаНаценкиПолучательРегл,
	|	ТаблицаЗапасы.СодержаниеПроводки КАК Содержание,
	|	ТаблицаЗапасы.СодержаниеПроводки КАК СодержаниеПроводки,
	|	ТаблицаЗапасы.Имущество КАК Имущество,
	|	ТаблицаЗапасы.ПодразделениеОС КАК ПодразделениеОС,
	|	ТаблицаЗапасы.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ТаблицаЗапасы.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ТаблицаЗапасы.СчетЗатрат КАК СчетЗатрат,
	|	ТаблицаЗапасы.ПрименитьВТекущемМесяце КАК ПрименитьВТекущемМесяце,
	|	ТаблицаЗапасы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	//Малышев 2024-06-12 вернул обратно, т.к. данное заполнение делается в начальном наборе ТаблицаЗапасы
	////ПодольскийАИ #УчетПроектов 05.10.2020 {
	|	ТаблицаЗапасы.Проект КАК Проект,
	|	ТаблицаЗапасы.КоррПроект КАК КоррПроект,
	|	ТаблицаЗапасы.ДокументПоступления, //Малышев 2024-11-19 ONESOFT-3602
	
	////ПодольскийАИ #УчетПроектов 05.10.2020 }
	//_Lazare
	//|	ВЫБОР
	//|		КОГДА ТаблицаЗапасы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ТаблицаЗапасы.Проект
	//|	КОНЕЦ КАК Проект,
	//|	ВЫБОР
	//|		КОГДА ТаблицаЗапасы.КоррПроект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ТаблицаЗапасы.КоррПроект
	//|	КОНЕЦ КАК КоррПроект,
	//Lazare_
	|	ТаблицаЗапасы.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ТаблицаЗапасы.СчетЗатратРегл КАК СчетЗатратРегл,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация, //+++ Дмгг
	|	ТаблицаЗапасы.Адрес КАК Адрес,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаЗапасы.ВозвратИзРозницыСуммовойУчет
	|				ТОГДА -ТаблицаЗапасы.Количество
	|			ИНАЧЕ ТаблицаЗапасы.Количество
	|		КОНЕЦ) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаЗапасы.ВозвратИзРозницыСуммовойУчет
	|				ТОГДА -ТаблицаЗапасы.Резерв
	|			ИНАЧЕ ТаблицаЗапасы.Резерв
	|		КОНЕЦ) КАК Резерв,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаЗапасы.ВозвратИзРозницыСуммовойУчет
	|				ТОГДА -ТаблицаЗапасы.Себестоимость
	|			ИНАЧЕ ТаблицаЗапасы.Сумма
	|		КОНЕЦ) КАК Сумма,
	|	ЛОЖЬ КАК ФиксированнаяСтоимость
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	(НЕ ТаблицаЗапасы.ПеремещениеВРозницеСуммовойУчет)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	//Paganini_ONESOFT-2657_
	|	ТаблицаЗапасы.Получатель_Транзитный,	
	//_Paganini_ONESOFT-2657
	|	ТаблицаЗапасы.ВидОперации,
	|	ТаблицаЗапасы.ВалютаЦеныПолучатель,
	|	ТаблицаЗапасы.ТипСчетаЗатрат,
	|	ТаблицаЗапасы.КоррНаправлениеДеятельности,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СценарийПланирования,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.КоррСтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.СчетУчетаВРозницеПолучатель,
	|	ТаблицаЗапасы.СчетУчетаРегл,
	|	ТаблицаЗапасы.СчетУчетаВРозницеПолучательРегл,
	|	ТаблицаЗапасы.КоррСчетУчета,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.КоррНоменклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.КоррХарактеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.КоррПартия,
	|	ТаблицаЗапасы.ЗаказПокупателя,
	|	ТаблицаЗапасы.КоррЗаказПокупателя,
	|	ТаблицаЗапасы.СодержаниеПроводки,
	|	ТаблицаЗапасы.СчетУчетаНаценкиПолучатель,
	|	ТаблицаЗапасы.СчетУчетаНаценкиПолучательРегл,
	|	ТаблицаЗапасы.СчетУчетаЗатратРегл, //+++ // Kuzmich, отменил комментирование, иначе вылетает ошибка при движении по резервам
	|	ТаблицаЗапасы.ПеремещениеВРозницуСуммовойУчет,
	|	ТаблицаЗапасы.ПеремещениеВРозницу,
	|	ТаблицаЗапасы.ВозвратИзРозницыСуммовойУчет,
	|	ТаблицаЗапасы.СчетУчетаВРознице,
	|	ТаблицаЗапасы.СчетУчетаНаценки,
	|	ТаблицаЗапасы.КоррСчетУчета,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.СчетУчетаВРозницеРегл,
	|	ТаблицаЗапасы.СчетУчетаНаценкиРегл,
	|	ТаблицаЗапасы.КоррСчетУчетаРегл,
	|	ТаблицаЗапасы.СчетУчетаРегл,
	|	ТаблицаЗапасы.Имущество,
	|	ТаблицаЗапасы.ПодразделениеОС,
	|	ТаблицаЗапасы.СрокИспользованияДляВычисленияАмортизации,
	|	ТаблицаЗапасы.ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ТаблицаЗапасы.СчетЗатрат,
	|	ТаблицаЗапасы.НаправлениеДеятельности,
	//Малышев 2024-06-12 вернул обратно, т.к. данное заполнение делается в начальном наборе ТаблицаЗапасы
	//ПодольскийАИ #УчетПроектов 05.10.2020 {
	|	ТаблицаЗапасы.Проект,
	|	ТаблицаЗапасы.КоррПроект,
	|	ТаблицаЗапасы.ДокументПоступления, //Малышев 2024-11-19 ONESOFT-3602
	//ПодольскийАИ #УчетПроектов 05.10.2020 }
	//_Lazare
	//|	ВЫБОР
	//|		КОГДА ТаблицаЗапасы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ТаблицаЗапасы.Проект
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ТаблицаЗапасы.КоррПроект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ТаблицаЗапасы.КоррПроект
	//|	КОНЕЦ,
	//Lazare_
	|	ТаблицаЗапасы.СтоимостьДляВычисленияАмортизации,
	|	ТаблицаЗапасы.СчетЗатратРегл,
	|	ТаблицаЗапасы.Адрес,
	|	ТаблицаЗапасы.ПрименитьВТекущемМесяце,
	|	ТаблицаЗапасы.СодержаниеПроводки";
	
	РезультатЗапроса = Запрос.Выполнить();

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", РезультатЗапроса.Выгрузить());
	
	// Установка исключительной блокировки контролируемых остатков запасов.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|	ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|	ТаблицаЗапасы.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ТаблицаЗапасы.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл, // Kuzmich, отменил комментирование, иначе вылетает ошибка при движении по резервам
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.ЗаказПокупателя КАК ЗаказПокупателя
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаЗапасы.Организация КАК Организация,
	|		ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|		ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|		ТаблицаЗапасы.СчетУчетаРегл КАК СчетУчетаРегл,
	|		ТаблицаЗапасы.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл, // Kuzmich, отменил комментирование, иначе вылетает ошибка при движении по резервам
	|		ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|		ТаблицаЗапасы.Характеристика КАК Характеристика,
	|		ТаблицаЗапасы.Партия КАК Партия,
	|		ТаблицаЗапасы.ЗаказПокупателя КАК ЗаказПокупателя
	|	ИЗ
	|		ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|	ГДЕ
	|		ТаблицаЗапасы.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		И (НЕ ТаблицаЗапасы.ПеремещениеВРозницеСуммовойУчет)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаЗапасы.Организация,
	|		ТаблицаЗапасы.СтруктурнаяЕдиница,
	//|		ТаблицаЗапасы.СчетУчета,
	|		ТаблицаЗапасы.СчетУчетаРегл,
	|		ТаблицаЗапасы.СчетУчетаЗатратРегл, // Kuzmich, отменил комментирование, иначе вылетает ошибка при движении по резервам
	|		ТаблицаЗапасы.Номенклатура,
	|		ТаблицаЗапасы.Характеристика,
	|		ТаблицаЗапасы.Партия,
	|		ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	ИЗ
	|		ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|	ГДЕ
	|		(НЕ ТаблицаЗапасы.ПеремещениеВРозницеСуммовойУчет)) КАК ТаблицаЗапасы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	//|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.СчетУчетаРегл,
	|	ТаблицаЗапасы.СчетУчетаЗатратРегл, // Kuzmich, отменил комментирование, иначе вылетает ошибка при движении по резервам
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.ЗаказПокупателя";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Запасы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;

	Для каждого КолонкаРезультатЗапроса из РезультатЗапроса.Колонки Цикл 
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	// Получение остатков запасов по стоимости.      
	
	
	
	Запрос.Текст =
	//+++ Дмгг
	//"ВЫБРАТЬ
	//|	ЗапасыОстатки.Организация КАК Организация,
	//|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	////|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	//|	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
	////|	ЗапасыОстатки.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	//|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	//|	ЗапасыОстатки.Характеристика КАК Характеристика,
	//|	ЗапасыОстатки.Партия КАК Партия,
	//|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	//|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	//|	СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		ЗапасыОстатки.Организация КАК Организация,
	//|		ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	////|		ЗапасыОстатки.СчетУчета КАК СчетУчета,
	//|		ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
	////|		ЗапасыОстатки.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	//|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
	//|		ЗапасыОстатки.Характеристика КАК Характеристика,
	//|		ЗапасыОстатки.Партия КАК Партия,
	//|		ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	//|		СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	//|		СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток
	//|	ИЗ
	//|		РегистрНакопления.Запасы.Остатки(
	//|				&МоментКонтроля,
	////|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	//|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	//|					(ВЫБРАТЬ
	//|						ТаблицаЗапасы.Организация,
	//|						ТаблицаЗапасы.СтруктурнаяЕдиница,
	////|						ТаблицаЗапасы.СчетУчета,
	//|						ТаблицаЗапасы.СчетУчетаРегл, //+++ Дмгг
	//|						ТаблицаЗапасы.Номенклатура,
	//|						ТаблицаЗапасы.Характеристика,
	//|						ТаблицаЗапасы.Партия,
	//|						ТаблицаЗапасы.ЗаказПокупателя
	//|					ИЗ
	//|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	//|					ГДЕ
	//|						ТаблицаЗапасы.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))) КАК ЗапасыОстатки
	//|	
	//|	СГРУППИРОВАТЬ ПО
	//|		ЗапасыОстатки.Организация,
	//|		ЗапасыОстатки.СтруктурнаяЕдиница,
	////|		ЗапасыОстатки.СчетУчета,
	//|		ЗапасыОстатки.СчетУчетаРегл,
	////|		ЗапасыОстатки.СчетУчетаЗатратРегл,
	//|		ЗапасыОстатки.Номенклатура,
	//|		ЗапасыОстатки.Характеристика,
	//|		ЗапасыОстатки.Партия,
	//|		ЗапасыОстатки.ЗаказПокупателя
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ЗапасыОстатки.Организация,
	//|		ЗапасыОстатки.СтруктурнаяЕдиница,
	////|		ЗапасыОстатки.СчетУчета,
	//|		ЗапасыОстатки.СчетУчетаРегл,
	////|		ЗапасыОстатки.СчетУчетаЗатратРегл,
	//|		ЗапасыОстатки.Номенклатура,
	//|		ЗапасыОстатки.Характеристика,
	//|		ЗапасыОстатки.Партия,
	//|		ЗапасыОстатки.ЗаказПокупателя,
	//|		СУММА(ЗапасыОстатки.КоличествоОстаток),
	//|		СУММА(ЗапасыОстатки.СуммаОстаток)
	//|	ИЗ
	//|		РегистрНакопления.Запасы.Остатки(
	//|				&МоментКонтроля,
	////|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	//|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	//|					(ВЫБРАТЬ
	//|						ТаблицаЗапасы.Организация,
	//|						ТаблицаЗапасы.СтруктурнаяЕдиница,
	////|						ТаблицаЗапасы.СчетУчета,
	//|						ТаблицаЗапасы.СчетУчетаРегл, //+++ Дмгг
	//|						ТаблицаЗапасы.Номенклатура,
	//|						ТаблицаЗапасы.Характеристика,
	//|						ТаблицаЗапасы.Партия,
	//|						ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	//|					ИЗ
	//|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы)) КАК ЗапасыОстатки
	//|	
	//|	СГРУППИРОВАТЬ ПО
	//|		ЗапасыОстатки.Организация,
	//|		ЗапасыОстатки.СтруктурнаяЕдиница,
	////|		ЗапасыОстатки.СчетУчета,
	//|		ЗапасыОстатки.СчетУчетаРегл,
	////|		ЗапасыОстатки.СчетУчетаЗатратРегл,
	//|		ЗапасыОстатки.Номенклатура,
	//|		ЗапасыОстатки.Характеристика,
	//|		ЗапасыОстатки.Партия,
	//|		ЗапасыОстатки.ЗаказПокупателя
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ДвиженияДокументаЗапасы.Организация,
	//|		ДвиженияДокументаЗапасы.СтруктурнаяЕдиница,
	////|		ДвиженияДокументаЗапасы.СчетУчета,
	//|		ДвиженияДокументаЗапасы.СчетУчетаРегл,
	////|		ДвиженияДокументаЗапасы.СчетУчетаЗатратРегл,
	//|		ДвиженияДокументаЗапасы.Номенклатура,
	//|		ДвиженияДокументаЗапасы.Характеристика,
	//|		ДвиженияДокументаЗапасы.Партия,
	//|		ДвиженияДокументаЗапасы.ЗаказПокупателя,
	//|		ВЫБОР
	//|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	//|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	//|		КОНЕЦ,
	//|		ВЫБОР
	//|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Сумма, 0)
	//|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Сумма, 0)
	//|		КОНЕЦ
	//|	ИЗ
	//|		РегистрНакопления.Запасы КАК ДвиженияДокументаЗапасы
	//|	ГДЕ
	//|		ДвиженияДокументаЗапасы.Регистратор = &Ссылка
	//|		И ДвиженияДокументаЗапасы.Период <= &ПериодКонтроля) КАК ЗапасыОстатки
	//|
	//|ГДЕ
	//|	ЗапасыОстатки.КоличествоОстаток > 0
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЗапасыОстатки.Организация,
	//|	ЗапасыОстатки.СтруктурнаяЕдиница,
	////|	ЗапасыОстатки.СчетУчета,
	//|	ЗапасыОстатки.СчетУчетаРегл,
	////|	ЗапасыОстатки.СчетУчетаЗатратРегл,
	//|	ЗапасыОстатки.Номенклатура,
	//|	ЗапасыОстатки.Характеристика,
	//|	ЗапасыОстатки.Партия,
	//|	ЗапасыОстатки.ЗаказПокупателя";
	"ВЫБРАТЬ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ЗапасыОстатки.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл, // Kuzmich, вставил, иначе вылетает ошибка при движении по резервам
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	ЗапасыОстатки.Проект КАК Проект, 		//Малышев 2024-06-05 ONESOFT-3093
	|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗапасыОбороты.Организация КАК Организация,
	|		ЗапасыОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ЗапасыОбороты.СчетУчетаРегл КАК СчетУчетаРегл,
	|		ЗапасыОбороты.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл, // Kuzmich, вставил, иначе вылетает ошибка при движении по резервам
	|		ЗапасыОбороты.Номенклатура КАК Номенклатура,
	|		ЗапасыОбороты.Характеристика КАК Характеристика,
	|		ЗапасыОбороты.Партия КАК Партия,
	|		ЗапасыОбороты.Проект КАК Проект, 		//Малышев 2024-06-05 ONESOFT-3093
	|		ЗапасыОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
	|		СУММА(ЗапасыОбороты.КоличествоОборот) КАК КоличествоОстаток,
	|		СУММА(ЗапасыОбороты.СуммаОборот) КАК СуммаОстаток
	|	ИЗ
	|		РегистрНакопления.Запасы.Обороты(
	|				,
	|				&ПериодКонтроля,
	|				Регистратор,
	//|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В
	|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия, Проект, ЗаказПокупателя) В  //Малышев 2024-06-05 ONESOFT-3093
	|					(ВЫБРАТЬ
	|						ТаблицаЗапасы.Организация,
	|						ТаблицаЗапасы.СтруктурнаяЕдиница,
	|						ТаблицаЗапасы.СчетУчетаРегл,
	|						ТаблицаЗапасы.Номенклатура,
	|						ТаблицаЗапасы.Характеристика,
	|						ТаблицаЗапасы.Партия,
	|						ТаблицаЗапасы.Проект,  //Малышев 2024-06-05 ONESOFT-3093
	|						ТаблицаЗапасы.ЗаказПокупателя
	|					ИЗ
	|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|					ГДЕ
	|						ТаблицаЗапасы.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))) КАК ЗапасыОбороты
	|	ГДЕ
	|		ЗапасыОбороты.Регистратор <> &Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗапасыОбороты.Организация,
	|		ЗапасыОбороты.СтруктурнаяЕдиница,
	|		ЗапасыОбороты.СчетУчетаРегл,
	|		ЗапасыОбороты.СчетУчетаЗатратРегл, // Kuzmich, вставил, иначе вылетает ошибка при движении по резервам
	|		ЗапасыОбороты.Номенклатура,
	|		ЗапасыОбороты.Характеристика,
	|		ЗапасыОбороты.Партия,
	|		ЗапасыОбороты.Проект, //Малышев 2024-06-05 ONESOFT-3093
	|		ЗапасыОбороты.ЗаказПокупателя
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗапасыОбороты.Организация,
	|		ЗапасыОбороты.СтруктурнаяЕдиница,
	|		ЗапасыОбороты.СчетУчетаРегл,
	|		ЗапасыОбороты.СчетУчетаЗатратРегл, // Kuzmich, вставил, иначе вылетает ошибка при движении по резервам
	|		ЗапасыОбороты.Номенклатура,
	|		ЗапасыОбороты.Характеристика,
	|		ЗапасыОбороты.Партия,
	|		ЗапасыОбороты.Проект, //Малышев 2024-06-05 ONESOFT-3093
	|		ЗапасыОбороты.ЗаказПокупателя,
	|		СУММА(ЗапасыОбороты.КоличествоОборот),
	|		СУММА(ЗапасыОбороты.СуммаОборот)
	|	ИЗ
	|		РегистрНакопления.Запасы.Обороты(
	|				,
	|				&ПериодКонтроля,
	|				Регистратор,
	//|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В
	|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия, Проект, ЗаказПокупателя) В //Малышев 2024-06-05 ONESOFT-3093
	|					(ВЫБРАТЬ
	|						ТаблицаЗапасы.Организация,
	|						ТаблицаЗапасы.СтруктурнаяЕдиница,
	|						ТаблицаЗапасы.СчетУчетаРегл,
	|						ТаблицаЗапасы.Номенклатура,
	|						ТаблицаЗапасы.Характеристика,
	|						ТаблицаЗапасы.Партия,
	|						ТаблицаЗапасы.Проект, //Малышев 2024-06-05 ONESOFT-3093
	|						ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|					ИЗ
	|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы)) КАК ЗапасыОбороты
	|	ГДЕ
	|		ЗапасыОбороты.Регистратор <> &Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗапасыОбороты.Организация,
	|		ЗапасыОбороты.СтруктурнаяЕдиница,
	|		ЗапасыОбороты.СчетУчетаРегл,
	|		ЗапасыОбороты.СчетУчетаЗатратРегл, // Kuzmich, вставил, иначе вылетает ошибка при движении по резервам
	|		ЗапасыОбороты.Номенклатура,
	|		ЗапасыОбороты.Характеристика,
	|		ЗапасыОбороты.Партия,
	|		ЗапасыОбороты.Проект, //Малышев 2024-06-05 ONESOFT-3093
	|		ЗапасыОбороты.ЗаказПокупателя) КАК ЗапасыОстатки
	|ГДЕ
	|	ЗапасыОстатки.КоличествоОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыОстатки.Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчетаРегл,
	|	ЗапасыОстатки.СчетУчетаЗатратРегл, // Kuzmich, вставил, иначе вылетает ошибка при движении по резервам
	|	ЗапасыОстатки.Номенклатура,
	|	ЗапасыОстатки.Характеристика,
	|	ЗапасыОстатки.Партия,
	|	ЗапасыОстатки.Проект, //Малышев 2024-06-05 ONESOFT-3093
	|	ЗапасыОстатки.ЗаказПокупателя";
	//--- Дмгг
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеЗапасов);
	//Запрос.УстановитьПараметр("МоментКонтроля", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("МоментКонтроля", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	
	//+++ Дмгг
	СписаниеНаОС = ДокументСсылкаПеремещениеЗапасов.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеТаваровНаОС;
	Запрос.УстановитьПараметр("СписаниеНаОС", СписаниеНаОС);
	ВнеоборотныеАктивы = Новый ТаблицаЗначений;
	ВнеоборотныеАктивы.Колонки.Добавить("Период");
	ВнеоборотныеАктивы.Колонки.Добавить("ВнеоборотныйАктив"); 
	ВнеоборотныеАктивы.Колонки.Добавить("Организация");
	ВнеоборотныеАктивы.Колонки.Добавить("СчетУчетаРегл");
	ВнеоборотныеАктивы.Колонки.Добавить("Стоимость");
	ВнеоборотныеАктивы.Колонки.Добавить("Амортизация");
	ВнеоборотныеАктивы.Колонки.Добавить("СодержаниеПроводки");
	ВнеоборотныеАктивы.Колонки.Добавить("ВидДвижения");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВнеоборотныеАктивы", ВнеоборотныеАктивы);
	ПараметрыВнеоборотныхАктивов = Новый ТаблицаЗначений;
	ПараметрыВнеоборотныхАктивов.Колонки.Добавить("Период");
	ПараметрыВнеоборотныхАктивов.Колонки.Добавить("ВнеоборотныйАктив"); 
	ПараметрыВнеоборотныхАктивов.Колонки.Добавить("Организация");
	ПараметрыВнеоборотныхАктивов.Колонки.Добавить("ОбъемПродукцииРаботДляВычисленияАмортизации");
	ПараметрыВнеоборотныхАктивов.Колонки.Добавить("СтоимостьДляВычисленияАмортизации");
	ПараметрыВнеоборотныхАктивов.Колонки.Добавить("ПрименитьВТекущемМесяце");
	ПараметрыВнеоборотныхАктивов.Колонки.Добавить("СчетЗатрат");
	ПараметрыВнеоборотныхАктивов.Колонки.Добавить("СтруктурнаяЕдиница");
	ПараметрыВнеоборотныхАктивов.Колонки.Добавить("НаправлениеДеятельности");
	ПараметрыВнеоборотныхАктивов.Колонки.Добавить("СрокИспользованияДляВычисленияАмортизации");
	ПараметрыВнеоборотныхАктивов.Колонки.Добавить("СчетЗатратРегл");
	ПараметрыВнеоборотныхАктивов.Колонки.Добавить("Адрес");
	ПараметрыВнеоборотныхАктивов.Колонки.Добавить("ДопСумма");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПараметрыВнеоборотныхАктивов", ПараметрыВнеоборотныхАктивов);
	//--- Дмгг
	РезультатЗапроса = Запрос.Выполнить();
	
	//Малышев 2024-12-26 формируем таблицу, на какие товары вывести остатки (--
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.Проект КАК Проект,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ТаблицаПеремещаемыхТоваров
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	(ТаблицаЗапасы.Количество - ТаблицаЗапасы.Резерв) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчетаРегл,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.Проект,
	|	ТаблицаЗапасы.ЗаказПокупателя
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И ТаблицаЗапасы.Резерв <> 0";
	Запрос.Выполнить();
	//Малышев 2024-12-26 формируем таблицу, на какие товары вывести остатки --)
	
	
	//Малышев 2024-06-16 ONESOFT-3094 - запрос перенесен в эту процедуру
	//ТаблицаЗапасыОстатки = РезультатЗапроса.Выгрузить();
	//ТаблицаЗапасыОстатки = УправлениеНебольшойФирмойСервер.ПолучитьОстаткиЗапасовПоСтоимостиПриПроведении(ДокументСсылкаПеремещениеЗапасов,СтруктураДополнительныеСвойства,,"ТаблицаПеремещаемыхТоваров").Выгрузить(); 
	ТаблицаЗапасыОстатки = УправлениеНебольшойФирмойСервер.ПолучитьОстаткиЗапасовПоСтоимостиПриПроведении(ДокументСсылкаПеремещениеЗапасов,СтруктураДополнительныеСвойства,,"ТаблицаПеремещаемыхТоваров",,,ЛОЖЬ).Выгрузить(); // Kuzmich, 15.05.2025, (ONESOFT-3975) ნიკა პლასტი - წარმოების დოკუმენტის დროს, უარყოფითი ნაშთები არ აისახება მარაგებში და დანახარჯებში 
	
	// Kuzmich, 11.01.2020, Подбор цены и себестоимости для отрицательных остатков
	Если Константы.ПодборЦеныДляОтрицательныхОстатков.Получить() Тогда
		
		//Малышев 2024-06-16 ONESOFT-3094 - перенес в отдельный модуль
		УправлениеНебольшойФирмойСервер.ДополнитьТаблицуОстатков_ПодборЦеныДляОтрицательныхОстатков(ТаблицаЗапасыОстатки, СтруктураДополнительныеСвойства, ДокументСсылкаПеремещениеЗапасов);	
 	
	КонецЕсли;
	// Kuzmich, 11.01.2020, Подбор цены и себестоимости для отрицательных остатков
	//ТаблицаЗапасыОстатки.Индексы.Добавить("Организация,СтруктурнаяЕдиница,СчетУчета,СчетУчетаРегл,СчетУчетаЗатратРегл,Номенклатура,Характеристика,Партия,ЗаказПокупателя");
	ТаблицаЗапасыОстатки.Индексы.Добавить("Организация,СтруктурнаяЕдиница,СчетУчетаРегл,Номенклатура,Характеристика,Партия,ЗаказПокупателя");
	
	ТаблицаЗапасыОстаткиПодРезерв = ТаблицаЗапасыОстатки.Скопировать();
	Если СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости Тогда 
		
		Запрос.Текст = ПолучитьТекстЗапросаБезФильтрЗаказов();
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ТаблицаЗапасыОстаткиПодРезерв = РезультатЗапроса.Выгрузить();
		
		//ТаблицаЗапасыОстаткиПодРезерв.Свернуть("Организация,СтруктурнаяЕдиница,СчетУчета,СчетУчетаРегл,СчетУчетаЗатратРегл,Номенклатура,Характеристика,Партия","КоличествоОстаток,СуммаОстаток");
		//ТаблицаЗапасыОстаткиПодРезерв.Свернуть("Организация,СтруктурнаяЕдиница,СчетУчетаРегл,Номенклатура,Характеристика,Партия","КоличествоОстаток,СуммаОстаток");
		
		//Малышев 2024-06-16 ONESOFT-3094
		//СписокПолейДляСвертки = "Организация,СтруктурнаяЕдиница,СчетУчетаРегл,Номенклатура,Характеристика,Партия";
		СписокПолейДляСвертки = "Организация,СтруктурнаяЕдиница,СчетУчетаРегл,Номенклатура,Характеристика,Партия, ДокументПоступления"; //Малышев 2024-11-19 ONESOFT-3602
		Если СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам Тогда
			СписокПолейДляСвертки = СписокПолейДляСвертки + ",Проект";
		КонецЕсли;	
		ТаблицаЗапасыОстаткиПодРезерв.Свернуть( СписокПолейДляСвертки,"КоличествоОстаток,СуммаОстаток"); //Малышев 2024-06-05 ONESOFT-3093
		
	КонецЕсли;
	
	ВременнаяТаблицаЗапасы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.СкопироватьКолонки();
	ВременнаяТаблицаЗапасы2 = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.СкопироватьКолонки(); //+++ Дмгг
	
	ПустаяСтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
	ПустойСчетУчета = ПланыСчетов.Управленческий.ПустаяСсылка();
	ПустойСчетУчетаРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	ПустаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
	ПустаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	ПустаяПартия = Справочники.ПартииНоменклатуры.ПустаяСсылка();
    ПустойЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();

	ПеремещениеВРозницуСуммовойУчет = Ложь;
	ВозвратИзРозницыСуммовойУчет = Ложь;	
	
	//+++
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("СубконтоДт1");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("СубконтоДт2");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("СубконтоДт3");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("СубконтоКт1");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("СубконтоКт2");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("СубконтоКт3");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("ВидСубконтоДт1");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("ВидСубконтоДт2");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("ВидСубконтоДт3");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("ВидСубконтоКт1");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("ВидСубконтоКт2");
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Колонки.Добавить("ВидСубконтоКт3");
	//---
	//Паганини_
	Отправитель_Транзитный	= Ложь;
	Получатель_Транзитный	= Ложь;	
	СчетТранзитногоСклада 	= Неопределено;
	Если ДокументСсылкаПеремещениеЗапасов.ЧерезТранзитныйСклад Тогда
		Получатель_Транзитный	= Истина;
		СчетаУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаРегл.ПолучитьПоследнее(ДокументСсылкаПеремещениеЗапасов.Дата, Новый Структура("Организация", ДокументСсылкаПеремещениеЗапасов.Организация));
		СчетТранзитногоСклада 	= СчетаУчетнойПолитики.СчетТранзитногоСклада;
		//Если НЕ ЗначениеЗаполнено(СчетТранзитногоСклада) Тогда
		//	Сообщить(НСТР("ka='აღრიცხვის პოლიტიკაში დოკუმენტის თარიღისთვის არ არის მითითებული ""ტრანზიტული საწყობის ანგარიში""';ru='В учетной политике не указанн ""Счет транзитного склада"" на дату документа.'"));
		//КонецЕсли;
		СчетТранзитногоСклада = ?(ЗначениеЗаполнено(СчетТранзитногоСклада), СчетТранзитногоСклада, УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСчета("Товары"));
	Иначе
		Если ЗначениеЗаполнено(ДокументСсылкаПеремещениеЗапасов) Тогда
			Отправитель_Транзитный	= Истина;
			СчетаУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаРегл.ПолучитьПоследнее(ДокументСсылкаПеремещениеЗапасов.Дата, Новый Структура("Организация", ДокументСсылкаПеремещениеЗапасов.Организация));
			СчетТранзитногоСклада 	= СчетаУчетнойПолитики.СчетТранзитногоСклада;
		КонецЕсли;
	КонецЕсли;
	//_Паганини
	
	Для н = 0 По СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы.Количество() - 1 Цикл
		
		СтрокаТаблицаЗапасы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы[н];
		//Paganini_ONESOFT-2657_
		Если ДокументСсылкаПеремещениеЗапасов.ЧерезТранзитныйСклад Тогда
			Получатель_Транзитный = СтрокаТаблицаЗапасы.Получатель_Транзитный;
		КонецЕсли;
		//_Paganini_ONESOFT-2657	
		
		Если СтрокаТаблицаЗапасы.ВозвратИзРозницыСуммовойУчет Тогда
			ВозвратИзРозницыСуммовойУчет = Истина;			
			
			СтрокаТаблицыРасход = ВременнаяТаблицаЗапасы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасход, СтрокаТаблицаЗапасы);
			СтрокаТаблицыРасход.СтруктурнаяЕдиница = СтрокаТаблицыРасход.КоррСтруктурнаяЕдиница;
			СтрокаТаблицыРасход.КоррСтруктурнаяЕдиница = Неопределено;
			СтрокаТаблицыРасход.КоррСчетУчета = Неопределено;
			СтрокаТаблицыРасход.КоррСчетУчетаРегл = Неопределено;
			СтрокаТаблицыРасход.КоррНоменклатура = Неопределено;
			СтрокаТаблицыРасход.КоррХарактеристика = Неопределено;
			СтрокаТаблицыРасход.КоррПартия = Неопределено;
			СтрокаТаблицыРасход.КоррЗаказПокупателя = Неопределено;
			СтрокаТаблицыРасход.ФиксированнаяСтоимость = Истина;

			СтрокаТаблицаУправленческий = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицаУправленческий, СтрокаТаблицаЗапасы);
			СтрокаТаблицаУправленческий.Сумма = СтрокаТаблицаЗапасы.Сумма;
			СтрокаТаблицаУправленческий.СчетДт = СтрокаТаблицаЗапасы.СчетУчетаВРознице;
			
			СтрокаТаблицаХозрасчетный = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицаХозрасчетный, СтрокаТаблицаЗапасы);
			СтрокаТаблицаХозрасчетный.Сумма = СтрокаТаблицаЗапасы.Сумма;
			СтрокаТаблицаХозрасчетный.СчетДт = СтрокаТаблицаЗапасы.СчетУчетаВРозницеРегл;
			СтрокаТаблицаХозрасчетный.СчетКт = СтрокаТаблицаЗапасы.СчетКтРегл;
			СтрокаТаблицаХозрасчетный.СубконтоДт1 = СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница;
			СтрокаТаблицаХозрасчетный.СубконтоДт2 = СтрокаТаблицаЗапасы.КоррНоменклатура;
			СтрокаТаблицаХозрасчетный.СубконтоДт3 = СтрокаТаблицаЗапасы.КоррХарактеристика;
			СтрокаТаблицаХозрасчетный.СубконтоКт1 = СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
			СтрокаТаблицаХозрасчетный.СубконтоКт2 = СтрокаТаблицаЗапасы.Номенклатура;
			СтрокаТаблицаХозрасчетный.СубконтоКт3 = СтрокаТаблицаЗапасы.Характеристика;
			СтрокаТаблицаХозрасчетный.ВидСубконтоДт1 = "Склады";
			СтрокаТаблицаХозрасчетный.ВидСубконтоДт2 = "Номенклатура";
			СтрокаТаблицаХозрасчетный.ВидСубконтоДт3 = "ХарактеристикиНоменклатуры";
			СтрокаТаблицаХозрасчетный.ВидСубконтоКт1 = "Склады";
			СтрокаТаблицаХозрасчетный.ВидСубконтоКт2 = "Номенклатура";
			СтрокаТаблицаХозрасчетный.ВидСубконтоКт3 = "ХарактеристикиНоменклатуры";
			
			Продолжить;
		КонецЕсли;
		
		//Малышев 2024-07-27 ((-
		СтруктураДляПоиска = УправлениеНебольшойФирмойСервер.ПолучитьСтруктуруДляПоиска(СтрокаТаблицаЗапасы, СтруктураДополнительныеСвойства);
		//СтруктураДляПоиска = Новый Структура;
		//СтруктураДляПоиска.Вставить("Организация", СтрокаТаблицаЗапасы.Организация);
		////--------------------------------------------------------------------------
		//// © Шишка В.В. [17 августа 2021]  НАЧАЛО
		////СтруктураДляПоиска.Вставить("СтруктурнаяЕдиница", СтрокаТаблицаЗапасы.СтруктурнаяЕдиница);
		//Если НЕ УчетСебестоимостиВРазрезеОрганизации Тогда
		//
		//	СтруктураДляПоиска.Вставить("СтруктурнаяЕдиница", СтрокаТаблицаЗапасы.СтруктурнаяЕдиница);
		//
		//КонецЕсли; 	
		//// © Шишка В.В. [17 августа 2021]  КОНЕЦ
		////--------------------------------------------------------------------------
		////СтруктураДляПоиска.Вставить("СчетУчета", СтрокаТаблицаЗапасы.СчетУчета);
		//СтруктураДляПоиска.Вставить("СчетУчетаРегл", СтрокаТаблицаЗапасы.СчетУчетаРегл);
		//СтруктураДляПоиска.Вставить("Номенклатура", СтрокаТаблицаЗапасы.Номенклатура);
		//СтруктураДляПоиска.Вставить("Характеристика", СтрокаТаблицаЗапасы.Характеристика);
		//СтруктураДляПоиска.Вставить("Партия", СтрокаТаблицаЗапасы.Партия);  
		////Малышев 2024-06-16 ONESOFT-3094
		//Если СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам Тогда
		//	СтруктураДляПоиска.Вставить("Проект", СтрокаТаблицаЗапасы.Проект);  //Малышев 2024-06-17 ONESOFT-3093
		//КонецЕсли;
		//Малышев 2024-07-27 --)
	
		//КоличествоТребуетсяРезерв = СтрокаТаблицаЗапасы.Резерв;
		// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
		Если Константы.ФункциональнаяОпцияРезервированиеЗапасов_new.Получить() Тогда
			КоличествоТребуетсяРезерв = 0;
		Иначе
			КоличествоТребуетсяРезерв = ?(ЗначениеЗаполнено(СтрокаТаблицаЗапасы.Резерв), СтрокаТаблицаЗапасы.Резерв, 0);
		КонецЕсли;
		// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
		КоличествоТребуетсяСвободныйОстаток = СтрокаТаблицаЗапасы.Количество;
		
		Если КоличествоТребуетсяРезерв > 0 Тогда
			
			КоличествоТребуетсяСвободныйОстаток = КоличествоТребуетсяСвободныйОстаток - КоличествоТребуетсяРезерв;
			
			//СтруктураДляПоиска.Вставить("ЗаказПокупателя", СтрокаТаблицаЗапасы.ЗаказПокупателя);  //+++ Дмгг
			МассивСтрокОстатков = Новый Массив;
			Если НЕ СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости Тогда 
				
				СтруктураДляПоиска.Вставить("ЗаказПокупателя", СтрокаТаблицаЗапасы.ЗаказПокупателя);
				МассивСтрокОстатков = ТаблицаЗапасыОстатки.НайтиСтроки(СтруктураДляПоиска); //+++ Дмгг
				
			Иначе
				
				МассивСтрокОстатков = 	ТаблицаЗапасыОстаткиПодРезерв.НайтиСтроки(СтруктураДляПоиска);
				
			КонецЕсли;
			//--- Дмгг
			
			//МассивСтрокОстатков = ТаблицаЗапасыОстатки.НайтиСтроки(СтруктураДляПоиска); //+++ Дмгг
			//МассивСтрокОстатков = ТаблицаЗапасыОстаткиПодРезерв.НайтиСтроки(СтруктураДляПоиска);
			
			КоличествоОстаток = 0;
			СуммаОстаток = 0;
			
			Если МассивСтрокОстатков.Количество() > 0 Тогда
				КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток;
				СуммаОстаток = МассивСтрокОстатков[0].СуммаОстаток;
			КонецЕсли;
			
			Если КоличествоОстаток > 0 И КоличествоОстаток > КоличествоТребуетсяРезерв Тогда

				СуммаКСписанию = Окр(СуммаОстаток * КоличествоТребуетсяРезерв / КоличествоОстаток , 2, 1);

				МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоТребуетсяРезерв;
				МассивСтрокОстатков[0].СуммаОстаток = МассивСтрокОстатков[0].СуммаОстаток - СуммаКСписанию;

			ИначеЕсли КоличествоОстаток = КоличествоТребуетсяРезерв Тогда

				СуммаКСписанию = СуммаОстаток;

				МассивСтрокОстатков[0].КоличествоОстаток = 0;
				МассивСтрокОстатков[0].СуммаОстаток = 0;

			Иначе
				СуммаКСписанию = 0;	
			КонецЕсли;
			
			//+++ Дмгг
			// добавим себестоимость что бы обнулялся заказ
			Если СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости Тогда
			//	
			//	СтрокаТаблицыРасходДоначисление = ВременнаяТаблицаЗапасы.Добавить();
			//	ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасходДоначисление, СтрокаТаблицаЗапасы);
			//	
			//	СтрокаТаблицыРасходДоначисление.ВидДвижения = ВидДвиженияНакопления.Расход;
			//	СтрокаТаблицыРасходДоначисление.Сумма = СуммаКСписанию;
			//	СтрокаТаблицыРасходДоначисление.Количество = 0; // количество уже было сделано в заказе
			//	СтрокаТаблицыРасходДоначисление.ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
			//	СтрокаТаблицыРасходДоначисление.Период = СтрокаТаблицаЗапасы.ЗаказПокупателя.Дата;
			//	СтрокаТаблицыРасходДоначисление.КоррСтруктурнаяЕдиница = СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
			//	СтрокаТаблицыРасходДоначисление.КоррНоменклатура = СтрокаТаблицаЗапасы.Номенклатура;
			//	СтрокаТаблицыРасходДоначисление.КоррХарактеристика = СтрокаТаблицаЗапасы.Характеристика;
			//	СтрокаТаблицыРасходДоначисление.КоррЗаказПокупателя = СтрокаТаблицаЗапасы.ЗаказПокупателя;
			//	СтрокаТаблицыРасходДоначисление.ЗаказПродажи = Документы.ЗаказПокупателя.ПустаяСсылка();
			//	СтрокаТаблицыРасходДоначисление.ДокументПродажи  = Неопределено;
			//	//СтрокаТаблицыРасходДоначисление.Подразделение = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
			//	//СтрокаТаблицыРасходДоначисление.Ответственный = Справочники.Сотрудники.ПустаяСсылка();
			//	//СтрокаТаблицыРасходДоначисление.СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
			//	СтрокаТаблицыРасходДоначисление.СодержаниеПроводки = НСтр("ka='მარაგების რეზერვირება';ru='Резервирование запасов'");
			//	СтрокаТаблицыРасходДоначисление.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ЗаказНаПродажу;
			//	СтрокаТаблицыРасходДоначисление.КоррСчетУчетаРегл = СтрокаТаблицаЗапасы.СчетУчетаРегл;
			//	
				//СтрокаТаблицыПриход = ВременнаяТаблицаЗапасы.Добавить();
				//ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриход, СтрокаТаблицаЗапасы);
				//
				//СтрокаТаблицыПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
				//СтрокаТаблицыПриход.Сумма = СуммаКСписанию;
				//СтрокаТаблицыПриход.Количество = 0; // количество уже было сделано в заказе
				//СтрокаТаблицыПриход.Период = СтрокаТаблицаЗапасы.ЗаказПокупателя.Дата;
				//СтрокаТаблицыПриход.КоррСтруктурнаяЕдиница = СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
				//СтрокаТаблицыПриход.КоррНоменклатура = СтрокаТаблицаЗапасы.Номенклатура;
				//СтрокаТаблицыПриход.КоррХарактеристика = СтрокаТаблицаЗапасы.Характеристика;
				//СтрокаТаблицыПриход.КоррЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
				//СтрокаТаблицыПриход.ЗаказПродажи = Документы.ЗаказПокупателя.ПустаяСсылка();
				//СтрокаТаблицыПриход.ДокументПродажи  = Неопределено;
				////СтрокаТаблицыРасходДоначисление.Подразделение = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
				////СтрокаТаблицыРасходДоначисление.Ответственный = Справочники.Сотрудники.ПустаяСсылка();
				////СтрокаТаблицыРасходДоначисление.СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
				//СтрокаТаблицыПриход.СодержаниеПроводки = НСтр("ka='მარაგების რეზერვირება';ru='Резервирование запасов'");
				//СтрокаТаблицыПриход.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ЗаказНаПродажу;
				//СтрокаТаблицыПриход.КоррСчетУчетаРегл = СтрокаТаблицаЗапасы.СчетУчетаРегл;
			//	
			КонецЕсли;
			//--- Дмгг
			
			// Расход.
			СтрокаТаблицыРасход = ВременнаяТаблицаЗапасы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасход, СтрокаТаблицаЗапасы);
			
			СтрокаТаблицыРасход.Сумма = СуммаКСписанию;
			СтрокаТаблицыРасход.Количество = КоличествоТребуетсяРезерв;
			
			Если СтрокаТаблицаЗапасы.ТипСчетаЗатрат = Перечисления.ТипыСчетов.Расходы
			 ИЛИ СтрокаТаблицаЗапасы.ПеремещениеВРозницуСуммовойУчет Тогда
				
				СтрокаТаблицыРасход.КоррСтруктурнаяЕдиница = ПустаяСтруктурнаяЕдиница;
				СтрокаТаблицыРасход.КоррСчетУчета = ПустойСчетУчета;
				СтрокаТаблицыРасход.КоррСчетУчетаРегл = ПустойСчетУчетаРегл;
				СтрокаТаблицыРасход.КоррНоменклатура = ПустаяНоменклатура;
				СтрокаТаблицыРасход.КоррХарактеристика = ПустаяХарактеристика;
				СтрокаТаблицыРасход.КоррПартия = ПустаяПартия;
				СтрокаТаблицыРасход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
				СтрокаТаблицыРасход.ДокументПродажи = ДокументСсылкаПеремещениеЗапасов;
				СтрокаТаблицыРасход.ЗаказПродажи = СтрокаТаблицаЗапасы.ЗаказПокупателя;
				
				//+++ Дмгг
				//Если СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости Тогда
				//	
				//	СтрокаТаблицыРасходДоначисление.КоррСтруктурнаяЕдиница = ПустаяСтруктурнаяЕдиница;
				//	СтрокаТаблицыРасходДоначисление.КоррСчетУчета = ПустойСчетУчета;
				//	СтрокаТаблицыРасходДоначисление.КоррСчетУчетаРегл = ПустойСчетУчетаРегл;
				//	СтрокаТаблицыРасходДоначисление.КоррНоменклатура = ПустаяНоменклатура;
				//	СтрокаТаблицыРасходДоначисление.КоррХарактеристика = ПустаяХарактеристика;
				//	СтрокаТаблицыРасходДоначисление.КоррПартия = ПустаяПартия;
				//	СтрокаТаблицыРасходДоначисление.КоррЗаказПокупателя = ПустойЗаказПокупателя;
				//	СтрокаТаблицыРасходДоначисление.ДокументПродажи = ДокументСсылкаПеремещениеЗапасов;
				//	СтрокаТаблицыРасходДоначисление.ЗаказПродажи = СтрокаТаблицаЗапасы.ЗаказПокупателя;
				//	
				//	СтрокаТаблицыПриход.КоррСтруктурнаяЕдиница = ПустаяСтруктурнаяЕдиница;
				//	СтрокаТаблицыПриход.КоррСчетУчета = ПустойСчетУчета;
				//	СтрокаТаблицыПриход.КоррСчетУчетаРегл = ПустойСчетУчетаРегл;
				//	СтрокаТаблицыПриход.КоррНоменклатура = ПустаяНоменклатура;
				//	СтрокаТаблицыПриход.КоррХарактеристика = ПустаяХарактеристика;
				//	СтрокаТаблицыПриход.КоррПартия = ПустаяПартия;
				//	СтрокаТаблицыПриход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
				//	СтрокаТаблицыПриход.ДокументПродажи = ДокументСсылкаПеремещениеЗапасов;
				//	СтрокаТаблицыПриход.ЗаказПродажи = СтрокаТаблицаЗапасы.ЗаказПокупателя;
				//	
				//КонецЕсли;
				//--- Дмгг
				
			Иначе
				
				Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение
				   И СтрокаТаблицаЗапасы.ПеремещениеВРозницу Тогда
				   СтрокаТаблицыРасход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
				ИначеЕсли НЕ СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение
				   	    И НЕ СтрокаТаблицаЗапасы.ТипСчетаЗатрат = Перечисления.ТипыСчетов.КосвенныеЗатраты
						И НЕ РегламентированныйУчетСервер.СчетЯвляетсяКосвенныйПоПроизводственнымЗатратам(СтрокаТаблицаЗапасы.СчетУчетаЗатратРегл) Тогда
						СтрокаТаблицыРасход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
				КонецЕсли;
				
				Если СтрокаТаблицаЗапасы.ТипСчетаЗатрат = Перечисления.ТипыСчетов.КосвенныеЗатраты
					ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяКосвенныйПоПроизводственнымЗатратам(СтрокаТаблицаЗапасы.СчетУчетаЗатратРегл) Тогда
					СтрокаТаблицыРасход.КоррНоменклатура = ПустаяНоменклатура;
					СтрокаТаблицыРасход.КоррХарактеристика = ПустаяХарактеристика;
					СтрокаТаблицыРасход.КоррПартия = ПустаяПартия;
				КонецЕсли;
				
				//+++ Дмгг
				//Если СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости Тогда
				//	Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение
				//		И СтрокаТаблицаЗапасы.ПеремещениеВРозницу Тогда
				//		СтрокаТаблицыРасходДоначисление.КоррЗаказПокупателя = ПустойЗаказПокупателя;
				//		СтрокаТаблицыПриход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
				//	ИначеЕсли НЕ СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение
				//		И НЕ СтрокаТаблицаЗапасы.ТипСчетаЗатрат = Перечисления.ТипыСчетов.КосвенныеЗатраты
				//		И НЕ РегламентированныйУчетСервер.СчетЯвляетсяКосвенныйПоПроизводственнымЗатратам(СтрокаТаблицаЗапасы.СчетУчетаЗатратРегл) Тогда
				//		СтрокаТаблицыРасходДоначисление.КоррЗаказПокупателя = ПустойЗаказПокупателя;
				//		СтрокаТаблицыПриход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
				//	КонецЕсли;
				//	
				//	Если СтрокаТаблицаЗапасы.ТипСчетаЗатрат = Перечисления.ТипыСчетов.КосвенныеЗатраты
				//		ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяКосвенныйПоПроизводственнымЗатратам(СтрокаТаблицаЗапасы.СчетУчетаЗатратРегл) Тогда
				//		СтрокаТаблицыРасходДоначисление.КоррНоменклатура = ПустаяНоменклатура;
				//		СтрокаТаблицыРасходДоначисление.КоррХарактеристика = ПустаяХарактеристика;
				//		СтрокаТаблицыРасходДоначисление.КоррПартия = ПустаяПартия;
				//		
				//		СтрокаТаблицыПриход.КоррНоменклатура = ПустаяНоменклатура;
				//		СтрокаТаблицыПриход.КоррХарактеристика = ПустаяХарактеристика;
				//		СтрокаТаблицыПриход.КоррПартия = ПустаяПартия;
				//	КонецЕсли;
				//КонецЕсли;
				//--- Дмгг
				
			КонецЕсли;
			
			Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации Тогда
				
				СтрокаТаблицыРасход.КоррСтруктурнаяЕдиница = ПустаяСтруктурнаяЕдиница;
				СтрокаТаблицыРасход.КоррСчетУчета = ПустойСчетУчета;
				СтрокаТаблицыРасход.КоррСчетУчетаРегл = ПустойСчетУчетаРегл;
				СтрокаТаблицыРасход.КоррНоменклатура = ПустаяНоменклатура;
				СтрокаТаблицыРасход.КоррХарактеристика = ПустаяХарактеристика;
				СтрокаТаблицыРасход.КоррПартия = ПустаяПартия;
				СтрокаТаблицыРасход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
				СтрокаТаблицыРасход.ФиксированнаяСтоимость = Истина;
				
			КонецЕсли;
			
			// Сформируем проводки.
			//Если Окр(СуммаКСписанию, 2, 1) <> 0 Тогда
			Если ИСТИНА или Окр(СуммаКСписанию, 2, 1) <> 0 Тогда  //Малышев 2024-06-25 включил формирование проводок с нулевой суммой
				
				СтрокаТаблицаУправленческий = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицаУправленческий, СтрокаТаблицаЗапасы);
				СтрокаТаблицаУправленческий.Сумма = СуммаКСписанию;
				
				СтрокаТаблицаХозрасчетный = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицаХозрасчетный, СтрокаТаблицаЗапасы);
				СтрокаТаблицаХозрасчетный.Сумма = СуммаКСписанию;
				
				Если СтрокаТаблицаЗапасы.ПеремещениеВРозницуСуммовойУчет Тогда
					СтрокаТаблицаУправленческий.СчетДт = СтрокаТаблицаЗапасы.СчетУчетаВРозницеПолучатель;
				КонецЕсли;
				
				Если СтрокаТаблицаЗапасы.ПеремещениеВРозницуСуммовойУчет Тогда
					СтрокаТаблицаХозрасчетный.СчетДт = СтрокаТаблицаЗапасы.СчетУчетаВРозницеПолучательРегл;
				Иначе
					СтрокаТаблицаХозрасчетный.СчетДт = СтрокаТаблицаЗапасы.СчетДтРегл;
				КонецЕсли;
				
				Если СтрокаТаблицаХозрасчетный.СчетДт.Количественный Тогда 
					СтрокаТаблицаХозрасчетный.КоличествоДт = КоличествоТребуетсяРезерв;
				КонецЕсли;
				
				СтрокаТаблицаХозрасчетный.СчетКт = СтрокаТаблицаЗапасы.СчетКтРегл;
				
				Если СтрокаТаблицаХозрасчетный.СчетКт.Количественный Тогда 
					СтрокаТаблицаХозрасчетный.КоличествоКт = КоличествоТребуетсяРезерв;
					
				КонецЕсли;
				
				//ПодольскийАИ #ПодстановкаСубконто 10.04.2022 {Начало
				//Было---
				//СтрокаТаблицаХозрасчетный.СубконтоДт1 = СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница;
				//СтрокаТаблицаХозрасчетный.СубконтоДт2 = СтрокаТаблицаЗапасы.КоррНоменклатура;
				//СтрокаТаблицаХозрасчетный.СубконтоДт3 = СтрокаТаблицаЗапасы.КоррХарактеристика;
				//СтрокаТаблицаХозрасчетный.СубконтоКт1 = СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
				//СтрокаТаблицаХозрасчетный.СубконтоКт2 = СтрокаТаблицаЗапасы.Номенклатура;
				//СтрокаТаблицаХозрасчетный.СубконтоКт3 = СтрокаТаблицаЗапасы.Характеристика;
				//СтрокаТаблицаХозрасчетный.ВидСубконтоДт1 = "Склады";
				//СтрокаТаблицаХозрасчетный.ВидСубконтоДт2 = "Номенклатура";
				//СтрокаТаблицаХозрасчетный.ВидСубконтоДт3 = "ХарактеристикиНоменклатуры";
				////--------------------------------------------------------------------------
				//// © Шишка В.В. [20 октября 2021]  НАЧАЛО
				////СтрокаТаблицаХозрасчетный.ВидСубконтоКт1 = "Склады";
				//Если СтрокаТаблицаЗапасы.СтруктурнаяЕдиница = Неопределено ИЛИ	
				//	СтрокаТаблицаЗапасы.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад 
				//	ИЛИ СтрокаТаблицаЗапасы.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница Тогда				 
				//	СтрокаТаблицаХозрасчетный.ВидСубконтоКт1 = "Склады";
				//Иначе
				//	СтрокаТаблицаХозрасчетный.ВидСубконтоКт1 = "Подразделения";
				//КонецЕсли;
				//// © Шишка В.В. [20 октября 2021]  КОНЕЦ
				////--------------------------------------------------------------------------
				//СтрокаТаблицаХозрасчетный.ВидСубконтоКт2 = "Номенклатура";
				//СтрокаТаблицаХозрасчетный.ВидСубконтоКт3 = "ХарактеристикиНоменклатуры";
				//Стало+++
				
				Если СписаниеНаОС Тогда 
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Дт", "Подразделения", СтрокаТаблицаЗапасы.ПодразделениеОС);
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Дт", "Имущество", СтрокаТаблицаЗапасы.Имущество);
				Иначе
					
					//--------------------------------------------------------------------------
					// © Шишка В.В. [21 октября 2021]  НАЧАЛО
					//Если СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад Тогда 
					Если СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница <> Неопределено И СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад Тогда 
					// © Шишка В.В. [21 октября 2021]  КОНЕЦ
					//--------------------------------------------------------------------------
						ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Дт", "Склады",  СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница);
					Иначе
						ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Дт", "Подразделения",  СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница);
					КонецЕсли;
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Дт", "Номенклатура",  СтрокаТаблицаЗапасы.Номенклатура);
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Дт", "ХарактеристикиНоменклатуры",  СтрокаТаблицаЗапасы.Характеристика);
					
				КонецЕсли;
					
				//--------------------------------------------------------------------------
				// © Шишка В.В. [21 октября 2021]  НАЧАЛО
				//Если СтрокаТаблицаЗапасы.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад Тогда 
				Если СтрокаТаблицаЗапасы.СтруктурнаяЕдиница <> Неопределено И СтрокаТаблицаЗапасы.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад Тогда 
				// © Шишка В.В. [21 октября 2021]  КОНЕЦ
				//--------------------------------------------------------------------------
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Кт", "Склады",  СтрокаТаблицаЗапасы.СтруктурнаяЕдиница);
				Иначе
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Кт", "Подразделения",  СтрокаТаблицаЗапасы.СтруктурнаяЕдиница);
				КонецЕсли;
				ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Кт", "Номенклатура",  СтрокаТаблицаЗапасы.Номенклатура);
				ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Кт", "ХарактеристикиНоменклатуры",  СтрокаТаблицаЗапасы.Характеристика);
				
				Если СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам Тогда
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Дт", "Проекты", СтрокаТаблицаЗапасы.КоррПроект);
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Кт", "Проекты", СтрокаТаблицаЗапасы.Проект);
				КонецЕсли;
				//ПодольскийАИ #УчетПроектов 05.10.2020 }
				
				Если ЗначениеЗаполнено(СтрокаТаблицаХозрасчетный.СчетДт) И СтрокаТаблицаХозрасчетный.СчетДт.Количественный Тогда
				
					СтрокаТаблицаХозрасчетный.КоличествоДт = СтрокаТаблицаЗапасы.Количество;
				
				КонецЕсли; 
				
				Если ЗначениеЗаполнено(СтрокаТаблицаХозрасчетный.СчетКт) И СтрокаТаблицаХозрасчетный.СчетКт.Количественный Тогда
				
					СтрокаТаблицаХозрасчетный.КоличествоКт = СтрокаТаблицаЗапасы.Количество;
				
				КонецЕсли; 
				
				Если СписаниеНаОС Тогда 
					СтрокаТаблицаХозрасчетный.Содержание = НСтр("ka='კაპიტალური მოდერნიზაცია';ru='Капитальная модернизация';en='capital improvements'");
				КонецЕсли;
				
				//ПодольскийАИ #ПодстановкаСубконто 10.04.2022 Конец}
				
			КонецЕсли;
			
			Если СтрокаТаблицаЗапасы.ПеремещениеВРозницуСуммовойУчет Тогда
				
				СтрокаТаблицаСуммовойУчетВРознице = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСуммовойУчетВРознице.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицаСуммовойУчетВРознице, СтрокаТаблицаЗапасы);
				СтрокаТаблицаСуммовойУчетВРознице.Себестоимость = СуммаКСписанию;
				СтрокаТаблицаСуммовойУчетВРознице.ВидДвижения = ВидДвиженияНакопления.Приход;
				СтрокаТаблицаСуммовойУчетВРознице.Валюта = СтрокаТаблицаЗапасы.ВалютаЦеныПолучатель;
				СтрокаТаблицаСуммовойУчетВРознице.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница;
				СтрокаТаблицаСуммовойУчетВРознице.Организация = СтрокаТаблицаЗапасы.Организация;
				СтрокаТаблицаСуммовойУчетВРознице.Сумма = 0;
				СтрокаТаблицаСуммовойУчетВРознице.СуммаВал = 0;
				
				ПеремещениеВРозницуСуммовойУчет = Истина;
							
			ИначеЕсли Окр(СуммаКСписанию, 2, 1) <> 0 ИЛИ КоличествоТребуетсяРезерв > 0 Тогда // Приход.
				
				Если СтрокаТаблицаЗапасы.ТипСчетаЗатрат = Перечисления.ТипыСчетов.Расходы 
					ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяРасходным(СтрокаТаблицаЗапасы.СчетУчетаЗатратРегл) Тогда
					
					СтрокаТаблицыОборот = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицыОборот, СтрокаТаблицаЗапасы);
					СтрокаТаблицыОборот.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница;
					СтрокаТаблицыОборот.НаправлениеДеятельности = СтрокаТаблицаЗапасы.КоррНаправлениеДеятельности;
					СтрокаТаблицыОборот.ЗаказПокупателя = СтрокаТаблицаЗапасы.КоррЗаказПокупателя;
					СтрокаТаблицыОборот.СуммаРасходов = СуммаКСписанию;
					СтрокаТаблицыОборот.СчетУчета = СтрокаТаблицаЗапасы.КоррСчетУчета;
					СтрокаТаблицыОборот.СчетУчетаРегл = СтрокаТаблицаЗапасы.КоррСчетУчетаРегл;
					СтрокаТаблицыОборот.Аналитика = СтрокаТаблицаЗапасы.Номенклатура;
					
				Иначе // Это затраты.
					
					СтрокаТаблицыПриход = ВременнаяТаблицаЗапасы.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриход, СтрокаТаблицаЗапасы);
					
					СтрокаТаблицыПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
					
					СтрокаТаблицыПриход.Организация = СтрокаТаблицаЗапасы.Организация;
					СтрокаТаблицыПриход.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница;
					СтрокаТаблицыПриход.СчетУчета = СтрокаТаблицаЗапасы.КоррСчетУчета;
					СтрокаТаблицыПриход.СчетУчетаРегл = СтрокаТаблицаЗапасы.КоррСчетУчетаРегл;
					СтрокаТаблицыПриход.Номенклатура = СтрокаТаблицаЗапасы.КоррНоменклатура;
					СтрокаТаблицыПриход.Характеристика = СтрокаТаблицаЗапасы.КоррХарактеристика;
					СтрокаТаблицыПриход.Партия = СтрокаТаблицаЗапасы.КоррПартия;
					
					Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение
					И НЕ СтрокаТаблицаЗапасы.ПеремещениеВРозницу Тогда
						СтрокаТаблицыПриход.ЗаказПокупателя = СтрокаТаблицаЗапасы.КоррЗаказПокупателя;						
					ИначеЕсли СтрокаТаблицаЗапасы.ТипСчетаЗатрат = Перечисления.ТипыСчетов.КосвенныеЗатраты
						ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяКосвенныйПоПроизводственнымЗатратам(СтрокаТаблицаЗапасы.СчетУчетаЗатратРегл) Тогда
						СтрокаТаблицыПриход.ЗаказПокупателя = СтрокаТаблицаЗапасы.КоррЗаказПокупателя;
						СтрокаТаблицыПриход.Номенклатура = ПустаяНоменклатура;
						СтрокаТаблицыПриход.Характеристика = ПустаяХарактеристика;
						СтрокаТаблицыПриход.Партия = ПустаяПартия;
					Иначе
						СтрокаТаблицыПриход.ЗаказПокупателя = ПустойЗаказПокупателя;
					КонецЕсли;
					
					СтрокаТаблицыПриход.КоррСтруктурнаяЕдиница = СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
					СтрокаТаблицыПриход.КоррСчетУчета = СтрокаТаблицаЗапасы.СчетУчета;
					СтрокаТаблицыПриход.КоррСчетУчетаРегл = СтрокаТаблицаЗапасы.СчетУчетаРегл;
					СтрокаТаблицыПриход.КоррНоменклатура = СтрокаТаблицаЗапасы.Номенклатура;
					СтрокаТаблицыПриход.КоррХарактеристика = СтрокаТаблицаЗапасы.Характеристика;
					СтрокаТаблицыПриход.КоррПартия = СтрокаТаблицаЗапасы.Партия;
					СтрокаТаблицыПриход.КоррЗаказПокупателя = СтрокаТаблицаЗапасы.ЗаказПокупателя;
					
					СтрокаТаблицыПриход.Сумма = СуммаКСписанию;
					
					Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию
					 ИЛИ СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы Тогда
						СтрокаТаблицыПриход.Количество = 0;
					Иначе
						СтрокаТаблицыПриход.Количество = КоличествоТребуетсяРезерв;
					КонецЕсли;
					
					СтрокаТаблицыПриход.СчетУчета = СтрокаТаблицаЗапасы.КоррСчетУчета;
					СтрокаТаблицыПриход.СчетУчетаРегл = СтрокаТаблицаЗапасы.КоррСчетУчетаРегл;
					
					Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации Тогда
						
						СтрокаТаблицыПриход.КоррСтруктурнаяЕдиница = ПустаяСтруктурнаяЕдиница;
						СтрокаТаблицыПриход.КоррСчетУчета = ПустойСчетУчета;
						СтрокаТаблицыПриход.КоррСчетУчетаРегл = ПустойСчетУчетаРегл;
						СтрокаТаблицыПриход.КоррНоменклатура = ПустаяНоменклатура;
						СтрокаТаблицыПриход.КоррХарактеристика = ПустаяХарактеристика;
						СтрокаТаблицыПриход.КоррПартия = ПустаяПартия;
						СтрокаТаблицыПриход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
						СтрокаТаблицыПриход.ФиксированнаяСтоимость = Истина;
						
					КонецЕсли;
					
					//СтрокаТаблицыПриход.ФиксированнаяСтоимость = Истина; //+++ Дмгг
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если КоличествоТребуетсяСвободныйОстаток > 0 Тогда
			
			//СтруктураДляПоиска.Вставить("ЗаказПокупателя", ПустойЗаказПокупателя);  //+++ Дмгг
			
			Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах") Тогда
				Если Получатель_Транзитный Тогда
				ИначеЕсли Отправитель_Транзитный И ЗначениеЗаполнено(ДокументСсылкаПеремещениеЗапасов.ДокументПеремещенияВТранзит) Тогда
					СтруктураДляПоиска.СчетУчетаРегл = СчетТранзитногоСклада;
				КонецЕсли;
			КонецЕсли;
			
			//МассивСтрокОстатков = ТаблицаЗапасыОстатки.НайтиСтроки(СтруктураДляПоиска);
			Если НЕ СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости Тогда 
				
				СтруктураДляПоиска.Вставить("ЗаказПокупателя", ПустойЗаказПокупателя);
				МассивСтрокОстатков = ТаблицаЗапасыОстатки.НайтиСтроки(СтруктураДляПоиска);
				
			Иначе
				МассивСтрокОстатков = ТаблицаЗапасыОстаткиПодРезерв.НайтиСтроки(СтруктураДляПоиска);
			КонецЕсли;
			//--- Дмгг
			
			//Малышев 2024-11-19 ONESOFT-3602
			Для каждого СтрокаТаблицыОстатков из МассивСтрокОстатков Цикл
			
				Если КоличествоТребуетсяСвободныйОстаток <= 0 Тогда
					Прервать;
				КонецЕсли;	
		

			//КоличествоОстаток = 0;
			//СуммаОстаток = 0;
			
			//Если МассивСтрокОстатков.Количество() > 0 Тогда
			//	//КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток;
			//	//СуммаОстаток = МассивСтрокОстатков[0].СуммаОстаток;
			//	КоличествоОстаток = 0;
			//	СуммаОстаток = 0;
			//	Для Каждого Элем Из МассивСтрокОстатков Цикл 
			//		КоличествоОстаток = КоличествоОстаток + Элем.КоличествоОстаток;
			//		СуммаОстаток = СуммаОстаток + Элем.СуммаОстаток;
			//	КонецЦикла;
			//КонецЕсли;
			
			КоличествоОстаток = СтрокаТаблицыОстатков.КоличествоОстаток;
			СуммаОстаток = СтрокаТаблицыОстатков.СуммаОстаток;
			
			КоличествоКСписанию = 0;
			СуммаКСписанию = 0;
			
			Если КоличествоОстаток > 0 И КоличествоОстаток > КоличествоТребуетсяСвободныйОстаток Тогда
				
				КоличествоКСписанию = КоличествоТребуетсяСвободныйОстаток;
				СуммаКСписанию = Окр(СуммаОстаток * КоличествоТребуетсяСвободныйОстаток / КоличествоОстаток , 2, 1);

				//МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоТребуетсяСвободныйОстаток;
				СтрокаТаблицыОстатков.КоличествоОстаток = СтрокаТаблицыОстатков.КоличествоОстаток - КоличествоКСписанию;
				
				//МассивСтрокОстатков[0].СуммаОстаток = МассивСтрокОстатков[0].СуммаОстаток - СуммаКСписанию;
                СтрокаТаблицыОстатков.СуммаОстаток = СтрокаТаблицыОстатков.СуммаОстаток - СуммаКСписанию;

				//ИначеЕсли КоличествоОстаток = КоличествоТребуетсяСвободныйОстаток Тогда
			ИначеЕсли КоличествоОстаток >0 и КоличествоОстаток <= КоличествоТребуетсяСвободныйОстаток Тогда //Малышев 2024-11-19 ONESOFT-3602
				
				СуммаКСписанию = СуммаОстаток;
				//++Lazare 10.02.2025 ONESOFT-3832
				Если Константы.ФункциональнаяОпцияРезервированиеЗапасов.Получить() Тогда 
					КоличествоКСписанию = КоличествоТребуетсяСвободныйОстаток; 
				Иначе  
				//--Lazare 10.02.2025 ONESOFT-3832	
					КоличествоКСписанию = КоличествоОстаток; 
				КонецЕсли;
				
				//МассивСтрокОстатков[0].КоличествоОстаток = 0;
				СтрокаТаблицыОстатков.КоличествоОстаток = 0;
				//МассивСтрокОстатков[0].СуммаОстаток = 0;
				СтрокаТаблицыОстатков.СуммаОстаток = 0; 
				
				
				//Малышев 2024-11-19 ONESOFT-3602 (--	
				
			ИначеЕсли КоличествоОстаток <= 0 Тогда  
				Продолжить;
			//Малышев 2024-11-19 ONESOFT-3602 --)
		

			Иначе
				СуммаКСписанию = 0;	
			КонецЕсли;
			
			КоличествоТребуетсяСвободныйОстаток = КоличествоТребуетсяСвободныйОстаток - КоличествоКСписанию; //Малышев 2024-11-19 ONESOFT-3602

			
			// Расход.
			СтрокаТаблицыРасход = ВременнаяТаблицаЗапасы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасход, СтрокаТаблицаЗапасы);
			
						
			//Паганини_
			Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах") Тогда
				Если Получатель_Транзитный Тогда
					СтрокаТаблицыРасход.КоррСчетУчетаРегл 	= СчетТранзитногоСклада;
					СтрокаТаблицыРасход.СчетДтРегл 			= СчетТранзитногоСклада;
				ИначеЕсли Отправитель_Транзитный И ЗначениеЗаполнено(ДокументСсылкаПеремещениеЗапасов.ДокументПеремещенияВТранзит) Тогда
					СтрокаТаблицыРасход.СчетУчетаРегл 		= СчетТранзитногоСклада;
					СтрокаТаблицыРасход.СчетКтРегл 			= СчетТранзитногоСклада;
				КонецЕсли;
			КонецЕсли;
			//_Паганини
			
			СтрокаТаблицыРасход.Сумма = СуммаКСписанию;
			//СтрокаТаблицыРасход.Количество = КоличествоТребуетсяСвободныйОстаток;
			СтрокаТаблицыРасход.Количество = КоличествоКСписанию;
			СтрокаТаблицыРасход.ЗаказПокупателя = ПустойЗаказПокупателя;
			СтрокаТаблицыРасход.ДокументПоступления = СтрокаТаблицыОстатков.ДокументПоступления; //Малышев 2024-11-19 ONESOFT-3602
		

			Если СтрокаТаблицаЗапасы.ТипСчетаЗатрат = Перечисления.ТипыСчетов.Расходы
			 ИЛИ СтрокаТаблицаЗапасы.ПеремещениеВРозницуСуммовойУчет
			 //ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяРасходным(СтрокаТаблицаЗапасы.СчетУчетаЗатратРегл) Тогда
			  ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяРасходным(СтрокаТаблицаЗапасы.КоррСчетУчетаРегл) Тогда  //Малышев 
				
				СтрокаТаблицыРасход.КоррСтруктурнаяЕдиница = ПустаяСтруктурнаяЕдиница;
				СтрокаТаблицыРасход.КоррСчетУчета = ПустойСчетУчета;
				СтрокаТаблицыРасход.КоррСчетУчетаРегл = ПустойСчетУчетаРегл;
				СтрокаТаблицыРасход.КоррНоменклатура = ПустаяНоменклатура;
				СтрокаТаблицыРасход.КоррХарактеристика = ПустаяХарактеристика;
				СтрокаТаблицыРасход.КоррПартия = ПустаяПартия;
				СтрокаТаблицыРасход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
				СтрокаТаблицыРасход.ДокументПродажи = ДокументСсылкаПеремещениеЗапасов;
				СтрокаТаблицыРасход.ЗаказПродажи = СтрокаТаблицаЗапасы.ЗаказПокупателя;
				
			Иначе
				Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение
				   И СтрокаТаблицаЗапасы.ПеремещениеВРозницу Тогда
				   СтрокаТаблицыРасход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
				ИначеЕсли НЕ СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение
				   	   И НЕ СтрокаТаблицаЗапасы.ТипСчетаЗатрат = Перечисления.ТипыСчетов.КосвенныеЗатраты
					   //И НЕ РегламентированныйУчетСервер.СчетЯвляетсяКосвенныйПоПроизводственнымЗатратам(СтрокаТаблицаЗапасы.СчетУчетаЗатратРегл) Тогда
					   И НЕ РегламентированныйУчетСервер.СчетЯвляетсяКосвенныйПоПроизводственнымЗатратам(СтрокаТаблицаЗапасы.КоррСчетУчетаРегл) Тогда   //Малышев
						СтрокаТаблицыРасход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
				КонецЕсли;
				// Kuzmich, 08.05.2025, ONESOFT-4061, ONESOFT-3922, закоментировал
				//Если СтрокаТаблицаЗапасы.ТипСчетаЗатрат = Перечисления.ТипыСчетов.КосвенныеЗатраты
				//	//ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяКосвенныйПоПроизводственнымЗатратам(СтрокаТаблицаЗапасы.СчетУчетаЗатратРегл) Тогда
				//	ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяКосвенныйПоПроизводственнымЗатратам(СтрокаТаблицаЗапасы.КоррСчетУчетаРегл) Тогда  //Малышев
				//	СтрокаТаблицыРасход.КоррНоменклатура = ПустаяНоменклатура;
				//	СтрокаТаблицыРасход.КоррХарактеристика = ПустаяХарактеристика;
				//	СтрокаТаблицыРасход.КоррПартия = ПустаяПартия;
				//КонецЕсли;
				
			КонецЕсли;
			
			Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации Тогда
				
				СтрокаТаблицыРасход.КоррСтруктурнаяЕдиница = ПустаяСтруктурнаяЕдиница;
				СтрокаТаблицыРасход.КоррСчетУчета = ПустойСчетУчета;
				СтрокаТаблицыРасход.КоррСчетУчетаРегл = ПустойСчетУчетаРегл;
				СтрокаТаблицыРасход.КоррНоменклатура = ПустаяНоменклатура;
				СтрокаТаблицыРасход.КоррХарактеристика = ПустаяХарактеристика;
				СтрокаТаблицыРасход.КоррПартия = ПустаяПартия;
				СтрокаТаблицыРасход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
				СтрокаТаблицыРасход.ФиксированнаяСтоимость = Истина;
				
			КонецЕсли;
			
			//+++ Дмгг Попробуем не заказывать
			СтрокаТаблицыРасход.ЗаказПокупателя = ПустойЗаказПокупателя;
			СтрокаТаблицыРасход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
			//СтрокаТаблицыРасход.ФиксированнаяСтоимость = Истина;
			//--- Дмгг Попробуем не заказывать
			
			// Сформируем проводки.
			//Если Окр(СуммаКСписанию, 2, 1) <> 0 Тогда
			Если ИСТИНА или Окр(СуммаКСписанию, 2, 1) <> 0 Тогда //Малышев 2024-06-25 включил проводки с нулевой суммой
				
				СтрокаТаблицаУправленческий = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицаУправленческий, СтрокаТаблицаЗапасы);
				СтрокаТаблицаУправленческий.Сумма = СуммаКСписанию;
				
				Если СтрокаТаблицаЗапасы.ПеремещениеВРозницуСуммовойУчет Тогда
					Если СписаниеНаОС Тогда
						
						СтрокаТаблицаУправленческий.СчетДт = СтрокаТаблицаЗапасы.Имущество.СчетУчета;
						
					Иначе
						
						СтрокаТаблицаУправленческий.СчетДт = СтрокаТаблицаЗапасы.СчетУчетаВРозницеПолучатель;	
						
					КонецЕсли;
				КонецЕсли;
				
				Если СписаниеНаОС Тогда
						
						СтрокаТаблицаУправленческий.СчетДт = СтрокаТаблицаЗапасы.Имущество.СчетУчета;
						
				КонецЕсли;
					
				СтрокаТаблицаХозрасчетный = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицаХозрасчетный, СтрокаТаблицаЗапасы);
				СтрокаТаблицаХозрасчетный.Сумма = СуммаКСписанию;
				
				СтрокаТаблицаХозрасчетный.СчетКт = СтрокаТаблицаЗапасы.СчетКтРегл;
				Если СтрокаТаблицаЗапасы.ПеремещениеВРозницуСуммовойУчет Тогда
					СтрокаТаблицаХозрасчетный.СчетДт = СтрокаТаблицаЗапасы.СчетУчетаВРозницеПолучательРегл;	
				Иначе
					Если СписаниеНаОС Тогда 
						СтрокаТаблицаХозрасчетный.СчетДт = СтрокаТаблицаЗапасы.Имущество.СчетУчетаРегл;
					Иначе
						СтрокаТаблицаХозрасчетный.СчетДт = СтрокаТаблицаЗапасы.СчетДтРегл;
					КонецЕсли;
				КонецЕсли;
				
				//ПодольскийАИ #УчетПроектов 05.10.2020 {
				//Запись в регистр значений субконто жестко завязано на порядке видов субконто в счете
				//Было---
				//Если СписаниеНаОС Тогда
				//	СтрокаТаблицаХозрасчетный.СубконтоДт1 = СтрокаТаблицаЗапасы.ПодразделениеОС;
				//	СтрокаТаблицаХозрасчетный.СубконтоДт2 = СтрокаТаблицаЗапасы.Имущество;
				//	СтрокаТаблицаХозрасчетный.СубконтоДт3 = Неопределено;
				//Иначе
				//	СтрокаТаблицаХозрасчетный.СубконтоДт1 = СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница;
				//	СтрокаТаблицаХозрасчетный.СубконтоДт2 = СтрокаТаблицаЗапасы.Номенклатура;
				//	СтрокаТаблицаХозрасчетный.СубконтоДт3 = СтрокаТаблицаЗапасы.Характеристика;					
				//КонецЕсли;
				//
				//СтрокаТаблицаХозрасчетный.СубконтоКт1 = СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
				//СтрокаТаблицаХозрасчетный.СубконтоКт2 = СтрокаТаблицаЗапасы.Номенклатура;
				//СтрокаТаблицаХозрасчетный.СубконтоКт3 = СтрокаТаблицаЗапасы.Характеристика;
				//	
				//Если СписаниеНаОС Тогда 
				//	СтрокаТаблицаХозрасчетный.ВидСубконтоДт1 = "Подразделения";
				//	СтрокаТаблицаХозрасчетный.ВидСубконтоДт2 = "Имущество";
				//	СтрокаТаблицаХозрасчетный.ВидСубконтоДт3 = "";
				//Иначе
				//	
				//	Если СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад Тогда 
				//		СтрокаТаблицаХозрасчетный.ВидСубконтоДт1 = "Склады";
				//	Иначе
				//		СтрокаТаблицаХозрасчетный.ВидСубконтоДт1 = "Подразделения";
				//	КонецЕсли;
				//	СтрокаТаблицаХозрасчетный.ВидСубконтоДт2 = "Номенклатура";
				//	СтрокаТаблицаХозрасчетный.ВидСубконтоДт3 = "ХарактеристикиНоменклатуры";
				//	
				//КонецЕсли;
				//	
				//Если СтрокаТаблицаЗапасы.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад Тогда 
				//	СтрокаТаблицаХозрасчетный.ВидСубконтоКт1 = "Склады";
				//Иначе
				//	СтрокаТаблицаХозрасчетный.ВидСубконтоКт1 = "Подразделения";
				//КонецЕсли;
				//СтрокаТаблицаХозрасчетный.ВидСубконтоКт2 = "Номенклатура";
				//СтрокаТаблицаХозрасчетный.ВидСубконтоКт3 = "ХарактеристикиНоменклатуры";
				//Стало+++
				
				Если СписаниеНаОС Тогда 
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Дт", "Подразделения", СтрокаТаблицаЗапасы.ПодразделениеОС);
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Дт", "Имущество", СтрокаТаблицаЗапасы.Имущество);
				Иначе
					
					//--------------------------------------------------------------------------
					// © Шишка В.В. [21 октября 2021]  НАЧАЛО
					//Если СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад Тогда 
					Если СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница <> Неопределено И СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад
						Или  СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница //++Lazare
					Тогда 
					// © Шишка В.В. [21 октября 2021]  КОНЕЦ
					//--------------------------------------------------------------------------
						ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Дт", "Склады",  СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница);
					Иначе
						ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Дт", "Подразделения",  СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница);
					КонецЕсли;
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Дт", "Номенклатура",  СтрокаТаблицаЗапасы.Номенклатура);
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Дт", "ХарактеристикиНоменклатуры",  СтрокаТаблицаЗапасы.Характеристика);
					
				КонецЕсли;
					
				//--------------------------------------------------------------------------
				// © Шишка В.В. [21 октября 2021]  НАЧАЛО
				//Если СтрокаТаблицаЗапасы.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад Тогда 
				Если СтрокаТаблицаЗапасы.СтруктурнаяЕдиница <> Неопределено И СтрокаТаблицаЗапасы.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад 
					Или СтрокаТаблицаЗапасы.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница //++Lazare 
				Тогда 
				// © Шишка В.В. [21 октября 2021]  КОНЕЦ
				//--------------------------------------------------------------------------
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Кт", "Склады",  СтрокаТаблицаЗапасы.СтруктурнаяЕдиница);
				Иначе
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Кт", "Подразделения",  СтрокаТаблицаЗапасы.СтруктурнаяЕдиница);
				КонецЕсли;
				ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Кт", "Номенклатура",  СтрокаТаблицаЗапасы.Номенклатура);
				ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Кт", "ХарактеристикиНоменклатуры",  СтрокаТаблицаЗапасы.Характеристика);
				
				Если СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам Тогда
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Дт", "Проекты", СтрокаТаблицаЗапасы.КоррПроект);
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетный, "Кт", "Проекты", СтрокаТаблицаЗапасы.Проект);
				КонецЕсли;
				//ПодольскийАИ #УчетПроектов 05.10.2020 }
				
				Если ЗначениеЗаполнено(СтрокаТаблицаХозрасчетный.СчетДт) И СтрокаТаблицаХозрасчетный.СчетДт.Количественный Тогда
				
					СтрокаТаблицаХозрасчетный.КоличествоДт = СтрокаТаблицаЗапасы.Количество;
				
				КонецЕсли; 
				
				Если ЗначениеЗаполнено(СтрокаТаблицаХозрасчетный.СчетКт) И СтрокаТаблицаХозрасчетный.СчетКт.Количественный Тогда
				
					СтрокаТаблицаХозрасчетный.КоличествоКт = СтрокаТаблицаЗапасы.Количество;
				
				КонецЕсли; 
				
				Если СписаниеНаОС Тогда 
					СтрокаТаблицаХозрасчетный.Содержание = НСтр("ka='კაპიტალური მოდერნიზაცია';ru='Капитальная модернизация';en='capital improvements'");
				КонецЕсли;
				
			КонецЕсли;
			//+++ Дмгг
			
			// Kuzmich, 23.04.2025, (ONESOFT-3975) ნიკა პლასტი - წარმოების დოკუმენტის დროს, უარყოფითი ნაშთები არ აისახება მარაგებში და დანახარჯებში
			// делаем отрицательный остаток
			Если КоличествоТребуетсяСвободныйОстаток > 0 Тогда
				
				СтрокаТаблицыРасходОтрицательныеОстатки = ВременнаяТаблицаЗапасы.Добавить();
				
				Если ВременнаяТаблицаЗапасы.Количество()=0 Тогда
					ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасходОтрицательныеОстатки, СтрокаТаблицаЗапасы);
				Иначе	
					ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасходОтрицательныеОстатки, СтрокаТаблицыРасход);
				КонецЕсли;
				
				СтрокаТаблицыРасходОтрицательныеОстатки.ДокументПоступления = НЕОПРЕДЕЛЕНО;
				СтрокаТаблицыРасходОтрицательныеОстатки.Количество = КоличествоТребуетсяСвободныйОстаток;
				СтрокаТаблицыРасходОтрицательныеОстатки.Сумма = 0;
				
			КонецЕсли;
			// Kuzmich, 23.04.2025, (ONESOFT-3975) ნიკა პლასტი - წარმოების დოკუმენტის დროს, უარყოფითი ნაშთები არ აისახება მარაგებში და დანახარჯებში
			
			//Движение по РН ВнеоборотныеАктывы
			Если СписаниеНаОС Тогда
				СтрокВА = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВнеоборотныеАктивы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокВА, СтрокаТаблицаЗапасы);
				СтрокВА.Организация = СтрокаТаблицаЗапасы.Организация;
				СтрокВА.ВнеоборотныйАктив = СтрокаТаблицаЗапасы.Имущество;
				СтрокВА.СчетУчетаРегл= СтрокаТаблицаЗапасы.Имущество.СчетУчетаРегл;
				СтрокВА.Стоимость = СуммаКСписанию;
				СтрокВА.ВидДвижения = ВидДвиженияНакопления.Приход;
			КонецЕсли;
			//Движение по РС ПараметрыВнеоборотныхАктивов
			Если СписаниеНаОС Тогда
				СтрокВА = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПараметрыВнеоборотныхАктивов.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокВА, СтрокаТаблицаЗапасы);
				СтрокВА.Организация = СтрокаТаблицаЗапасы.Организация;
				СтрокВА.ВнеоборотныйАктив = СтрокаТаблицаЗапасы.Имущество;
				СтрокВА.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.ПодразделениеОС;
				СтрокВА.ДопСумма = СуммаКСписанию;
			КонецЕсли;
			//--- Дмгг
                        			
			Если СтрокаТаблицаЗапасы.ПеремещениеВРозницуСуммовойУчет Тогда
				
				СтрокаТаблицаСуммовойУчетВРознице = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСуммовойУчетВРознице.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицаСуммовойУчетВРознице, СтрокаТаблицаЗапасы);
				СтрокаТаблицаСуммовойУчетВРознице.ВидДвижения = ВидДвиженияНакопления.Приход;
				СтрокаТаблицаСуммовойУчетВРознице.Себестоимость = СуммаКСписанию;
				СтрокаТаблицаСуммовойУчетВРознице.Валюта = СтрокаТаблицаЗапасы.ВалютаЦеныПолучатель;
				СтрокаТаблицаСуммовойУчетВРознице.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница;
				СтрокаТаблицаСуммовойУчетВРознице.Сумма = 0;
				СтрокаТаблицаСуммовойУчетВРознице.СуммаВал = 0;
				
				ПеремещениеВРозницуСуммовойУчет = Истина;
			
			ИначеЕсли Окр(СуммаКСписанию, 2, 1) <> 0 ИЛИ КоличествоКСписанию > 0 ИЛИ КоличествоТребуетсяСвободныйОстаток > 0 Тогда // Приход // Kuzmich, 28.04.2025, (ONESOFT-3975) ნიკა პლასტი - წარმოების დოკუმენტის დროს, უარყოფითი ნაშთები არ აისახება მარაგებში და დანახარჯებში, закоментировал
			//ИначеЕсли Окр(СуммаКСписанию, 2, 1) <> 0 ИЛИ КоличествоКСписанию > 0 Тогда // Приход
				
				Если СтрокаТаблицаЗапасы.ТипСчетаЗатрат = Перечисления.ТипыСчетов.Расходы
					//ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяРасходным(СтрокаТаблицаЗапасы.СчетУчетаЗатратРегл) Тогда
					ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяРасходным(СтрокаТаблицаЗапасы.КоррСчетУчетаРегл) Тогда  //Малышев 2024-06-12
					
					СтрокаТаблицыОборот = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицыОборот, СтрокаТаблицаЗапасы);
					СтрокаТаблицыОборот.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница;
					СтрокаТаблицыОборот.НаправлениеДеятельности = СтрокаТаблицаЗапасы.КоррНаправлениеДеятельности;
					СтрокаТаблицыОборот.ЗаказПокупателя = СтрокаТаблицаЗапасы.КоррЗаказПокупателя;
					СтрокаТаблицыОборот.СуммаРасходов = СуммаКСписанию;
					СтрокаТаблицыОборот.СчетУчета = СтрокаТаблицаЗапасы.КоррСчетУчета;
					СтрокаТаблицыОборот.СчетУчетаРегл = СтрокаТаблицаЗапасы.КоррСчетУчетаРегл;
					СтрокаТаблицыОборот.Аналитика = СтрокаТаблицаЗапасы.Номенклатура;
					
				Иначе // Это затраты.
					
					СтрокаТаблицыПриход = ВременнаяТаблицаЗапасы.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриход, СтрокаТаблицаЗапасы);
					
					СтрокаТаблицыПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
					
					СтрокаТаблицыПриход.Организация = СтрокаТаблицаЗапасы.Организация;
					СтрокаТаблицыПриход.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница;
					СтрокаТаблицыПриход.СчетУчета = СтрокаТаблицаЗапасы.КоррСчетУчета;
					СтрокаТаблицыПриход.СчетУчетаРегл = СтрокаТаблицаЗапасы.КоррСчетУчетаРегл;
					
					//ПодольскийАИ #УчетПроектов 08.10.2020 {
					СтрокаТаблицыПриход.Проект = СтрокаТаблицаЗапасы.КоррПроект;
					//ПодольскийАИ #УчетПроектов 08.10.2020 }
					
					//Малышев 2024-11-19 ONESOFT-3602
					Если СтрокаТаблицыПриход.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад Тогда
						СтрокаТаблицыПриход.ДокументПоступления = СтрокаТаблицыОстатков.ДокументПоступления; 
					КонецЕсли;	
					
					//СтрокаТаблицыПриход.Количество = КоличествоКСписанию; // Kuzmich, 28.04.2025, (ONESOFT-3975) ნიკა პლასტი - წარმოების დოკუმენტის დროს, უარყოფითი ნაშთები არ აისახება მარაგებში და დანახარჯებში, закоментировал
					СтрокаТаблицыПриход.Количество = КоличествоКСписанию + КоличествоТребуетсяСвободныйОстаток;

					//Паганини_
					Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах") Тогда
						Если Получатель_Транзитный Тогда
							СтрокаТаблицыПриход.СчетУчетаРегл 	= СчетТранзитногоСклада;
						ИначеЕсли Отправитель_Транзитный И ЗначениеЗаполнено(ДокументСсылкаПеремещениеЗапасов.ДокументПеремещенияВТранзит) Тогда
							СтрокаТаблицыПриход.КоррСчетУчетаРегл 	= СчетТранзитногоСклада;
						КонецЕсли;
					КонецЕсли;
					//_Паганини
					//СтрокаТаблицыПриход.Номенклатура = СтрокаТаблицаЗапасы.КоррНоменклатура;
					СтрокаТаблицыПриход.Характеристика = СтрокаТаблицаЗапасы.КоррХарактеристика;
					СтрокаТаблицыПриход.Партия = СтрокаТаблицаЗапасы.КоррПартия;
					
					Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение
					И НЕ СтрокаТаблицаЗапасы.ПеремещениеВРозницу Тогда
						СтрокаТаблицыПриход.ЗаказПокупателя = СтрокаТаблицаЗапасы.КоррЗаказПокупателя;
					ИначеЕсли СтрокаТаблицаЗапасы.ТипСчетаЗатрат = Перечисления.ТипыСчетов.КосвенныеЗатраты
						//ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяКосвенныйПоПроизводственнымЗатратам(СтрокаТаблицаЗапасы.СчетУчетаЗатратРегл) Тогда
						ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяКосвенныйПоПроизводственнымЗатратам(СтрокаТаблицаЗапасы.КоррСчетУчетаРегл) Тогда   //Малышев 2024-06-12
						СтрокаТаблицыПриход.ЗаказПокупателя = СтрокаТаблицаЗапасы.КоррЗаказПокупателя;
						//СтрокаТаблицыПриход.Номенклатура = ПустаяНоменклатура;
						//СтрокаТаблицыПриход.Характеристика = ПустаяХарактеристика;
						СтрокаТаблицыПриход.Партия = ПустаяПартия;
					Иначе
						СтрокаТаблицыПриход.ЗаказПокупателя = ПустойЗаказПокупателя;
					КонецЕсли;
					
					СтрокаТаблицыПриход.КоррСтруктурнаяЕдиница = СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
					СтрокаТаблицыПриход.КоррСчетУчета = СтрокаТаблицаЗапасы.СчетУчета;
					СтрокаТаблицыПриход.КоррСчетУчетаРегл = СтрокаТаблицаЗапасы.СчетУчетаРегл;
					СтрокаТаблицыПриход.КоррНоменклатура = СтрокаТаблицаЗапасы.Номенклатура;
					СтрокаТаблицыПриход.КоррХарактеристика = СтрокаТаблицаЗапасы.Характеристика;
					СтрокаТаблицыПриход.КоррПартия = СтрокаТаблицаЗапасы.Партия;
					//СтрокаТаблицыПриход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
					
					//ПодольскийАИ #УчетПроектов 08.10.2020 {
					СтрокаТаблицыПриход.КоррПроект = СтрокаТаблицаЗапасы.Проект;
					//ПодольскийАИ #УчетПроектов 08.10.2020 }
					
					СтрокаТаблицыПриход.Сумма = СуммаКСписанию;
					
					//Малышев 2024-11-19 ONESOFT-3602 - закоментировал, чтобы количество затрат вставало
					//Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию
					// ИЛИ СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы Тогда
					//	СтрокаТаблицыПриход.Количество = 0;
					//Иначе
					//	//СтрокаТаблицыПриход.Количество = КоличествоТребуетсяСвободныйОстаток;
					//	СтрокаТаблицыПриход.Количество = КоличествоКСписанию; //Малышев 2024-11-19 ONESOFT-3602
					//КонецЕсли;
					
					СтрокаТаблицыПриход.СчетУчета = СтрокаТаблицаЗапасы.КоррСчетУчета;
					СтрокаТаблицыПриход.СчетУчетаРегл = СтрокаТаблицаЗапасы.КоррСчетУчетаРегл;
					//Паганини_
					Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах") Тогда
						Если Получатель_Транзитный Тогда
							СтрокаТаблицыПриход.СчетУчетаРегл 	= СчетТранзитногоСклада;
						ИначеЕсли Отправитель_Транзитный И ЗначениеЗаполнено(ДокументСсылкаПеремещениеЗапасов.ДокументПеремещенияВТранзит) Тогда
							СтрокаТаблицыПриход.КоррСчетУчетаРегл 	= СчетТранзитногоСклада;
						КонецЕсли;
					КонецЕсли;
					//_Паганини
					
					Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации Тогда
						
						СтрокаТаблицыПриход.КоррСтруктурнаяЕдиница = ПустаяСтруктурнаяЕдиница;
						СтрокаТаблицыПриход.КоррСчетУчета = ПустойСчетУчета;
						СтрокаТаблицыПриход.КоррСчетУчетаРегл = ПустойСчетУчетаРегл;
						СтрокаТаблицыПриход.КоррНоменклатура = ПустаяНоменклатура;
						СтрокаТаблицыПриход.КоррХарактеристика = ПустаяХарактеристика;
						СтрокаТаблицыПриход.КоррПартия = ПустаяПартия;
						СтрокаТаблицыПриход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
						СтрокаТаблицыПриход.ФиксированнаяСтоимость = Истина;
						
					КонецЕсли;
					
					//+++ Дмгг Попробуем не заказывать
					СтрокаТаблицыПриход.ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
					СтрокаТаблицыПриход.КоррЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
					//СтрокаТаблицыПриход.ФиксированнаяСтоимость = Истина;
					//--- Дмгг Попробуем не заказывать
					
					Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации Тогда 
						
						СтруктураПоиска = Новый Структура;
						СтруктураПоиска.Вставить("Номенклатура", 		СтрокаТаблицаЗапасы.Номенклатура);
						СтруктураПоиска.Вставить("Характеристика", 		СтрокаТаблицаЗапасы.Характеристика);
						СтруктураПоиска.Вставить("Организация",			СтрокаТаблицаЗапасы.Организация);
						СтруктураПоиска.Вставить("СчетУчетаРегл",		СтрокаТаблицаЗапасы.СчетУчетаРегл); 
						СтруктураПоиска.Вставить("СтруктурнаяЕдиница",	СтрокаТаблицаЗапасы.СтруктурнаяЕдиница);
						
						МассивСтрокОстатков = Неопределено;
						Если НЕ СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости Тогда 
							
							СтруктураПоиска.Вставить("ЗаказПокупателя", СтрокаТаблицаЗапасы.ЗаказПокупателя);
							МассивСтрокОстатков = ТаблицаЗапасыОстатки.НайтиСтроки(СтруктураДляПоиска); 
							
						Иначе
							
							МассивСтрокОстатков = 	ТаблицаЗапасыОстаткиПодРезерв.НайтиСтроки(СтруктураДляПоиска);
							
						КонецЕсли;
						
						СтрокаОстатков = Неопределено;
						
						//Для Каждого ЭлементОстатков Из МассивСтрокОстатков Цикл 
						//	Если ЗначениеЗаполнено(ЭлементОстатков.СчетУчетаЗатратРегл) Тогда 
						//		СтрокаОстатков = ЭлементОстатков;
						//		Прервать;
						//	КонецЕсли;
						//КонецЦикла;
						
						Если НЕ СтрокаОстатков = Неопределено Тогда 
							
							СтрокаТаблицаХозрасчетный = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаТаблицаХозрасчетный, СтрокаТаблицаЗапасы);
							СтрокаТаблицаХозрасчетный.Сумма = СуммаКСписанию;
							
							СтрокаТаблицаХозрасчетный.СчетДт = СтрокаОстатков.СчетУчетаРегл;
							СтрокаТаблицаХозрасчетный.СчетКт = СтрокаОстатков.СчетУчетаЗатратРегл;
							
							СтрокаТаблицаХозрасчетный.СубконтоДт1 = СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница;
							СтрокаТаблицаХозрасчетный.СубконтоДт2 = СтрокаТаблицаЗапасы.Номенклатура;
							СтрокаТаблицаХозрасчетный.СубконтоДт3 = СтрокаТаблицаЗапасы.Характеристика;
							
							СтрокаТаблицаХозрасчетный.СубконтоКт1 = СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
							СтрокаТаблицаХозрасчетный.СубконтоКт2 = СтрокаТаблицаЗапасы.Номенклатура;
							СтрокаТаблицаХозрасчетный.СубконтоКт3 = СтрокаТаблицаЗапасы.Характеристика;
							
							//--------------------------------------------------------------------------
							// © Шишка В.В. [21 октября 2021]  НАЧАЛО
							//Если СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад Тогда 
							Если СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница <> Неопределено И СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад Тогда 
								
							// © Шишка В.В. [21 октября 2021]  КОНЕЦ
							//--------------------------------------------------------------------------
								СтрокаТаблицаХозрасчетный.ВидСубконтоДт1 = "Склады";
							Иначе
								СтрокаТаблицаХозрасчетный.ВидСубконтоДт1 = "Подразделения";
							КонецЕсли;
							СтрокаТаблицаХозрасчетный.ВидСубконтоДт2 = "Номенклатура";
							СтрокаТаблицаХозрасчетный.ВидСубконтоДт3 = "ХарактеристикиНоменклатуры";
							
							
							//--------------------------------------------------------------------------
							// © Шишка В.В. [21 октября 2021]  НАЧАЛО
							//Если СтрокаТаблицаЗапасы.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад Тогда 
							Если СтрокаТаблицаЗапасы.СтруктурнаяЕдиница <> Неопределено И СтрокаТаблицаЗапасы.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад Тогда 
							// © Шишка В.В. [21 октября 2021]  КОНЕЦ
							//--------------------------------------------------------------------------
								СтрокаТаблицаХозрасчетный.ВидСубконтоКт1 = "Склады";
							Иначе
								СтрокаТаблицаХозрасчетный.ВидСубконтоКт1 = "Подразделения";
							КонецЕсли;
							СтрокаТаблицаХозрасчетный.ВидСубконтоКт2 = "Номенклатура";
							СтрокаТаблицаХозрасчетный.ВидСубконтоКт3 = "ХарактеристикиНоменклатуры";
							
							Если ЗначениеЗаполнено(СтрокаТаблицаХозрасчетный.СчетДт) И СтрокаТаблицаХозрасчетный.СчетДт.Количественный Тогда
								
								СтрокаТаблицаХозрасчетный.КоличествоДт = СтрокаТаблицаЗапасы.Количество;
								
							КонецЕсли; 
							
							Если ЗначениеЗаполнено(СтрокаТаблицаХозрасчетный.СчетКт) И СтрокаТаблицаХозрасчетный.СчетКт.Количественный Тогда
								
								СтрокаТаблицаХозрасчетный.КоличествоКт = СтрокаТаблицаЗапасы.Количество;
								
							КонецЕсли; 
							
							Если СписаниеНаОС Тогда 
								СтрокаТаблицаХозрасчетный.Содержание = НСтр("ka='ექსპლუატაციიდან დაბრუნება';ru='Возврат из експлуатации'");
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			КонецЦикла; //по строкам остатков
			// Kuzmich, 28.04.2025, (ONESOFT-3975) ნიკა პლასტი - წარმოების დოკუმენტის დროს, უარყოფითი ნაშთები არ აისახება მარაგებში და დანახარჯებში
			// делаем отрицательный остаток
			Если МассивСтрокОстатков.Количество() = 0 ИЛИ КоличествоТребуетсяСвободныйОстаток>0 Тогда
				
				// Расход
				СтрокаТаблицыРасходОтрицательныеОстатки = ВременнаяТаблицаЗапасы.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасходОтрицательныеОстатки, СтрокаТаблицаЗапасы);
				
				СтрокаТаблицыРасходОтрицательныеОстатки.ДокументПоступления = НЕОПРЕДЕЛЕНО;
				СтрокаТаблицыРасходОтрицательныеОстатки.Количество = КоличествоТребуетсяСвободныйОстаток;
				СтрокаТаблицыРасходОтрицательныеОстатки.Сумма = 0;
				
				Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах") Тогда
					Если Получатель_Транзитный Тогда
						СтрокаТаблицыРасход.КоррСчетУчетаРегл 	= СчетТранзитногоСклада;
						СтрокаТаблицыРасход.СчетДтРегл 			= СчетТранзитногоСклада;
					ИначеЕсли Отправитель_Транзитный И ЗначениеЗаполнено(ДокументСсылкаПеремещениеЗапасов.ДокументПеремещенияВТранзит) Тогда
						СтрокаТаблицыРасход.СчетУчетаРегл 		= СчетТранзитногоСклада;
						СтрокаТаблицыРасход.СчетКтРегл 			= СчетТранзитногоСклада;
					КонецЕсли;
				КонецЕсли;
				
				Если СтрокаТаблицаЗапасы.ТипСчетаЗатрат = Перечисления.ТипыСчетов.Расходы
					ИЛИ СтрокаТаблицаЗапасы.ПеремещениеВРозницуСуммовойУчет
					ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяРасходным(СтрокаТаблицаЗапасы.КоррСчетУчетаРегл) Тогда  //Малышев 
					
					СтрокаТаблицыРасходОтрицательныеОстатки.КоррСтруктурнаяЕдиница = ПустаяСтруктурнаяЕдиница;
					СтрокаТаблицыРасходОтрицательныеОстатки.КоррСчетУчета = ПустойСчетУчета;
					СтрокаТаблицыРасходОтрицательныеОстатки.КоррСчетУчетаРегл = ПустойСчетУчетаРегл;
					СтрокаТаблицыРасходОтрицательныеОстатки.КоррНоменклатура = ПустаяНоменклатура;
					СтрокаТаблицыРасходОтрицательныеОстатки.КоррХарактеристика = ПустаяХарактеристика;
					СтрокаТаблицыРасходОтрицательныеОстатки.КоррПартия = ПустаяПартия;
					СтрокаТаблицыРасходОтрицательныеОстатки.КоррЗаказПокупателя = ПустойЗаказПокупателя;
					СтрокаТаблицыРасходОтрицательныеОстатки.ДокументПродажи = ДокументСсылкаПеремещениеЗапасов;
					СтрокаТаблицыРасходОтрицательныеОстатки.ЗаказПродажи = СтрокаТаблицаЗапасы.ЗаказПокупателя;
					
				Иначе
					Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение
						И СтрокаТаблицаЗапасы.ПеремещениеВРозницу Тогда
						СтрокаТаблицыРасходОтрицательныеОстатки.КоррЗаказПокупателя = ПустойЗаказПокупателя;
					ИначеЕсли НЕ СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение
						И НЕ СтрокаТаблицаЗапасы.ТипСчетаЗатрат = Перечисления.ТипыСчетов.КосвенныеЗатраты
						И НЕ РегламентированныйУчетСервер.СчетЯвляетсяКосвенныйПоПроизводственнымЗатратам(СтрокаТаблицаЗапасы.КоррСчетУчетаРегл) Тогда   //Малышев
						СтрокаТаблицыРасходОтрицательныеОстатки.КоррЗаказПокупателя = ПустойЗаказПокупателя;
					КонецЕсли;
					
					Если СтрокаТаблицаЗапасы.ТипСчетаЗатрат = Перечисления.ТипыСчетов.КосвенныеЗатраты
						ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяКосвенныйПоПроизводственнымЗатратам(СтрокаТаблицаЗапасы.КоррСчетУчетаРегл) Тогда  //Малышев
						СтрокаТаблицыРасходОтрицательныеОстатки.КоррНоменклатура = ПустаяНоменклатура;
						СтрокаТаблицыРасходОтрицательныеОстатки.КоррХарактеристика = ПустаяХарактеристика;
						СтрокаТаблицыРасходОтрицательныеОстатки.КоррПартия = ПустаяПартия;
					КонецЕсли;
					
				КонецЕсли;
				
				Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации Тогда
					
					СтрокаТаблицыРасходОтрицательныеОстатки.КоррСтруктурнаяЕдиница = ПустаяСтруктурнаяЕдиница;
					СтрокаТаблицыРасходОтрицательныеОстатки.КоррСчетУчета = ПустойСчетУчета;
					СтрокаТаблицыРасходОтрицательныеОстатки.КоррСчетУчетаРегл = ПустойСчетУчетаРегл;
					СтрокаТаблицыРасходОтрицательныеОстатки.КоррНоменклатура = ПустаяНоменклатура;
					СтрокаТаблицыРасходОтрицательныеОстатки.КоррХарактеристика = ПустаяХарактеристика;
					СтрокаТаблицыРасходОтрицательныеОстатки.КоррПартия = ПустаяПартия;
					СтрокаТаблицыРасходОтрицательныеОстатки.КоррЗаказПокупателя = ПустойЗаказПокупателя;
					СтрокаТаблицыРасходОтрицательныеОстатки.ФиксированнаяСтоимость = Истина;
					
				КонецЕсли;
				
				//+++ Дмгг Попробуем не заказывать
				СтрокаТаблицыРасходОтрицательныеОстатки.ЗаказПокупателя = ПустойЗаказПокупателя;
				СтрокаТаблицыРасходОтрицательныеОстатки.КоррЗаказПокупателя = ПустойЗаказПокупателя;
				//--- Дмгг Попробуем не заказывать
				
				// Сформируем проводки.
				СтрокаТаблицаУправленческийОтрицательныеОстатки = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицаУправленческийОтрицательныеОстатки, СтрокаТаблицаЗапасы);
				СтрокаТаблицаУправленческийОтрицательныеОстатки.Сумма = 0;
				
				Если СтрокаТаблицаЗапасы.ПеремещениеВРозницуСуммовойУчет Тогда
					Если СписаниеНаОС Тогда
						СтрокаТаблицаУправленческийОтрицательныеОстатки.СчетДт = СтрокаТаблицаЗапасы.Имущество.СчетУчета;
					Иначе
						СтрокаТаблицаУправленческийОтрицательныеОстатки.СчетДт = СтрокаТаблицаЗапасы.СчетУчетаВРозницеПолучатель;	
					КонецЕсли;
				КонецЕсли;
				
				Если СписаниеНаОС Тогда
					СтрокаТаблицаУправленческийОтрицательныеОстатки.СчетДт = СтрокаТаблицаЗапасы.Имущество.СчетУчета;
				КонецЕсли;
				
				СтрокаТаблицаХозрасчетныйОтрицательныеОстатки = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицаХозрасчетныйОтрицательныеОстатки, СтрокаТаблицаЗапасы);
				СтрокаТаблицаХозрасчетныйОтрицательныеОстатки.Сумма = 0;
				
				СтрокаТаблицаХозрасчетныйОтрицательныеОстатки.СчетКт = СтрокаТаблицаЗапасы.СчетКтРегл;
				Если СтрокаТаблицаЗапасы.ПеремещениеВРозницуСуммовойУчет Тогда
					СтрокаТаблицаХозрасчетныйОтрицательныеОстатки.СчетДт = СтрокаТаблицаЗапасы.СчетУчетаВРозницеПолучательРегл;	
				Иначе
					Если СписаниеНаОС Тогда 
						СтрокаТаблицаХозрасчетныйОтрицательныеОстатки.СчетДт = СтрокаТаблицаЗапасы.Имущество.СчетУчетаРегл;
					Иначе
						СтрокаТаблицаХозрасчетныйОтрицательныеОстатки.СчетДт = СтрокаТаблицаЗапасы.СчетДтРегл;
					КонецЕсли;
				КонецЕсли;
				
				Если СписаниеНаОС Тогда 
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетныйОтрицательныеОстатки, "Дт", "Подразделения", СтрокаТаблицаЗапасы.ПодразделениеОС);
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетныйОтрицательныеОстатки, "Дт", "Имущество", СтрокаТаблицаЗапасы.Имущество);
				Иначе
					
					Если СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница <> Неопределено И СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад
						Или  СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница //++Lazare
						Тогда 
						ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетныйОтрицательныеОстатки, "Дт", "Склады",  СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница);
					Иначе
						ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетныйОтрицательныеОстатки, "Дт", "Подразделения",  СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница);
					КонецЕсли;
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетныйОтрицательныеОстатки, "Дт", "Номенклатура",  СтрокаТаблицаЗапасы.Номенклатура);
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетныйОтрицательныеОстатки, "Дт", "ХарактеристикиНоменклатуры",  СтрокаТаблицаЗапасы.Характеристика);
					
				КонецЕсли;
				
				Если СтрокаТаблицаЗапасы.СтруктурнаяЕдиница <> Неопределено И СтрокаТаблицаЗапасы.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад 
					Или СтрокаТаблицаЗапасы.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница //++Lazare 
					Тогда 
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетныйОтрицательныеОстатки, "Кт", "Склады",  СтрокаТаблицаЗапасы.СтруктурнаяЕдиница);
				Иначе
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетныйОтрицательныеОстатки, "Кт", "Подразделения",  СтрокаТаблицаЗапасы.СтруктурнаяЕдиница);
				КонецЕсли;
				ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетныйОтрицательныеОстатки, "Кт", "Номенклатура",  СтрокаТаблицаЗапасы.Номенклатура);
				ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетныйОтрицательныеОстатки, "Кт", "ХарактеристикиНоменклатуры",  СтрокаТаблицаЗапасы.Характеристика);
				
				Если СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам Тогда
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетныйОтрицательныеОстатки, "Дт", "Проекты", СтрокаТаблицаЗапасы.КоррПроект);
					ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТаблицаХозрасчетныйОтрицательныеОстатки, "Кт", "Проекты", СтрокаТаблицаЗапасы.Проект);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаТаблицаХозрасчетныйОтрицательныеОстатки.СчетДт) И СтрокаТаблицаХозрасчетныйОтрицательныеОстатки.СчетДт.Количественный Тогда
					
					СтрокаТаблицаХозрасчетныйОтрицательныеОстатки.КоличествоДт = СтрокаТаблицаЗапасы.Количество;
					
				КонецЕсли; 
				
				Если ЗначениеЗаполнено(СтрокаТаблицаХозрасчетныйОтрицательныеОстатки.СчетКт) И СтрокаТаблицаХозрасчетныйОтрицательныеОстатки.СчетКт.Количественный Тогда
					
					СтрокаТаблицаХозрасчетныйОтрицательныеОстатки.КоличествоКт = СтрокаТаблицаЗапасы.Количество;
					
				КонецЕсли; 
				
				Если СписаниеНаОС Тогда 
					СтрокаТаблицаХозрасчетныйОтрицательныеОстатки.Содержание = НСтр("ka='კაპიტალური მოდერნიზაცია';ru='Капитальная модернизация';en='capital improvements'");
				КонецЕсли;
				
				// Приход
				Если СтрокаТаблицаЗапасы.ТипСчетаЗатрат = Перечисления.ТипыСчетов.Расходы
					ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяРасходным(СтрокаТаблицаЗапасы.КоррСчетУчетаРегл) Тогда  //Малышев 2024-06-12
					
					СтрокаТаблицыОборотОтрицательныеОстатки = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицыОборотОтрицательныеОстатки, СтрокаТаблицаЗапасы);
					СтрокаТаблицыОборотОтрицательныеОстатки.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница;
					СтрокаТаблицыОборотОтрицательныеОстатки.НаправлениеДеятельности = СтрокаТаблицаЗапасы.КоррНаправлениеДеятельности;
					СтрокаТаблицыОборотОтрицательныеОстатки.ЗаказПокупателя = СтрокаТаблицаЗапасы.КоррЗаказПокупателя;
					СтрокаТаблицыОборотОтрицательныеОстатки.СуммаРасходов = СуммаКСписанию;
					СтрокаТаблицыОборотОтрицательныеОстатки.СчетУчета = СтрокаТаблицаЗапасы.КоррСчетУчета;
					СтрокаТаблицыОборотОтрицательныеОстатки.СчетУчетаРегл = СтрокаТаблицаЗапасы.КоррСчетУчетаРегл;
					СтрокаТаблицыОборотОтрицательныеОстатки.Аналитика = СтрокаТаблицаЗапасы.Номенклатура;
					
				Иначе // Это затраты.
					
					СтрокаТаблицыПриходОтрицательныеОстатки = ВременнаяТаблицаЗапасы.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриходОтрицательныеОстатки, СтрокаТаблицаЗапасы);
					
					СтрокаТаблицыПриходОтрицательныеОстатки.ВидДвижения = ВидДвиженияНакопления.Приход;
					
					СтрокаТаблицыПриходОтрицательныеОстатки.Организация = СтрокаТаблицаЗапасы.Организация;
					СтрокаТаблицыПриходОтрицательныеОстатки.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница;
					СтрокаТаблицыПриходОтрицательныеОстатки.СчетУчета = СтрокаТаблицаЗапасы.КоррСчетУчета;
					СтрокаТаблицыПриходОтрицательныеОстатки.СчетУчетаРегл = СтрокаТаблицаЗапасы.КоррСчетУчетаРегл;
					
					//ПодольскийАИ #УчетПроектов 08.10.2020 {
					СтрокаТаблицыПриходОтрицательныеОстатки.Проект = СтрокаТаблицаЗапасы.КоррПроект;
					//ПодольскийАИ #УчетПроектов 08.10.2020 }
					
					//Малышев 2024-11-19 ONESOFT-3602
					Если СтрокаТаблицыПриходОтрицательныеОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад Тогда
						Если СтрокаТаблицыПриходОтрицательныеОстатки.Номенклатура.МетодОценки = Перечисления.МетодОценкиЗапасов.FIFO Тогда
							СтрокаТаблицыПриходОтрицательныеОстатки.ДокументПоступления = ДокументСсылкаПеремещениеЗапасов; 
						Иначе	
							СтрокаТаблицыПриходОтрицательныеОстатки.ДокументПоступления = НЕОПРЕДЕЛЕНО; 
						КонецЕсли;
					КонецЕсли;	
					
					//СтрокаТаблицыПриходОтрицательныеОстатки.Количество = КоличествоКСписанию; // Kuzmich, 28.04.2025, (ONESOFT-3975) ნიკა პლასტი - წარმოების დოკუმენტის დროს, უარყოფითი ნაშთები არ აისახება მარაგებში და დანახარჯებში, закоментировал
					
					//Паганини_
					Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах") Тогда
						Если Получатель_Транзитный Тогда
							СтрокаТаблицыПриходОтрицательныеОстатки.СчетУчетаРегл 	= СчетТранзитногоСклада;
						ИначеЕсли Отправитель_Транзитный И ЗначениеЗаполнено(ДокументСсылкаПеремещениеЗапасов.ДокументПеремещенияВТранзит) Тогда
							СтрокаТаблицыПриходОтрицательныеОстатки.КоррСчетУчетаРегл 	= СчетТранзитногоСклада;
						КонецЕсли;
					КонецЕсли;
					//_Паганини
					СтрокаТаблицыПриходОтрицательныеОстатки.Характеристика = СтрокаТаблицаЗапасы.КоррХарактеристика;
					СтрокаТаблицыПриходОтрицательныеОстатки.Партия = СтрокаТаблицаЗапасы.КоррПартия;
					
					Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение
						И НЕ СтрокаТаблицаЗапасы.ПеремещениеВРозницу Тогда
						СтрокаТаблицыПриходОтрицательныеОстатки.ЗаказПокупателя = СтрокаТаблицаЗапасы.КоррЗаказПокупателя;
					ИначеЕсли СтрокаТаблицаЗапасы.ТипСчетаЗатрат = Перечисления.ТипыСчетов.КосвенныеЗатраты
						ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяКосвенныйПоПроизводственнымЗатратам(СтрокаТаблицаЗапасы.КоррСчетУчетаРегл) Тогда   //Малышев 2024-06-12
						СтрокаТаблицыПриходОтрицательныеОстатки.ЗаказПокупателя = СтрокаТаблицаЗапасы.КоррЗаказПокупателя;
						СтрокаТаблицыПриходОтрицательныеОстатки.Партия = ПустаяПартия;
					Иначе
						СтрокаТаблицыПриходОтрицательныеОстатки.ЗаказПокупателя = ПустойЗаказПокупателя;
					КонецЕсли;
					
					СтрокаТаблицыПриходОтрицательныеОстатки.КоррСтруктурнаяЕдиница = СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
					СтрокаТаблицыПриходОтрицательныеОстатки.КоррСчетУчета = СтрокаТаблицаЗапасы.СчетУчета;
					СтрокаТаблицыПриходОтрицательныеОстатки.КоррСчетУчетаРегл = СтрокаТаблицаЗапасы.СчетУчетаРегл;
					СтрокаТаблицыПриходОтрицательныеОстатки.КоррНоменклатура = СтрокаТаблицаЗапасы.Номенклатура;
					СтрокаТаблицыПриходОтрицательныеОстатки.КоррХарактеристика = СтрокаТаблицаЗапасы.Характеристика;
					СтрокаТаблицыПриходОтрицательныеОстатки.КоррПартия = СтрокаТаблицаЗапасы.Партия;
					
					//ПодольскийАИ #УчетПроектов 08.10.2020 {
					СтрокаТаблицыПриходОтрицательныеОстатки.КоррПроект = СтрокаТаблицаЗапасы.Проект;
					//ПодольскийАИ #УчетПроектов 08.10.2020 }
					
					СтрокаТаблицыПриходОтрицательныеОстатки.Сумма = 0;
					
					СтрокаТаблицыПриходОтрицательныеОстатки.СчетУчета = СтрокаТаблицаЗапасы.КоррСчетУчета;
					СтрокаТаблицыПриходОтрицательныеОстатки.СчетУчетаРегл = СтрокаТаблицаЗапасы.КоррСчетУчетаРегл;
					//Паганини_
					Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах") Тогда
						Если Получатель_Транзитный Тогда
							СтрокаТаблицыПриходОтрицательныеОстатки.СчетУчетаРегл 	= СчетТранзитногоСклада;
						ИначеЕсли Отправитель_Транзитный И ЗначениеЗаполнено(ДокументСсылкаПеремещениеЗапасов.ДокументПеремещенияВТранзит) Тогда
							СтрокаТаблицыПриходОтрицательныеОстатки.КоррСчетУчетаРегл 	= СчетТранзитногоСклада;
						КонецЕсли;
					КонецЕсли;
					//_Паганини
					
					Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации Тогда
						
						СтрокаТаблицыПриходОтрицательныеОстатки.КоррСтруктурнаяЕдиница = ПустаяСтруктурнаяЕдиница;
						СтрокаТаблицыПриходОтрицательныеОстатки.КоррСчетУчета = ПустойСчетУчета;
						СтрокаТаблицыПриходОтрицательныеОстатки.КоррСчетУчетаРегл = ПустойСчетУчетаРегл;
						СтрокаТаблицыПриходОтрицательныеОстатки.КоррНоменклатура = ПустаяНоменклатура;
						СтрокаТаблицыПриходОтрицательныеОстатки.КоррХарактеристика = ПустаяХарактеристика;
						СтрокаТаблицыПриходОтрицательныеОстатки.КоррПартия = ПустаяПартия;
						СтрокаТаблицыПриходОтрицательныеОстатки.КоррЗаказПокупателя = ПустойЗаказПокупателя;
						СтрокаТаблицыПриходОтрицательныеОстатки.ФиксированнаяСтоимость = Истина;
						
					КонецЕсли;
					
					//+++ Дмгг Попробуем не заказывать
					СтрокаТаблицыПриходОтрицательныеОстатки.ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
					СтрокаТаблицыПриходОтрицательныеОстатки.КоррЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
					//--- Дмгг Попробуем не заказывать
					
				КонецЕсли;
			КонецЕсли;
			// Kuzmich, 28.04.2025, (ONESOFT-3975) ნიკა პლასტი - წარმოების დოკუმენტის დროს, უარყოფითი ნაშთები არ აისახება მარაგებში და დანახარჯებში	
		КонецЕсли; //КоличествоТребуетсяСвободныйОстаток > 0
		
		//Малышев 2024-11-19 ONESOFT-3602 - закоментировал
		//// Если это передача в эксплуатацию, то передаем по нулевой стоимости, а саму стоимость относим
		//// на затраты подразделения-получателя.
		//Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию Тогда
		//   
		//   // Нужно добавить тогда приход только по количеству с пустой корреспонденции,
		//   // для корректного учета в количественном выражении.
		//   СтрокаТаблицыПриход = ВременнаяТаблицаЗапасы.Добавить();
		//   ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриход, СтрокаТаблицаЗапасы);
		//   
		//   СтрокаТаблицыПриход.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница;
		//   
		//   СтрокаТаблицыПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
		//   
		//   СтрокаТаблицыПриход.ЗаказПокупателя = ПустойЗаказПокупателя;
		//  		   
		//   СтрокаТаблицыПриход.КоррСтруктурнаяЕдиница = ПустаяСтруктурнаяЕдиница;
		//   СтрокаТаблицыПриход.КоррСчетУчета = ПустойСчетУчета;
		//   СтрокаТаблицыПриход.КоррСчетУчетаРегл = ПустойСчетУчетаРегл;
		//   СтрокаТаблицыПриход.КоррНоменклатура = ПустаяНоменклатура;
		//   СтрокаТаблицыПриход.КоррХарактеристика = ПустаяХарактеристика;
		//   СтрокаТаблицыПриход.КоррПартия = ПустаяПартия;
		//   СтрокаТаблицыПриход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
		//   
		//   СтрокаТаблицыПриход.Сумма = 0;
		//   СтрокаТаблицыПриход.ФиксированнаяСтоимость = Истина;
		//   
		//   //Малышев 2024-06-12 ONESOFT-3094 - скорректируем записи по регистру
		//   СтрокаТаблицыПриход.СчетУчетаРегл = СтрокаТаблицаЗапасы.СчетДтРегл;
		//   СтрокаТаблицыПриход.Проект = СтрокаТаблицаЗапасы.КоррПроект;
		//   
		//КонецЕсли;
			
	КонецЦикла;
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы = ВременнаяТаблицаЗапасы;
	// Kuzmich, 31.05.2022, Очистить резерв при перемещении по константе
	Если Константы.ОчиститьРезервПриПеремещенииЗапасов.Получить() Тогда
	
		Для каждого СтрокаВременнаяТаблицаЗапасы Из СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы Цикл
		
			Если СтрокаВременнаяТаблицаЗапасы.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
			
				СтрокаВременнаяТаблицаЗапасы.ЗаказПокупателя = НЕОПРЕДЕЛЕНО;
				СтрокаВременнаяТаблицаЗапасы.КоррЗаказПокупателя = НЕОПРЕДЕЛЕНО;
			
			КонецЕсли;
		
		КонецЦикла; 
	
	КонецЕсли;
	// Kuzmich, 31.05.2022, Очистить резерв при перемещении по константе
	Если СписаниеНаОС Тогда 
		тзЗапасы = ВременнаяТаблицаЗапасы.Скопировать(Новый Структура("ВидДвижения", ВидДвиженияНакопления.Расход));
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы = тзЗапасы;
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПараметрыВнеоборотныхАктивов.Свернуть("Период,Организация,ВнеоборотныйАктив,ОбъемПродукцииРаботДляВычисленияАмортизации,СтоимостьДляВычисленияАмортизации,ПрименитьВТекущемМесяце,СчетЗатрат,СтруктурнаяЕдиница,НаправлениеДеятельности,СрокИспользованияДляВычисленияАмортизации,СчетЗатратРегл,Адрес", "ДопСумма");
		Для Каждого Строк Из СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПараметрыВнеоборотныхАктивов Цикл 
			Строк.СтоимостьДляВычисленияАмортизации = Строк.ДопСумма + Строк.СтоимостьДляВычисленияАмортизации;
		КонецЦикла;
	Иначе 
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасы = ВременнаяТаблицаЗапасы;
	КонецЕсли;
	
	// Торговая наценка в случае розницы (суммовой учет).
	Если ПеремещениеВРозницуСуммовойУчет
	 ИЛИ ВозвратИзРозницыСуммовойУчет Тогда
		
		СуммаСебестоимость = ВременнаяТаблицаЗапасы.Итог("Сумма");
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ВременнаяТаблицаСуммовойУчетВРознице.Сумма, 0)) КАК Сумма
		|ИЗ
		|	ВременнаяТаблицаСуммовойУчетВРознице КАК ВременнаяТаблицаСуммовойУчетВРознице";
		
		ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаРезультатаЗапроса.Следующий() Тогда
			СуммаВПродажныхЦенах = ВыборкаРезультатаЗапроса.Сумма;			
		Иначе
			СуммаВПродажныхЦенах = 0;
		КонецЕсли;
		
		СуммаНаценка = СуммаВПродажныхЦенах - СуммаСебестоимость;
		
		Если СуммаНаценка <> 0 Тогда
			
			Если ВременнаяТаблицаЗапасы.Количество() > 0 Тогда
				СтрокаТаблицы = ВременнаяТаблицаЗапасы[0];
			ИначеЕсли СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСуммовойУчетВРознице.Количество() > 0 Тогда
				СтрокаТаблицы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСуммовойУчетВРознице[0];
			Иначе
				СтрокаТаблицы = Неопределено;
			КонецЕсли;
			
			Если СтрокаТаблицы <> Неопределено Тогда
				СтрокаТаблицаУправленческий = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицаУправленческий, СтрокаТаблицы);
				СтрокаТаблицаУправленческий.СчетДт = ?(ПеремещениеВРозницуСуммовойУчет, СтрокаТаблицы.СчетУчетаВРозницеПолучатель, СтрокаТаблицы.СчетУчетаВРознице);
				СтрокаТаблицаУправленческий.СчетКт = ?(ПеремещениеВРозницуСуммовойУчет, СтрокаТаблицы.СчетУчетаНаценкиПолучатель, СтрокаТаблицы.СчетУчетаНаценки);
				СтрокаТаблицаУправленческий.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
				СтрокаТаблицаУправленческий.Содержание = НСтр("ka='სავაჭრო ფასნამატი';ru='Торговая наценка';en='trade margin'");
				СтрокаТаблицаУправленческий.Сумма = СуммаНаценка;
				
				СтрокаТаблицаХозрасчетный = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаХозрасчетный.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицаХозрасчетный, СтрокаТаблицы);
				СтрокаТаблицаХозрасчетный.СчетДт = ?(ПеремещениеВРозницуСуммовойУчет, СтрокаТаблицы.СчетУчетаВРозницеПолучательРегл, СтрокаТаблицы.СчетУчетаВРозницеРегл);
				СтрокаТаблицаХозрасчетный.СчетКт = ?(ПеремещениеВРозницуСуммовойУчет, СтрокаТаблицы.СчетУчетаНаценкиПолучательРегл, СтрокаТаблицы.СчетУчетаНаценкиРегл);
				СтрокаТаблицаХозрасчетный.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
				СтрокаТаблицаХозрасчетный.Содержание = НСтр("ka='სავაჭრო ფასნამატი';ru='Торговая наценка';en='trade margin'");
				СтрокаТаблицаХозрасчетный.Сумма = СуммаНаценка;
				
				СтрокаТаблицаХозрасчетный.СубконтоДт1 = СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница;
				СтрокаТаблицаХозрасчетный.СубконтоДт2 = СтрокаТаблицаЗапасы.КоррНоменклатура;
				СтрокаТаблицаХозрасчетный.СубконтоДт3 = СтрокаТаблицаЗапасы.КоррХарактеристика;
				СтрокаТаблицаХозрасчетный.СубконтоКт1 = СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
				СтрокаТаблицаХозрасчетный.СубконтоКт2 = СтрокаТаблицаЗапасы.Номенклатура;
				СтрокаТаблицаХозрасчетный.СубконтоКт3 = СтрокаТаблицаЗапасы.Характеристика;
				СтрокаТаблицаХозрасчетный.ВидСубконтоДт1 = "Склады";
				СтрокаТаблицаХозрасчетный.ВидСубконтоДт2 = "Номенклатура";
				СтрокаТаблицаХозрасчетный.ВидСубконтоДт3 = "ХарактеристикиНоменклатуры";
				СтрокаТаблицаХозрасчетный.ВидСубконтоКт1 = "Склады";
				СтрокаТаблицаХозрасчетный.ВидСубконтоКт2 = "Номенклатура";
				СтрокаТаблицаХозрасчетный.ВидСубконтоКт3 = "ХарактеристикиНоменклатуры";
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;		
	
КонецПроцедуры // СформироватьТаблицаЗапасов()

// Олег Литвиненко 20.01.23 --->
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыВВалюте(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства)
	
	//--------------------------------------------------------------------------
	// © Шишка В.В. [17 августа 2021]  НАЧАЛО
	УчетСебестоимостиВРазрезеОрганизации = СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетСебестоимостиВРазрезеОрганизации;
	УправлениеНебольшойФирмойСервер.ВыполнитьКорректировкуВременнойТаблицыЗапасыПоУчетуВРазрезеОрганизаций(СтруктураДополнительныеСвойства);	
	// © Шишка В.В. [17 августа 2021]  КОНЕЦ
	//--------------------------------------------------------------------------
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасы.НомерСтроки) КАК НомерСтроки,
	//Paganini_ONESOFT-2657_
	|	ТаблицаЗапасы.Получатель_Транзитный,	
	//_Paganini_ONESOFT-2657
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ТаблицаЗапасы.ВидОперации КАК ВидОперации,
	|	ТаблицаЗапасы.ВалютаЦеныПолучатель КАК ВалютаЦеныПолучатель,
	|	ТаблицаЗапасы.ТипСчетаЗатрат КАК ТипСчетаЗатрат,
	|	ТаблицаЗапасы.КоррНаправлениеДеятельности КАК КоррНаправлениеДеятельности,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.СценарийПланирования КАК СценарийПланирования,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|	ТаблицаЗапасы.КоррСчетУчета КАК КоррСчетУчета,
	|	ТаблицаЗапасы.СчетУчетаРегл КАК СчетУчетаРегл, //+++
	|	ТаблицаЗапасы.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл, //+++
	|	ТаблицаЗапасы.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл, //+++
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.КоррНоменклатура КАК КоррНоменклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.КоррХарактеристика КАК КоррХарактеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.КоррПартия КАК КоррПартия,
	//|	ТаблицаЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
	//|	ТаблицаЗапасы.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
	|	НЕОПРЕДЕЛЕНО КАК ДокументПродажи,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказПродажи,
	|	ТаблицаЗапасы.КоррСчетУчета КАК СчетДт,
	|	ТаблицаЗапасы.СчетУчета КАК СчетКт,
	|	ТаблицаЗапасы.КоррСчетУчетаРегл КАК СчетДтРегл,
	|	ТаблицаЗапасы.СчетУчетаРегл КАК СчетКтРегл,
	|	ТаблицаЗапасы.ПеремещениеВРозницу КАК ПеремещениеВРозницу,
	|	ТаблицаЗапасы.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
	|	ТаблицаЗапасы.ВозвратИзРозницыСуммовойУчет КАК ВозвратИзРозницыСуммовойУчет,
	|	ТаблицаЗапасы.СчетУчетаВРознице КАК СчетУчетаВРознице,
	|	ТаблицаЗапасы.СчетУчетаНаценки КАК СчетУчетаНаценки,
	|	ТаблицаЗапасы.СчетУчетаВРозницеПолучатель КАК СчетУчетаВРозницеПолучатель,
	|	ТаблицаЗапасы.СчетУчетаНаценкиПолучатель КАК СчетУчетаНаценкиПолучатель,
	|	ТаблицаЗапасы.СчетУчетаВРозницеРегл КАК СчетУчетаВРозницеРегл,
	|	ТаблицаЗапасы.СчетУчетаНаценкиРегл КАК СчетУчетаНаценкиРегл,
	|	ТаблицаЗапасы.СчетУчетаВРозницеПолучательРегл КАК СчетУчетаВРозницеПолучательРегл,
	|	ТаблицаЗапасы.СчетУчетаНаценкиПолучательРегл КАК СчетУчетаНаценкиПолучательРегл,
	|	ТаблицаЗапасы.СодержаниеПроводки КАК Содержание,
	|	ТаблицаЗапасы.СодержаниеПроводки КАК СодержаниеПроводки,
	|	ТаблицаЗапасы.Имущество КАК Имущество,
	|	ТаблицаЗапасы.ПодразделениеОС КАК ПодразделениеОС,
	|	ТаблицаЗапасы.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ТаблицаЗапасы.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ТаблицаЗапасы.СчетЗатрат КАК СчетЗатрат,
	|	ТаблицаЗапасы.ПрименитьВТекущемМесяце КАК ПрименитьВТекущемМесяце,
	|	ТаблицаЗапасы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	////ПодольскийАИ #УчетПроектов 05.10.2020 {
	//|	ТаблицаЗапасы.Проект КАК Проект,
	//|	ТаблицаЗапасы.КоррПроект КАК КоррПроект,
	////ПодольскийАИ #УчетПроектов 05.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаЗапасы.Проект
	|	КОНЕЦ КАК Проект,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.КоррПроект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаЗапасы.КоррПроект
	|	КОНЕЦ КАК КоррПроект,
	//Lazare_
	|	ТаблицаЗапасы.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ТаблицаЗапасы.СчетЗатратРегл КАК СчетЗатратРегл,
	|	НЕОПРЕДЕЛЕНО КАК ХозяйственнаяОперация, //+++ Дмгг
	|	ТаблицаЗапасы.Адрес КАК Адрес,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаЗапасы.ВозвратИзРозницыСуммовойУчет
	|				ТОГДА -ТаблицаЗапасы.Количество
	|			ИНАЧЕ ТаблицаЗапасы.Количество
	|		КОНЕЦ) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаЗапасы.ВозвратИзРозницыСуммовойУчет
	|				ТОГДА -ТаблицаЗапасы.Резерв
	|			ИНАЧЕ ТаблицаЗапасы.Резерв
	|		КОНЕЦ) КАК Резерв,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаЗапасы.ВозвратИзРозницыСуммовойУчет
	|				ТОГДА -ТаблицаЗапасы.Себестоимость
	|			ИНАЧЕ ТаблицаЗапасы.Сумма
	|		КОНЕЦ * КурсУпрВалюты.Кратность / КурсУпрВалюты.Курс) КАК СуммаВал,
	|	ЛОЖЬ КАК ФиксированнаяСтоимость
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы,
	|	втКурсУпрВалюты КАК КурсУпрВалюты
	|ГДЕ
	|	(НЕ ТаблицаЗапасы.ПеремещениеВРозницеСуммовойУчет)
	|	И КурсУпрВалюты.Курс > 0
	|	И КурсУпрВалюты.Кратность > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	//Paganini_ONESOFT-2657_
	|	ТаблицаЗапасы.Получатель_Транзитный,	
	//_Paganini_ONESOFT-2657
	|	ТаблицаЗапасы.ВидОперации,
	|	ТаблицаЗапасы.ВалютаЦеныПолучатель,
	|	ТаблицаЗапасы.ТипСчетаЗатрат,
	|	ТаблицаЗапасы.КоррНаправлениеДеятельности,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СценарийПланирования,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.КоррСтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.СчетУчетаВРозницеПолучатель,
	|	ТаблицаЗапасы.СчетУчетаРегл,
	|	ТаблицаЗапасы.СчетУчетаВРозницеПолучательРегл,
	|	ТаблицаЗапасы.КоррСчетУчета,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.КоррНоменклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.КоррХарактеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.КоррПартия,
	//|	ТаблицаЗапасы.ЗаказПокупателя,
	//|	ТаблицаЗапасы.КоррЗаказПокупателя,
	|	ТаблицаЗапасы.СодержаниеПроводки,
	|	ТаблицаЗапасы.СчетУчетаНаценкиПолучатель,
	|	ТаблицаЗапасы.СчетУчетаНаценкиПолучательРегл,
	|	ТаблицаЗапасы.СчетУчетаЗатратРегл, //+++
	|	ТаблицаЗапасы.ПеремещениеВРозницуСуммовойУчет,
	|	ТаблицаЗапасы.ПеремещениеВРозницу,
	|	ТаблицаЗапасы.ВозвратИзРозницыСуммовойУчет,
	|	ТаблицаЗапасы.СчетУчетаВРознице,
	|	ТаблицаЗапасы.СчетУчетаНаценки,
	|	ТаблицаЗапасы.КоррСчетУчета,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.СчетУчетаВРозницеРегл,
	|	ТаблицаЗапасы.СчетУчетаНаценкиРегл,
	|	ТаблицаЗапасы.КоррСчетУчетаРегл,
	|	ТаблицаЗапасы.СчетУчетаРегл,
	|	ТаблицаЗапасы.Имущество,
	|	ТаблицаЗапасы.ПодразделениеОС,
	|	ТаблицаЗапасы.СрокИспользованияДляВычисленияАмортизации,
	|	ТаблицаЗапасы.ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ТаблицаЗапасы.СчетЗатрат,
	|	ТаблицаЗапасы.НаправлениеДеятельности,
	//ПодольскийАИ #УчетПроектов 05.10.2020 {
	|	ТаблицаЗапасы.Проект,
	|	ТаблицаЗапасы.КоррПроект,
	//ПодольскийАИ #УчетПроектов 05.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаЗапасы.Проект
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.КоррПроект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаЗапасы.КоррПроект
	|	КОНЕЦ,
	//Lazare_
	|	ТаблицаЗапасы.СтоимостьДляВычисленияАмортизации,
	|	ТаблицаЗапасы.СчетЗатратРегл,
	|	ТаблицаЗапасы.Адрес,
	|	ТаблицаЗапасы.ПрименитьВТекущемМесяце,
	|	ТаблицаЗапасы.СодержаниеПроводки";
	
	РезультатЗапроса = Запрос.Выполнить();

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыВВалюте", РезультатЗапроса.Выгрузить());
	
	// Установка исключительной блокировки контролируемых остатков запасов.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|	ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|	ТаблицаЗапасы.СчетУчетаРегл КАК СчетУчетаРегл,
	//|	ТаблицаЗапасы.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия
	//|	ТаблицаЗапасы.ЗаказПокупателя КАК ЗаказПокупателя
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаЗапасы.Организация КАК Организация,
	|		ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|		ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|		ТаблицаЗапасы.СчетУчетаРегл КАК СчетУчетаРегл,
	//|		ТаблицаЗапасы.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	|		ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|		ТаблицаЗапасы.Характеристика КАК Характеристика,
	|		ТаблицаЗапасы.Партия КАК Партия
	//|		ТаблицаЗапасы.ЗаказПокупателя КАК ЗаказПокупателя
	|	ИЗ
	|		ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|	ГДЕ
	|		(НЕ ТаблицаЗапасы.ПеремещениеВРозницеСуммовойУчет)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаЗапасы.Организация,
	|		ТаблицаЗапасы.СтруктурнаяЕдиница,
	//|		ТаблицаЗапасы.СчетУчета,
	|		ТаблицаЗапасы.СчетУчетаРегл,
	//|		ТаблицаЗапасы.СчетУчетаЗатратРегл,
	|		ТаблицаЗапасы.Номенклатура,
	|		ТаблицаЗапасы.Характеристика,
	|		ТаблицаЗапасы.Партия
	//|		ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	ИЗ
	|		ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|	ГДЕ
	|		(НЕ ТаблицаЗапасы.ПеремещениеВРозницеСуммовойУчет)) КАК ТаблицаЗапасы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	//|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.СчетУчетаРегл,
	//|	ТаблицаЗапасы.СчетУчетаЗатратРегл,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия";
	//|	ТаблицаЗапасы.ЗаказПокупателя";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ЗапасыВВалюте");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;

	Для каждого КолонкаРезультатЗапроса из РезультатЗапроса.Колонки Цикл 
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	// Получение остатков запасов по стоимости.
	
	//Запрос.Текст =
	//+++ Дмгг
	//"ВЫБРАТЬ
	//|	ЗапасыОстатки.Организация КАК Организация,
	//|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	////|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	//|	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
	////|	ЗапасыОстатки.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	//|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	//|	ЗапасыОстатки.Характеристика КАК Характеристика,
	//|	ЗапасыОстатки.Партия КАК Партия,
	//|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	//|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	//|	СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		ЗапасыОстатки.Организация КАК Организация,
	//|		ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	////|		ЗапасыОстатки.СчетУчета КАК СчетУчета,
	//|		ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
	////|		ЗапасыОстатки.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	//|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
	//|		ЗапасыОстатки.Характеристика КАК Характеристика,
	//|		ЗапасыОстатки.Партия КАК Партия,
	//|		ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	//|		СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	//|		СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток
	//|	ИЗ
	//|		РегистрНакопления.Запасы.Остатки(
	//|				&МоментКонтроля,
	////|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	//|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	//|					(ВЫБРАТЬ
	//|						ТаблицаЗапасы.Организация,
	//|						ТаблицаЗапасы.СтруктурнаяЕдиница,
	////|						ТаблицаЗапасы.СчетУчета,
	//|						ТаблицаЗапасы.СчетУчетаРегл, //+++ Дмгг
	//|						ТаблицаЗапасы.Номенклатура,
	//|						ТаблицаЗапасы.Характеристика,
	//|						ТаблицаЗапасы.Партия,
	//|						ТаблицаЗапасы.ЗаказПокупателя
	//|					ИЗ
	//|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	//|					ГДЕ
	//|						ТаблицаЗапасы.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))) КАК ЗапасыОстатки
	//|	
	//|	СГРУППИРОВАТЬ ПО
	//|		ЗапасыОстатки.Организация,
	//|		ЗапасыОстатки.СтруктурнаяЕдиница,
	////|		ЗапасыОстатки.СчетУчета,
	//|		ЗапасыОстатки.СчетУчетаРегл,
	////|		ЗапасыОстатки.СчетУчетаЗатратРегл,
	//|		ЗапасыОстатки.Номенклатура,
	//|		ЗапасыОстатки.Характеристика,
	//|		ЗапасыОстатки.Партия,
	//|		ЗапасыОстатки.ЗаказПокупателя
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ЗапасыОстатки.Организация,
	//|		ЗапасыОстатки.СтруктурнаяЕдиница,
	////|		ЗапасыОстатки.СчетУчета,
	//|		ЗапасыОстатки.СчетУчетаРегл,
	////|		ЗапасыОстатки.СчетУчетаЗатратРегл,
	//|		ЗапасыОстатки.Номенклатура,
	//|		ЗапасыОстатки.Характеристика,
	//|		ЗапасыОстатки.Партия,
	//|		ЗапасыОстатки.ЗаказПокупателя,
	//|		СУММА(ЗапасыОстатки.КоличествоОстаток),
	//|		СУММА(ЗапасыОстатки.СуммаОстаток)
	//|	ИЗ
	//|		РегистрНакопления.Запасы.Остатки(
	//|				&МоментКонтроля,
	////|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	//|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	//|					(ВЫБРАТЬ
	//|						ТаблицаЗапасы.Организация,
	//|						ТаблицаЗапасы.СтруктурнаяЕдиница,
	////|						ТаблицаЗапасы.СчетУчета,
	//|						ТаблицаЗапасы.СчетУчетаРегл, //+++ Дмгг
	//|						ТаблицаЗапасы.Номенклатура,
	//|						ТаблицаЗапасы.Характеристика,
	//|						ТаблицаЗапасы.Партия,
	//|						ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	//|					ИЗ
	//|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы)) КАК ЗапасыОстатки
	//|	
	//|	СГРУППИРОВАТЬ ПО
	//|		ЗапасыОстатки.Организация,
	//|		ЗапасыОстатки.СтруктурнаяЕдиница,
	////|		ЗапасыОстатки.СчетУчета,
	//|		ЗапасыОстатки.СчетУчетаРегл,
	////|		ЗапасыОстатки.СчетУчетаЗатратРегл,
	//|		ЗапасыОстатки.Номенклатура,
	//|		ЗапасыОстатки.Характеристика,
	//|		ЗапасыОстатки.Партия,
	//|		ЗапасыОстатки.ЗаказПокупателя
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ДвиженияДокументаЗапасы.Организация,
	//|		ДвиженияДокументаЗапасы.СтруктурнаяЕдиница,
	////|		ДвиженияДокументаЗапасы.СчетУчета,
	//|		ДвиженияДокументаЗапасы.СчетУчетаРегл,
	////|		ДвиженияДокументаЗапасы.СчетУчетаЗатратРегл,
	//|		ДвиженияДокументаЗапасы.Номенклатура,
	//|		ДвиженияДокументаЗапасы.Характеристика,
	//|		ДвиженияДокументаЗапасы.Партия,
	//|		ДвиженияДокументаЗапасы.ЗаказПокупателя,
	//|		ВЫБОР
	//|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	//|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	//|		КОНЕЦ,
	//|		ВЫБОР
	//|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Сумма, 0)
	//|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Сумма, 0)
	//|		КОНЕЦ
	//|	ИЗ
	//|		РегистрНакопления.Запасы КАК ДвиженияДокументаЗапасы
	//|	ГДЕ
	//|		ДвиженияДокументаЗапасы.Регистратор = &Ссылка
	//|		И ДвиженияДокументаЗапасы.Период <= &ПериодКонтроля) КАК ЗапасыОстатки
	//|
	//|ГДЕ
	//|	ЗапасыОстатки.КоличествоОстаток > 0
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЗапасыОстатки.Организация,
	//|	ЗапасыОстатки.СтруктурнаяЕдиница,
	////|	ЗапасыОстатки.СчетУчета,
	//|	ЗапасыОстатки.СчетУчетаРегл,
	////|	ЗапасыОстатки.СчетУчетаЗатратРегл,
	//|	ЗапасыОстатки.Номенклатура,
	//|	ЗапасыОстатки.Характеристика,
	//|	ЗапасыОстатки.Партия,
	//|	ЗапасыОстатки.ЗаказПокупателя";
	
	//Малышев 2024-06-16 ONESOFT-3094 - запрос перенесен в эту процедуру  --)
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ЗапасыОстатки.Организация КАК Организация,
	//|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
	//|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	//|	ЗапасыОстатки.Характеристика КАК Характеристика,
	//|	ЗапасыОстатки.Партия КАК Партия,
	////|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	//|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	//|	СУММА(ЗапасыОстатки.СуммаВалОстаток) КАК СуммаВалОстаток
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		ЗапасыОбороты.Организация КАК Организация,
	//|		ЗапасыОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|		ЗапасыОбороты.СчетУчетаРегл КАК СчетУчетаРегл,
	//|		ЗапасыОбороты.Номенклатура КАК Номенклатура,
	//|		ЗапасыОбороты.Характеристика КАК Характеристика,
	//|		ЗапасыОбороты.Партия КАК Партия,
	////|		ЗапасыОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
	//|		СУММА(ЗапасыОбороты.КоличествоОборот) КАК КоличествоОстаток,
	//|		СУММА(ЗапасыОбороты.СуммаВалОборот) КАК СуммаВалОстаток
	//|	ИЗ
	//|		РегистрНакопления.ЗапасыВВалюте.Обороты(
	//|				,
	//|				&ПериодКонтроля,
	//|				Регистратор,
	////|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В
	//|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия) В
	//|					(ВЫБРАТЬ
	//|						ТаблицаЗапасы.Организация,
	//|						ТаблицаЗапасы.СтруктурнаяЕдиница,
	//|						ТаблицаЗапасы.СчетУчетаРегл,
	//|						ТаблицаЗапасы.Номенклатура,
	//|						ТаблицаЗапасы.Характеристика,
	//|						ТаблицаЗапасы.Партия
	////|						ТаблицаЗапасы.ЗаказПокупателя
	//|					ИЗ
	//|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	////|					ГДЕ
	////|						ТаблицаЗапасы.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	//|					)) КАК ЗапасыОбороты
	//|	ГДЕ
	//|		ЗапасыОбороты.Регистратор <> &Ссылка
	//|	
	//|	СГРУППИРОВАТЬ ПО
	//|		ЗапасыОбороты.Организация,
	//|		ЗапасыОбороты.СтруктурнаяЕдиница,
	//|		ЗапасыОбороты.СчетУчетаРегл,
	//|		ЗапасыОбороты.Номенклатура,
	//|		ЗапасыОбороты.Характеристика,
	//|		ЗапасыОбороты.Партия
	////|		ЗапасыОбороты.ЗаказПокупателя
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ЗапасыОбороты.Организация,
	//|		ЗапасыОбороты.СтруктурнаяЕдиница,
	//|		ЗапасыОбороты.СчетУчетаРегл,
	//|		ЗапасыОбороты.Номенклатура,
	//|		ЗапасыОбороты.Характеристика,
	//|		ЗапасыОбороты.Партия,
	////|		ЗапасыОбороты.ЗаказПокупателя,
	//|		СУММА(ЗапасыОбороты.КоличествоОборот),
	//|		СУММА(ЗапасыОбороты.СуммаВалОборот)
	//|	ИЗ
	//|		РегистрНакопления.ЗапасыВВалюте.Обороты(
	//|				,
	//|				&ПериодКонтроля,
	//|				Регистратор,
	////|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В
	//|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия) В
	//|					(ВЫБРАТЬ
	//|						ТаблицаЗапасы.Организация,
	//|						ТаблицаЗапасы.СтруктурнаяЕдиница,
	//|						ТаблицаЗапасы.СчетУчетаРегл,
	//|						ТаблицаЗапасы.Номенклатура,
	//|						ТаблицаЗапасы.Характеристика,
	//|						ТаблицаЗапасы.Партия
	////|						ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	//|					ИЗ
	//|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы)) КАК ЗапасыОбороты
	//|	ГДЕ
	//|		ЗапасыОбороты.Регистратор <> &Ссылка
	//|	
	//|	СГРУППИРОВАТЬ ПО
	//|		ЗапасыОбороты.Организация,
	//|		ЗапасыОбороты.СтруктурнаяЕдиница,
	//|		ЗапасыОбороты.СчетУчетаРегл,
	//|		ЗапасыОбороты.Номенклатура,
	//|		ЗапасыОбороты.Характеристика,
	//|		ЗапасыОбороты.Партия) КАК ЗапасыОстатки
	////|		ЗапасыОбороты.ЗаказПокупателя) КАК ЗапасыОстатки
	//|ГДЕ
	//|	ЗапасыОстатки.КоличествоОстаток > 0
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЗапасыОстатки.Организация,
	//|	ЗапасыОстатки.СтруктурнаяЕдиница,
	//|	ЗапасыОстатки.СчетУчетаРегл,
	//|	ЗапасыОстатки.Номенклатура,
	//|	ЗапасыОстатки.Характеристика,
	//|	ЗапасыОстатки.Партия";
	////|	ЗапасыОстатки.ЗаказПокупателя";
	////--- Дмгг
	//
	//Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеЗапасов);
	////Запрос.УстановитьПараметр("МоментКонтроля", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	//Запрос.УстановитьПараметр("МоментКонтроля", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Исключая));
	//Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	//
	//+++ Дмгг
	СписаниеНаОС = ДокументСсылкаПеремещениеЗапасов.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеТаваровНаОС;
	//Запрос.УстановитьПараметр("СписаниеНаОС", СписаниеНаОС);
	//--- Дмгг
	
	//РезультатЗапроса = Запрос.Выполнить();
	//ТаблицаЗапасыОстатки = РезультатЗапроса.Выгрузить();   
	ТаблицаЗапасыОстатки = УправлениеНебольшойФирмойСервер.ПолучитьОстаткиЗапасовПоСтоимостиПриПроведении(ДокументСсылкаПеремещениеЗапасов,СтруктураДополнительныеСвойства,,,,Истина).Выгрузить(); 
	//Малышев 2024-06-16 ONESOFT-3094 - запрос перенесен в эту процедуру  --)
	
	// Kuzmich, 11.01.2020, Подбор цены и себестоимости для отрицательных остатков
	Если Константы.ПодборЦеныДляОтрицательныхОстатков.Получить() Тогда
		
		//Малышев 2024-06-16 ONESOFT-3094 - перенес в отдельный модуль (--
		 УправлениеНебольшойФирмойСервер.ДополнитьТаблицуОстатков_ПодборЦеныДляОтрицательныхОстатков(ТаблицаЗапасыОстатки, СтруктураДополнительныеСвойства, ДокументСсылкаПеремещениеЗапасов, Ложь);	
				
	КонецЕсли;
	// Kuzmich, 11.01.2020, Подбор цены и себестоимости для отрицательных остатков
	//ТаблицаЗапасыОстатки.Индексы.Добавить("Организация,СтруктурнаяЕдиница,СчетУчета,СчетУчетаРегл,СчетУчетаЗатратРегл,Номенклатура,Характеристика,Партия,ЗаказПокупателя");
	//ТаблицаЗапасыОстатки.Индексы.Добавить("Организация,СтруктурнаяЕдиница,СчетУчетаРегл,Номенклатура,Характеристика,Партия,ЗаказПокупателя");
	ТаблицаЗапасыОстатки.Индексы.Добавить("Организация,СтруктурнаяЕдиница,СчетУчетаРегл,Номенклатура,Характеристика,Партия");
	
	ТаблицаЗапасыОстаткиПодРезерв = ТаблицаЗапасыОстатки.Скопировать();
	//Если СтруктураДополнительныеСвойства.РезервированиеБезСебестоимости Тогда 
	//	
	//	Запрос.Текст = ПолучитьТекстЗапросаБезФильтрЗаказов();
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	ТаблицаЗапасыОстаткиПодРезерв = РезультатЗапроса.Выгрузить();
	//	
	//	//ТаблицаЗапасыОстаткиПодРезерв.Свернуть("Организация,СтруктурнаяЕдиница,СчетУчета,СчетУчетаРегл,СчетУчетаЗатратРегл,Номенклатура,Характеристика,Партия","КоличествоОстаток,СуммаОстаток");
	//	ТаблицаЗапасыОстаткиПодРезерв.Свернуть("Организация,СтруктурнаяЕдиница,СчетУчетаРегл,Номенклатура,Характеристика,Партия","КоличествоОстаток,СуммаВалОстаток");
	//	
	//КонецЕсли;
	
	ВременнаяТаблицаЗапасы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыВВалюте.СкопироватьКолонки();
	ВременнаяТаблицаЗапасы2 = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыВВалюте.СкопироватьКолонки(); //+++ Дмгг
	
	ПустаяСтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
	ПустойСчетУчета = ПланыСчетов.Управленческий.ПустаяСсылка();
	ПустойСчетУчетаРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	ПустаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
	ПустаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	ПустаяПартия = Справочники.ПартииНоменклатуры.ПустаяСсылка();
    //ПустойЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();

	ПеремещениеВРозницуСуммовойУчет = Ложь;
	ВозвратИзРозницыСуммовойУчет = Ложь;	
	
	Отправитель_Транзитный	= Ложь;
	Получатель_Транзитный	= Ложь;	
	СчетТранзитногоСклада 	= Неопределено;
	Если ДокументСсылкаПеремещениеЗапасов.ЧерезТранзитныйСклад Тогда
		Получатель_Транзитный	= Истина;
		СчетаУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаРегл.ПолучитьПоследнее(ДокументСсылкаПеремещениеЗапасов.Дата, Новый Структура("Организация", ДокументСсылкаПеремещениеЗапасов.Организация));
		СчетТранзитногоСклада 	= СчетаУчетнойПолитики.СчетТранзитногоСклада;
		//Если НЕ ЗначениеЗаполнено(СчетТранзитногоСклада) Тогда
		//	Сообщить(НСТР("ka='აღრიცხვის პოლიტიკაში დოკუმენტის თარიღისთვის არ არის მითითებული ""ტრანზიტული საწყობის ანგარიში""';ru='В учетной политике не указанн ""Счет транзитного склада"" на дату документа.'"));
		//КонецЕсли;
		СчетТранзитногоСклада = ?(ЗначениеЗаполнено(СчетТранзитногоСклада), СчетТранзитногоСклада, УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСчета("Товары"));
	Иначе
		Если ЗначениеЗаполнено(ДокументСсылкаПеремещениеЗапасов) Тогда
			Отправитель_Транзитный	= Истина;
			СчетаУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаРегл.ПолучитьПоследнее(ДокументСсылкаПеремещениеЗапасов.Дата, Новый Структура("Организация", ДокументСсылкаПеремещениеЗапасов.Организация));
			СчетТранзитногоСклада 	= СчетаУчетнойПолитики.СчетТранзитногоСклада;
		КонецЕсли;
	КонецЕсли;
	//_Паганини
	
	Для н = 0 По СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыВВалюте.Количество() - 1 Цикл
		
		СтрокаТаблицаЗапасы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыВВалюте[н];
		//Paganini_ONESOFT-2657_
		Если ДокументСсылкаПеремещениеЗапасов.ЧерезТранзитныйСклад Тогда
			Получатель_Транзитный = СтрокаТаблицаЗапасы.Получатель_Транзитный;
		КонецЕсли;
		//_Paganini_ONESOFT-2657	
		
		Если СтрокаТаблицаЗапасы.ВозвратИзРозницыСуммовойУчет Тогда
			ВозвратИзРозницыСуммовойУчет = Истина;			
			
			СтрокаТаблицыРасход = ВременнаяТаблицаЗапасы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасход, СтрокаТаблицаЗапасы);
			СтрокаТаблицыРасход.СтруктурнаяЕдиница = СтрокаТаблицыРасход.КоррСтруктурнаяЕдиница;
			СтрокаТаблицыРасход.КоррСтруктурнаяЕдиница = Неопределено;
			СтрокаТаблицыРасход.КоррСчетУчета = Неопределено;
			СтрокаТаблицыРасход.КоррСчетУчетаРегл = Неопределено;
			СтрокаТаблицыРасход.КоррНоменклатура = Неопределено;
			СтрокаТаблицыРасход.КоррХарактеристика = Неопределено;
			СтрокаТаблицыРасход.КоррПартия = Неопределено;
			СтрокаТаблицыРасход.КоррЗаказПокупателя = Неопределено;
			СтрокаТаблицыРасход.ФиксированнаяСтоимость = Истина;

			Продолжить;
		КонецЕсли;
		
		//Малышев 2024-07-27 ((-
		СтруктураДляПоиска = УправлениеНебольшойФирмойСервер.ПолучитьСтруктуруДляПоиска(СтрокаТаблицаЗапасы, СтруктураДополнительныеСвойства);
		//СтруктураДляПоиска = Новый Структура;
		//СтруктураДляПоиска.Вставить("Организация", СтрокаТаблицаЗапасы.Организация);
		////--------------------------------------------------------------------------
		//// © Шишка В.В. [17 августа 2021]  НАЧАЛО
		////СтруктураДляПоиска.Вставить("СтруктурнаяЕдиница", СтрокаТаблицаЗапасы.СтруктурнаяЕдиница);
		//Если НЕ УчетСебестоимостиВРазрезеОрганизации Тогда
		//
		//	СтруктураДляПоиска.Вставить("СтруктурнаяЕдиница", СтрокаТаблицаЗапасы.СтруктурнаяЕдиница);
		//
		//КонецЕсли; 	
		//// © Шишка В.В. [17 августа 2021]  КОНЕЦ
		////--------------------------------------------------------------------------
		////СтруктураДляПоиска.Вставить("СчетУчета", СтрокаТаблицаЗапасы.СчетУчета);
		//СтруктураДляПоиска.Вставить("СчетУчетаРегл", СтрокаТаблицаЗапасы.СчетУчетаРегл);
		//СтруктураДляПоиска.Вставить("Номенклатура", СтрокаТаблицаЗапасы.Номенклатура);
		//СтруктураДляПоиска.Вставить("Характеристика", СтрокаТаблицаЗапасы.Характеристика);
		//СтруктураДляПоиска.Вставить("Партия", СтрокаТаблицаЗапасы.Партия);
		//Малышев 2024-07-27 --)
	
		//КоличествоТребуетсяРезерв = СтрокаТаблицаЗапасы.Резерв;
		// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
		Если Константы.ФункциональнаяОпцияРезервированиеЗапасов_new.Получить() Тогда
			КоличествоТребуетсяРезерв = 0;
		Иначе
			КоличествоТребуетсяРезерв = ?(ЗначениеЗаполнено(СтрокаТаблицаЗапасы.Резерв), СтрокаТаблицаЗапасы.Резерв, 0);
		КонецЕсли;
		// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
		КоличествоТребуетсяСвободныйОстаток = СтрокаТаблицаЗапасы.Количество;
		
		Если КоличествоТребуетсяРезерв > 0 Тогда
			
			КоличествоТребуетсяСвободныйОстаток = КоличествоТребуетсяСвободныйОстаток - КоличествоТребуетсяРезерв;
			
			//СтруктураДляПоиска.Вставить("ЗаказПокупателя", СтрокаТаблицаЗапасы.ЗаказПокупателя);  //+++ Дмгг
			МассивСтрокОстатков = Новый Массив;
				
			МассивСтрокОстатков = 	ТаблицаЗапасыОстаткиПодРезерв.НайтиСтроки(СтруктураДляПоиска);
			
			//МассивСтрокОстатков = ТаблицаЗапасыОстатки.НайтиСтроки(СтруктураДляПоиска); //+++ Дмгг
			//МассивСтрокОстатков = ТаблицаЗапасыОстаткиПодРезерв.НайтиСтроки(СтруктураДляПоиска);
			
			КоличествоОстаток = 0;
			СуммаВалОстаток = 0;
			
			Если МассивСтрокОстатков.Количество() > 0 Тогда
				КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток;
				СуммаВалОстаток = МассивСтрокОстатков[0].СуммаВалОстаток;
			КонецЕсли;
			
			Если КоличествоОстаток > 0 И КоличествоОстаток > КоличествоТребуетсяРезерв Тогда

				СуммаКСписанию = Окр(СуммаВалОстаток * КоличествоТребуетсяРезерв / КоличествоОстаток , 2, 1);

				МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоТребуетсяРезерв;
				МассивСтрокОстатков[0].СуммаВалОстаток = МассивСтрокОстатков[0].СуммаВалОстаток - СуммаКСписанию;

			ИначеЕсли КоличествоОстаток = КоличествоТребуетсяРезерв Тогда

				СуммаКСписанию = СуммаВалОстаток;

				МассивСтрокОстатков[0].КоличествоОстаток = 0;
				МассивСтрокОстатков[0].СуммаВалОстаток = 0;

			Иначе
				СуммаКСписанию = 0;	
			КонецЕсли;
			
			// Расход.
			СтрокаТаблицыРасход = ВременнаяТаблицаЗапасы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасход, СтрокаТаблицаЗапасы);
			
			СтрокаТаблицыРасход.СуммаВал = СуммаКСписанию;
			СтрокаТаблицыРасход.Количество = КоличествоТребуетсяРезерв;
			
			Если СтрокаТаблицаЗапасы.ТипСчетаЗатрат = Перечисления.ТипыСчетов.Расходы
			 ИЛИ СтрокаТаблицаЗапасы.ПеремещениеВРозницуСуммовойУчет Тогда
				
				СтрокаТаблицыРасход.КоррСтруктурнаяЕдиница = ПустаяСтруктурнаяЕдиница;
				СтрокаТаблицыРасход.КоррСчетУчета = ПустойСчетУчета;
				СтрокаТаблицыРасход.КоррСчетУчетаРегл = ПустойСчетУчетаРегл;
				СтрокаТаблицыРасход.КоррНоменклатура = ПустаяНоменклатура;
				СтрокаТаблицыРасход.КоррХарактеристика = ПустаяХарактеристика;
				СтрокаТаблицыРасход.КоррПартия = ПустаяПартия;
				//СтрокаТаблицыРасход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
				СтрокаТаблицыРасход.ДокументПродажи = ДокументСсылкаПеремещениеЗапасов;
				//СтрокаТаблицыРасход.ЗаказПродажи = СтрокаТаблицаЗапасы.ЗаказПокупателя;
				
			Иначе
				
				Если СтрокаТаблицаЗапасы.ТипСчетаЗатрат = Перечисления.ТипыСчетов.КосвенныеЗатраты
					ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяКосвенныйПоПроизводственнымЗатратам(СтрокаТаблицаЗапасы.СчетУчетаЗатратРегл) Тогда
					СтрокаТаблицыРасход.КоррНоменклатура = ПустаяНоменклатура;
					СтрокаТаблицыРасход.КоррХарактеристика = ПустаяХарактеристика;
					СтрокаТаблицыРасход.КоррПартия = ПустаяПартия;
				КонецЕсли;
				
			КонецЕсли;
			
			Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации Тогда
				
				СтрокаТаблицыРасход.КоррСтруктурнаяЕдиница = ПустаяСтруктурнаяЕдиница;
				СтрокаТаблицыРасход.КоррСчетУчета = ПустойСчетУчета;
				СтрокаТаблицыРасход.КоррСчетУчетаРегл = ПустойСчетУчетаРегл;
				СтрокаТаблицыРасход.КоррНоменклатура = ПустаяНоменклатура;
				СтрокаТаблицыРасход.КоррХарактеристика = ПустаяХарактеристика;
				СтрокаТаблицыРасход.КоррПартия = ПустаяПартия;
				//СтрокаТаблицыРасход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
				СтрокаТаблицыРасход.ФиксированнаяСтоимость = Истина;
				
			КонецЕсли;
			
			Если Окр(СуммаКСписанию, 2, 1) <> 0 ИЛИ КоличествоТребуетсяРезерв > 0 Тогда // Приход.
				
				СтрокаТаблицыПриход = ВременнаяТаблицаЗапасы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриход, СтрокаТаблицаЗапасы);
				
				СтрокаТаблицыПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
				
				СтрокаТаблицыПриход.Организация = СтрокаТаблицаЗапасы.Организация;
				СтрокаТаблицыПриход.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница;
				СтрокаТаблицыПриход.СчетУчета = СтрокаТаблицаЗапасы.КоррСчетУчета;
				СтрокаТаблицыПриход.СчетУчетаРегл = СтрокаТаблицаЗапасы.КоррСчетУчетаРегл;
				СтрокаТаблицыПриход.Номенклатура = СтрокаТаблицаЗапасы.КоррНоменклатура;
				СтрокаТаблицыПриход.Характеристика = СтрокаТаблицаЗапасы.КоррХарактеристика;
				СтрокаТаблицыПриход.Партия = СтрокаТаблицаЗапасы.КоррПартия;
				
				Если СтрокаТаблицаЗапасы.ТипСчетаЗатрат = Перечисления.ТипыСчетов.КосвенныеЗатраты
					ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяКосвенныйПоПроизводственнымЗатратам(СтрокаТаблицаЗапасы.СчетУчетаЗатратРегл) Тогда
					//СтрокаТаблицыПриход.ЗаказПокупателя = СтрокаТаблицаЗапасы.КоррЗаказПокупателя;
					СтрокаТаблицыПриход.Номенклатура = ПустаяНоменклатура;
					СтрокаТаблицыПриход.Характеристика = ПустаяХарактеристика;
					СтрокаТаблицыПриход.Партия = ПустаяПартия;
				КонецЕсли;
				
				СтрокаТаблицыПриход.КоррСтруктурнаяЕдиница = СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
				СтрокаТаблицыПриход.КоррСчетУчета = СтрокаТаблицаЗапасы.СчетУчета;
				СтрокаТаблицыПриход.КоррСчетУчетаРегл = СтрокаТаблицаЗапасы.СчетУчетаРегл;
				СтрокаТаблицыПриход.КоррНоменклатура = СтрокаТаблицаЗапасы.Номенклатура;
				СтрокаТаблицыПриход.КоррХарактеристика = СтрокаТаблицаЗапасы.Характеристика;
				СтрокаТаблицыПриход.КоррПартия = СтрокаТаблицаЗапасы.Партия;
				//СтрокаТаблицыПриход.КоррЗаказПокупателя = СтрокаТаблицаЗапасы.ЗаказПокупателя;
				
				СтрокаТаблицыПриход.СуммаВал = СуммаКСписанию;
				
				Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию
				 ИЛИ СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы Тогда
					СтрокаТаблицыПриход.Количество = 0;
				Иначе
					СтрокаТаблицыПриход.Количество = КоличествоТребуетсяРезерв;
				КонецЕсли;
				
				СтрокаТаблицыПриход.СчетУчета = СтрокаТаблицаЗапасы.КоррСчетУчета;
				СтрокаТаблицыПриход.СчетУчетаРегл = СтрокаТаблицаЗапасы.КоррСчетУчетаРегл;
				
				Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации Тогда
					
					СтрокаТаблицыПриход.КоррСтруктурнаяЕдиница = ПустаяСтруктурнаяЕдиница;
					СтрокаТаблицыПриход.КоррСчетУчета = ПустойСчетУчета;
					СтрокаТаблицыПриход.КоррСчетУчетаРегл = ПустойСчетУчетаРегл;
					СтрокаТаблицыПриход.КоррНоменклатура = ПустаяНоменклатура;
					СтрокаТаблицыПриход.КоррХарактеристика = ПустаяХарактеристика;
					СтрокаТаблицыПриход.КоррПартия = ПустаяПартия;
					//СтрокаТаблицыПриход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
					СтрокаТаблицыПриход.ФиксированнаяСтоимость = Истина;
					
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЕсли;
		
		Если КоличествоТребуетсяСвободныйОстаток > 0 Тогда
			
			//СтруктураДляПоиска.Вставить("ЗаказПокупателя", ПустойЗаказПокупателя);  //+++ Дмгг
			
			Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах") Тогда
				Если Получатель_Транзитный Тогда
				ИначеЕсли Отправитель_Транзитный И ЗначениеЗаполнено(ДокументСсылкаПеремещениеЗапасов.ДокументПеремещенияВТранзит) Тогда
					СтруктураДляПоиска.СчетУчетаРегл = СчетТранзитногоСклада;
				КонецЕсли;
			КонецЕсли;
			
			МассивСтрокОстатков = ТаблицаЗапасыОстаткиПодРезерв.НайтиСтроки(СтруктураДляПоиска);
			
			КоличествоОстаток = 0;
			СуммаВалОстаток = 0;
			
			Если МассивСтрокОстатков.Количество() > 0 Тогда
				//КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток;
				//СуммаОстаток = МассивСтрокОстатков[0].СуммаОстаток;
				КоличествоОстаток = 0;
				СуммаВалОстаток = 0;
				Для Каждого Элем Из МассивСтрокОстатков Цикл 
					КоличествоОстаток = КоличествоОстаток + Элем.КоличествоОстаток;
					СуммаВалОстаток = СуммаВалОстаток + Элем.СуммаВалОстаток;
				КонецЦикла;
			КонецЕсли;
			
			Если КоличествоОстаток > 0 И КоличествоОстаток > КоличествоТребуетсяСвободныйОстаток Тогда

				СуммаКСписанию = Окр(СуммаВалОстаток * КоличествоТребуетсяСвободныйОстаток / КоличествоОстаток , 2, 1);

				МассивСтрокОстатков[0].КоличествоОстаток = МассивСтрокОстатков[0].КоличествоОстаток - КоличествоТребуетсяСвободныйОстаток;
				МассивСтрокОстатков[0].СуммаВалОстаток = МассивСтрокОстатков[0].СуммаВалОстаток - СуммаКСписанию;

			ИначеЕсли КоличествоОстаток = КоличествоТребуетсяСвободныйОстаток Тогда

				СуммаКСписанию = СуммаВалОстаток;

				МассивСтрокОстатков[0].КоличествоОстаток = 0;
				МассивСтрокОстатков[0].СуммаВалОстаток = 0;

			Иначе
				СуммаКСписанию = 0;	
			КонецЕсли;
	
			// Расход.
			СтрокаТаблицыРасход = ВременнаяТаблицаЗапасы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыРасход, СтрокаТаблицаЗапасы);
			
			
			//Паганини_
			Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах") Тогда
				Если Получатель_Транзитный Тогда
					СтрокаТаблицыРасход.КоррСчетУчетаРегл 	= СчетТранзитногоСклада;
					СтрокаТаблицыРасход.СчетДтРегл 			= СчетТранзитногоСклада;
				ИначеЕсли Отправитель_Транзитный И ЗначениеЗаполнено(ДокументСсылкаПеремещениеЗапасов.ДокументПеремещенияВТранзит) Тогда
					СтрокаТаблицыРасход.СчетУчетаРегл 		= СчетТранзитногоСклада;
					СтрокаТаблицыРасход.СчетКтРегл 			= СчетТранзитногоСклада;
				КонецЕсли;
			КонецЕсли;
			//_Паганини
			
			СтрокаТаблицыРасход.СуммаВал = СуммаКСписанию;
			СтрокаТаблицыРасход.Количество = КоличествоТребуетсяСвободныйОстаток;
			//СтрокаТаблицыРасход.ЗаказПокупателя = ПустойЗаказПокупателя;
			
			Если СтрокаТаблицаЗапасы.ТипСчетаЗатрат = Перечисления.ТипыСчетов.Расходы
			 ИЛИ СтрокаТаблицаЗапасы.ПеремещениеВРозницуСуммовойУчет
			 ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяРасходным(СтрокаТаблицаЗапасы.СчетУчетаЗатратРегл) Тогда
				
				СтрокаТаблицыРасход.КоррСтруктурнаяЕдиница = ПустаяСтруктурнаяЕдиница;
				СтрокаТаблицыРасход.КоррСчетУчета = ПустойСчетУчета;
				СтрокаТаблицыРасход.КоррСчетУчетаРегл = ПустойСчетУчетаРегл;
				СтрокаТаблицыРасход.КоррНоменклатура = ПустаяНоменклатура;
				СтрокаТаблицыРасход.КоррХарактеристика = ПустаяХарактеристика;
				СтрокаТаблицыРасход.КоррПартия = ПустаяПартия;
				//СтрокаТаблицыРасход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
				СтрокаТаблицыРасход.ДокументПродажи = ДокументСсылкаПеремещениеЗапасов;
				//СтрокаТаблицыРасход.ЗаказПродажи = СтрокаТаблицаЗапасы.ЗаказПокупателя;
				
			Иначе
				
				Если СтрокаТаблицаЗапасы.ТипСчетаЗатрат = Перечисления.ТипыСчетов.КосвенныеЗатраты
					ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяКосвенныйПоПроизводственнымЗатратам(СтрокаТаблицаЗапасы.СчетУчетаЗатратРегл) Тогда
					СтрокаТаблицыРасход.КоррНоменклатура = ПустаяНоменклатура;
					СтрокаТаблицыРасход.КоррХарактеристика = ПустаяХарактеристика;
					СтрокаТаблицыРасход.КоррПартия = ПустаяПартия;
				КонецЕсли;
				
			КонецЕсли;
			
			Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации Тогда
				
				СтрокаТаблицыРасход.КоррСтруктурнаяЕдиница = ПустаяСтруктурнаяЕдиница;
				СтрокаТаблицыРасход.КоррСчетУчета = ПустойСчетУчета;
				СтрокаТаблицыРасход.КоррСчетУчетаРегл = ПустойСчетУчетаРегл;
				СтрокаТаблицыРасход.КоррНоменклатура = ПустаяНоменклатура;
				СтрокаТаблицыРасход.КоррХарактеристика = ПустаяХарактеристика;
				СтрокаТаблицыРасход.КоррПартия = ПустаяПартия;
				//СтрокаТаблицыРасход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
				СтрокаТаблицыРасход.ФиксированнаяСтоимость = Истина;
				
			КонецЕсли;
			
			Если Окр(СуммаКСписанию, 2, 1) <> 0 ИЛИ КоличествоТребуетсяСвободныйОстаток > 0 Тогда // Приход
				
				СтрокаТаблицыПриход = ВременнаяТаблицаЗапасы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриход, СтрокаТаблицаЗапасы);
				
				СтрокаТаблицыПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
				
				СтрокаТаблицыПриход.Организация = СтрокаТаблицаЗапасы.Организация;
				СтрокаТаблицыПриход.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница;
				СтрокаТаблицыПриход.СчетУчета = СтрокаТаблицаЗапасы.КоррСчетУчета;
				СтрокаТаблицыПриход.СчетУчетаРегл = СтрокаТаблицаЗапасы.КоррСчетУчетаРегл;
				
				//ПодольскийАИ #УчетПроектов 08.10.2020 {
				СтрокаТаблицыПриход.Проект = СтрокаТаблицаЗапасы.КоррПроект;
				//ПодольскийАИ #УчетПроектов 08.10.2020 }
				
				//Паганини_
				Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах") Тогда
					Если Получатель_Транзитный Тогда
						СтрокаТаблицыПриход.СчетУчетаРегл 	= СчетТранзитногоСклада;
					ИначеЕсли Отправитель_Транзитный И ЗначениеЗаполнено(ДокументСсылкаПеремещениеЗапасов.ДокументПеремещенияВТранзит) Тогда
						СтрокаТаблицыПриход.КоррСчетУчетаРегл 	= СчетТранзитногоСклада;
					КонецЕсли;
				КонецЕсли;
				//_Паганини
				//СтрокаТаблицыПриход.Номенклатура = СтрокаТаблицаЗапасы.КоррНоменклатура;
				СтрокаТаблицыПриход.Характеристика = СтрокаТаблицаЗапасы.КоррХарактеристика;
				СтрокаТаблицыПриход.Партия = СтрокаТаблицаЗапасы.КоррПартия;
				
				Если СтрокаТаблицаЗапасы.ТипСчетаЗатрат = Перечисления.ТипыСчетов.КосвенныеЗатраты
					ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяКосвенныйПоПроизводственнымЗатратам(СтрокаТаблицаЗапасы.СчетУчетаЗатратРегл) Тогда
					//СтрокаТаблицыПриход.ЗаказПокупателя = СтрокаТаблицаЗапасы.КоррЗаказПокупателя;
					//СтрокаТаблицыПриход.Номенклатура = ПустаяНоменклатура;
					//СтрокаТаблицыПриход.Характеристика = ПустаяХарактеристика;
					СтрокаТаблицыПриход.Партия = ПустаяПартия;
				КонецЕсли;
				
				СтрокаТаблицыПриход.КоррСтруктурнаяЕдиница = СтрокаТаблицаЗапасы.СтруктурнаяЕдиница;
				СтрокаТаблицыПриход.КоррСчетУчета = СтрокаТаблицаЗапасы.СчетУчета;
				СтрокаТаблицыПриход.КоррСчетУчетаРегл = СтрокаТаблицаЗапасы.СчетУчетаРегл;
				СтрокаТаблицыПриход.КоррНоменклатура = СтрокаТаблицаЗапасы.Номенклатура;
				СтрокаТаблицыПриход.КоррХарактеристика = СтрокаТаблицаЗапасы.Характеристика;
				СтрокаТаблицыПриход.КоррПартия = СтрокаТаблицаЗапасы.Партия;
				//СтрокаТаблицыПриход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
				
				//ПодольскийАИ #УчетПроектов 08.10.2020 {
				СтрокаТаблицыПриход.КоррПроект = СтрокаТаблицаЗапасы.Проект;
				//ПодольскийАИ #УчетПроектов 08.10.2020 }
				
				СтрокаТаблицыПриход.СуммаВал = СуммаКСписанию;
				
				Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию
				 ИЛИ СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы Тогда
					СтрокаТаблицыПриход.Количество = 0;
				Иначе
					СтрокаТаблицыПриход.Количество = КоличествоТребуетсяСвободныйОстаток;
				КонецЕсли;
				
				СтрокаТаблицыПриход.СчетУчета = СтрокаТаблицаЗапасы.КоррСчетУчета;
				СтрокаТаблицыПриход.СчетУчетаРегл = СтрокаТаблицаЗапасы.КоррСчетУчетаРегл;
				//Паганини_
				Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах") Тогда
					Если Получатель_Транзитный Тогда
						СтрокаТаблицыПриход.СчетУчетаРегл 	= СчетТранзитногоСклада;
					ИначеЕсли Отправитель_Транзитный И ЗначениеЗаполнено(ДокументСсылкаПеремещениеЗапасов.ДокументПеремещенияВТранзит) Тогда
						СтрокаТаблицыПриход.КоррСчетУчетаРегл 	= СчетТранзитногоСклада;
					КонецЕсли;
				КонецЕсли;
				//_Паганини
				
				Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации Тогда
					
					СтрокаТаблицыПриход.КоррСтруктурнаяЕдиница = ПустаяСтруктурнаяЕдиница;
					СтрокаТаблицыПриход.КоррСчетУчета = ПустойСчетУчета;
					СтрокаТаблицыПриход.КоррСчетУчетаРегл = ПустойСчетУчетаРегл;
					СтрокаТаблицыПриход.КоррНоменклатура = ПустаяНоменклатура;
					СтрокаТаблицыПриход.КоррХарактеристика = ПустаяХарактеристика;
					СтрокаТаблицыПриход.КоррПартия = ПустаяПартия;
					//СтрокаТаблицыПриход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
					СтрокаТаблицыПриход.ФиксированнаяСтоимость = Истина;
					
				КонецЕсли;
				
				Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации Тогда 
					
					СтруктураПоиска = Новый Структура;
					СтруктураПоиска.Вставить("Номенклатура", 		СтрокаТаблицаЗапасы.Номенклатура);
					СтруктураПоиска.Вставить("Характеристика", 		СтрокаТаблицаЗапасы.Характеристика);
					СтруктураПоиска.Вставить("Организация",			СтрокаТаблицаЗапасы.Организация);
					СтруктураПоиска.Вставить("СчетУчетаРегл",		СтрокаТаблицаЗапасы.СчетУчетаРегл); 
					СтруктураПоиска.Вставить("СтруктурнаяЕдиница",	СтрокаТаблицаЗапасы.СтруктурнаяЕдиница);
					
					МассивСтрокОстатков = Неопределено;
					МассивСтрокОстатков = 	ТаблицаЗапасыОстаткиПодРезерв.НайтиСтроки(СтруктураДляПоиска);
						
					СтрокаОстатков = Неопределено;
					
					//Для Каждого ЭлементОстатков Из МассивСтрокОстатков Цикл 
					//	Если ЗначениеЗаполнено(ЭлементОстатков.СчетУчетаЗатратРегл) Тогда 
					//		СтрокаОстатков = ЭлементОстатков;
					//		Прервать;
					//	КонецЕсли;
					//КонецЦикла;
					
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЕсли;
		
		// Если это передача в эксплуатацию, то передаем по нулевой стоимости, а саму стоимость относим
		// на затраты подразделения-получателя.
		Если СтрокаТаблицаЗапасы.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию Тогда
		   
		   // Нужно добавить тогда приход только по количеству с пустой корреспонденции,
		   // для корректного учета в количественном выражении.
		   СтрокаТаблицыПриход = ВременнаяТаблицаЗапасы.Добавить();
		   ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриход, СтрокаТаблицаЗапасы);
		   
		   СтрокаТаблицыПриход.СтруктурнаяЕдиница = СтрокаТаблицаЗапасы.КоррСтруктурнаяЕдиница;
		   
		   СтрокаТаблицыПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
		   
		   //СтрокаТаблицыПриход.ЗаказПокупателя = ПустойЗаказПокупателя;
		  		   
		   СтрокаТаблицыПриход.КоррСтруктурнаяЕдиница = ПустаяСтруктурнаяЕдиница;
		   СтрокаТаблицыПриход.КоррСчетУчета = ПустойСчетУчета;
		   СтрокаТаблицыПриход.КоррСчетУчетаРегл = ПустойСчетУчетаРегл;
		   СтрокаТаблицыПриход.КоррНоменклатура = ПустаяНоменклатура;
		   СтрокаТаблицыПриход.КоррХарактеристика = ПустаяХарактеристика;
		   СтрокаТаблицыПриход.КоррПартия = ПустаяПартия;
		   //СтрокаТаблицыПриход.КоррЗаказПокупателя = ПустойЗаказПокупателя;
		   
		   СтрокаТаблицыПриход.Сумма = 0;
		   СтрокаТаблицыПриход.ФиксированнаяСтоимость = Истина;
		   
		КонецЕсли;
			
	КонецЦикла;
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыВВалюте = ВременнаяТаблицаЗапасы;
	Если СписаниеНаОС Тогда 
		тзЗапасы = ВременнаяТаблицаЗапасы.Скопировать(Новый Структура("ВидДвижения", ВидДвиженияНакопления.Расход));
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыВВалюте = тзЗапасы;
	Иначе 
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыВВалюте = ВременнаяТаблицаЗапасы;
	КонецЕсли;
	
КонецПроцедуры // СформироватьТаблицаЗапасовВВалюте()// Олег Литвиненко <---

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ТаблицаЗапасы.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.Ячейка КАК Ячейка,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	//Малышев 2024-09-25 ONESOFT-3483 (--
	|	ТаблицаЗапасы.Проект как Проект,
	//|	ВЫБОР
	//|		КОГДА ТаблицаЗапасы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ТаблицаЗапасы.Проект
	//|	КОНЕЦ КАК Проект,
	//Малышев 2024-09-25 ONESOFT-3483 --)
	|	ТаблицаЗапасы.Количество КАК Количество,
	|	ТаблицаЗапасы.СрокГодности КАК СрокГодности
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	НЕ ТаблицаЗапасы.ОрдерныйСклад
	|	И НЕ ТаблицаЗапасы.ВозвратИзРозницыСуммовойУчет
	|	И НЕ ТаблицаЗапасы.ПеремещениеВРозницеСуммовойУчет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ТаблицаЗапасы.НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.КоррСтруктурнаяЕдиница,
	|	ТаблицаЗапасы.КоррЯчейка,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,             
	
	//Малышев 2024-09-25 ONESOFT-3483 (--
	|	ТаблицаЗапасы.КоррПроект,
	//|	ВЫБОР
	//|		КОГДА ТаблицаЗапасы.КоррПроект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ТаблицаЗапасы.КоррПроект
	//|	КОНЕЦ,
	//Малышев 2024-09-25 ONESOFT-3483 --)
	
	|	ТаблицаЗапасы.Количество,
	|	NULL
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.Период < ТаблицаЗапасы.ДатаОбновленияНаРелиз_1_2_1
	|	И НЕ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|	И НЕ ТаблицаЗапасы.ПеремещениеВРозницуСуммовойУчет
	|	И НЕ ТаблицаЗапасы.ПеремещениеВРозницеСуммовойУчет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ТаблицаЗапасы.НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.КоррСтруктурнаяЕдиница,
	|	ТаблицаЗапасы.КоррЯчейка,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия, 
	
	//Малышев 2024-09-25 ONESOFT-3483 (--
	|	ТаблицаЗапасы.КоррПроект,
	//|	ВЫБОР
	//|		КОГДА ТаблицаЗапасы.КоррПроект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	//|		ИНАЧЕ ТаблицаЗапасы.КоррПроект
	//|	КОНЕЦ,
	//Малышев 2024-09-25 ONESOFT-3483 --)
	
	|	ТаблицаЗапасы.Количество,
	|	ТаблицаЗапасы.СрокГодности
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	НЕ ТаблицаЗапасы.КоррОрдерныйСклад
	|	И ТаблицаЗапасы.Период >= ТаблицаЗапасы.ДатаОбновленияНаРелиз_1_2_1
	|	И НЕ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|	И НЕ ТаблицаЗапасы.ПеремещениеВРозницуСуммовойУчет
	|	И НЕ ТаблицаЗапасы.ПеремещениеВРозницеСуммовойУчет";
    		
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладах", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗапасыНаСкладах()

Процедура СформироватьТаблицаЗапасыВРазрезеГТД(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасыНаСкладах.НомерСтроки) КАК НомерСтроки
	|	,Выбор Когда ТаблицаЗапасыНаСкладах.ВидОперации = Значение(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации) Тогда ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) Иначе ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) Конец КАК ВидДвижения
	|	,ТаблицаЗапасыНаСкладах.Период КАК Период
	|	,ТаблицаЗапасыНаСкладах.Организация КАК Организация
	|	,ТаблицаЗапасыНаСкладах.Номенклатура КАК Номенклатура
	|	,ТаблицаЗапасыНаСкладах.Характеристика КАК Характеристика
	|	,ТаблицаЗапасыНаСкладах.Партия КАК Партия
	|	,ТаблицаЗапасыНаСкладах.НомерГТД КАК НомерГТД
	|	,ТаблицаЗапасыНаСкладах.СтранаПроисхождения КАК СтранаПроисхождения
	|	,СУММА(ТаблицаЗапасыНаСкладах.Количество) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасыНаСкладах
	|ГДЕ
	|	ТаблицаЗапасыНаСкладах.СтранаПроисхождения <> Значение(Справочник.СтраныМира.Россия)
	|	И ТаблицаЗапасыНаСкладах.СтранаПроисхождения <> Значение(Справочник.СтраныМира.ПустаяССылка)
	|	И ТаблицаЗапасыНаСкладах.НомерГТД <> Значение(Справочник.НомераГТД.ПустаяССылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Выбор Когда ТаблицаЗапасыНаСкладах.ВидОперации = Значение(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации) Тогда ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) Иначе ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) Конец
	|	,ТаблицаЗапасыНаСкладах.Период
	|	,ТаблицаЗапасыНаСкладах.Организация
	|	,ТаблицаЗапасыНаСкладах.Номенклатура
	|	,ТаблицаЗапасыНаСкладах.Характеристика
	|	,ТаблицаЗапасыНаСкладах.Партия
	|	,ТаблицаЗапасыНаСкладах.НомерГТД
	|	,ТаблицаЗапасыНаСкладах.СтранаПроисхождения";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыВРазрезеГТД", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыКРасходуСоСкладов(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗапасы.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	////ПодольскийАИ #УчетПроектов 05.10.2020 {
	//|	ТаблицаЗапасы.Проект КАК Проект,
	////ПодольскийАИ #УчетПроектов 05.10.2020 }
	//_Lazare
	|	ВЫБОР
	|		КОГДА ТаблицаЗапасы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаЗапасы.Проект
	|	КОНЕЦ КАК Проект,
	//Lazare_

	|	ТаблицаЗапасы.Количество КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.ОрдерныйСклад
	|	И (НЕ ТаблицаЗапасы.ПеремещениеВРозницеСуммовойУчет)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыКРасходуСоСкладов", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗапасыКРасходуСоСкладов()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыКПоступлениюНаСклады(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗапасы.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ТаблицаЗапасы.КоррСтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.Количество КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.КоррОрдерныйСклад = ИСТИНА
	|	И ((НЕ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы))
	|			ИЛИ (НЕ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию)))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаЗапасы.НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.КоррСтруктурнаяЕдиница,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.Период < ТаблицаЗапасы.ДатаОбновленияНаРелиз_1_2_1
	|	И ТаблицаЗапасы.КоррОрдерныйСклад = ИСТИНА
	|	И ((НЕ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы))
	|			ИЛИ (НЕ ТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию)))";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыКПоступлениюНаСклады", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗапасыКПоступлениюНаСклады()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходы(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства)
	
	СтруктураСчетовКурсРазниц = РегламентированныйУчетСервер.ПолучитьСтруктуруСчетовУчета(СтруктураДополнительныеСвойства.ДляПроведения.Организация, СтруктураДополнительныеСвойства.ДляПроведения.Дата);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	
	Если СтруктураСчетовКурсРазниц.Выбран() Тогда
	
		Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчетаРегл", СтруктураСчетовКурсРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность);
		Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчетаРегл", СтруктураСчетовКурсРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность);
		
	Иначе
	
		Запрос.УстановитьПараметр("ПоложительнаяКурсоваяРазницаСчетУчетаРегл", ПланыСчетов.Хозрасчетный.Вспомогательный);
		Запрос.УстановитьПараметр("ОтрицательнаяКурсоваяРазницаСчетУчетаРегл", ПланыСчетов.Хозрасчетный.Вспомогательный);

	КонецЕсли;
	
	//+++ Дмгг
	СписаниеНаОС = ДокументСсылкаПеремещениеЗапасов.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеТаваровНаОС;
	Запрос.УстановитьПараметр("СписаниеНаОС", СписаниеНаОС);
	//--- Дмгг
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Дата КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	//ПодольскийАИ #УчетПроектов 05.10.2020 {
	|	ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка) КАК Проект,
	//ПодольскийАИ #УчетПроектов 05.10.2020 }
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПоложительнаяКурсоваяРазницаСчетУчетаРегл
	|		ИНАЧЕ &ОтрицательнаяКурсоваяРазницаСчетУчетаРегл
	|	КОНЕЦ КАК СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА ТаблицаДокумента.Валюта
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Аналитика,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницСуммовойУчетВРознице КАК ТаблицаДокумента
	|ГДЕ
	|	НЕ &СписаниеНаОС";
		
	РезультатЗапроса = Запрос.Выполнить();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходы()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСуммовойУчетВРознице(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеЗапасов);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ПеремещениеВРозницу", НСтр("ka='საცალო ვაჭრობაში გადაადგილება';ru='Перемещение в розницу';en='Moving into retail'"));
	Запрос.УстановитьПараметр("ПеремещениеВРознице", НСтр("ka='საცალო ვაჭრობაში გადაადგილება';ru='Перемещение в рознице';en='Moving in retail'"));
	Запрос.УстановитьПараметр("ВозвратИзРозницы", НСтр("ka='საცალო გაყიდვიდან დაბრუნება';ru='Возврат из розницы';en='Return of retail'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Дата КАК Дата,
	|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.РозничныйВидЦен КАК РозничныйВидЦен,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.Характеристика КАК Характеристика,
	|	ТаблицаДокумента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаДокумента.Валюта КАК Валюта,
	|	ТаблицаДокумента.СчетУчета КАК СчетУчета,
	|	ТаблицаДокумента.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ТаблицаДокумента.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаДокумента.Сумма КАК Сумма,
	|	ТаблицаДокумента.СуммаВал КАК СуммаВал,
	|	ТаблицаДокумента.Сумма КАК СуммаДляОстатка,
	|	ТаблицаДокумента.СуммаВал КАК СуммаВалДляОстатка,
	|	ТаблицаДокумента.Себестоимость КАК Себестоимость,
	|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки
	|ПОМЕСТИТЬ ВременнаяТаблицаСуммовойУчетВРознице
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаДокумента.Период КАК Дата,
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|		ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|		ТаблицаДокумента.Организация КАК Организация,
	|		ВЫБОР
	|			КОГДА ТаблицаДокумента.ВозвратИзРозницыСуммовойУчет
	|				ТОГДА ТаблицаДокумента.РозничныйВидЦен
	|			ИНАЧЕ ТаблицаДокумента.РозничныйВидЦенПолучатель
	|		КОНЕЦ КАК РозничныйВидЦен,
	|		ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|		ТаблицаДокумента.Характеристика КАК Характеристика,
	|		ВЫБОР
	|			КОГДА ТаблицаДокумента.ВозвратИзРозницыСуммовойУчет
	|				ТОГДА ТаблицаДокумента.СтруктурнаяЕдиница
	|			ИНАЧЕ ТаблицаДокумента.КоррСтруктурнаяЕдиница
	|		КОНЕЦ КАК СтруктурнаяЕдиница,
	|		ВЫБОР
	|			КОГДА ТаблицаДокумента.ВозвратИзРозницыСуммовойУчет
	|				ТОГДА ТаблицаДокумента.ВалютаЦены
	|			ИНАЧЕ ТаблицаДокумента.ВалютаЦеныПолучатель
	|		КОНЕЦ КАК Валюта,
	|		ВЫБОР
	|			КОГДА ТаблицаДокумента.ВозвратИзРозницыСуммовойУчет
	|				ТОГДА ТаблицаДокумента.СчетУчетаВРознице
	|			ИНАЧЕ ТаблицаДокумента.СчетУчетаВРозницеПолучатель
	|		КОНЕЦ КАК СчетУчета,
	|		ВЫБОР
	|			КОГДА ТаблицаДокумента.ВозвратИзРозницыСуммовойУчет
	|				ТОГДА ТаблицаДокумента.СчетУчетаВРозницеРегл
	|			ИНАЧЕ ТаблицаДокумента.СчетУчетаВРозницеПолучательРегл
	|		КОНЕЦ КАК СчетУчетаРегл,
	|		ТаблицаДокумента.ЗаказПокупателя КАК ЗаказПокупателя,
	|		ВЫБОР
	|			КОГДА ТаблицаДокумента.ВозвратИзРозницыСуммовойУчет
	|				ТОГДА -(ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * ТаблицаДокумента.Количество * КурсыЦенВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыЦенВалюты.Кратность) / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения.Коэффициент, 1) КАК ЧИСЛО(15, 2)))
	|			ИНАЧЕ ВЫРАЗИТЬ(ЦеныНоменклатурыПолучательСрезПоследних.Цена * ТаблицаДокумента.Количество * КурсыЦенВалютыПолучатель.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыЦенВалютыПолучатель.Кратность) / ЕСТЬNULL(ЦеныНоменклатурыПолучательСрезПоследних.ЕдиницаИзмерения.Коэффициент, 1) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ КАК Сумма,
	|		ВЫБОР
	|			КОГДА ТаблицаДокумента.ВозвратИзРозницыСуммовойУчет
	|				ТОГДА -(ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * ТаблицаДокумента.Количество / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения.Коэффициент, 1) КАК ЧИСЛО(15, 2)))
	|			ИНАЧЕ ВЫРАЗИТЬ(ЦеныНоменклатурыПолучательСрезПоследних.Цена * ТаблицаДокумента.Количество / ЕСТЬNULL(ЦеныНоменклатурыПолучательСрезПоследних.ЕдиницаИзмерения.Коэффициент, 1) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ КАК СуммаВал,
	|		ВЫБОР
	|			КОГДА ТаблицаДокумента.ВозвратИзРозницыСуммовойУчет
	|				ТОГДА -(ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * ТаблицаДокумента.Количество * КурсыЦенВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыЦенВалюты.Кратность) / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения.Коэффициент, 1) КАК ЧИСЛО(15, 2)))
	|			ИНАЧЕ ВЫРАЗИТЬ(ЦеныНоменклатурыПолучательСрезПоследних.Цена * ТаблицаДокумента.Количество * КурсыЦенВалютыПолучатель.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыЦенВалютыПолучатель.Кратность) / ЕСТЬNULL(ЦеныНоменклатурыПолучательСрезПоследних.ЕдиницаИзмерения.Коэффициент, 1) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ КАК СуммДляОстатка,
	|		ВЫБОР
	|			КОГДА ТаблицаДокумента.ВозвратИзРозницыСуммовойУчет
	|				ТОГДА -(ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * ТаблицаДокумента.Количество / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения.Коэффициент, 1) КАК ЧИСЛО(15, 2)))
	|			ИНАЧЕ ВЫРАЗИТЬ(ЦеныНоменклатурыПолучательСрезПоследних.Цена * ТаблицаДокумента.Количество / ЕСТЬNULL(ЦеныНоменклатурыПолучательСрезПоследних.ЕдиницаИзмерения.Коэффициент, 1) КАК ЧИСЛО(15, 2))
	|		КОНЕЦ КАК СуммаВалДляОстатка,
	|		ВЫБОР
	|			КОГДА ТаблицаДокумента.ВозвратИзРозницыСуммовойУчет
	|				ТОГДА -ТаблицаДокумента.Себестоимость
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Себестоимость,
	|		ВЫБОР
	|			КОГДА ТаблицаДокумента.ВозвратИзРозницыСуммовойУчет
	|				ТОГДА &ВозвратИзРозницы
	|			ИНАЧЕ &ПеремещениеВРозницу
	|		КОНЕЦ КАК СодержаниеПроводки
	|	ИЗ
	|		ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|					&МоментВремени,
	|					(ВидЦен, Номенклатура, Характеристика) В
	|						(ВЫБРАТЬ
	|							ВременнаяТаблицаЗапасы.РозничныйВидЦенПолучатель,
	|							ВременнаяТаблицаЗапасы.Номенклатура,
	|							ВременнаяТаблицаЗапасы.Характеристика
	|						ИЗ
	|							ВременнаяТаблицаЗапасы)) КАК ЦеныНоменклатурыПолучательСрезПоследних
	|			ПО ТаблицаДокумента.Номенклатура = ЦеныНоменклатурыПолучательСрезПоследних.Номенклатура
	|				И ТаблицаДокумента.РозничныйВидЦенПолучатель = ЦеныНоменклатурыПолучательСрезПоследних.ВидЦен
	|				И ТаблицаДокумента.Характеристика = ЦеныНоменклатурыПолучательСрезПоследних.Характеристика
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|					&МоментВремени,
	|					(ВидЦен, Номенклатура, Характеристика) В
	|						(ВЫБРАТЬ
	|							ВременнаяТаблицаЗапасы.РозничныйВидЦен,
	|							ВременнаяТаблицаЗапасы.Номенклатура,
	|							ВременнаяТаблицаЗапасы.Характеристика
	|						ИЗ
	|							ВременнаяТаблицаЗапасы)) КАК ЦеныНоменклатурыСрезПоследних
	|			ПО ТаблицаДокумента.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|				И ТаблицаДокумента.РозничныйВидЦен = ЦеныНоменклатурыСрезПоследних.ВидЦен
	|				И ТаблицаДокумента.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|					&МоментВремени,
	|					Валюта В
	|						(ВЫБРАТЬ
	|							Константы.ВалютаУчета
	|						ИЗ
	|							Константы КАК Константы)) КАК КурсыУпрВалюты
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыЦенВалютыПолучатель
	|			ПО ТаблицаДокумента.ВалютаЦеныПолучатель = КурсыЦенВалютыПолучатель.Валюта
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыЦенВалюты
	|			ПО ТаблицаДокумента.ВалютаЦены = КурсыЦенВалюты.Валюта
	|	ГДЕ
	|		(ТаблицаДокумента.ПеремещениеВРозницуСуммовойУчет
	|				ИЛИ ТаблицаДокумента.ВозвратИзРозницыСуммовойУчет)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаДокумента.Период,
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|		ТаблицаДокумента.НомерСтроки,
	|		ТаблицаДокумента.Организация,
	|		ТаблицаДокумента.РозничныйВидЦен,
	|		ТаблицаДокумента.Номенклатура,
	|		ТаблицаДокумента.Характеристика,
	|		ТаблицаДокумента.СтруктурнаяЕдиница,
	|		ТаблицаДокумента.ВалютаЦены,
	|		ТаблицаДокумента.СчетУчетаВРознице,
	|		ТаблицаДокумента.СчетУчетаВРозницеРегл,
	|		ТаблицаДокумента.ЗаказПокупателя,
	|		СУММА(ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * ТаблицаДокумента.Количество * КурсыЦенВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыЦенВалюты.Кратность) / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения.Коэффициент, 1) КАК ЧИСЛО(15, 2))),
	|		СУММА(ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * ТаблицаДокумента.Количество / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения.Коэффициент, 1) КАК ЧИСЛО(15, 2))),
	|		-СУММА(ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * ТаблицаДокумента.Количество * КурсыЦенВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыЦенВалюты.Кратность) / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения.Коэффициент, 1) КАК ЧИСЛО(15, 2))),
	|		-СУММА(ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * ТаблицаДокумента.Количество / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения.Коэффициент, 1) КАК ЧИСЛО(15, 2))),
	|		ТаблицаДокумента.Себестоимость,
	|		&ПеремещениеВРознице
	|	ИЗ
	|		ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|					&МоментВремени,
	|					(ВидЦен, Номенклатура, Характеристика) В
	|						(ВЫБРАТЬ
	|							ВременнаяТаблицаЗапасы.РозничныйВидЦен,
	|							ВременнаяТаблицаЗапасы.Номенклатура,
	|							ВременнаяТаблицаЗапасы.Характеристика
	|						ИЗ
	|							ВременнаяТаблицаЗапасы)) КАК ЦеныНоменклатурыСрезПоследних
	|			ПО ТаблицаДокумента.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|				И ТаблицаДокумента.РозничныйВидЦен = ЦеныНоменклатурыСрезПоследних.ВидЦен
	|				И ТаблицаДокумента.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|					&МоментВремени,
	|					Валюта В
	|						(ВЫБРАТЬ
	|							Константы.ВалютаУчета
	|						ИЗ
	|							Константы КАК Константы)) КАК КурсыУпрВалюты
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыЦенВалюты
	|			ПО ТаблицаДокумента.ВалютаЦены = КурсыЦенВалюты.Валюта
	|	ГДЕ
	|		ТаблицаДокумента.ПеремещениеВРозницеСуммовойУчет
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаДокумента.Период,
	|		ТаблицаДокумента.НомерСтроки,
	|		ТаблицаДокумента.Организация,
	|		ТаблицаДокумента.РозничныйВидЦен,
	|		ТаблицаДокумента.Номенклатура,
	|		ТаблицаДокумента.Характеристика,
	|		ТаблицаДокумента.СтруктурнаяЕдиница,
	|		ТаблицаДокумента.ВалютаЦены,
	|		ТаблицаДокумента.СчетУчетаВРознице,
	|		ТаблицаДокумента.СчетУчетаВРозницеРегл,
	|		ТаблицаДокумента.ЗаказПокупателя,
	|		ТаблицаДокумента.Себестоимость
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаДокумента.Период,
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|		ТаблицаДокумента.НомерСтроки,
	|		ТаблицаДокумента.Организация,
	|		ТаблицаДокумента.РозничныйВидЦенПолучатель,
	|		ТаблицаДокумента.Номенклатура,
	|		ТаблицаДокумента.Характеристика,
	|		ТаблицаДокумента.КоррСтруктурнаяЕдиница,
	|		ТаблицаДокумента.ВалютаЦеныПолучатель,
	|		ТаблицаДокумента.СчетУчетаВРозницеПолучатель,
	|		ТаблицаДокумента.СчетУчетаВРозницеПолучательРегл,
	|		ТаблицаДокумента.ЗаказПокупателя,
	|		СУММА(ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * ТаблицаДокумента.Количество * КурсыЦенВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыЦенВалюты.Кратность) / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения.Коэффициент, 1) КАК ЧИСЛО(15, 2))),
	|		СУММА(ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * ТаблицаДокумента.Количество * КурсыЦенВалюты.Курс * КурсыЦенВалютыПолучатель.Кратность / (КурсыЦенВалютыПолучатель.Курс * КурсыЦенВалюты.Кратность) / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения.Коэффициент, 1) КАК ЧИСЛО(15, 2))),
	|		СУММА(ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * ТаблицаДокумента.Количество * КурсыЦенВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыЦенВалюты.Кратность) / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения.Коэффициент, 1) КАК ЧИСЛО(15, 2))),
	|		СУММА(ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * ТаблицаДокумента.Количество * КурсыЦенВалюты.Курс * КурсыЦенВалютыПолучатель.Кратность / (КурсыЦенВалютыПолучатель.Курс * КурсыЦенВалюты.Кратность) / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения.Коэффициент, 1) КАК ЧИСЛО(15, 2))),
	|		ТаблицаДокумента.Себестоимость,
	|		&ПеремещениеВРознице
	|	ИЗ
	|		ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|					&МоментВремени,
	|					(ВидЦен, Номенклатура, Характеристика) В
	|						(ВЫБРАТЬ
	|							ВременнаяТаблицаЗапасы.РозничныйВидЦен,
	|							ВременнаяТаблицаЗапасы.Номенклатура,
	|							ВременнаяТаблицаЗапасы.Характеристика
	|						ИЗ
	|							ВременнаяТаблицаЗапасы)) КАК ЦеныНоменклатурыСрезПоследних
	|			ПО ТаблицаДокумента.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|				И ТаблицаДокумента.РозничныйВидЦен = ЦеныНоменклатурыСрезПоследних.ВидЦен
	|				И ТаблицаДокумента.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|					&МоментВремени,
	|					Валюта В
	|						(ВЫБРАТЬ
	|							Константы.ВалютаУчета
	|						ИЗ
	|							Константы КАК Константы)) КАК КурсыУпрВалюты
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыЦенВалюты
	|			ПО ТаблицаДокумента.ВалютаЦены = КурсыЦенВалюты.Валюта
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыЦенВалютыПолучатель
	|			ПО ТаблицаДокумента.ВалютаЦеныПолучатель = КурсыЦенВалютыПолучатель.Валюта
	|	ГДЕ
	|		ТаблицаДокумента.ПеремещениеВРозницеСуммовойУчет
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаДокумента.Период,
	|		ТаблицаДокумента.НомерСтроки,
	|		ТаблицаДокумента.Организация,
	|		ТаблицаДокумента.РозничныйВидЦенПолучатель,
	|		ТаблицаДокумента.Номенклатура,
	|		ТаблицаДокумента.Характеристика,
	|		ТаблицаДокумента.КоррСтруктурнаяЕдиница,
	|		ТаблицаДокумента.ВалютаЦеныПолучатель,
	|		ТаблицаДокумента.СчетУчетаВРозницеПолучатель,
	|		ТаблицаДокумента.СчетУчетаВРозницеПолучательРегл,
	|		ТаблицаДокумента.ЗаказПокупателя,
	|		ТаблицаДокумента.Себестоимость) КАК ТаблицаДокумента
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	Валюта,
	|	СчетУчета,
	|	СчетУчетаРегл";
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков денежных средств.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаСуммовойУчетВРознице.Организация КАК Организация,
	|	ВременнаяТаблицаСуммовойУчетВРознице.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВременнаяТаблицаСуммовойУчетВРознице.Валюта КАК Валюта
	|ИЗ
	|	ВременнаяТаблицаСуммовойУчетВРознице КАК ВременнаяТаблицаСуммовойУчетВРознице";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.СуммовойУчетВРознице");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыСуммовойУчетВРознице(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыСуммовойУчетВРозницеРегл(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСуммовойУчетВРознице", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходы()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Дата КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СчетУчета
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|				И ТаблицаДокумента.СчетУчета.Валютный
	|			ТОГДА ТаблицаДокумента.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	|				И ТаблицаДокумента.СчетУчета.Валютный
	|			ТОГДА ТаблицаДокумента.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	0 КАК СуммаВалДт,
	|	0 КАК СуммаВалКт,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ КАК Сумма,
	|	&КурсоваяРазница КАК Содержание
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницСуммовойУчетВРознице КАК ТаблицаДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаУправленческий()

// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
Процедура СформироватьТаблицаРезервированиеЗапасов(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасы.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.ЗаказПокупателя КАК Документ,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаЗапасы.Проект ЕСТЬ NULL
	|							ИЛИ ТаблицаЗапасы.Проект = НЕОПРЕДЕЛЕНО
	|							ИЛИ ТаблицаЗапасы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|						ТОГДА ТаблицаЗапасы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|					ИНАЧЕ ТаблицаЗапасы.Проект
	|				КОНЕЦ
	|	КОНЕЦ КАК Проект,
	|	СУММА(ТаблицаЗапасы.Резерв) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы,
	|	Константы КАК Константы
	|ГДЕ
	|	Константы.ФункциональнаяОпцияРезервированиеЗапасов_new
	|	И ТаблицаЗапасы.Резерв > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.ЗаказПокупателя,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаЗапасы.Проект ЕСТЬ NULL
	|							ИЛИ ТаблицаЗапасы.Проект = НЕОПРЕДЕЛЕНО
	|							ИЛИ ТаблицаЗапасы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|						ТОГДА ТаблицаЗапасы.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|					ИНАЧЕ ТаблицаЗапасы.Проект
	|				КОНЕЦ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасы.НомерСтроки),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.КоррСтруктурнаяЕдиница,
	|	ТаблицаЗапасы.ЗаказПокупателя,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаЗапасы.КоррПроект ЕСТЬ NULL
	|							ИЛИ ТаблицаЗапасы.КоррПроект = НЕОПРЕДЕЛЕНО
	|							ИЛИ ТаблицаЗапасы.КоррПроект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|						ТОГДА ТаблицаЗапасы.КоррПроект = ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|					ИНАЧЕ ТаблицаЗапасы.КоррПроект
	|				КОНЕЦ
	|	КОНЕЦ,
	|	СУММА(ТаблицаЗапасы.Резерв)
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы,
	|	Константы КАК Константы
	|ГДЕ
	|	Константы.ФункциональнаяОпцияРезервированиеЗапасов_new
	|	И НЕ Константы.ОчиститьРезервПриПеремещенииЗапасов
	|	И ТаблицаЗапасы.Резерв > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.КоррСтруктурнаяЕдиница,
	|	ТаблицаЗапасы.ЗаказПокупателя,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаЗапасы.КоррПроект ЕСТЬ NULL
	|							ИЛИ ТаблицаЗапасы.КоррПроект = НЕОПРЕДЕЛЕНО
	|							ИЛИ ТаблицаЗапасы.КоррПроект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|						ТОГДА ТаблицаЗапасы.КоррПроект = ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|					ИНАЧЕ ТаблицаЗапасы.КоррПроект
	|				КОНЕЦ
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("УчетПоПроектам",  СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРезервированиеЗапасов", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
	//Paganini_ONESOFT-2657_
	|	ЛОЖЬ КАК Получатель_Транзитный,
	//_Paganini_ONESOFT-2657
	|	ПеремещениеЗапасовЗапасы.КлючСвязи КАК КлючСвязи,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ПеремещениеЗапасовЗапасы.Ссылка.Дата КАК Период,
	|	ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации КАК ВидОперации,
	|	ПеремещениеЗапасовЗапасы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы <> ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|				И ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПеремещениеВРозницуСуммовойУчет,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы <> ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|				И ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПеремещениеВРозницу,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|				И ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы <> ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВозвратИзРозницыСуммовойУчет,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|				И ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПеремещениеВРозницеСуммовойУчет,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаВРознице КАК СчетУчетаВРознице,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаНаценки КАК СчетУчетаНаценки,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаВРозницеРегл КАК СчетУчетаВРозницеРегл,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаНаценкиРегл КАК СчетУчетаНаценкиРегл,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.РозничныйВидЦен КАК РозничныйВидЦен,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.РозничныйВидЦен.ВалютаЦены КАК ВалютаЦены,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.СчетУчетаВРознице КАК СчетУчетаВРозницеПолучатель,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.СчетУчетаНаценки КАК СчетУчетаНаценкиПолучатель,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.СчетУчетаВРозницеРегл КАК СчетУчетаВРозницеПолучательРегл,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.СчетУчетаНаценкиРегл КАК СчетУчетаНаценкиПолучательРегл,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.РозничныйВидЦен КАК РозничныйВидЦенПолучатель,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.РозничныйВидЦен.ВалютаЦены КАК ВалютаЦеныПолучатель,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ОрдерныйСклад КАК ОрдерныйСклад,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ОрдерныйСклад КАК КоррОрдерныйСклад,
	//+++ Дмгг
	//|	ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатрат.ТипСчета КАК ТипСчетаЗатрат,
	|	ВЫБОР
	|		КОГДА &ИспользоватьТолькоРегламентированногоПланаСчетов
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл.ТипСчета
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатрат.ТипСчета
	|	КОНЕЦ КАК ТипСчетаЗатрат,
	//--- Дмгг
	|	ПеремещениеЗапасовЗапасы.Ссылка.НаправлениеДеятельности КАК КоррНаправлениеДеятельности,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	
		
	//ПодольскийАИ #УчетПроектов 05.10.2020 {
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)   //Малышев 2024-06-10 ONESOFT-3093 
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			      И ПеремещениеЗапасовЗапасы.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)  
	|			ТОГДА ПеремещениеЗапасовЗапасы.Проект
	|		КОГДА (ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|                ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию)
	|                ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеТаваровНаОС)
	|              ) 
	
	//|			    И ПеремещениеЗапасовЗапасы.ПроектОтправитель <> Значение(Справочник.Проекты.ПустаяСсылка)  
	//|			ТОГДА ПеремещениеЗапасовЗапасы.ПроектОтправитель
	|			    И ПеремещениеЗапасовЗапасы.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)  
	|			ТОГДА ПеремещениеЗапасовЗапасы.Проект
	
	|		КОГДА (ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|              ) 
	
	//Малышев 2024-06-24 ONESOFT-3275
	//|			    И ПеремещениеЗапасовЗапасы.ПроектОтправитель <> Значение(Справочник.Проекты.ПустаяСсылка)  
	//|			ТОГДА ПеремещениеЗапасовЗапасы.ПроектОтправитель
	|			    И ПеремещениеЗапасовЗапасы.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)  
	|			ТОГДА ПеремещениеЗапасовЗапасы.Проект
	//Малышев 2024-06-24 ONESOFT-3275
	
	|
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ КАК Проект,                                
	|
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)   //Малышев 2024-06-10 ONESOFT-3093 
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			      И ПеремещениеЗапасовЗапасы.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)  
	|			ТОГДА ПеремещениеЗапасовЗапасы.Проект
	|		КОГДА (ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|                ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию)
	|                ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеТаваровНаОС)
	|			   )	
	|			    И ПеремещениеЗапасовЗапасы.ПроектПолучатель <> Значение(Справочник.Проекты.ПустаяСсылка)  
	|          	ТОГДА ПеремещениеЗапасовЗапасы.ПроектПолучатель
	|		КОГДА (ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			   )	
	|			    И ПеремещениеЗапасовЗапасы.ПроектПолучатель <> Значение(Справочник.Проекты.ПустаяСсылка)  
	|          	ТОГДА ПеремещениеЗапасовЗапасы.ПроектПолучатель
	|		
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ КАК КоррПроект,
	//ПодольскийАИ #УчетПроектов 05.10.2020 }

	
	//|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|  ВЫБОР
	|	КОГДА ПеремещениеЗапасовЗапасы.ЗапасыСтруктурнаяЕдиницаОтправитель = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|		ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница
	|	ИНАЧЕ ПеремещениеЗапасовЗапасы.ЗапасыСтруктурнаяЕдиницаОтправитель
	|  КОНЕЦ КАК СтруктурнаяЕдиница,
	
	
	//|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель КАК КоррСтруктурнаяЕдиница,
	
	|  ВЫБОР
	|	КОГДА ПеремещениеЗапасовЗапасы.ЗапасыСтруктурнаяЕдиницаПолучатель = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|		ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель
	|	ИНАЧЕ ПеремещениеЗапасовЗапасы.ЗапасыСтруктурнаяЕдиницаПолучатель
	|  КОНЕЦ КАК КоррСтруктурнаяЕдиница,
	
	
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ПоложениеЯчейкиВПеремещенииЗапасов = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВШапке)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.Ячейка
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Ячейка
	|	КОНЕЦ КАК Ячейка,
	|	ПеремещениеЗапасовЗапасы.Ссылка.ЯчейкаПолучатель КАК КоррЯчейка,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	//|					ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|					ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат //Малышев 2024-06-12 
	|				ИНАЧЕ 
	|					ВЫБОР
	|						КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|							ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|						ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|					ИНАЧЕ ВЫБОР
	|                           КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|								ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|							КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|								ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|							ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатрат
	|	КОНЕЦ КАК КоррСчетУчета,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТранзитныйСклад
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаРегл
	|		КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	//|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл  //Малышев 2024-06-12
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл
	|	КОНЕЦ КАК СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТранзитныйСклад
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.СчетУчетаРегл
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл //Малышев 2024-06-12
	|					КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|					КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|					ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл
	|				КОНЕЦ
	|		ИНАЧЕ    
	//Малышев 2024-06-12 ONESOFT-3094
	//|			ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл
	|			ВЫБОР 
	|                КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл <> Значение(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|                    ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл
	|                ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл
	|           КОНЕЦ
	
	|	КОНЕЦ КАК КоррСчетУчетаРегл,
	
	//Малышев 2024-06-12 ONESOFT-3094 
	//|	ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл КАК СчетУчетаЗатратРегл,
	|	ВЫБОР 
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл <> Значение(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл 
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл 
	|	КОНЕЦ КАК СчетУчетаЗатратРегл,
	
	|	ПеремещениеЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	ПеремещениеЗапасовЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ПеремещениеЗапасовЗапасы.НомерГТД КАК НомерГТД,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	// Kuzmich, 08.05.2025, ONESOFT-4061, ONESOFT-3922
	|				ИЛИ (ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы) И 
	|						(ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство) 
	|						ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
	|						ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|					)
	|				)
	// Kuzmich, 08.05.2025, ONESOFT-4061, ONESOFT-3922
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК КоррНоменклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА ПеремещениеЗапасовЗапасы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	// Kuzmich, 08.05.2025, ONESOFT-4061, ONESOFT-3922
	|				ИЛИ (ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы) И 
	|						(ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство) 
	|						ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
	|						ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|					)
	|				)
	// Kuzmich, 08.05.2025, ONESOFT-4061, ONESOFT-3922
	|			ТОГДА ВЫБОР
	|					КОГДА &ИспользоватьХарактеристики
	|						ТОГДА ПеремещениеЗапасовЗапасы.Характеристика
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК КоррХарактеристика,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ПеремещениеЗапасовЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	// Kuzmich, 08.05.2025, ONESOFT-4061, ONESOFT-3922
	|				ИЛИ (ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы) И 
	|						(ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство) 
	|						ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
	|						ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|					)
	|				)
	// Kuzmich, 08.05.2025, ONESOFT-4061, ONESOFT-3922
	|			ТОГДА ВЫБОР
	|					КОГДА &ИспользоватьПартии
	|						ТОГДА ПеремещениеЗапасовЗапасы.Партия
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК КоррПартия,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	// Kuzmich, 08.05.2025, ONESOFT-4061, ONESOFT-3922
	|				ИЛИ (ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы) И 
	|						(ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство) 
	|						ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
	|						ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|					)
	|				)
	// Kuzmich, 08.05.2025, ONESOFT-4061, ONESOFT-3922
	|			ТОГДА ПеремещениеЗапасовЗапасы.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	// Kuzmich, 08.05.2025, ONESOFT-4061, ONESOFT-3922
	|				ИЛИ (ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы) И 
	|						(ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство) 
	|						ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
	|						ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|					)
	|				)
	// Kuzmich, 08.05.2025, ONESOFT-4061, ONESOFT-3922
	|			ТОГДА ПеремещениеЗапасовЗапасы.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК КоррЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Количество - ПеремещениеЗапасовЗапасы.КоличествоВДороге 
	|		ИНАЧЕ ВЫРАЗИТЬ((ПеремещениеЗапасовЗапасы.Количество - ПеремещениеЗапасовЗапасы.КоличествоВДороге) * ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения.Коэффициент - &СмещениеДляОкругления КАК ЧИСЛО(15,3))
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	// Kuzmich, 08.05.2025, ONESOFT-4061, ONESOFT-3922
	|				ИЛИ (ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы) И 
	|						(ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство) 
	|						ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
	|						ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|					)
	|				)
	// Kuzmich, 08.05.2025, ONESOFT-4061, ONESOFT-3922
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Резерв
	|					ИНАЧЕ ВЫРАЗИТЬ(ПеремещениеЗапасовЗапасы.Резерв * ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения.Коэффициент - &СмещениеДляОкругления КАК ЧИСЛО(15,3))
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Резерв,
	|	0 КАК Сумма,
	|	ПеремещениеЗапасовЗапасы.Сумма КАК Себестоимость,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов  //Малышев
	|					КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|								ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|							ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатрат
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|					ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат //Малышев 
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|							ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|						ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТранзитныйСклад
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаРегл
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл //Малышев 
	|					КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|								ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|							ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл
	|	КОНЕЦ КАК СчетДтРегл,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТранзитныйСклад
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.СчетУчетаРегл
	|		КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|					ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|							ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|						ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетКтРегл,
	|	&ПеремещениеЗапасов КАК Содержание,
	|	&ПеремещениеЗапасов КАК СодержаниеПроводки,
	|	ПеремещениеЗапасовЗапасы.Сумма КАК СуммаВозвратВал,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ПеремещениеЗапасовЗапасы.КоличествоВДороге
	|		ИНАЧЕ ВЫРАЗИТЬ(ПеремещениеЗапасовЗапасы.КоличествоВДороге * ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения.Коэффициент - &СмещениеДляОкругления КАК ЧИСЛО(15,3))  
	|	КОНЕЦ КАК КоличествоВДороге,
	|	ВЫРАЗИТЬ(ПеремещениеЗапасовЗапасы.Ссылка.ДокументОснование КАК Документ.ВнутреннийЗаказ) КАК ЗаказНаПеремещения,
	|	ПеремещениеЗапасовЗапасы.Ссылка.ДатаПеремещенияИзТранзита КАК ДатаПеремещенияИзТранзита,
	|	ПеремещениеЗапасовЗапасы.ВнеоборотныйАктив КАК Имущество,
	|	ЛОЖЬ КАК ПрименитьВТекущемМесяце,
	|	ВложенныйЗапрос.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ВложенныйЗапрос.СтруктурнаяЕдиница КАК ПодразделениеОС,
	|	ВложенныйЗапрос.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ВложенныйЗапрос.СчетЗатрат КАК СчетЗатрат,
	|	ВложенныйЗапрос.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВложенныйЗапрос.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ВложенныйЗапрос.СчетЗатратРегл КАК СчетЗатратРегл,
	|	ВложенныйЗапрос.Адрес КАК Адрес,
	|	&ДатаОбновленияНаРелиз_1_2_1 КАК ДатаОбновленияНаРелиз_1_2_1,
	//Mira. lazare 02.09.2022
	//|   ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
	
	|  ВЫБОР
	|	КОГДА ПеремещениеЗапасовЗапасы.ЗапасыСтруктурнаяЕдиницаПолучатель = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|		ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель
	|	ИНАЧЕ ПеремещениеЗапасовЗапасы.ЗапасыСтруктурнаяЕдиницаПолучатель
	|  КОНЕЦ КАК СтруктурнаяЕдиницаПолучатель,
	
    |   ПеремещениеЗапасовЗапасы.Ссылка.ДокументОснование КАК ДокументОснование,
	//Mira. lazare 02.09.2022	

	//Малышев 2024-11-19 ONESOFT-3602 ((-
	|  	НЕОПРЕДЕЛЕНО как ДокументПоступления, 
	//Малышев 2024-11-19 ONESOFT-3602 --)

	|   ПеремещениеЗапасовЗапасы.СрокГодности КАК СрокГодности

	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатрат КАК СчетЗатрат,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатратРегл КАК СчетЗатратРегл,
	|			ВЫРАЗИТЬ(ПараметрыВнеоборотныхАктивовСрезПоследних.Адрес КАК СТРОКА(250)) КАК Адрес
	|		ИЗ
	|			РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(&ДатаДокумента, Регистратор <> &Ссылка) КАК ПараметрыВнеоборотныхАктивовСрезПоследних) КАК ВложенныйЗапрос
	|		ПО ПеремещениеЗапасовЗапасы.ВнеоборотныйАктив = ВложенныйЗапрос.ВнеоборотныйАктив
	|ГДЕ
	|	ПеремещениеЗапасовЗапасы.Ссылка = &Ссылка
	|	И ПеремещениеЗапасовЗапасы.Количество - ПеремещениеЗапасовЗапасы.КоличествоВДороге <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеЗапасовЗапасы.НомерСтроки,
	//Paganini_ONESOFT-2657_
	|	ИСТИНА КАК Получатель_Транзитный,
	//_Paganini_ONESOFT-2657
	|	ПеремещениеЗапасовЗапасы.КлючСвязи,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ПеремещениеЗапасовЗапасы.Ссылка.Дата,
	|	ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации,
	|	ПеремещениеЗапасовЗапасы.Номенклатура.ТипНоменклатуры,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы <> ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|				И ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы <> ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|				И ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|				И ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы <> ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|				И ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаВРознице,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаНаценки,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаВРозницеРегл,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаНаценкиРегл,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.РозничныйВидЦен,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.РозничныйВидЦен.ВалютаЦены,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.СчетУчетаВРознице,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.СчетУчетаНаценки,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.СчетУчетаВРозницеРегл,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.СчетУчетаНаценкиРегл,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.РозничныйВидЦен,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.РозничныйВидЦен.ВалютаЦены,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ОрдерныйСклад,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ОрдерныйСклад,
	|	ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатрат.ТипСчета,
	|	ПеремещениеЗапасовЗапасы.Ссылка.НаправлениеДеятельности,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	//ПодольскийАИ #УчетПроектов 05.10.2020 {
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка) //Малышев 2024-06-26
	|		КОГДА &УчетПоПроектам И ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Проект
	|		КОГДА &УчетПоПроектам И ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	
	//Малышев 2024-06-24 ONESOFT-3275
	//|			ТОГДА ПеремещениеЗапасовЗапасы.ПроектОтправитель
	|			ТОГДА ПеремещениеЗапасовЗапасы.Проект
	//Малышев 2024-06-24 ONESOFT-3275
	
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка) //Малышев 2024-06-26
	|		КОГДА &УчетПоПроектам И ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Проект
	|		КОГДА &УчетПоПроектам И ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|			ТОГДА ПеремещениеЗапасовЗапасы.ПроектПолучатель
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ,
	//ПодольскийАИ #УчетПроектов 05.10.2020 }
	//|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница,
	
	|  ВЫБОР
	|	КОГДА ПеремещениеЗапасовЗапасы.ЗапасыСтруктурнаяЕдиницаОтправитель = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|		ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница
	|	ИНАЧЕ ПеремещениеЗапасовЗапасы.ЗапасыСтруктурнаяЕдиницаОтправитель
	|  КОНЕЦ,
	
	|	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ПоложениеЯчейкиВПеремещенииЗапасов = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВШапке)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.Ячейка
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Ячейка
	|	КОНЕЦ,
	|	ПеремещениеЗапасовЗапасы.Ссылка.ЯчейкаПолучатель,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|					ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|							ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|						ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|								ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|							ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатрат
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТранзитныйСклад
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаРегл
	|		КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|					ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|							ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|						ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТранзитныйСклад
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.СчетУчетаРегл
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|								ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|							ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ  
	//Малышев 2024-06-12 ONESOFT-3094
    //			|ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл
	|			ВЫБОР 
	|				КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл <> Значение(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|					ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл
	|				ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл
	|			КОНЕЦ	
	|	КОНЕЦ,

	//Малышев 2024-06-12 ONESOFT-3094
	//|	ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл,
	|	ВЫБОР 
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл <> Значение(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|  	  		ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл	
	|	КОНЕЦ, 		
	
	|	ПеремещениеЗапасовЗапасы.Номенклатура,
	|	ПеремещениеЗапасовЗапасы.СтранаПроисхождения,
	|	ПеремещениеЗапасовЗапасы.НомерГТД,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА ПеремещениеЗапасовЗапасы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА &ИспользоватьХарактеристики
	|						ТОГДА ПеремещениеЗапасовЗапасы.Характеристика
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ПеремещениеЗапасовЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА &ИспользоватьПартии
	|						ТОГДА ПеремещениеЗапасовЗапасы.Партия
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			ТОГДА ПеремещениеЗапасовЗапасы.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			ТОГДА ПеремещениеЗапасовЗапасы.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ПеремещениеЗапасовЗапасы.КоличествоВДороге
	|		ИНАЧЕ ВЫРАЗИТЬ(ПеремещениеЗапасовЗапасы.КоличествоВДороге * ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения.Коэффициент - &СмещениеДляОкругления КАК ЧИСЛО(15,3))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Резерв
	|					ИНАЧЕ ВЫРАЗИТЬ(ПеремещениеЗапасовЗапасы.Резерв * ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения.Коэффициент - &СмещениеДляОкругления КАК ЧИСЛО(15,3))
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	ПеремещениеЗапасовЗапасы.Сумма,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|								ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|							ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатрат
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|					ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|							ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасов
	|						ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатрат
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТранзитныйСклад
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.СчетУчетаРегл
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.Перемещение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|			ТОГДА ВЫБОР
	|					КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|							ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|						ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|									ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|								ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|							ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 
	
	//Малышев 2024-06-12 ONESOFT-3094
	//|			ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл
	|			ВЫБОР
	|                КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл <> Значение(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	| 					ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СчетЗатратРегл
	| 				 ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл	
	|           КОНЕЦ
	
	
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТранзитныйСклад
	|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.СчетУчетаРегл
	|		КОГДА ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ОтветственноеХранение)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварыНаКомиссии)
	|				ИЛИ ПеремещениеЗапасовЗапасы.Партия.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ДавальческоеСырье)
	|			ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации)
	|					ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
	|								ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаКонечныйПолучатель.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет)
	|							ТОГДА ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗапасовРегл
	|						ИНАЧЕ ПеремещениеЗапасовЗапасы.Номенклатура.СчетУчетаЗатратРегл
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	&ПеремещениеЗапасов,
	|	&ПеремещениеЗапасов,
	|	ПеремещениеЗапасовЗапасы.Сумма,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ПеремещениеЗапасовЗапасы.КоличествоВДороге
	|		ИНАЧЕ ВЫРАЗИТЬ(ПеремещениеЗапасовЗапасы.КоличествоВДороге * ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения.Коэффициент - &СмещениеДляОкругления КАК ЧИСЛО(15,3))
	|	КОНЕЦ,
	|	ВЫРАЗИТЬ(ПеремещениеЗапасовЗапасы.Ссылка.ДокументОснование КАК Документ.ВнутреннийЗаказ),
	|	ПеремещениеЗапасовЗапасы.Ссылка.ДатаПеремещенияИзТранзита,
	|	ПеремещениеЗапасовЗапасы.ВнеоборотныйАктив,
	|	ЛОЖЬ,
	|	ВложенныйЗапрос.СрокИспользованияДляВычисленияАмортизации,
	|	ВложенныйЗапрос.СтруктурнаяЕдиница,
	|	ВложенныйЗапрос.ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ВложенныйЗапрос.СчетЗатрат,
	|	ВложенныйЗапрос.НаправлениеДеятельности,
	|	ISNULL(ВложенныйЗапрос.СтоимостьДляВычисленияАмортизации, 0) как СтоимостьДляВычисленияАмортизации, //Малышев 2024-06-24 ONESOFT-3275
	|	ВложенныйЗапрос.СчетЗатратРегл,
	|	ВложенныйЗапрос.Адрес,
	|	&ДатаОбновленияНаРелиз_1_2_1,
	//Mira. lazare 02.09.2022
	//| 	ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель,
	
	|  ВЫБОР
	|	КОГДА ПеремещениеЗапасовЗапасы.ЗапасыСтруктурнаяЕдиницаПолучатель = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|		ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель
	|	ИНАЧЕ ПеремещениеЗапасовЗапасы.ЗапасыСтруктурнаяЕдиницаПолучатель
	|  КОНЕЦ,

    |   ПеремещениеЗапасовЗапасы.Ссылка.ДокументОснование,
	|   НЕОПРЕДЕЛЕНО, //Малышев 2024-11-19 ONESOFT-3602
	//Mira. lazare 02.09.2022
	|   ПеремещениеЗапасовЗапасы.СрокГодности КАК СрокГодности

	|ИЗ
	|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатрат КАК СчетЗатрат,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|			ПараметрыВнеоборотныхАктивовСрезПоследних.СчетЗатратРегл КАК СчетЗатратРегл,
	|			ВЫРАЗИТЬ(ПараметрыВнеоборотныхАктивовСрезПоследних.Адрес КАК СТРОКА(250)) КАК Адрес
	|		ИЗ
	|			РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(&ДатаДокумента, Регистратор <> &Ссылка) КАК ПараметрыВнеоборотныхАктивовСрезПоследних) КАК ВложенныйЗапрос
	|		ПО ПеремещениеЗапасовЗапасы.ВнеоборотныйАктив = ВложенныйЗапрос.ВнеоборотныйАктив
	|ГДЕ
	|	ПеремещениеЗапасовЗапасы.Ссылка = &Ссылка
	|	И ПеремещениеЗапасовЗапасы.КоличествоВДороге <> 0
	|;
	|
	// Олег Литвиненко 20.01.23 --->
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетнаяПолитикаРеглСрезПоследних.ВалютаУправленческая КАК ВалютаУправленческая,
	|	УчетнаяПолитикаРеглСрезПоследних.ДатаНачалаУчетаПоУпрВалюте КАК ДатаНачалаУчетаПоУпрВалюте
	|ПОМЕСТИТЬ втУчетнаяПолитика
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаРегл.СрезПоследних(&ДатаДокумента, Организация = &Организация) КАК УчетнаяПолитикаРеглСрезПоследних
	|ГДЕ
	|	УчетнаяПолитикаРеглСрезПоследних.ВестиУчетВУпрВалюте
	|	И УчетнаяПолитикаРеглСрезПоследних.ДатаНачалаУчетаПоУпрВалюте <= &ДатаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КурсыВалютСрезПоследних.Курс = 0
	|			ТОГДА 1	
	|		ИНАЧЕ КурсыВалютСрезПоследних.Курс
	|	КОНЕЦ КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ПОМЕСТИТЬ втКурсУпрВалюты
	|ИЗ
	|	втУчетнаяПолитика КАК втУчетнаяПолитика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК КурсыВалютСрезПоследних
	|		ПО втУчетнаяПолитика.ВалютаУправленческая = КурсыВалютСрезПоследних.Валюта
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втУчетнаяПолитика
	|;
	// Олег Литвиненко <---
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПеремещениеЗапасовСерийныеНомера.КлючСвязи,
	|	ПеремещениеЗапасовСерийныеНомера.СерийныйНомер
	|ПОМЕСТИТЬ ВременнаяТаблицаСерийныеНомера
	|ИЗ
	|	Документ.ПеремещениеЗапасов.СерийныеНомера КАК ПеремещениеЗапасовСерийныеНомера
	|ГДЕ
	|	ПеремещениеЗапасовСерийныеНомера.Ссылка = &Ссылка
	|	И &ИспользоватьСерийныеНомера
	|	И НЕ ПеремещениеЗапасовСерийныеНомера.Ссылка.СтруктурнаяЕдиница.ОрдерныйСклад";
	
	// Олег Литвиненко 15.09.22 --->
	Запрос.УстановитьПараметр("СмещениеДляОкругления", 0.0005);
	// Олег Литвиненко <---
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеЗапасов);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.Дляпроведения.Организация);
	Запрос.УстановитьПараметр("ИспользоватьХарактеристики", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьХарактеристики);
	Запрос.УстановитьПараметр("УчетПоЯчейкам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоЯчейкам);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	Запрос.УстановитьПараметр("ДатаДокумента", ДокументСсылкаПеремещениеЗапасов.Дата);
	
	//ПодольскийАИ #УчетПроектов 05.10.2020 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 05.10.2020 }
	
	Запрос.УстановитьПараметр("ИспользоватьСерийныеНомера", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьСерийныеНомера);
	
	// Временно: изменение движений по ордерному складу.
	Запрос.УстановитьПараметр("ДатаОбновленияНаРелиз_1_2_1", Константы.ДатаОбновленияНаРелиз_1_2_1.Получить());
		
	Запрос.УстановитьПараметр("ПеремещениеЗапасов", НСтр("en='Stock Transfer';ka='მარაგების გადაადგილება';ru='Перемещение запасов'"));
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов); //+++ Дмгг

	
	МассивРезультатов = Запрос.Выполнить();
		
	// Формирование проводок документа.
	СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыВРазрезеГТД(СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыКРасходуСоСкладов(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыКПоступлениюНаСклады(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаСуммовойУчетВРознице(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
	
	// Серийные номера
	СформироватьТаблицаСерийныеНомера(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);	
	
	СформироватьТаблицаУправленческий(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_ПеремещениеЗапасов(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
	//Паганини_
	СформироватьТаблицаЗаказНаПеремещение(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
	//_Паганини
		
	// Расчет стоимости списания запасов.
	СформироватьТаблицаЗапасы(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
	
	// Олег Литвиненко 20.01.23 --->
	СформироватьТаблицаЗапасыВВалюте(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
	// Олег Литвиненко <---
	
	//++Mira. Lazare 02.09.2022
	СформироватьТаблицаЗаказыИПеремешения(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства);
	//++Mira. Lazare 02.09.2022

	//+Lazare
	Если СтруктураДополнительныеСвойства.ИспользоватьКонтрольСроковГодностиТовара Тогда 
		СформироватьТаблицаКонтрольСроковГодностиТовара(ДокументСсылкаПеремещениеЗапасов,СтруктураДополнительныеСвойства);
	КонецЕсли;
	//-Lazare

	СформироватьТаблицаРезервированиеЗапасов(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства); // Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылкаПеремещениеЗапасов, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь, ПроверятьИтогиРегистров = ЛОЖЬ) Экспорт
	
	Если ДокументСсылкаПеремещениеЗапасов.СтруктурнаяЕдиница.КонтролироватьОстатки Тогда // Kuzmich, 11.01.2020
		Возврат;
	КонецЕсли;
	
	// Kuzmich, 25.07.2019, Контролировать остатки запасов на складах при проведении документов
	Если Константы.КонтролироватьОстаткиЗапасовНаСкладахПриПроведении.Получить() Тогда
		
		Результат = УправлениеНебольшойФирмойСервер.ЗапросОтрицательныхОстатковЗапасовНаСкладахПриПроведенииДокумента(ДокументСсылкаПеремещениеЗапасов,ДокументСсылкаПеремещениеЗапасов.СтруктурнаяЕдиница);
		
		Если НЕ Результат.Пустой() Тогда
			ДокументСсылкаПеремещениеЗапасов_Объект = ДокументСсылкаПеремещениеЗапасов.ПолучитьОбъект();
			ВыборкаИзРезультатаЗапроса = Результат.Выбрать();
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыНаСкладах(ДокументСсылкаПеремещениеЗапасов_Объект, ВыборкаИзРезультатаЗапроса, Отказ);
		КонецЕсли;			
		
	КонецЕсли;
	// Kuzmich, 25.07.2019, Контролировать остатки запасов на складах при проведении документов
	
	Если НЕ УправлениеНебольшойФирмойСервер.ВыполнитьКонтрольОстатков() Тогда
		Возврат;
	КонецЕсли;

	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Если временные таблицы "ДвиженияЗапасыНаСкладахИзменение", "ДвиженияЗапасыИзменение"
	// содержат записи, необходимо выполнить контроль реализации товаров.
	
	Если СтруктураВременныеТаблицы.ДвиженияЗапасыНаСкладахИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияЗапасыИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияСуммовойУчетВРозницеИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияСерийныеНомераИзменение
		ИЛИ СтруктураВременныеТаблицы.ДвиженияЗапасыВРазрезеГТДИзменение
		ИЛИ (Константы.ФункциональнаяОпцияРезервированиеЗапасов_new.Получить() И СтруктураВременныеТаблицы.ДвиженияРезервированиеЗапасовИзменение) // Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
		Тогда
		
		Запрос = Новый Запрос(
		//Малышев 2024-12-03 ONESOFT-3670 (--
		УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКонтроля_ОстаткиЗапасовНаСкладе(ДополнительныеСвойства) //[0]
		//"ВЫБРАТЬ
		//|	ДвиженияЗапасыНаСкладахИзменение.НомерСтроки КАК НомерСтроки,
		//|	ДвиженияЗапасыНаСкладахИзменение.Организация КАК ОрганизацияПредставление,
		//|	ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПредставление,
		//|	ДвиженияЗапасыНаСкладахИзменение.Номенклатура КАК НоменклатураПредставление,
		//|	ДвиженияЗапасыНаСкладахИзменение.Характеристика КАК ХарактеристикаПредставление,
		//|	ДвиженияЗапасыНаСкладахИзменение.Партия КАК ПартияПредставление,
		//|	ДвиженияЗапасыНаСкладахИзменение.Ячейка КАК ЯчейкаПредставление,
		//|	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
		//|	ЗапасыНаСкладахОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
		//|	ЕСТЬNULL(ДвиженияЗапасыНаСкладахИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасыНаСкладах,
		//|	ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыНаСкладах
		//|ИЗ
		//|	ДвиженияЗапасыНаСкладахИзменение КАК ДвиженияЗапасыНаСкладахИзменение
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(
		//|				&МоментКонтроля,
		//|				(Организация, СтруктурнаяЕдиница, Номенклатура, Характеристика, Партия, Ячейка) В
		//|					(ВЫБРАТЬ
		//|						ДвиженияЗапасыНаСкладахИзменение.Организация КАК Организация,
		//|						ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		//|						ДвиженияЗапасыНаСкладахИзменение.Номенклатура КАК Номенклатура,
		//|						ДвиженияЗапасыНаСкладахИзменение.Характеристика КАК Характеристика,
		//|						ДвиженияЗапасыНаСкладахИзменение.Партия КАК Партия,
		//|						ДвиженияЗапасыНаСкладахИзменение.Ячейка КАК Ячейка
		//|					ИЗ
		//|						ДвиженияЗапасыНаСкладахИзменение КАК ДвиженияЗапасыНаСкладахИзменение)) КАК ЗапасыНаСкладахОстатки
		//|		ПО ДвиженияЗапасыНаСкладахИзменение.Организация = ЗапасыНаСкладахОстатки.Организация
		//|			И ДвиженияЗапасыНаСкладахИзменение.СтруктурнаяЕдиница = ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница
		//|			И ДвиженияЗапасыНаСкладахИзменение.Номенклатура = ЗапасыНаСкладахОстатки.Номенклатура
		//|			И ДвиженияЗапасыНаСкладахИзменение.Характеристика = ЗапасыНаСкладахОстатки.Характеристика
		//|			И ДвиженияЗапасыНаСкладахИзменение.Партия = ЗапасыНаСкладахОстатки.Партия
		//|			И ДвиженияЗапасыНаСкладахИзменение.Ячейка = ЗапасыНаСкладахОстатки.Ячейка
		//|			И (ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0) < 0)
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	НомерСтроки
		//Малышев 2024-12-03 ONESOFT-3670 --)
		+ "
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияЗапасыИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияЗапасыИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияЗапасыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПредставление,
		|	ДвиженияЗапасыИзменение.СчетУчета КАК СчетУчетаПредставление,
		|	ДвиженияЗапасыИзменение.Номенклатура КАК НоменклатураПредставление,
		|	ДвиженияЗапасыИзменение.Характеристика КАК ХарактеристикаПредставление,
		|	ДвиженияЗапасыИзменение.Партия КАК ПартияПредставление,
		|	ДвиженияЗапасыИзменение.ЗаказПокупателя КАК ЗаказПокупателяПредставление,
		|	ЗапасыОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
		|	ЗапасыОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗапасыИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасы,
		|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасы,
		|	ЕСТЬNULL(ЗапасыОстатки.СуммаОстаток, 0) КАК СуммаОстатокЗапасы
		|ИЗ
		|	ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
		|				&МоментКонтроля,
		|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В
		|					(ВЫБРАТЬ
		|						ДвиженияЗапасыИзменение.Организация КАК Организация,
		|						ДвиженияЗапасыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|						ДвиженияЗапасыИзменение.СчетУчета КАК СчетУчета,
		|						ДвиженияЗапасыИзменение.Номенклатура КАК Номенклатура,
		|						ДвиженияЗапасыИзменение.Характеристика КАК Характеристика,
		|						ДвиженияЗапасыИзменение.Партия КАК Партия,
		|						ДвиженияЗапасыИзменение.ЗаказПокупателя КАК ЗаказПокупателя
		|					ИЗ
		|						ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение)) КАК ЗапасыОстатки
		|		ПО ДвиженияЗапасыИзменение.Организация = ЗапасыОстатки.Организация
		|			И ДвиженияЗапасыИзменение.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
		|			И ДвиженияЗапасыИзменение.СчетУчета = ЗапасыОстатки.СчетУчета
		|			И ДвиженияЗапасыИзменение.Номенклатура = ЗапасыОстатки.Номенклатура
		|			И ДвиженияЗапасыИзменение.Характеристика = ЗапасыОстатки.Характеристика
		|			И ДвиженияЗапасыИзменение.Партия = ЗапасыОстатки.Партия
		|			И ДвиженияЗапасыИзменение.ЗаказПокупателя = ЗапасыОстатки.ЗаказПокупателя
		|			И (ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) < 0)
		|;      
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияСуммовойУчетВРозницеИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияСуммовойУчетВРозницеИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияСуммовойУчетВРозницеИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПредставление,
		|	ДвиженияСуммовойУчетВРозницеИзменение.СтруктурнаяЕдиница.РозничныйВидЦен.ВалютаЦены КАК ВалютаПредставление,
		|	ЕСТЬNULL(СуммовойУчетВРозницеОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ДвиженияСуммовойУчетВРозницеИзменение.СуммаВалИзменение + ЕСТЬNULL(СуммовойУчетВРозницеОстатки.СуммаВалОстаток, 0) КАК ОстатокВРознице,
		|	ДвиженияСуммовойУчетВРозницеИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
		|	ДвиженияСуммовойУчетВРозницеИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
		|	ДвиженияСуммовойУчетВРозницеИзменение.СуммаИзменение КАК СуммаИзменение,
		|	ДвиженияСуммовойУчетВРозницеИзменение.СуммаВалПередЗаписью КАК СуммаВалПередЗаписью,
		|	ДвиженияСуммовойУчетВРозницеИзменение.СуммаВалПриЗаписи КАК СуммаВалПриЗаписи,
		|	ДвиженияСуммовойУчетВРозницеИзменение.СуммаВалИзменение КАК СуммаВалИзменение,
		|	ДвиженияСуммовойУчетВРозницеИзменение.СебестоимостьПередЗаписью КАК СебестоимостьПередЗаписью,
		|	ДвиженияСуммовойУчетВРозницеИзменение.СебестоимостьПриЗаписи КАК СебестоимостьПриЗаписи,
		|	ДвиженияСуммовойУчетВРозницеИзменение.СебестоимостьИзменение КАК СебестоимостьИзменение
		|ИЗ
		|	ДвиженияСуммовойУчетВРозницеИзменение КАК ДвиженияСуммовойУчетВРозницеИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СуммовойУчетВРознице.Остатки(
		|				&МоментКонтроля,
		|				(Организация, СтруктурнаяЕдиница) В
		|					(ВЫБРАТЬ
		|						ДвиженияСуммовойУчетВРозницеИзменение.Организация КАК Организация,
		|						ДвиженияСуммовойУчетВРозницеИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		|					ИЗ
		|						ДвиженияСуммовойУчетВРозницеИзменение КАК ДвиженияСуммовойУчетВРозницеИзменение)) КАК СуммовойУчетВРозницеОстатки
		|		ПО ДвиженияСуммовойУчетВРозницеИзменение.Организация = СуммовойУчетВРозницеОстатки.Организация
		|			И ДвиженияСуммовойУчетВРозницеИзменение.СтруктурнаяЕдиница = СуммовойУчетВРозницеОстатки.СтруктурнаяЕдиница
		|			И (ЕСТЬNULL(СуммовойУчетВРозницеОстатки.СуммаВалОстаток, 0) < 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияСерийныеНомераИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияСерийныеНомераИзменение.СерийныйНомер КАК СерийныйНомерПредставление,
		|	ДвиженияСерийныеНомераИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПредставление,
		|	ДвиженияСерийныеНомераИзменение.Номенклатура КАК НоменклатураПредставление,
		|	ДвиженияСерийныеНомераИзменение.Характеристика КАК ХарактеристикаПредставление,
		|	ДвиженияСерийныеНомераИзменение.Партия КАК ПартияПредставление,
		|	ДвиженияСерийныеНомераИзменение.Ячейка КАК ЯчейкаПредставление,
		|	СерийныеНомераОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
		|	СерийныеНомераОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияСерийныеНомераИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(СерийныеНомераОстатки.КоличествоОстаток, 0) КАК ОстатокСерийныеНомера,
		|	ЕСТЬNULL(СерийныеНомераОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокСерийныеНомера
		|ИЗ
		|	ДвиженияСерийныеНомераИзменение КАК ДвиженияСерийныеНомераИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СерийныеНомера.Остатки(&МоментКонтроля, ) КАК СерийныеНомераОстатки
		|		ПО ДвиженияСерийныеНомераИзменение.СтруктурнаяЕдиница = СерийныеНомераОстатки.СтруктурнаяЕдиница
		|			И ДвиженияСерийныеНомераИзменение.Номенклатура = СерийныеНомераОстатки.Номенклатура
		|			И ДвиженияСерийныеНомераИзменение.Характеристика = СерийныеНомераОстатки.Характеристика
		|			И ДвиженияСерийныеНомераИзменение.Партия = СерийныеНомераОстатки.Партия
		|			И ДвиженияСерийныеНомераИзменение.СерийныйНомер = СерийныеНомераОстатки.СерийныйНомер
		|			И ДвиженияСерийныеНомераИзменение.Ячейка = СерийныеНомераОстатки.Ячейка
		|			И (ЕСТЬNULL(СерийныеНомераОстатки.КоличествоОстаток, 0) < 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияЗапасыВРазрезеГТДИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.НомерГТД) КАК НомерГТДПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.Номенклатура) КАК НоменклатураПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.Характеристика) КАК ХарактеристикаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.Партия) КАК ПартияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияЗапасыВРазрезеГТДИзменение.СтранаПроисхождения) КАК СтранаПроисхожденияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗапасыВРазрезеГТДОстатки.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
		|	ЕСТЬNULL(ДвиженияЗапасыВРазрезеГТДИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыВРазрезеГТДОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасыВРазрезеГТД,
		|	ЕСТЬNULL(ЗапасыВРазрезеГТДОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасыВРазрезеГТД
		|ИЗ
		|	ДвиженияЗапасыВРазрезеГТДИзменение КАК ДвиженияЗапасыВРазрезеГТДИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыВРазрезеГТД.Остатки(
		|				&МоментКонтроля,
		|				(Организация, НомерГТД, Номенклатура, Характеристика, Партия, СтранаПроисхождения) В
		|					(ВЫБРАТЬ
		|						ДвиженияЗапасыВРазрезеГТДИзменение.Организация КАК Организация,
		|						ДвиженияЗапасыВРазрезеГТДИзменение.НомерГТД КАК НомерГТД,
		|						ДвиженияЗапасыВРазрезеГТДИзменение.Номенклатура КАК Номенклатура,
		|						ДвиженияЗапасыВРазрезеГТДИзменение.Характеристика КАК Характеристика,
		|						ДвиженияЗапасыВРазрезеГТДИзменение.Партия КАК Партия,
		|						ДвиженияЗапасыВРазрезеГТДИзменение.СтранаПроисхождения КАК СтранаПроисхождения
		|					ИЗ
		|						ДвиженияЗапасыВРазрезеГТДИзменение КАК ДвиженияЗапасыВРазрезеГТДИзменение)) КАК ЗапасыВРазрезеГТДОстатки
		|		ПО ДвиженияЗапасыВРазрезеГТДИзменение.Организация = ЗапасыВРазрезеГТДОстатки.Организация
		|			И ДвиженияЗапасыВРазрезеГТДИзменение.НомерГТД = ЗапасыВРазрезеГТДОстатки.НомерГТД
		|			И ДвиженияЗапасыВРазрезеГТДИзменение.Номенклатура = ЗапасыВРазрезеГТДОстатки.Номенклатура
		|			И ДвиженияЗапасыВРазрезеГТДИзменение.Характеристика = ЗапасыВРазрезеГТДОстатки.Характеристика
		|			И ДвиженияЗапасыВРазрезеГТДИзменение.Партия = ЗапасыВРазрезеГТДОстатки.Партия
		|			И ДвиженияЗапасыВРазрезеГТДИзменение.СтранаПроисхождения = ЗапасыВРазрезеГТДОстатки.СтранаПроисхождения
		|ГДЕ
		|	ЕСТЬNULL(ЗапасыВРазрезеГТДОстатки.КоличествоОстаток, 0) < 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|"
		
		//Малышев 2024-06-17 ONESOFT-3094 (--
	    + УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКонтроля_ОстаткиЗапасов(ДополнительныеСвойства) // МассивРезультатов[5]
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ДвиженияЗапасыИзменение.НомерСтроки КАК НомерСтроки,
		//|	ДвиженияЗапасыИзменение.Организация КАК ОрганизацияПредставление,
		//|	ДвиженияЗапасыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПредставление,
		//|	ДвиженияЗапасыИзменение.СчетУчетаРегл КАК СчетУчетаРеглПредставление,
		//|	ДвиженияЗапасыИзменение.Номенклатура КАК НоменклатураПредставление,
		//|	ДвиженияЗапасыИзменение.Характеристика КАК ХарактеристикаПредставление,
		//|	ДвиженияЗапасыИзменение.Партия КАК ПартияПредставление,
		//|	ДвиженияЗапасыИзменение.Проект КАК ПроектПредставление,   //
		//|	ДвиженияЗапасыИзменение.ЗаказПокупателя КАК ЗаказПокупателяПредставление,
		//|	ЗапасыОстатки.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы,
		//|	ЗапасыОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПредставление,
		//|	ЕСТЬNULL(ДвиженияЗапасыИзменение.КоличествоИзменение, 0) + ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК ОстатокЗапасы,
		//|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗапасы,
		//|	ЕСТЬNULL(ЗапасыОстатки.СуммаОстаток, 0) КАК СуммаОстатокЗапасы
		//|ИЗ
		//|	ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
		//|				&МоментКонтроля,
		////|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В
		//|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия, Проект, ЗаказПокупателя) В   //Малышев 2024-06-10 ONESOFT-3093
		//|					(ВЫБРАТЬ
		//|						ДвиженияЗапасыИзменение.Организация КАК Организация,
		//|						ДвиженияЗапасыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		//|						ДвиженияЗапасыИзменение.СчетУчетаРегл КАК СчетУчетаРегл,
		//|						ДвиженияЗапасыИзменение.Номенклатура КАК Номенклатура,
		//|						ДвиженияЗапасыИзменение.Характеристика КАК Характеристика,
		//|						ДвиженияЗапасыИзменение.Партия КАК Партия,
		//|						ДвиженияЗапасыИзменение.Проект КАК Проект,    //Малышев 2024-06-10 ONESOFT-3093
		//|						ДвиженияЗапасыИзменение.ЗаказПокупателя КАК ЗаказПокупателя
		//|					ИЗ
		//|						ДвиженияЗапасыИзменение КАК ДвиженияЗапасыИзменение)) КАК ЗапасыОстатки
		//|		ПО ДвиженияЗапасыИзменение.Организация = ЗапасыОстатки.Организация
		//|			И ДвиженияЗапасыИзменение.СтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
		//|			И ДвиженияЗапасыИзменение.СчетУчетаРегл = ЗапасыОстатки.СчетУчетаРегл
		//|			И ДвиженияЗапасыИзменение.Номенклатура = ЗапасыОстатки.Номенклатура
		//|			И ДвиженияЗапасыИзменение.Характеристика = ЗапасыОстатки.Характеристика
		//|			И ДвиженияЗапасыИзменение.Партия = ЗапасыОстатки.Партия
		//|			И ДвиженияЗапасыИзменение.Проект = ЗапасыОстатки.Проект      //Малышев 2024-06-10 ONESOFT-3093
		//|			И ДвиженияЗапасыИзменение.ЗаказПокупателя = ЗапасыОстатки.ЗаказПокупателя
		//|			И (ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) < 0)
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	НомерСтроки";
		);
		
		// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
		Если Константы.ФункциональнаяОпцияРезервированиеЗапасов_new.Получить() Тогда
			
			Если ПроверятьИтогиРегистров Тогда
				
				Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() + РезервированиеЗапасов_new.ПолучитьТекстЗапросаКонтроля_РезервированиеЗапасов(ДополнительныеСвойства, ЛОЖЬ); //[9]
			
			Иначе
				
				Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() + РезервированиеЗапасов_new.ПолучитьТекстЗапросаКонтроля_РезервированиеЗапасов(ДополнительныеСвойства, ИСТИНА) //[9]
				+ РезервированиеЗапасов_new.ПолучитьТекстЗапросаКонтроля_СвободныеОстатки(ДополнительныеСвойства); //[15] 
			
			КонецЕсли;			 
			
			Запрос.УстановитьПараметр("КонтролироватьОстаткиПриПроведенииПоПроектам",  ДополнительныеСвойства.УчетнаяПолитика.КонтролироватьОстаткиПриПроведенииПоПроектам);
			Запрос.УстановитьПараметр("МоментКонтроляРезерва", ДокументСсылкаПеремещениеЗапасов.МоментВремени());
			
		КонецЕсли;
		// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Если НЕ ПроверятьИтогиРегистров Тогда 
			Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
		Иначе 
			Запрос.УстановитьПараметр("МоментКонтроля", Дата(2999,12,31));
		КонецЕсли;
		
		//Малышев 2024-06-10 ONESOFT-3093
		Запрос.УстановитьПараметр("КонтролироватьОстаткиПриПроведенииПоПроектам", ДополнительныеСвойства.УчетнаяПолитика.КонтролироватьОстаткиПриПроведенииПоПроектам);
		
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Если НЕ МассивРезультатов[0].Пустой()
			ИЛИ НЕ МассивРезультатов[1].Пустой()
			ИЛИ НЕ МассивРезультатов[2].Пустой()
			ИЛИ НЕ МассивРезультатов[3].Пустой()
			ИЛИ НЕ МассивРезультатов[4].Пустой()
			ИЛИ НЕ МассивРезультатов[5].Пустой()
			// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
			ИЛИ (Константы.ФункциональнаяОпцияРезервированиеЗапасов_new.Получить() И НЕ(МассивРезультатов[9].Пустой()))
			ИЛИ (Константы.ФункциональнаяОпцияРезервированиеЗапасов_new.Получить() И НЕ(ПроверятьИтогиРегистров) И НЕ(МассивРезультатов[15].Пустой()))
			// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
			Тогда
			
			ДокументОбъектПеремещениеЗапасов = ДокументСсылкаПеремещениеЗапасов.ПолучитьОбъект()
			
		КонецЕсли;
		
		// Отрицательный остаток запасов на складе.
		Если НЕ МассивРезультатов[0].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[0].Выбрать();
			Если НЕ ПроверятьИтогиРегистров Тогда 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыНаСкладах(ДокументОбъектПеремещениеЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
			Иначе 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыНаСкладах(ДокументОбъектПеремещениеЗапасов, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
			КонецЕсли;
		КонецЕсли;
		
		// Отрицательный остаток учета запасов и затрат. 
		Если НЕ ДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов Тогда //+++ Дмгг
			Если НЕ МассивРезультатов[1].Пустой() Тогда
				ВыборкаИзРезультатаЗапроса = МассивРезультатов[1].Выбрать();
				Если НЕ ПроверятьИтогиРегистров Тогда 
					УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасы(ДокументОбъектПеремещениеЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
				Иначе 
					УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасы(ДокументОбъектПеремещениеЗапасов, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
				КонецЕсли;
			КонецЕсли;
		// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
		ИначеЕсли Константы.ФункциональнаяОпцияРезервированиеЗапасов_new.Получить() И НЕ(МассивРезультатов[9].Пустой()) Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[9].Выбрать();
			Если НЕ(ПроверятьИтогиРегистров) Тогда 
				РезервированиеЗапасов_new.СообщитьОбОшибкахПроведенияПоРегиструЗапасы(ДокументСсылкаПеремещениеЗапасов, ВыборкаИзРезультатаЗапроса, Отказ,,,1);
			Иначе 
				РезервированиеЗапасов_new.СообщитьОбОшибкахПроведенияПоРегиструЗапасы(ДокументСсылкаПеремещениеЗапасов, ВыборкаИзРезультатаЗапроса, Отказ,,ИСТИНА,1);
			КонецЕсли;
		ИначеЕсли Константы.ФункциональнаяОпцияРезервированиеЗапасов_new.Получить() И НЕ(ПроверятьИтогиРегистров) И НЕ(МассивРезультатов[15].Пустой()) Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[15].Выбрать();
			РезервированиеЗапасов_new.СообщитьОбОшибкахПроведенияПоРегиструЗапасы(ДокументСсылкаПеремещениеЗапасов, ВыборкаИзРезультатаЗапроса, Отказ,,,2);
		// Kuzmich, ONESOFT-2440, Использование резервов - Переместить в хранилище - Исправления
		Иначе
			Если НЕ МассивРезультатов[5].Пустой() Тогда
				ВыборкаИзРезультатаЗапроса = МассивРезультатов[5].Выбрать();
				Если НЕ ПроверятьИтогиРегистров Тогда 
					УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасы(ДокументОбъектПеремещениеЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
				Иначе 
					УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасы(ДокументОбъектПеремещениеЗапасов, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Отрицательный остаток по суммовому учету в рознице.
		Если НЕ МассивРезультатов[2].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[2].Выбрать();
			Если НЕ ПроверятьИтогиРегистров Тогда 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструСуммовойУчетВРознице(ДокументОбъектПеремещениеЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
			Иначе 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструСуммовойУчетВРознице(ДокументОбъектПеремещениеЗапасов, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
			КонецЕсли;
		КонецЕсли;
		
		// Отрицательный остаток учета серийных номеров.
		Если НЕ МассивРезультатов[3].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[3].Выбрать();
			Если НЕ ПроверятьИтогиРегистров Тогда 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструСерийныеНомера(ДокументОбъектПеремещениеЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
			Иначе 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструСерийныеНомера(ДокументОбъектПеремещениеЗапасов, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
			КонецЕсли;
		КонецЕсли;
		
		// Отрицательный остаток по остаткам запасов в разрезе номеров ГТД.
		Если Константы.КонтролироватьОстаткиПоНомерамГТД.Получить()
			И НЕ МассивРезультатов[4].Пустой() Тогда
			
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[4].Выбрать();
			Если НЕ ПроверятьИтогиРегистров Тогда 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыВРазрезеГТД(ДокументОбъектПеремещениеЗапасов, ВыборкаИзРезультатаЗапроса, Отказ);
			Иначе 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструЗапасыВРазрезеГТД(ДокументОбъектПеремещениеЗапасов, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКонтроль()

#Область ИнтерфейсПечати

Функция ДанныеДокументовБланкТоварногоНаполнения(МассивОбъектов, ЭтоОтправитель)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЭтоОтправитель", ЭтоОтправитель);
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст =
	"Выбрать
	|	ПеремещениеЗапасов.Ссылка КАК Ссылка
	|	,ПеремещениеЗапасов.Дата КАК ДатаДокумента
	|	,""Перемещение запасов"" КАК ПредставлениеРегистратора
	|	,Выбор когда &ЭтоОтправитель = Истина
	|		Тогда ПеремещениеЗапасов.СтруктурнаяЕдиница
	|		Иначе ПеремещениеЗапасов.СтруктурнаяЕдиницаПолучатель Конец КАК ПредставлениеСклада
	|	,Выбор когда &ЭтоОтправитель = Истина
	|		Тогда ПеремещениеЗапасов.Ячейка 
	|		Иначе ПеремещениеЗапасов.ЯчейкаПолучатель Конец КАК ПредставлениеЯчейки
	|	,ПеремещениеЗапасов.Номер
	|	,ПеремещениеЗапасов.Организация.Префикс КАК Префикс
	|	,ПеремещениеЗапасов.Запасы.(
	|		НомерСтроки КАК НомерСтроки
	|		,Номенклатура.Склад КАК Склад
	|		,Номенклатура.Ячейка КАК Ячейка
	|		,Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры
	|		,Неопределено КАК Содержание
	|		,Выбор когда Выразить(ПеремещениеЗапасов.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(100)) = """"
	|			Тогда ПеремещениеЗапасов.Запасы.Номенклатура.Наименование
	|			Иначе ПеремещениеЗапасов.Запасы.Номенклатура.НаименованиеПолное Конец КАК ПредставлениеНоменклатуры
	|		,Номенклатура.Артикул КАК Артикул
	|		,Номенклатура.Код КАК Код
	|		,ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения
	|		,Количество
	|		,Характеристика
	|		,КлючСвязи
	|	) КАК ТаблицаЗапасы
	|	,ЗаказПокупателя.СерийныеНомера.(
	|		СерийныйНомер
	|		,КлючСвязи
	|	) КАК ТаблицаСерийныеНомера
	|Из Документ.ПеремещениеЗапасов КАК ПеремещениеЗапасов
	|Где ПеремещениеЗапасов.Ссылка В (&МассивОбъектов)
	|Упорядочить по НомерСтроки";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция проверяет, проведен документ или нет, и вызывает процедуру печати
// документа.
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПеремещениеЗапасов";

	ПервыйДокумент = Истина;
	
	Для каждого ТекущийДокумент Из МассивОбъектов Цикл
	
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		
		Если ИмяМакета = "ПеремещениеЗапасов" Тогда
		
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ШапкаДокумента.Дата КАК ДатаДокумента,
			|	ШапкаДокумента.Организация КАК Организация,
			|	ШапкаДокумента.СтруктурнаяЕдиница КАК Отправитель,
			|	ШапкаДокумента.СтруктурнаяЕдиницаПолучатель КАК Получатель,
			|	ШапкаДокумента.Номер,
			|	ШапкаДокумента.Организация.Префикс КАК Префикс,
			|	ШапкаДокумента.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы КАК СтруктурнаяЕдиницаПолучательТипСтруктурнойЕдиницы,
			|	ШапкаДокумента.ПодписьКладовщикаОтправил.Должность КАК ДолжностьКладовщикаОтпустил,
			|	ШапкаДокумента.ПодписьКладовщикаОтправил.РасшифровкаПодписи КАК РасшифровкаПодписиКладовщикаОтпустил,
			|	ШапкаДокумента.ПодписьКладовщикаПолучил.Должность КАК ДолжностьКладовщикаПринял,
			|	ШапкаДокумента.ПодписьКладовщикаПолучил.РасшифровкаПодписи КАК РасшифровкаПодписиКладовщикаПринял,
			|	ШапкаДокумента.СерийныеНомера.(
			|		СерийныйНомер,
			|		КлючСвязи
			|	)
			|ИЗ
			|	Документ.ПеремещениеЗапасов КАК ШапкаДокумента
			|ГДЕ
			|	ШапкаДокумента.Ссылка = &ТекущийДокумент
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПеремещениеЗапасов.НомерСтроки КАК НомерСтроки,
			|	ПеремещениеЗапасов.Номенклатура.НаименованиеПолное КАК Запас,
			|	ПеремещениеЗапасов.Номенклатура.Код КАК Код,
			|	ПеремещениеЗапасов.Номенклатура.Артикул КАК Артикул,
			|	ПеремещениеЗапасов.ЕдиницаИзмерения КАК ЕдиницаХранения,
			|	ПеремещениеЗапасов.Количество КАК Количество,
			|	ПеремещениеЗапасов.Резерв КАК Резерв,
			|	ПеремещениеЗапасов.ЗаказПокупателя КАК ЗаказПокупателя,
			|	ПеремещениеЗапасов.Характеристика КАК Характеристика,
			|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
			|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена * ПеремещениеЗапасов.Количество, 0) КАК Сумма,
			|	ПеремещениеЗапасов.КлючСвязи
			|ИЗ
			|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасов
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
			|				&ДатаДокумента,
			|				Номенклатура В (&СписокНоменклатура)
			|					И Характеристика В (&СписокХарактеристика)
			|					И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследних
			|		ПО ПеремещениеЗапасов.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
			|			И ПеремещениеЗапасов.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
			|			И ПеремещениеЗапасов.Ссылка.СтруктурнаяЕдиницаПолучатель.РозничныйВидЦен = ЦеныНоменклатурыСрезПоследних.ВидЦен
			|ГДЕ
			|	ПеремещениеЗапасов.Ссылка = &ТекущийДокумент
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
			Запрос.УстановитьПараметр("ВидЦен", ТекущийДокумент.СтруктурнаяЕдиницаПолучатель.РозничныйВидЦен);
			Запрос.УстановитьПараметр("ДатаДокумента", ТекущийДокумент.Дата);
			Запрос.УстановитьПараметр("СписокНоменклатура", ТекущийДокумент.Запасы.ВыгрузитьКолонку("Номенклатура"));
			Запрос.УстановитьПараметр("СписокХарактеристика", ТекущийДокумент.Запасы.ВыгрузитьКолонку("Характеристика"));
			
			МассивРезультатов = Запрос.ВыполнитьПакет();
			
			Шапка = МассивРезультатов[0].Выбрать();
			Шапка.Следующий();
			
			ВыборкаСтрокСерийныеНомера = Шапка.СерийныеНомера.Выбрать();
			ВыборкаСтрокЗапасы = МассивРезультатов[1].Выбрать();
			
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеЗапасов_ПеремещениеЗапасов";
			
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПеремещениеЗапасов.ПФ_MXL_ПеремещениеЗапасов");
			
			НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.ТекстЗаголовка =
				"მარაგების გადაადგილება № "
			  + НомерДокумента
			  + "  "
			  + Формат(Шапка.ДатаДокумента, "ДЛФ=D");
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если Шапка.СтруктурнаяЕдиницаПолучательТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
			 ИЛИ Шапка.СтруктурнаяЕдиницаПолучательТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыСЦенами");
			Иначе
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если Шапка.СтруктурнаяЕдиницаПолучательТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
			 ИЛИ Шапка.СтруктурнаяЕдиницаПолучательТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаСЦенами");
			Иначе
				ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			КонецЕсли;
			
			Количество = 0;
			Всего = 0;
			
			Пока ВыборкаСтрокЗапасы.Следующий() Цикл
				
				ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокЗапасы);
				
				СтрокаСерийныеНомера = РаботаССерийнымиНомерами.СтрокаСерийныеНомераИзВыборки(ВыборкаСтрокСерийныеНомера, ВыборкаСтрокЗапасы.КлючСвязи);
				ОбластьМакета.Параметры.Запас = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(ВыборкаСтрокЗапасы.Запас, 
					ВыборкаСтрокЗапасы.Характеристика, ВыборкаСтрокЗапасы.Артикул, СтрокаСерийныеНомера);
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Количество = Количество + 1;
				Всего = Всего + ВыборкаСтрокЗапасы.Сумма;
				
			КонецЦикла;
			
			Если Шапка.СтруктурнаяЕдиницаПолучательТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
			 ИЛИ Шапка.СтруктурнаяЕдиницаПолучательТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ИтогоСЦенами");
				ОбластьМакета.Параметры.Всего = Всего;
			Иначе
				ОбластьМакета = Макет.ПолучитьОбласть("Итого");
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		ИначеЕсли ИмяМакета = "М11" Тогда
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПеремещениеЗапасов.Дата КАК ДатаДокумента,
			|	ПеремещениеЗапасов.Организация КАК Организация,
			|	ПеремещениеЗапасов.СтруктурнаяЕдиница КАК Отправитель,
			|	ПеремещениеЗапасов.СтруктурнаяЕдиницаПолучатель КАК Получатель,
			|	ПеремещениеЗапасов.СчетЗатрат.Код КАК КоррСчет,
			|	ПеремещениеЗапасов.Номер,
			|	ПеремещениеЗапасов.Организация.Префикс КАК Префикс,
			|	ПеремещениеЗапасов.ПодписьРуководителя.РасшифровкаПодписи КАК РасшифровкаПодписиРуководителя,
			|	ПеремещениеЗапасов.ПодписьКладовщикаОтправил.Должность КАК ДолжностьКладовщикаОтпустил,
			|	ПеремещениеЗапасов.ПодписьКладовщикаОтправил.РасшифровкаПодписи КАК РасшифровкаПодписиКладовщикаОтпустил,
			|	ПеремещениеЗапасов.ПодписьКладовщикаПолучил.Должность КАК ДолжностьКладовщикаПринял,
			|	ПеремещениеЗапасов.ПодписьКладовщикаПолучил.РасшифровкаПодписи КАК РасшифровкаПодписиКладовщикаПринял
			|ИЗ
			|	Документ.ПеремещениеЗапасов КАК ПеремещениеЗапасов
			|ГДЕ
			|	ПеремещениеЗапасов.Ссылка = &ТекущийДокумент
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПеремещениеЗапасов.НомерСтроки КАК НомерСтроки,
			|	ПеремещениеЗапасов.Номенклатура КАК СсылкаНоменклатура,
			|	ПеремещениеЗапасов.Характеристика КАК СсылкаХарактеристика,
			|	ПеремещениеЗапасов.Номенклатура.НаименованиеПолное КАК Запас,
			|	ПеремещениеЗапасов.Номенклатура.Артикул КАК Артикул,
			|	ПеремещениеЗапасов.Количество КАК Количество,
			|	ПеремещениеЗапасов.Резерв КАК Резерв,
			|	ПеремещениеЗапасов.ЗаказПокупателя КАК ЗаказПокупателя,
			|	ПеремещениеЗапасов.Характеристика,
			|	ПеремещениеЗапасов.ЕдиницаИзмерения.Наименование,
			|	ПеремещениеЗапасов.ЕдиницаИзмерения.Код,
			|	ПеремещениеЗапасов.Номенклатура.СчетУчетаЗапасов.Код КАК Счет,
			|	ПеремещениеЗапасов.Номенклатура.Код КАК НоменклатурныйНомер
			|ПОМЕСТИТЬ ТаблицаДокумента
			|ИЗ
			|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасов
			|ГДЕ
			|	ПеремещениеЗапасов.Ссылка = &ТекущийДокумент
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаДокумента.НомерСтроки,
			|	ТаблицаДокумента.СсылкаНоменклатура,
			|	ТаблицаДокумента.СсылкаХарактеристика,
			|	ТаблицаДокумента.Запас,
			|	ТаблицаДокумента.Артикул,
			|	ТаблицаДокумента.Количество,
			|	ТаблицаДокумента.Резерв,
			|	ТаблицаДокумента.ЗаказПокупателя,
			|	ТаблицаДокумента.Характеристика,
			|	ТаблицаДокумента.ЕдиницаИзмеренияНаименование,
			|	ТаблицаДокумента.ЕдиницаИзмеренияКод,
			|	ТаблицаДокумента.Счет,
			|	ТаблицаДокумента.НоменклатурныйНомер,
			|	ВЫБОР
			|		КОГДА &ВалютаВидЦен = НациональнаяВалюта.Значение
			|			ТОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)
			|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность
			|	КОНЕЦ КАК Цена,
			|	ВЫБОР
			|		КОГДА &ВалютаВидЦен = НациональнаяВалюта.Значение
			|			ТОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена * ТаблицаДокумента.Количество, 0)
			|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена * ТаблицаДокумента.Количество, 0) * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность
			|	КОНЕЦ КАК Сумма
			|ИЗ
			|	ТаблицаДокумента КАК ТаблицаДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
			|				&ДатаДокумента,
			|				Актуальность
			|					И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследних
			|		ПО ТаблицаДокумента.СсылкаНоменклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
			|			И ТаблицаДокумента.СсылкаХарактеристика = ЦеныНоменклатурыСрезПоследних.Характеристика,
			|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, Валюта = &ВалютаВидЦен) КАК КурсыВалютСрезПоследних,
			|	Константа.НациональнаяВалюта КАК НациональнаяВалюта
			|
			|УПОРЯДОЧИТЬ ПО
			|	ТаблицаДокумента.НомерСтроки";
			
			РозничныйВидДокумента = ТекущийДокумент.СтруктурнаяЕдиницаПолучатель.РозничныйВидЦен;
			
			Если НЕ ЗначениеЗаполнено(РозничныйВидДокумента) Тогда
				
				РозничныйВидДокумента = Справочники.ВидыЦен.Учетная;
				
			КонецЕсли;
			
			Запрос.УстановитьПараметр("ВидЦен", 			РозничныйВидДокумента);
			Запрос.УстановитьПараметр("ВалютаВидЦен", 		?(ЗначениеЗаполнено(РозничныйВидДокумента.ВалютаЦены), РозничныйВидДокумента.ВалютаЦены, Константы.НациональнаяВалюта.Получить()));
			Запрос.УстановитьПараметр("ДатаДокумента", 		ТекущийДокумент.Дата);
			
			МассивРезультатов = Запрос.ВыполнитьПакет();
			
			Шапка = МассивРезультатов[0].Выбрать();
			Шапка.Следующий();
			
			ВыборкаСтрокЗапасы = МассивРезультатов[2].Выбрать();
			
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеЗапасов_ПеремещениеЗапасов_М11";
			
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПеремещениеЗапасов.ПФ_MXL_М11");
			
			СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
			
			НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Заголовок =
				"ТРЕБОВАНИЕ-НАКЛАДНАЯ № "
			  + НомерДокумента
			  + " от "
			  + Формат(Шапка.ДатаДокумента, "ДЛФ=DD");
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ОбластьМакета.Параметры.КодОКПО                  = СведенияОбОрганизации.КодПоОКПО;
			ОбластьМакета.Параметры.ПредставлениеОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации);
			ОбластьМакета.Параметры.ДатаСоставления          = Формат(Шапка.ДатаДокумента, "ДФ=dd.MM.yy");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			
			Пока ВыборкаСтрокЗапасы.Следующий() Цикл
			
				ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокЗапасы);
				ОбластьМакета.Параметры.Запас = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(ВыборкаСтрокЗапасы.Запас, ВыборкаСтрокЗапасы.Характеристика, ВыборкаСтрокЗапасы.Артикул);
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		ИначеЕсли ИмяМакета = "ТОРГ13" Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ШапкаДокумента.Дата КАК ДатаДокумента,
			|	ШапкаДокумента.Организация КАК Организация,
			|	ШапкаДокумента.СтруктурнаяЕдиница КАК Отправитель,
			|	ШапкаДокумента.СтруктурнаяЕдиницаПолучатель КАК Получатель,
			|	ШапкаДокумента.СчетЗатрат.Код КАК СубСчет,
			|	ШапкаДокумента.Номер КАК Номер,
			|	ШапкаДокумента.Организация.Префикс КАК Префикс,
			|	ШапкаДокумента.ПодписьКладовщикаОтправил.Должность КАК ДолжностьКладовщикаОтпустил,
			|	ШапкаДокумента.ПодписьКладовщикаОтправил.РасшифровкаПодписи КАК РасшифровкаПодписиКладовщикаОтпустил,
			|	ШапкаДокумента.ПодписьКладовщикаПолучил.Должность КАК ДолжностьКладовщикаПринял,
			|	ШапкаДокумента.ПодписьКладовщикаПолучил.РасшифровкаПодписи КАК РасшифровкаПодписиКладовщикаПринял
			|ИЗ
			|	Документ.ПеремещениеЗапасов КАК ШапкаДокумента
			|ГДЕ
			|	ШапкаДокумента.Ссылка = &ТекущийДокумент
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПеремещениеЗапасов.НомерСтроки КАК НомерСтроки,
			|	ПеремещениеЗапасов.Номенклатура КАК СсылкаНоменклатура,
			|	ПеремещениеЗапасов.Характеристика КАК СсылкаХарактеристика,
			|	ПеремещениеЗапасов.Номенклатура.НаименованиеПолное КАК Запас,
			|	ПеремещениеЗапасов.Номенклатура.Артикул КАК Артикул,
			|	ПеремещениеЗапасов.Количество КАК Количество,
			|	ПеремещениеЗапасов.Резерв КАК Резерв,
			|	ПеремещениеЗапасов.ЗаказПокупателя КАК ЗаказПокупателя,
			|	ПеремещениеЗапасов.Характеристика КАК Характеристика,
			|	ПеремещениеЗапасов.Номенклатура.СчетУчетаЗапасов.Код КАК Счет,
			|	ПеремещениеЗапасов.Номенклатура.Код КАК ТоварКод,
			|	ПеремещениеЗапасов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ПеремещениеЗапасов.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
			|	ПеремещениеЗапасов.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКодПоОКЕИ
			|ПОМЕСТИТЬ ТаблицаДокумента
			|ИЗ
			|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасов
			|ГДЕ
			|	ПеремещениеЗапасов.Ссылка = &ТекущийДокумент
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	СсылкаНоменклатура,
			|	СсылкаХарактеристика
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаДокумента.НомерСтроки,
			|	ТаблицаДокумента.СсылкаНоменклатура,
			|	ТаблицаДокумента.СсылкаХарактеристика,
			|	ТаблицаДокумента.Запас,
			|	ТаблицаДокумента.Артикул,
			|	ТаблицаДокумента.Количество КАК КоличествоМест,
			|	ВЫБОР
			|		КОГДА ТаблицаДокумента.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
			|			ТОГДА ТаблицаДокумента.ЕдиницаИзмерения.Коэффициент
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК КоличествоВОдномМесте,
			|	ТаблицаДокумента.Резерв,
			|	ТаблицаДокумента.ЗаказПокупателя,
			|	ТаблицаДокумента.Характеристика,
			|	ТаблицаДокумента.Счет,
			|	ТаблицаДокумента.ТоварКод,
			|	ТаблицаДокумента.ЕдиницаИзмеренияНаименование,
			|	ТаблицаДокумента.ЕдиницаИзмеренияКодПоОКЕИ,
			|	ВЫБОР
			|		КОГДА &ВалютаВидЦен = НациональнаяВалюта.Значение
			|			ТОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)
			|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность
			|	КОНЕЦ КАК Цена,
			|	ВЫБОР
			|		КОГДА &ВалютаВидЦен = НациональнаяВалюта.Значение
			|			ТОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена * ТаблицаДокумента.Количество, 0)
			|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена * ТаблицаДокумента.Количество, 0) * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность
			|	КОНЕЦ КАК Сумма
			|ИЗ
			|	ТаблицаДокумента КАК ТаблицаДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
			|				&ДатаДокумента,
			|				Актуальность
			|					И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследних
			|		ПО ТаблицаДокумента.СсылкаНоменклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
			|			И ТаблицаДокумента.СсылкаХарактеристика = ЦеныНоменклатурыСрезПоследних.Характеристика,
			|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, Валюта = &ВалютаВидЦен) КАК КурсыВалютСрезПоследних,
			|	Константа.НациональнаяВалюта КАК НациональнаяВалюта
			|
			|УПОРЯДОЧИТЬ ПО
			|	ТаблицаДокумента.НомерСтроки";
			
			РозничныйВидДокумента = ТекущийДокумент.СтруктурнаяЕдиницаПолучатель.РозничныйВидЦен;
			
			Если НЕ ЗначениеЗаполнено(РозничныйВидДокумента) Тогда
				
				РозничныйВидДокумента = Справочники.ВидыЦен.Учетная;
				
			КонецЕсли;
			
			Запрос.УстановитьПараметр("ВидЦен", 			РозничныйВидДокумента);
			Запрос.УстановитьПараметр("ВалютаВидЦен", 		?(ЗначениеЗаполнено(РозничныйВидДокумента.ВалютаЦены), РозничныйВидДокумента.ВалютаЦены, Константы.НациональнаяВалюта.Получить()));
			Запрос.УстановитьПараметр("ДатаДокумента", 		ТекущийДокумент.Дата);
			
			МассивРезультатов = Запрос.ВыполнитьПакет();
			
			Шапка = МассивРезультатов[0].Выбрать();
			Шапка.Следующий();
			
			ВыборкаСтрокЗапасы = МассивРезультатов[2].Выбрать();
			
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеЗапасов_ТОРГ13";
			
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПеремещениеЗапасов.ПФ_MXL_ТОРГ13");
			НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс);
			
			СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
			ОбластьМакета         = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ОбластьМакета.Параметры.ПредставлениеОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации);
			ОбластьМакета.Параметры.НомерДокумента           = НомерДокумента;
			ОбластьМакета.Параметры.ДатаДокумента            = Шапка.ДатаДокумента;
			ОбластьМакета.Параметры.ОрганизацияПоОКПО        = СведенияОбОрганизации.КодПоОКПО;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			СтрокНаСтранице = 23;
			СтрокШапки      = 10;
			СтрокПодвала    = 9;
			НомерСтраницы   = 1;
			
			// Выводим заголовок таблицы
			ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
			ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
			ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
			
			КоличествоСтрок = ВыборкаСтрокЗапасы.Количество();
			
			Если КоличествоСтрок = 1 Тогда
				ПереноситьПоследнююСтроку = 0;
			Иначе
				ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
				ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
				ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
			КонецЕсли;
			
			// инициализация итогов по странице
			ИтогКоличествоМестПоСтранице = 0;
			ИтогСуммыПоСтранице = 0;
			
			// инициализация итогов по документу
			ИтогоКоличество  = 0;
			ИтогоСумма = 0;
			
			Ном = 0;
			
			// Выводим многострочную часть докмента
			ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогиПоСтранице");
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			Пока ВыборкаСтрокЗапасы.Следующий() Цикл
				
				Ном = Ном + 1;
				
				//Начинаем новую страницу, если предыдущая строка была последней на странице
				//или пора переносить последнюю строку на последнюю страницу с подвалом.
				ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;
				
				Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
				 ИЛИ ((ПереноситьПоследнююСтроку = 1) И (Ном = КоличествоСтрок)) Тогда
					
					ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице;
					ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице = ИтогСуммыПоСтранице;
					
					ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);
					
					// инициализация итогов по странице
					ИтогКоличествоМестПоСтранице = 0;
					ИтогСуммыПоСтранице = 0;
					
					НомерСтраницы = НомерСтраницы + 1;
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
					ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
					
				КонецЕсли;
				
				ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокЗапасы);
				КоличествоМест = ВыборкаСтрокЗапасы.КоличествоМест;
				ОбластьМакета.Параметры.ТоварНаименование = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(
					ВыборкаСтрокЗапасы.Запас,
					ВыборкаСтрокЗапасы.Характеристика,
					ВыборкаСтрокЗапасы.Артикул);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				// Обновим итоги по странице
				ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице + КоличествоМест;
				ИтогСуммыПоСтранице = ИтогСуммыПоСтранице + ВыборкаСтрокЗапасы.Сумма;
				
				// Обновим итогов по документу
				ИтогоКоличество  = ИтогоКоличество + КоличествоМест;
				ИтогоСумма = ИтогоСумма + ВыборкаСтрокЗапасы.Сумма;
				
			КонецЦикла;
			
			ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице;
			ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице = ИтогСуммыПоСтранице;
			
			ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);
			
			// Выводим итоги по документу в целом
			ОбластьМакета = Макет.ПолучитьОбласть("Всего");
			ОбластьМакета.Параметры.ИтогоКоличествоМест = ИтогоКоличество;
			ОбластьМакета.Параметры.ИтогоСумма = ИтогоСумма;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Выводим подвал документа
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		ИначеЕсли ИмяМакета = "МХ18" Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ПеремещениеЗапасов.Дата КАК ДатаДокумента,
			|	ПеремещениеЗапасов.Организация КАК Организация,
			|	ПеремещениеЗапасов.СтруктурнаяЕдиница КАК Отправитель,
			|	ПеремещениеЗапасов.СтруктурнаяЕдиницаПолучатель КАК Получатель,
			|	ПеремещениеЗапасов.СчетЗатрат.Код КАК СубСчет,
			|	ПеремещениеЗапасов.Номер,
			|	ПеремещениеЗапасов.Организация.Префикс КАК Префикс,
			|	ПеремещениеЗапасов.ПодписьКладовщикаОтправил.Должность КАК ДолжностьКладовщикаОтпустил,
			|	ПеремещениеЗапасов.ПодписьКладовщикаОтправил.РасшифровкаПодписи КАК РасшифровкаПодписиКладовщикаОтпустил,
			|	ПеремещениеЗапасов.ПодписьКонтролера.Должность КАК ДолжностьКонтролера,
			|	ПеремещениеЗапасов.ПодписьКонтролера.РасшифровкаПодписи КАК РасшифровкаПодписиКонтролера,
			|	ПеремещениеЗапасов.ПодписьКладовщикаПолучил.Должность КАК ДолжностьКладовщикаПринял,
			|	ПеремещениеЗапасов.ПодписьКладовщикаПолучил.РасшифровкаПодписи КАК РасшифровкаПодписиКладовщикаПринял,
			|	ПеремещениеЗапасов.Запасы.(
			|		НомерСтроки,
			|		Номенклатура.НаименованиеПолное КАК Запас,
			|		Номенклатура.Артикул КАК Артикул,
			|		Количество КАК КоличествоМест,
			|		Резерв КАК Резерв,
			|		ЗаказПокупателя КАК ЗаказПокупателя,
			|		Характеристика,
			|		ЕдиницаИзмерения.Наименование КАК ВидУпаковки,
			|		Номенклатура.СчетУчетаЗапасов.Код КАК Счет,
			|		Номенклатура.Код КАК ТоварКод,
			|		Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияНаименование,
			|		Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКодПоОКЕИ,
			|		ВЫБОР
			|			КОГДА ПеремещениеЗапасов.Запасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
			|				ТОГДА ПеремещениеЗапасов.Запасы.ЕдиницаИзмерения.Коэффициент
			|			ИНАЧЕ 1
			|		КОНЕЦ КАК КоличествоВОдномМесте
			|	)
			|ИЗ
			|	Документ.ПеремещениеЗапасов КАК ПеремещениеЗапасов
			|ГДЕ
			|	ПеремещениеЗапасов.Ссылка = &ТекущийДокумент";
			
			Шапка = Запрос.Выполнить().Выбрать();
			Шапка.Следующий();
			
			ВыборкаСтрокЗапасы = Шапка.Запасы.Выгрузить();
			
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеЗапасов_МХ18";
			
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПеремещениеЗапасов.ПФ_MXL_МХ18");
			
			НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс);
			
			СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
			ОбластьМакета         = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ОбластьМакета.Параметры.ПредставлениеОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации);
			ОбластьМакета.Параметры.НомерДокумента           = НомерДокумента;
			ОбластьМакета.Параметры.ДатаДокумента            = Шапка.ДатаДокумента;
			ОбластьМакета.Параметры.ОрганизацияПоОКПО        = СведенияОбОрганизации.КодПоОКПО;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			СтрокНаСтранице = 23;
			СтрокШапки      = 10;
			СтрокПодвала    = 9;
			НомерСтраницы   = 1;
			
			// Выводим заголовок таблицы
			ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
			ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
			ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
			
			КоличествоСтрок = ВыборкаСтрокЗапасы.Количество();
			
			Если КоличествоСтрок = 1 Тогда
				ПереноситьПоследнююСтроку = 0;
			Иначе
				ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
				ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
				ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
			КонецЕсли;
			
			// инициализация итогов по странице
			ИтогКоличествоМестПоСтранице = 0;
			
			// инициализация итогов по документу
			ИтогоКоличество  = 0;
			
			Ном = 0;
			
			// Выводим многострочную часть докмента
			ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогиПоСтранице");
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			
			Для каждого СтрокаЗапасы Из ВыборкаСтрокЗапасы Цикл
				
				Ном = Ном + 1;
				
				//Начинаем новую страницу, если предыдущая строка была последней на странице
				//или пора переносить последнюю строку на последнюю страницу с подвалом.
				ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;
				
				Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
				 ИЛИ ((ПереноситьПоследнююСтроку = 1) И (Ном = КоличествоСтрок)) Тогда
					
					ОбластьИтоговПоСтранице.Параметры.ИтогМестНаСтранице = ИтогКоличествоМестПоСтранице;
					
					ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);
					
					// инициализация итогов по странице
					ИтогКоличествоМестПоСтранице = 0;
					
					НомерСтраницы = НомерСтраницы + 1;
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
					ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
					
				КонецЕсли;
				
				ОбластьМакета.Параметры.Заполнить(СтрокаЗапасы);
				КоличествоМест = СтрокаЗапасы.КоличествоМест;
				ОбластьМакета.Параметры.ТоварНаименование = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(СтрокаЗапасы.Запас, СтрокаЗапасы.Характеристика, СтрокаЗапасы.Артикул);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				// Обновим итоги по странице
				ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице + КоличествоМест;
				
				// Обновим итогов по документу
				ИтогоКоличество  = ИтогоКоличество  + КоличествоМест;
				
			КонецЦикла;
			
			ОбластьИтоговПоСтранице.Параметры.ИтогМестНаСтранице = ИтогКоличествоМестПоСтранице;
			
			ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);
			
			// Выводим итоги по документу в целом
			ОбластьМакета = Макет.ПолучитьОбласть("Всего");
			ОбластьМакета.Параметры.ИтогМест = ИтогоКоличество;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Выводим подвал документа
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
	  	//Паганини_
		ИначеЕсли ИмяМакета = "ФормаВодителя" Тогда
			Если НЕ ТекущийДокумент.ЧерезТранзитныйСклад Тогда
				Продолжить;
			КонецЕсли;
			
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеЗапасов_ФормаВодителя";
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПеремещениеЗапасов.ПФ_MXL_ФормаВодителя");

			СтруктураШапки = Новый Структура;
			СтруктураШапки.Вставить("Номер", 			ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ТекущийДокумент.Номер, Истина, Истина));
			СтруктураШапки.Вставить("Дата", 			Формат(ТекущийДокумент.Дата, "Л=ka; ДФ=dd.MM.yyyy"));
			СтруктураШапки.Вставить("Организация", 		ТекущийДокумент.Организация.НаименованиеПолное);
			
			//СтруктураШапки.Вставить("АдресОтправитель",	ТекущийДокумент.СтруктурнаяЕдиница.Адрес);
			//СтруктураШапки.Вставить("АдресПолучатель", 	ТекущийДокумент.СтруктурнаяЕдиницаПолучатель.Адрес);
			ФактАдрес = УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("ВидыКонтактнойИнформации", "ФактАдресСтруктурнойЕдиницы");		
			СтруктураШапки.Вставить("АдресОтправитель", УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(ТекущийДокумент.СтруктурнаяЕдиница,					ФактАдрес));
			СтруктураШапки.Вставить("АдресПолучатель",	УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(ТекущийДокумент.СтруктурнаяЕдиницаКонечныйПолучатель,	ФактАдрес));
			
			СтруктураШапки.Вставить("ВремяПечати", 		ТекущаяДата());
			СтруктураШапки.Вставить("Комментарий", 		ТекущийДокумент.Комментарий);
			
			//Шапка
			ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
			ОбластьШапка.Параметры.Заполнить(СтруктураШапки);
			
			ФайлПечати = ТекущийДокумент.Организация.ФайлЛоготип;
			Если ЗначениеЗаполнено(ФайлПечати) Тогда
				ДанныеКартинки = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ФайлПечати);
				Если ЗначениеЗаполнено(ДанныеКартинки) Тогда
					Попытка
						ОбластьШапка.Рисунки.Лого.Картинка = Новый Картинка(ДанныеКартинки);
					Исключение
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			//Строка таблицы
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ПеремещениеЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
				|	ПеремещениеЗапасовЗапасы.Номенклатура,
				|	ПеремещениеЗапасовЗапасы.Номенклатура.Код КАК Код,
				|	ПеремещениеЗапасовЗапасы.Количество КАК Количество,
				|	ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения КАК ЕдИзм
				|ИЗ
				|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
				|ГДЕ
				|	ПеремещениеЗапасовЗапасы.Ссылка = &Ссылка
				|
				|УПОРЯДОЧИТЬ ПО
				|	НомерСтроки";
			Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
			Выборка = Запрос.Выполнить().Выбрать();
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
			Пока Выборка.Следующий() Цикл
				ОбластьСтрока.Параметры.Заполнить(Выборка);
				ТабличныйДокумент.Вывести(ОбластьСтрока);
			КонецЦикла;
			
			//Подвал
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
			ОбластьПодвал.Параметры.Заполнить(СтруктураШапки);
			ТабличныйДокумент.Вывести(ОбластьПодвал);
	  	//_Паганини
		
		// Олег Литвиненко 19.04.23 --->
		ИначеЕсли ИмяМакета = "СписаниеМатериаловПроекта" Тогда 
			ПечатьСписаниеМатериаловПроекта(Запрос, ТабличныйДокумент, ТекущийДокумент);
		// Олег Литвиненко <---
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Олег Литвиненко 19.04.23 --->
Процедура ПечатьСписаниеМатериаловПроекта(Запрос, ТабличныйДокумент, ТекущийДокумент)
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШапкаДокумента.Дата КАК ДатаДокумента,
	|	ШапкаДокумента.Организация КАК Организация,
	|	ШапкаДокумента.СтруктурнаяЕдиница КАК Отправитель,
	|	ШапкаДокумента.СтруктурнаяЕдиницаПолучатель КАК Получатель,
	|	ШапкаДокумента.Проект КАК Проект,
	|	ШапкаДокумента.ЗаказПокупателя КАК Заказ,
	|	ШапкаДокумента.Автор КАК Автор,
	|	ШапкаДокумента.Номер КАК Номер,
	|	ПОДСТРОКА(ШапкаДокумента.Комментарий, 1, 500) КАК Комментарий,
	|	ШапкаДокумента.Организация.Префикс КАК Префикс,
	|	ШапкаДокумента.СтруктурнаяЕдиницаПолучатель.ТипСтруктурнойЕдиницы КАК СтруктурнаяЕдиницаПолучательТипСтруктурнойЕдиницы,
	|	ШапкаДокумента.ПодписьКладовщикаОтправил.Должность КАК ДолжностьКладовщикаОтпустил,
	|	ШапкаДокумента.ПодписьКладовщикаОтправил.РасшифровкаПодписи КАК РасшифровкаПодписиКладовщикаОтпустил,
	|	ШапкаДокумента.ПодписьКладовщикаПолучил.Должность КАК ДолжностьКладовщикаПринял,
	|	ШапкаДокумента.ПодписьКладовщикаПолучил.РасшифровкаПодписи КАК РасшифровкаПодписиКладовщикаПринял,
	|	ШапкаДокумента.СерийныеНомера.(
	|		СерийныйНомер КАК СерийныйНомер,
	|		КлючСвязи КАК КлючСвязи
	|	) КАК СерийныеНомера
	|ИЗ
	|	Документ.ПеремещениеЗапасов КАК ШапкаДокумента
	|ГДЕ
	|	ШапкаДокумента.Ссылка = &ТекущийДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПеремещениеЗапасов.НомерСтроки КАК НомерСтроки,
	|	ПеремещениеЗапасов.Номенклатура.НаименованиеПолное КАК Запас,
	|	ПеремещениеЗапасов.Номенклатура.Код КАК Код,
	|	ПеремещениеЗапасов.Номенклатура.Артикул КАК Артикул,
	|	ПеремещениеЗапасов.ЕдиницаИзмерения КАК ЕдиницаХранения,
	|	ПеремещениеЗапасов.Количество КАК Количество,
	|	ПеремещениеЗапасов.Резерв КАК Резерв,
	|	ПеремещениеЗапасов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ПеремещениеЗапасов.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена * ПеремещениеЗапасов.Количество, 0) КАК Сумма,
	|	ПеремещениеЗапасов.КлючСвязи КАК КлючСвязи,
	|	ХозрасчетныйДвиженияССубконто.Сумма КАК Себестоимость,
	|	ХозрасчетныйДвиженияССубконто.Сумма / ПеремещениеЗапасов.Количество КАК СебестоимостьЕдиницы
	|ИЗ
	|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&ДатаДокумента,
	|				Номенклатура В (&СписокНоменклатура)
	|					И Характеристика В (&СписокХарактеристика)
	|					И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ПеремещениеЗапасов.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ПеремещениеЗапасов.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	|			И ПеремещениеЗапасов.Ссылка.СтруктурнаяЕдиницаПолучатель.РозничныйВидЦен = ЦеныНоменклатурыСрезПоследних.ВидЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	|				,
	|				,
	|				(ВЫРАЗИТЬ(Регистратор КАК Документ.ПеремещениеЗапасов)) = &ТекущийДокумент
	|					И (ВЫРАЗИТЬ(Субконто2 КАК Справочник.Номенклатура) В (&СписокНоменклатура)
	|						ИЛИ ВЫРАЗИТЬ(Субконто3 КАК Справочник.Номенклатура) В (&СписокНоменклатура)),
	|				,
	|				) КАК ХозрасчетныйДвиженияССубконто
	|		ПО (ПеремещениеЗапасов.Ссылка = (ВЫРАЗИТЬ(ХозрасчетныйДвиженияССубконто.Регистратор КАК Документ.ПеремещениеЗапасов)))
	|			И (ПеремещениеЗапасов.Номенклатура = (ВЫРАЗИТЬ(ХозрасчетныйДвиженияССубконто.СубконтоДт2 КАК Справочник.Номенклатура))
	|				ИЛИ ПеремещениеЗапасов.Номенклатура = (ВЫРАЗИТЬ(ХозрасчетныйДвиженияССубконто.СубконтоДт3 КАК Справочник.Номенклатура)))
	|ГДЕ
	|	ПеремещениеЗапасов.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("ВидЦен", ТекущийДокумент.СтруктурнаяЕдиницаПолучатель.РозничныйВидЦен);
	Запрос.УстановитьПараметр("ДатаДокумента", ТекущийДокумент.Дата);
	Запрос.УстановитьПараметр("СписокНоменклатура", ТекущийДокумент.Запасы.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("СписокХарактеристика", ТекущийДокумент.Запасы.ВыгрузитьКолонку("Характеристика"));
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Шапка = МассивРезультатов[0].Выбрать();
	Шапка.Следующий();
	
	ВыборкаСтрокСерийныеНомера = Шапка.СерийныеНомера.Выбрать();
	ВыборкаСтрокЗапасы = МассивРезультатов[1].Выбрать();
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеЗапасов_ПеремещениеЗапасов";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПеремещениеЗапасов.СписаниеМатериаловПроекта");
	
	НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка =
		НСтр("ru = 'Списание материалов проекта № '; ka = 'პროექტზე გახარჯული მასალების ჩამოწერა № '")
	  + НомерДокумента
	  + "  "
	  + Формат(Шапка.ДатаДокумента, "ДЛФ=D");
	//ОбластьМакета.Параметры.ТекстЗаголовка = "პროექტზე გახარჯული მასალების ჩამოწერა";
	
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Если Шапка.СтруктурнаяЕдиницаПолучательТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
	 ИЛИ Шапка.СтруктурнаяЕдиницаПолучательТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыСЦенами");
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Если Шапка.СтруктурнаяЕдиницаПолучательТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
	 ИЛИ Шапка.СтруктурнаяЕдиницаПолучательТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаСЦенами");
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	КонецЕсли;
	
	Количество = 0;
	Всего = 0;
	// Олег Литвиненко 12.07.23 --->
	ВсегоСебестоимость = 0;
	// Олег Литвиненко <---
	
	Пока ВыборкаСтрокЗапасы.Следующий() Цикл
		
		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокЗапасы);
		
		СтрокаСерийныеНомера = РаботаССерийнымиНомерами.СтрокаСерийныеНомераИзВыборки(ВыборкаСтрокСерийныеНомера, ВыборкаСтрокЗапасы.КлючСвязи);
		ОбластьМакета.Параметры.Запас = УправлениеНебольшойФирмойСервер.ПолучитьПредставлениеНоменклатурыДляПечати(ВыборкаСтрокЗапасы.Запас, 
			ВыборкаСтрокЗапасы.Характеристика, ВыборкаСтрокЗапасы.Артикул, СтрокаСерийныеНомера);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Количество = Количество + 1;
		Всего = Всего + ВыборкаСтрокЗапасы.Сумма;
		// Олег Литвиненко 12.07.23 --->
		ВсегоСебестоимость = ВсегоСебестоимость + ВыборкаСтрокЗапасы.Себестоимость;
		// Олег Литвиненко <---
		
	КонецЦикла;
	
	Если Шапка.СтруктурнаяЕдиницаПолучательТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Розница
	 ИЛИ Шапка.СтруктурнаяЕдиницаПолучательТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоСЦенами");
		ОбластьМакета.Параметры.Всего = Всего;
	Иначе
		//ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		// Олег Литвиненко 12.07.23 --->
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоСЦенами");
		ОбластьМакета.Параметры.Всего = ВсегоСебестоимость;
		// Олег Литвиненко <---
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры
// Олег Литвиненко <---

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "М11") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "М11", "М-11", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "М11"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТОРГ13") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТОРГ13", "ТОРГ-13", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ТОРГ13"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МХ18") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МХ18", "МХ-18", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "МХ18"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТТН") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТТН", "Товарно-транспортная накладная", Обработки.ПечатьТТН.ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПеремещениеЗапасов") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПеремещениеЗапасов", "Перемещение запасов", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ПеремещениеЗапасов"));
		
	КонецЕсли;
	
	//Паганини
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ФормаВодителя") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ФормаВодителя", "Форма Водителя", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ФормаВодителя"));
	КонецЕсли;
	//_Паганини
	
	// Олег Литвиненко 19.04.23 --->
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СписаниеМатериаловПроекта") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СписаниеМатериаловПроекта", "Списание материалов проекта", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "СписаниеМатериаловПроекта"));
	КонецЕсли;	
	// Олег Литвиненко <---
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "БланкТоварногоНаполненияОтправитель");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьБланкТоварногоНаполнения.КлючПараметровПечати();
		ПечатнаяФорма.ПолныйПутьКМакету = Обработки.ПечатьБланкТоварногоНаполнения.ПолныйПутьКМакету();
		ПечатнаяФорма.СинонимМакета = НСтр("ka='სასაქონლო შევსების ბლანკი (გამგზავნი)';ru='Бланк товарного наполнения (Отправитель)';en='commercial filling Blank (sender)'");
		
		ДанныеОбъектовПечати = ДанныеДокументовБланкТоварногоНаполнения(МассивОбъектов, Истина);
		Обработки.ПечатьБланкТоварногоНаполнения.СформироватьПФ(ПечатнаяФорма, ДанныеОбъектовПечати, ОбъектыПечати);
		
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "БланкТоварногоНаполненияПолучатель");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = Обработки.ПечатьБланкТоварногоНаполнения.КлючПараметровПечати();
		ПечатнаяФорма.ПолныйПутьКМакету = Обработки.ПечатьБланкТоварногоНаполнения.ПолныйПутьКМакету();
		ПечатнаяФорма.СинонимМакета = НСтр("ka='სასაქონლო გავსების ბლანკი (მიმღები)';ru='Бланк товарного наполнения (Получатель)';en='commercial filling Blank (Recipient)'");
		
		ДанныеОбъектовПечати = ДанныеДокументовБланкТоварногоНаполнения(МассивОбъектов, Ложь);
		Обработки.ПечатьБланкТоварногоНаполнения.СформироватьПФ(ПечатнаяФорма, ДанныеОбъектовПечати, ОбъектыПечати);
		
	КонецЕсли;
	
	// параметры отправки печатных форм по электронной почте
	УправлениеНебольшойФирмойСервер.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "М11,ТОРГ13,МХ18,ТТН,ПеремещениеЗапасов";
	КомандаПечати.Представление = НСтр("ka='Настраиваемый комплект документов';ru='Настраиваемый комплект документов';en='Customizable set of documents'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "М11";
	КомандаПечати.Представление = НСтр("ka='М11 (მოთხოვნა-ზედნადები)';ru='М11 (Требование-накладная)';en='M11 (requirement-waybill)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 4;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТОРГ13";
	КомандаПечати.Представление = НСтр("ka='ТОРГ13 (შიდა გადაადგილების ზედნადები)';ru='ТОРГ13 (Накладная на внутреннее перемещение)';en='TORG13 (consignment to internal displacement)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 7;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "МХ18";
	КомандаПечати.Представление = НСтр("ka='МХ18 (მზა პროდუქციის გადაცემის ზედნადები)';ru='МХ18 (Накладная на передачу готовой продукции)';en='MH18 (Invoice to transfer the finished product)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 10;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТТН";
	КомандаПечати.Представление = НСтр("ka='1-Т (სატრანსპორტო-სასაქონლო ზედნადები)';ru='1-Т (Товарно-транспортная накладная)';en='1-T (bill of lading)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 14;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеНебольшойФирмойКлиент.ПечатьТН";
	КомандаПечати.Идентификатор = "ТН";
	КомандаПечати.Представление = НСтр("ka='დანართი #4 (სატრანსპორტო ზედნადები)';ru='Приложение №4 (Транспортная накладная)';en='Appendix №4 (Lading)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 17;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПеремещениеЗапасов";
	КомандаПечати.Представление = НСтр("en='Stock Transfer';ka='მარაგების გადაადგილება';ru='Перемещение запасов'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 20;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "БланкТоварногоНаполненияОтправитель";
	КомандаПечати.Представление = НСтр("ka='სასაქონლო შევსების ბლანკი (გამგზავნი)';ru='Бланк товарного наполнения (Отправитель)';en='commercial filling Blank (sender)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 23;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "БланкТоварногоНаполненияПолучатель";
	КомандаПечати.Представление = НСтр("ka='სასაქონლო გავსების ბლანკი (მიმღები)';ru='Бланк товарного наполнения (Получатель)';en='commercial filling Blank (Recipient)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 26;
	
	//Паганини_
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ФормаВодителя";
	КомандаПечати.Представление = НСтр("en='Driver Form';ka='მძღოლის ფორმა';ru='Форма водителя'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 27;
	//_Паганини
	
	// Олег Литвиненко 19.04.23 --->
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СписаниеМатериаловПроекта";
	КомандаПечати.Представление = НСтр("ka='პროექტზე გახარჯული მასალების ჩამოწერა';ru='Списание материалов проекта'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 28;
	// Олег Литвиненко <---
	
	Если ПравоДоступа("Просмотр", Метаданные.Обработки.ПечатьЭтикетокИЦенников)
		И ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.ЦеныНоменклатуры)
		И ПолучитьФункциональнуюОпцию("ПечатьЭтикетокИЦенников") Тогда
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "УправлениеНебольшойФирмойКлиент.ПечатьЭтикетокИЦенниковИзДокументов";
		КомандаПечати.Идентификатор = "ПечатьЭтикетокИзПеремещенияТоваров";
		КомандаПечати.Представление = НСтр("ka='ეტიკეტების ბეჭდვა';ru='Печать этикеток';en='Printing labels'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		КомандаПечати.Порядок = 29;
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "УправлениеНебольшойФирмойКлиент.ПечатьЭтикетокИЦенниковИзДокументов";
		КомандаПечати.Идентификатор = "ПечатьЦенниковИзПеремещенияТоваров";
		КомандаПечати.Представление = НСтр("ka='ფასდებულების ბეჭდვა';ru='Печать ценников';en='Print price tags'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		КомандаПечати.Порядок = 32;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаССерийнымиНомерами

// Формирует таблицу значений, содержащую данные для проведения по регистру СерийныеНомераГарантии.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСерийныеНомера(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Если ДокументСсылка.СерийныеНомера.Количество()=0 Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераГарантии", Новый ТаблицаЗначений);
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераОстатки", Новый ТаблицаЗначений);
		Возврат;
	КонецЕсли;                         
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаЗапасы.Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	СерийныеНомера.СерийныйНомер КАК СерийныйНомер,
	|	ВременнаяТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ВременнаяТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ВременнаяТаблицаЗапасы.Партия КАК Партия,
	|	ВременнаяТаблицаЗапасы.Организация КАК Организация,
	|	ВременнаяТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВременнаяТаблицаЗапасы.Ячейка КАК Ячейка,
	|	ВременнаяТаблицаЗапасы.ВидОперации КАК ВидОперации,
	|	1 КАК Количество,
	|	ВременнаяТаблицаЗапасы.ОрдерныйСклад КАК ОрдерныйСклад
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ВременнаяТаблицаЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаСерийныеНомера КАК СерийныеНомера
	|		ПО ВременнаяТаблицаЗапасы.КлючСвязи = СерийныеНомера.КлючСвязи
	|ГДЕ
	|	НЕ ВременнаяТаблицаЗапасы.ОрдерныйСклад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблицаЗапасы.Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	СерийныеНомера.СерийныйНомер,
	|	ВременнаяТаблицаЗапасы.Номенклатура,
	|	ВременнаяТаблицаЗапасы.Характеристика,
	|	ВременнаяТаблицаЗапасы.Партия,
	|	ВременнаяТаблицаЗапасы.Организация,
	|	ВременнаяТаблицаЗапасы.КоррСтруктурнаяЕдиница,
	|	ВременнаяТаблицаЗапасы.КоррЯчейка,
	|	ВременнаяТаблицаЗапасы.ВидОперации,
	|	1,
	|	ВременнаяТаблицаЗапасы.ОрдерныйСклад
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ВременнаяТаблицаЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаСерийныеНомера КАК СерийныеНомера
	|		ПО ВременнаяТаблицаЗапасы.КлючСвязи = СерийныеНомера.КлючСвязи
	|ГДЕ
	|	НЕ ВременнаяТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|	И НЕ ВременнаяТаблицаЗапасы.КоррОрдерныйСклад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВременнаяТаблицаЗапасы.Период КАК ДатаСобытия,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаЗапасы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ОперацииСерийныхНомеров.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ОперацииСерийныхНомеров.Движение)
	|	КОНЕЦ КАК Операция,
	|	СерийныеНомера.СерийныйНомер КАК СерийныйНомер,
	|	ВременнаяТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ВременнаяТаблицаЗапасы.Характеристика КАК Характеристика
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ВременнаяТаблицаЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаСерийныеНомера КАК СерийныеНомера
	|		ПО ВременнаяТаблицаЗапасы.КлючСвязи = СерийныеНомера.КлючСвязи";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераГарантии", МассивРезультатов[1].Выгрузить());
	Если СтруктураДополнительныеСвойства.УчетнаяПолитика.ОстаткиСерийныхНомеров Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераОстатки", МассивРезультатов[0].Выгрузить());
	Иначе
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераОстатки", Новый ТаблицаЗначений);
	КонецЕсли; 
	
КонецПроцедуры // СформироватьТаблицаСерийныеНомера()

#КонецОбласти

#КонецЕсли

//Паганини_
Процедура СформироватьТаблицаЗаказНаПеремещение(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства)//Паганини
	
	Если НЕ УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьСтатусыВПеремещенииИВоВнутренныхЗаказах") ИЛИ
		 НЕ ТипЗнч(ДокументСсылкаПеремещениеЗапасов.ДокументОснование) = Тип("ДокументСсылка.ВнутреннийЗаказ") 
		 Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаказыНаПеремещение", Новый ТаблицаЗначений);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ТаблицаЗапасы.Период КАК Период,
		|	ТаблицаЗапасы.КоррСтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
		|	ТаблицаЗапасы.Характеристика КАК Характеристика,
		|	ТаблицаЗапасы.Партия КАК Партия,
		|	ТаблицаЗапасы.Количество КАК Количество,
		|	ТаблицаЗапасы.ЗаказНаПеремещения КАК Заказ
		|ИЗ
		|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
		|ГДЕ
		|	НЕ ТаблицаЗапасы.ЗаказНаПеремещения ЕСТЬ NULL 
		|	И ТаблицаЗапасы.Количество > 0";
	РезультатЗапроса = Запрос.Выполнить();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаказыНаПеремещение", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

//_Паганини

Функция ПолучитьТекстЗапросаБезФильтрЗаказов() //+++ Дмгг

	Возврат "ВЫБРАТЬ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	ЗапасыОстатки.Проект КАК Проект,  //Малышев 2024-06-05 ONESOFT-3093
	|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗапасыОбороты.Организация КАК Организация,
	|		ЗапасыОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ЗапасыОбороты.СчетУчетаРегл КАК СчетУчетаРегл,
	|		ЗапасыОбороты.Номенклатура КАК Номенклатура,
	|		ЗапасыОбороты.Характеристика КАК Характеристика,
	|		ЗапасыОбороты.Партия КАК Партия,
	|		ЗапасыОбороты.Проект КАК Проект, //Малышев 2024-06-05 ONESOFT-3093
	|		ЗапасыОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
	|		СУММА(ЗапасыОбороты.КоличествоОборот) КАК КоличествоОстаток,
	|		СУММА(ЗапасыОбороты.СуммаОборот) КАК СуммаОстаток
	|	ИЗ
	|		РегистрНакопления.Запасы.Обороты(
	|				,
	|				&ПериодКонтроля,
	|				Регистратор,
	//|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия) В
	|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия, Проект) В //Малышев 2024-06-05 ONESOFT-3093
	|					(ВЫБРАТЬ
	|						ТаблицаЗапасы.Организация,
	|						ТаблицаЗапасы.СтруктурнаяЕдиница,
	|						ТаблицаЗапасы.СчетУчетаРегл,
	|						ТаблицаЗапасы.Номенклатура,
	|						ТаблицаЗапасы.Характеристика,
	|						ТаблицаЗапасы.Партия,
	|						ТаблицаЗапасы.Проект
	|					ИЗ
	|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|					ГДЕ
	|						ТаблицаЗапасы.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))) КАК ЗапасыОбороты
	|	ГДЕ
	|		ЗапасыОбороты.Регистратор <> &Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗапасыОбороты.Организация,
	|		ЗапасыОбороты.СтруктурнаяЕдиница,
	|		ЗапасыОбороты.СчетУчетаРегл,
	|		ЗапасыОбороты.Номенклатура,
	|		ЗапасыОбороты.Характеристика,
	|		ЗапасыОбороты.Партия,
	|		ЗапасыОбороты.Проект, //Малышев 2024-06-05 ONESOFT-3093
	|		ЗапасыОбороты.ЗаказПокупателя
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗапасыОбороты.Организация,
	|		ЗапасыОбороты.СтруктурнаяЕдиница,
	|		ЗапасыОбороты.СчетУчетаРегл,
	|		ЗапасыОбороты.Номенклатура,
	|		ЗапасыОбороты.Характеристика,
	|		ЗапасыОбороты.Партия,
	|		ЗапасыОбороты.Проект, //Малышев 2024-06-05 ONESOFT-3093
	|		ЗапасыОбороты.ЗаказПокупателя,
	|		СУММА(ЗапасыОбороты.КоличествоОборот),
	|		СУММА(ЗапасыОбороты.СуммаОборот)
	|	ИЗ
	|		РегистрНакопления.Запасы.Обороты(
	|				,
	|				&ПериодКонтроля,
	|				Регистратор,
	//|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия) В
	|				(Организация, СтруктурнаяЕдиница, СчетУчетаРегл, Номенклатура, Характеристика, Партия, Проект) В  //Малышев 2024-06-05 ONESOFT-3093
	|					(ВЫБРАТЬ
	|						ТаблицаЗапасы.Организация,
	|						ТаблицаЗапасы.СтруктурнаяЕдиница,
	|						ТаблицаЗапасы.СчетУчетаРегл,
	|						ТаблицаЗапасы.Номенклатура,
	|						ТаблицаЗапасы.Характеристика,
	|						ТаблицаЗапасы.Партия,
	|						ТаблицаЗапасы.Проект    //Малышев 2024-06-05 ONESOFT-3093

	|					ИЗ
	|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы)) КАК ЗапасыОбороты
	|	ГДЕ
	|		ЗапасыОбороты.Регистратор <> &Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗапасыОбороты.Организация,
	|		ЗапасыОбороты.СтруктурнаяЕдиница,
	|		ЗапасыОбороты.СчетУчетаРегл,
	|		ЗапасыОбороты.Номенклатура,
	|		ЗапасыОбороты.Характеристика,
	|		ЗапасыОбороты.Партия,
	|		ЗапасыОбороты.Проект, //Малышев 2024-06-05 ONESOFT-3093
	|		ЗапасыОбороты.ЗаказПокупателя) КАК ЗапасыОстатки
	//|ГДЕ
	//|	ЗапасыОстатки.КоличествоОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыОстатки.Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчетаРегл,
	|	ЗапасыОстатки.Номенклатура,
	|	ЗапасыОстатки.Характеристика,
	|	ЗапасыОстатки.Партия,
	|	ЗапасыОстатки.Проект,  //Малышев 2024-06-05 ONESOFT-3093
	|	ЗапасыОстатки.ЗаказПокупателя";	

КонецФункции // ПолучитьТекстЗапросаБезФильтрЗаказов()

Функция ПолучитьТекстЗапросаСтандартный() //+++ Дмгг

	Возврат "ВЫБРАТЬ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗапасыОстатки.Организация КАК Организация,
	|		ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|		ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
	|		ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|		ЗапасыОстатки.Характеристика КАК Характеристика,
	|		ЗапасыОстатки.Партия КАК Партия,
	|		ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|		СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|		СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток
	|	ИЗ
	|		РегистрНакопления.Запасы.Остатки(
	|				&МоментКонтроля,
	//|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	|				(Организация, СтруктурнаяЕдиница, СчетУчета, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	|					(ВЫБРАТЬ
	|						ТаблицаЗапасы.Организация,
	|						ТаблицаЗапасы.СтруктурнаяЕдиница,
	|						ТаблицаЗапасы.СчетУчета,
	|						ТаблицаЗапасы.СчетУчетаРегл, //+++ Дмгг
	|						ТаблицаЗапасы.Номенклатура,
	|						ТаблицаЗапасы.Характеристика,
	|						ТаблицаЗапасы.Партия,
	|						ТаблицаЗапасы.ЗаказПокупателя
	|					ИЗ
	|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|					ГДЕ
	|						ТаблицаЗапасы.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))) КАК ЗапасыОстатки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗапасыОстатки.Организация,
	|		ЗапасыОстатки.СтруктурнаяЕдиница,
	|		ЗапасыОстатки.СчетУчета,
	|		ЗапасыОстатки.СчетУчетаРегл,
	|		ЗапасыОстатки.Номенклатура,
	|		ЗапасыОстатки.Характеристика,
	|		ЗапасыОстатки.Партия,
	|		ЗапасыОстатки.ЗаказПокупателя
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗапасыОстатки.Организация,
	|		ЗапасыОстатки.СтруктурнаяЕдиница,
	|		ЗапасыОстатки.СчетУчета,
	|		ЗапасыОстатки.СчетУчетаРегл,
	|		ЗапасыОстатки.Номенклатура,
	|		ЗапасыОстатки.Характеристика,
	|		ЗапасыОстатки.Партия,
	|		ЗапасыОстатки.ЗаказПокупателя,
	|		СУММА(ЗапасыОстатки.КоличествоОстаток),
	|		СУММА(ЗапасыОстатки.СуммаОстаток)
	|	ИЗ
	|		РегистрНакопления.Запасы.Остатки(
	|				&МоментКонтроля,
	//|				(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	|				(Организация, СтруктурнаяЕдиница, СчетУчета, СчетУчетаРегл, Номенклатура, Характеристика, Партия, ЗаказПокупателя) В //+++ Дмгг
	|					(ВЫБРАТЬ
	|						ТаблицаЗапасы.Организация,
	|						ТаблицаЗапасы.СтруктурнаяЕдиница,
	|						ТаблицаЗапасы.СчетУчета,
	|						ТаблицаЗапасы.СчетУчетаРегл, //+++ Дмгг
	|						ТаблицаЗапасы.Номенклатура,
	|						ТаблицаЗапасы.Характеристика,
	|						ТаблицаЗапасы.Партия,
	|						ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|					ИЗ
	|						ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы)) КАК ЗапасыОстатки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗапасыОстатки.Организация,
	|		ЗапасыОстатки.СтруктурнаяЕдиница,
	|		ЗапасыОстатки.СчетУчета,
	|		ЗапасыОстатки.СчетУчетаРегл,
	|		ЗапасыОстатки.Номенклатура,
	|		ЗапасыОстатки.Характеристика,
	|		ЗапасыОстатки.Партия,
	|		ЗапасыОстатки.ЗаказПокупателя
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияДокументаЗапасы.Организация,
	|		ДвиженияДокументаЗапасы.СтруктурнаяЕдиница,
	|		ДвиженияДокументаЗапасы.СчетУчета,
	|		ДвиженияДокументаЗапасы.СчетУчетаРегл,
	|		ДвиженияДокументаЗапасы.Номенклатура,
	|		ДвиженияДокументаЗапасы.Характеристика,
	|		ДвиженияДокументаЗапасы.Партия,
	|		ДвиженияДокументаЗапасы.ЗаказПокупателя,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Количество, 0)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДвиженияДокументаЗапасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЕСТЬNULL(ДвиженияДокументаЗапасы.Сумма, 0)
	|			ИНАЧЕ -ЕСТЬNULL(ДвиженияДокументаЗапасы.Сумма, 0)
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.Запасы КАК ДвиженияДокументаЗапасы
	|	ГДЕ
	|		ДвиженияДокументаЗапасы.Регистратор = &Ссылка
	|		И ДвиженияДокументаЗапасы.Период <= &ПериодКонтроля) КАК ЗапасыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыОстатки.Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета,
	|	ЗапасыОстатки.СчетУчетаРегл,
	|	ЗапасыОстатки.Номенклатура,
	|	ЗапасыОстатки.Характеристика,
	|	ЗапасыОстатки.Партия,
	|	ЗапасыОстатки.ЗаказПокупателя";	

КонецФункции // ПолучитьТекстЗапросаСтандартный()
//_Паганини

//ПодольскийАИ #УчетПроектов 05.10.2020 {
Процедура ЗаполнитьСубконтоПоСчетуВСтроке(СтрокаТЗ, ВидДтКт, ИмяСубконто, ЗначениеСубконто)
	
	ИмяСчета = "Счет" + ВидДтКт;
	ВидСубконто = "Субконто" + ВидДтКт;
	КолСубконто = СтрокаТЗ[ИмяСчета].ВидыСубконто.Количество() - 1;
	
	Для СубконтоИндекс = 0 По КолСубконто Цикл
		КолонкаСубконто = ВидСубконто + Строка(СубконтоИндекс + 1);
		КолонкаВидСубконто = "Вид" + КолонкаСубконто;
		Если СтрокаТЗ[ИмяСчета].ВидыСубконто[СубконтоИндекс].ВидСубконто.ИмяПредопределенныхДанных = ИмяСубконто Тогда
			СтрокаТЗ[КолонкаСубконто] = ЗначениеСубконто;
			СтрокаТЗ[КолонкаВидСубконто] = ИмяСубконто;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
//_Паганини

//++Mira. Lazare 02.09.2022
Процедура СформироватьТаблицаЗаказыИПеремешения(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.Количество КАК Количество,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
	|	ЗНАЧЕНИЕ(Перечисление.рс_ВидыОперацийЗаказыИПеремешения.Перемешение) КАК ВидОпераций,
	|	ТаблицаЗапасы.ДокументОснование КАК ЗаказПокупателя
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.Количество,
	|	ТаблицаЗапасы.СтруктурнаяЕдиницаПолучатель,
	|	ТаблицаЗапасы.ДокументОснование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаказыИПеремешения", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
//++Mira. Lazare 02.09.2022
 
Процедура СформироватьТаблицаКонтрольСроковГодностиТовара(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства)
	
		Если ДокументСсылкаПеремещениеЗапасов.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение Тогда
		
		КопияТаблицаЗапасы = Новый ТаблицаЗначений;
		КопияТаблицаЗапасы.Колонки.Добавить("Организация");
		КопияТаблицаЗапасы.Колонки.Добавить("СтруктурнаяЕдиница");
		КопияТаблицаЗапасы.Колонки.Добавить("Документ");
		КопияТаблицаЗапасы.Колонки.Добавить("Номенклатура");
		КопияТаблицаЗапасы.Колонки.Добавить("Характеристика");
		КопияТаблицаЗапасы.Колонки.Добавить("Количество");
		КопияТаблицаЗапасы.Колонки.Добавить("Период");
		КопияТаблицаЗапасы.Колонки.Добавить("ВидДвижения");	
		КопияТаблицаЗапасы.Колонки.Добавить("СрокГодности");
		КопияТаблицаЗапасы.Колонки.Добавить("ДокументСписания"); 
		//КопияТаблицаЗапасы.Колонки.Добавить("СрокГодности");
		
		ТзЗапасы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыНаСкладах;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВТЗапаси.Количество КАК Количество,
		|	ВТЗапаси.ВидДвижения КАК ВидДвижения,
		|	ВТЗапаси.Период КАК Период,
		|	ВТЗапаси.Организация КАК Организация,
		|	ВТЗапаси.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ВТЗапаси.Номенклатура КАК Номенклатура,
		|	ВТЗапаси.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТЗапаси
		|ИЗ
		|	&ТзЗапасы КАК ВТЗапаси
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТЗапаси.Количество КАК Количество,
		|	ВТЗапаси.ВидДвижения КАК ВидДвижения,
		|	ВТЗапаси.Период КАК Период,
		|	ВТЗапаси.Организация КАК Организация,
		|	ВТЗапаси.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ВТЗапаси.Номенклатура КАК Номенклатура,
		|	ВТЗапаси.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВтПеремищениеЗапасов
		|ИЗ
		|	ВТЗапаси КАК ВТЗапаси
		|ГДЕ
		|	ВТЗапаси.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.ПРИХОД)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 3000000
		|	СУММА(КонтрольСроковГодностиТовараОбороты.КоличествоОборот) КАК КоличествоОстаток,
		|	ВтПеремищениеЗапасов.Количество КАК Количество,
		|	ВтПеремищениеЗапасов.ВидДвижения КАК ВидДвижения,
		|	ВтПеремищениеЗапасов.Период КАК Период,
		|	ВтПеремищениеЗапасов.Организация КАК Организация,
		|	ВтПеремищениеЗапасов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ВтПеремищениеЗапасов.Номенклатура КАК Номенклатура,
		|	ВтПеремищениеЗапасов.Характеристика КАК Характеристика,
		|	КонтрольСроковГодностиТовараОбороты.Документ КАК Документ,
		|	КонтрольСроковГодностиТовараОбороты.СрокГодности КАК СрокГодности,
		|	КонтрольСроковГодностиТовараОбороты.Документ КАК ДокументСписания
		|ПОМЕСТИТЬ ВТПриход
		|ИЗ
		|	ВтПеремищениеЗапасов КАК ВтПеремищениеЗапасов,
		|	РегистрНакопления.КонтрольСроковГодностиТовара.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			Организация = &Организация
		|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И (Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						ВтПеремищениеЗапасов.Номенклатура КАК Номенклатура,
		|						ВтПеремищениеЗапасов.Характеристика КАК Характеристика
		|					ИЗ
		|						ВтПеремищениеЗапасов КАК ВтПеремищениеЗапасов)) КАК КонтрольСроковГодностиТовараОбороты
		|ГДЕ
		|	КонтрольСроковГодностиТовараОбороты.Регистратор <> &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	КонтрольСроковГодностиТовараОбороты.СрокГодности,
		|	ВтПеремищениеЗапасов.Количество,
		|	ВтПеремищениеЗапасов.Характеристика,
		|	ВтПеремищениеЗапасов.Номенклатура,
		|	ВтПеремищениеЗапасов.СтруктурнаяЕдиница,
		|	ВтПеремищениеЗапасов.Период,
		|	ВтПеремищениеЗапасов.Организация,
		|	ВтПеремищениеЗапасов.ВидДвижения,
		|	КонтрольСроковГодностиТовараОбороты.Документ,
		|	КонтрольСроковГодностиТовараОбороты.Документ
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтрольСроковГодностиТовараОбороты.СрокГодности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТПриход.КоличествоОстаток) КАК КоличествоОстаток,
		|	ВТПриход.Количество КАК Количество,
		|	ВТПриход.ВидДвижения КАК ВидДвижения,
		|	ВТПриход.Период КАК Период,
		|	ВТПриход.Организация КАК Организация,
		|	ВТПриход.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ВТПриход.Номенклатура КАК Номенклатура,
		|	ВТПриход.Характеристика КАК Характеристика,
		|	ВТПриход.Документ КАК Документ,
		|	ВТПриход.ДокументСписания КАК ДокументСписания,
		|	ВТПриход.СрокГодности КАК СрокГодности
		|ИЗ
		|	ВТПриход КАК ВТПриход
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТПриход.Документ,
		|	ВТПриход.Номенклатура,
		|	ВТПриход.СтруктурнаяЕдиница,
		|	ВТПриход.ВидДвижения,
		|	ВТПриход.Период,
		|	ВТПриход.Организация,
		|	ВТПриход.Характеристика,
		|	ВТПриход.ДокументСписания,
		|	ВТПриход.Количество,
		|	ВТПриход.СрокГодности
		|ИТОГИ
		|	СУММА(КоличествоОстаток),
		|	МАКСИМУМ(Количество)
		|ПО
		|	Номенклатура";
		
		Запрос.УстановитьПараметр("ТзЗапасы",ТзЗапасы);
		Запрос.УстановитьПараметр("Регистратор",ДокументСсылкаПеремещениеЗапасов);	
		Запрос.УстановитьПараметр("Организация",ДокументСсылкаПеремещениеЗапасов.Организация);
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница",ДокументСсылкаПеремещениеЗапасов.СтруктурнаяЕдиница);
		
		ВыборкаНоменклатура = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаНоменклатура.Следующий() Цикл
			КоличествоПогасить= 0;
			КоличествоПогасить = ВыборкаНоменклатура.Количество;
			
			ВыборкаПродажи = ВыборкаНоменклатура.Выбрать(); 		
			Пока ВыборкаПродажи.Следующий() Цикл
				Если Не ВыборкаПродажи.КоличествоОстаток > 0 Тогда
					Продолжить;
				КонецЕсли;
				Если   КоличествоПогасить <> Null Тогда 
					Если КоличествоПогасить >0 Тогда  
						стрЗапасы = КопияТаблицаЗапасы.Добавить();
						ЗаполнитьЗначенияСвойств(стрЗапасы,ВыборкаПродажи);
						стрЗапасы.Количество = Мин(ВыборкаПродажи.КоличествоОстаток,КоличествоПогасить);
						КоличествоПогасить 	 = КоличествоПогасить - ВыборкаПродажи.КоличествоОстаток;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		КопияТаблици = КопияТаблицаЗапасы.Скопировать();
		
		Для Каждого Ст из КопияТаблици Цикл 	
			стрЗапасы = КопияТаблицаЗапасы.Добавить();
			ЗаполнитьЗначенияСвойств(стрЗапасы,Ст);
			стрЗапасы.ВидДвижения = ВидДвиженияНакопления.Расход;
			стрЗапасы.Документ = Ст.ДокументСписания;
			стрЗапасы.СтруктурнаяЕдиница = ДокументСсылкаПеремещениеЗапасов.СтруктурнаяЕдиница;	
		КонецЦикла;
		
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаКонтрольСроковГодностиТовара", КопияТаблицаЗапасы);
		
	ИначеЕсли ДокументСсылкаПеремещениеЗапасов.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы Тогда  
		
		КопияТаблицаЗапасы = Новый ТаблицаЗначений;
		КопияТаблицаЗапасы.Колонки.Добавить("Организация");
		КопияТаблицаЗапасы.Колонки.Добавить("СтруктурнаяЕдиница");
		КопияТаблицаЗапасы.Колонки.Добавить("Документ");
		КопияТаблицаЗапасы.Колонки.Добавить("Номенклатура");
		КопияТаблицаЗапасы.Колонки.Добавить("Характеристика");
		КопияТаблицаЗапасы.Колонки.Добавить("Количество");
		КопияТаблицаЗапасы.Колонки.Добавить("Период");
		КопияТаблицаЗапасы.Колонки.Добавить("ВидДвижения");	
		КопияТаблицаЗапасы.Колонки.Добавить("СрокГодности");
		КопияТаблицаЗапасы.Колонки.Добавить("ДокументСписания"); 
		
		ТзЗапасы = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыНаСкладах;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВТЗапаси.Количество КАК Количество,
		|	ВТЗапаси.ВидДвижения КАК ВидДвижения,
		|	ВТЗапаси.Период КАК Период,
		|	ВТЗапаси.Организация КАК Организация,
		|	ВТЗапаси.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ВТЗапаси.Номенклатура КАК Номенклатура,
		|	ВТЗапаси.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТЗапаси
		|ИЗ
		|	&ТзЗапасы КАК ВТЗапаси
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТЗапаси.Количество КАК Количество,
		|	ВТЗапаси.ВидДвижения КАК ВидДвижения,
		|	ВТЗапаси.Период КАК Период,
		|	ВТЗапаси.Организация КАК Организация,
		|	ВТЗапаси.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ВТЗапаси.Номенклатура КАК Номенклатура,
		|	ВТЗапаси.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВтПеремищениеЗапасов
		|ИЗ
		|	ВТЗапаси КАК ВТЗапаси
		|ГДЕ
		|	ВТЗапаси.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 3000000
		|	СУММА(КонтрольСроковГодностиТовараОбороты.КоличествоОборот) КАК КоличествоОстаток,
		|	ВтПеремищениеЗапасов.Количество КАК Количество,
		|	ВтПеремищениеЗапасов.ВидДвижения КАК ВидДвижения,
		|	ВтПеремищениеЗапасов.Период КАК Период,
		|	ВтПеремищениеЗапасов.Организация КАК Организация,
		|	ВтПеремищениеЗапасов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ВтПеремищениеЗапасов.Номенклатура КАК Номенклатура,
		|	ВтПеремищениеЗапасов.Характеристика КАК Характеристика,
		|	КонтрольСроковГодностиТовараОбороты.Документ КАК Документ,
		|	КонтрольСроковГодностиТовараОбороты.СрокГодности КАК СрокГодности,
		|	КонтрольСроковГодностиТовараОбороты.Документ КАК ДокументСписания
		|ПОМЕСТИТЬ ВТПриход
		|ИЗ
		|	ВтПеремищениеЗапасов КАК ВтПеремищениеЗапасов,
		|	РегистрНакопления.КонтрольСроковГодностиТовара.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			Организация = &Организация
		|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И (Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						ВтПеремищениеЗапасов.Номенклатура КАК Номенклатура,
		|						ВтПеремищениеЗапасов.Характеристика КАК Характеристика
		|					ИЗ
		|						ВтПеремищениеЗапасов КАК ВтПеремищениеЗапасов)) КАК КонтрольСроковГодностиТовараОбороты
		|ГДЕ
		|	КонтрольСроковГодностиТовараОбороты.Регистратор <> &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	КонтрольСроковГодностиТовараОбороты.СрокГодности,
		|	ВтПеремищениеЗапасов.Количество,
		|	ВтПеремищениеЗапасов.Характеристика,
		|	ВтПеремищениеЗапасов.Номенклатура,
		|	ВтПеремищениеЗапасов.СтруктурнаяЕдиница,
		|	ВтПеремищениеЗапасов.Период,
		|	ВтПеремищениеЗапасов.Организация,
		|	ВтПеремищениеЗапасов.ВидДвижения,
		|	КонтрольСроковГодностиТовараОбороты.Документ,
		|	КонтрольСроковГодностиТовараОбороты.Документ
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтрольСроковГодностиТовараОбороты.СрокГодности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТПриход.КоличествоОстаток) КАК КоличествоОстаток,
		|	ВТПриход.Количество КАК Количество,
		|	ВТПриход.ВидДвижения КАК ВидДвижения,
		|	ВТПриход.Период КАК Период,
		|	ВТПриход.Организация КАК Организация,
		|	ВТПриход.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ВТПриход.Номенклатура КАК Номенклатура,
		|	ВТПриход.Характеристика КАК Характеристика,
		|	ВТПриход.Документ КАК Документ,
		|	ВТПриход.ДокументСписания КАК ДокументСписания,
		|	ВТПриход.СрокГодности КАК СрокГодности
		|ИЗ
		|	ВТПриход КАК ВТПриход
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТПриход.Документ,
		|	ВТПриход.Номенклатура,
		|	ВТПриход.СтруктурнаяЕдиница,
		|	ВТПриход.ВидДвижения,
		|	ВТПриход.Период,
		|	ВТПриход.Организация,
		|	ВТПриход.Характеристика,
		|	ВТПриход.ДокументСписания,
		|	ВТПриход.Количество,
		|	ВТПриход.СрокГодности
		|ИТОГИ
		|	СУММА(КоличествоОстаток),
		|	МАКСИМУМ(Количество)
		|ПО
		|	Номенклатура";
		
		Запрос.УстановитьПараметр("ТзЗапасы",ТзЗапасы);
		Запрос.УстановитьПараметр("Регистратор",ДокументСсылкаПеремещениеЗапасов);	
		Запрос.УстановитьПараметр("Организация",ДокументСсылкаПеремещениеЗапасов.Организация);
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница",ДокументСсылкаПеремещениеЗапасов.СтруктурнаяЕдиница);
		
		ВыборкаНоменклатура = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаНоменклатура.Следующий() Цикл
			КоличествоПогасить= 0;
			КоличествоПогасить = ВыборкаНоменклатура.Количество;
			
			ВыборкаПродажи = ВыборкаНоменклатура.Выбрать(); 		
			Пока ВыборкаПродажи.Следующий() Цикл
				Если Не ВыборкаПродажи.КоличествоОстаток > 0 Тогда
					Продолжить;
				КонецЕсли;
				Если   КоличествоПогасить <> Null Тогда 
					Если КоличествоПогасить >0 Тогда  
						стрЗапасы = КопияТаблицаЗапасы.Добавить();
						ЗаполнитьЗначенияСвойств(стрЗапасы,ВыборкаПродажи);
						стрЗапасы.Количество = Мин(ВыборкаПродажи.КоличествоОстаток,КоличествоПогасить);
						КоличествоПогасить 	 = КоличествоПогасить - ВыборкаПродажи.КоличествоОстаток;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаКонтрольСроковГодностиТовара", КопияТаблицаЗапасы);
			
	КонецЕсли;

КонецПроцедуры

Функция ПолучитСрокГодности(Документ,Номенклатура,ДокументСсылка)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	Запасы.СрокГодности КАК СрокГодности
	|ИЗ
	|	Документ.%1.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.Ссылка = &Ссылка
	|	И Запасы.Номенклатура = &Номенклатура";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%1",Документ);
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	
	Резултат = Запрос.Выполнить().Выгрузить();
	
	Если Резултат.Количество() >  0 Тогда 
		
		Возврат  Резултат[0].СрокГодности ;
	Иначе 
		Возврат Неопределено
	КонецЕсли;

	  
КонецФункции

	


#Область ЗагрузкаДанныхИзВнешнегоИсточника

Процедура ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт
	
	//
	// Для группы полей действует правило: хотя бы одно поле в группе должно быть выбрано в колонках
	//
	
	ОписаниеТиповСтрока25 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(25));
	ОписаниеТиповСтрока30 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(30));
	ОписаниеТиповСтрока50 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50));
	ОписаниеТиповСтрока100 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100));
	ОписаниеТиповСтрока150 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(150));
	ОписаниеТиповСтрока200 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(200));
	ОписаниеТиповСтрока1000 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1000));
	ОписаниеТиповЧисло15_2 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповЧисло15_3 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповДата = Новый ОписаниеТипов("Дата", , , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Штрихкод", НСтр("en='Barcode';ka='შტრიხ კოდი';ru='Штрихкод'"), ОписаниеТиповСтрока200, ОписаниеТиповКолонка, "Номенклатура", 1, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Артикул", НСтр("en='OptionCode';ka='არტიკული';ru='Артикул'"), ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 2, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименование", НСтр("ka='ნომენკლატურა (დასახელება)';ru='Номенклатура (наименование)';en='Nomenclature (name)'"), ОписаниеТиповСтрока100, ОписаниеТиповКолонка, "Номенклатура", 3, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименованиеПолное",НСтр("ka='ნომენკლატურა (სრული დასახელება)';ru='Номенклатура (полное наименование';en='Nomenclature (full name'"), ОписаниеТиповСтрока1000, ОписаниеТиповКолонка, "Номенклатура", 5, , Истина);
	
	//ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Содержание",  НСтр("en='Content';ka='შინაარსი';ru='Содержание'"), ОписаниеТиповСтрока1000, ОписаниеТиповСтрока1000, , , , , НастройкиЗагрузкиДанных.СодержаниеВидимо);
	
	
	//НСтр("ru='';ka=''");
	Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		
		ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры");
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Характеристика",  НСтр("ru = 'Характеристика (наименование)'; ka = 'მახასიათებელი  (დასახელება)'; en = 'Characteristics (name)'"), ОписаниеТиповСтрока150, ОписаниеТиповКолонка);
		
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПартии") Тогда
		
		ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ПартииНоменклатуры");
		ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Партия", НСтр("ka='პარტია (დასახელება)';ru='Партия (наименование)';en='Party (name)'"), ОписаниеТиповСтрока100, ОписаниеТиповКолонка);
		
	КонецЕсли;
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Количество",  НСтр("en='Quantity';ka='რაოდენობა';ru='Количество'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_3, , , Истина);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Резерв", НСтр("ka='რეზერვი';ru='Резерв';en='Резерв'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_3, , , , , ПолучитьФункциональнуюОпцию("РезервированиеЗапасов"));
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения, СправочникСсылка.ЕдиницыИзмерения");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "ЕдиницаИзмерения", НСтр("en='Unit Measurement';ka='საზომი ერთეული';ru='Ед. изм.'"), ОписаниеТиповСтрока25, ОписаниеТиповКолонка, , , , , ПолучитьФункциональнуюОпцию("УчетВРазличныхЕдиницахИзмерения"));
	
	//ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Цена", НСтр("en='Price';ka='ფასი';ru='Цена'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2, , , Ложь);
	
	//ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС");
	//ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СтавкаНДС", НСтр("ka='დღგ';ru='Ставка НДС';en='VAT Rate'"), ОписаниеТиповСтрока50, ОписаниеТиповКолонка);
	//
	//ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СуммаНДС",  НСтр("en='VAT Amount';ka='დღგ-ს თანხა';ru='Сумма НДС'"), ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2);
	
	//МассивТипов = Новый Массив;
	//МассивТипов.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	//МассивТипов.Добавить(Тип("ДокументСсылка.ЗаказПоставщику"));
	//
	//ВидимостьЗаказаПокупателя = (НастройкиЗагрузкиДанных.ПоложениеЗаказаВДокументе = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти);
	//ОписаниеТиповКолонка = Новый ОписаниеТипов(МассивТипов);
	//ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Заказ", НСтр("ka='შეკვეთა (მყიდველი/მომწოდებელი)';ru='Заказ (покупатель/поставщик)';en='Check (customer / supplier)'"), ОписаниеТиповСтрока50, ОписаниеТиповКолонка, , , , , ВидимостьЗаказаПокупателя);
	
	//Если ПолучитьФункциональнуюОпцию("УчетГТД") Тогда
	//	
	//	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.СтраныМира");
	//	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "СтранаПроисхождения", НСтр("en='Country of Origin';ka='მწარმოებელი ქვეყანა';ru='Страна происхождения'"), ОписаниеТиповСтрока100, ОписаниеТиповКолонка);
	//	
	//	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.НомераГТД");
	//	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НомерГТД", НСтр("ka='საბაჭო დეკლარაციის ნომერი';ru='Номер ГТД';en='Номер ГТД'"), ОписаниеТиповСтрока30, ОписаниеТиповКолонка);
	//	
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПриОпределенииОбразцовЗагрузкиДанных(НастройкиЗагрузкиДанных, УникальныйИдентификатор) Экспорт
	
	Образец_xlsx = ПолучитьМакет("ОбразецЗагрузкиДанных_xlsx");
	ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_xlsx", ОбразецЗагрузкиДанных_xlsx);
	
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_mxl", "ОбразецЗагрузкиДанных_mxl");
	
	Образец_csv = ПолучитьМакет("ОбразецЗагрузкиДанных_csv");
	ОбразецЗагрузкиДанных_csv = ПоместитьВоВременноеХранилище(Образец_csv, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_csv", ОбразецЗагрузкиДанных_csv);
	
КонецПроцедуры

Процедура СопоставитьЗагружаемыеДанныеИзВнешнегоИсточника(ТаблицаСопоставленияДанных, НастройкиЗагрузкиДанных) Экспорт
	
	ПолноеИмяОбъектаЗаполнения = НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;
	
	// ТаблицаСопоставленияДанных - Тип ДанныеФормыКоллекция
	Для каждого СтрокаТаблицыФормы Из ТаблицаСопоставленияДанных Цикл
		
		// Номенклатура по ШтрихКоду, Артикулу, Наименованию, НаименованиеПолное
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьНоменклатуру(СтрокаТаблицыФормы.Номенклатура,СтрокаТаблицыФормы.Штрихкод,СтрокаТаблицыФормы.Артикул, СтрокаТаблицыФормы.НоменклатураНаименование, СтрокаТаблицыФормы.НоменклатураНаименованиеПолное);
		
		//// Содержание
		//ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СкопироватьСтрокуВЗначениеСтроковогоТипа(СтрокаТаблицыФормы.Содержание, СтрокаТаблицыФормы.Содержание_ВходящиеДанные);
		
		// Характеристика по Владельцу и Наименованию
		Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
			
			Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
				
				ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьХарактеристику(СтрокаТаблицыФормы.Характеристика, СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.Штрихкод, СтрокаТаблицыФормы.Характеристика_ВходящиеДанные);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Партия по Владельцу и Наименованию
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПартии") Тогда
			
			Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
				
				ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьПартию(СтрокаТаблицыФормы.Партия, СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.Штрихкод, СтрокаТаблицыФормы.Партия_ВходящиеДанные);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Количество
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Количество, СтрокаТаблицыФормы.Количество_ВходящиеДанные, 1);
		
		// Резерв
		Если ПолучитьФункциональнуюОпцию("РезервированиеЗапасов") Тогда
			
			ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Резерв, СтрокаТаблицыФормы.Резерв_ВходящиеДанные, 0);
			
		КонецЕсли;
		
		// ЕдиницыИзмерения по Наименованию (так же рассмотреть возможность прикрутить пользовательские ЕИ)
		ЗначениеПоУмолчанию = ?(ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура), СтрокаТаблицыФормы.Номенклатура.ЕдиницаИзмерения, Справочники.КлассификаторЕдиницИзмерения.шт);
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьЕдиницыИзмерения(СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.ЕдиницаИзмерения, СтрокаТаблицыФормы.ЕдиницаИзмерения_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		//// Цена
		//ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Цена, СтрокаТаблицыФормы.Цена_ВходящиеДанные, 0);
		//
		//// СтавкаНДС по наименованию
		//ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьСтавкуНДС(СтрокаТаблицыФормы.СтавкаНДС, СтрокаТаблицыФормы.СтавкаНДС_ВходящиеДанные, Неопределено);
		//
		//// СуммаНДС
		//ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.СуммаНДС, СтрокаТаблицыФормы.СуммаНДС_ВходящиеДанные, 0);
		//
		//// Заказ
		//ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьЗаказ(СтрокаТаблицыФормы.Заказ, СтрокаТаблицыФормы.Заказ_ВходящиеДанные);
		
		// Страна и ГТД
		//Если ПолучитьФункциональнуюОпцию("УчетГТД") Тогда
		//	
		//	ЗначениеПоУмолчанию = Неопределено;
		//	Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
		//		
		//		ЗначениеПоУмолчанию = СтрокаТаблицыФормы.Номенклатура.СтранаПроисхождения;
		//		
		//	КонецЕсли;
			
			//ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьСтрануПроисхождения(,, );
			//
			//Если ЗначениеЗаполнено(СтрокаТаблицыФормы.СтранаПроисхождения)
			//	И СтрокаТаблицыФормы.СтранаПроисхождения <> Справочники.СтраныМира.Россия Тогда
			//	
			//	ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьНомерГТД(СтрокаТаблицыФормы.НомерГТД, СтрокаТаблицыФормы.НомерГТД_ВходящиеДанные);
			//	
			//КонецЕсли;
			
		//КонецЕсли;
		
		ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения = "") Экспорт
	
	ИмяСлужебногоПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна();
	
	СтрокаТаблицыФормы[ИмяСлужебногоПоля] = ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура)
		И (СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас 
			//ИЛИ СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга)
		И СтрокаТаблицыФормы.Количество <> 0);
	
КонецПроцедуры

#КонецОбласти






