
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОчиститьСообщения();
	Для Каждого Док Из ПараметрКоманды Цикл
	    //Паганини#OneSoft_
		//Идентификатор = РС_ОбщегоНазначения.ПолучитьЗначениеРеквизита(Док, "Идентификатор");
		//Если Не ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИзменитьСтатусСчетФактуруНаПортале(Док,  Идентификатор, 1) = Неопределено Тогда
		//	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОбновитьИдентификаторИСтатусДокументаСФ(Док, Идентификатор, 1, Истина);
		ЗначенияРеквизитов = ПроверкаДляКорректировачнойСчетФактуры(Док);
		Если ЗначенияРеквизитов = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если Не ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИзменитьСтатусСчетФактуруНаПортале(Док,  ЗначенияРеквизитов.Идентификатор, ЗначенияРеквизитов.СтатусСФ) = Неопределено Тогда
			ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОбновитьИдентификаторИСтатусДокументаСФ(Док, ЗначенияРеквизитов.Идентификатор, ЗначенияРеквизитов.СтатусСФ, Истина);
		//_Паганини#OneSoft
		КонецЕсли;
		ОповеститьОбИзменении(Док);
	КонецЦикла;
	
	Оповестить("ПерепрочитатьФорму");
	
	Состояние(НСтр("ka='RS.GE-ს სერვერთან მუშაობა დასრულებულია';ru='Работа с сервером RS.GE завершена';en='Working with server RS.GE completed'"));
	
КонецПроцедуры

&НаСервере
Функция ПроверкаДляКорректировачнойСчетФактуры(Док)
	
	ЗначенияРеквизитов = Новый Структура;
	ЗначенияРеквизитов.Вставить("Идентификатор",	Док.Идентификатор);
	ЗначенияРеквизитов.Вставить("СтатусСФ",			?(Док.Корректировочная, 5, 1));
	
	Если Док.Корректировочная Тогда
		Если Док.Идентификатор = 0 Тогда
			Сообщить("დოკუმენტისთვის """ +Строка(Док)+ """ ჯერ არ არის შესრულებული შენახვის ბრძანება.");
			Возврат Неопределено;
		КонецЕсли;
		ОснованиеКорректировки = Док.ОснованиеКорректировки;
		ЗначенияРеквизитов.Вставить("ОснованиеКорректировки", ОснованиеКорректировки);
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОбновитьСтатусСФ(ОснованиеКорректировки);
		ОснованиеКорректировки_Статус 	= ОснованиеКорректировки.Статус;
		Если ОснованиеКорректировки_Статус = Перечисления.СтатусыСФ.Подтвержденная ИЛИ 
			 ОснованиеКорректировки_Статус = Перечисления.СтатусыСФ.ПодтвержденнаяКорректировочная ИЛИ
			 ОснованиеКорректировки_Статус = Перечисления.СтатусыСФ.Первичная Тогда
			Возврат ЗначенияРеквизитов;
		КонецЕсли;
	Иначе
		Возврат ЗначенияРеквизитов;
	КонецЕсли;
	
	Сообщить("განაახლეთ დასაკორექტირებელი ფაქტურის სტატუსი. დასაკორექტირებელ დოკუმენტს """ + ОснованиеКорректировки + """ არ უნდა ჰქონდეს სტატუსი """
			 +ОснованиеКорректировки_Статус+ """.");
	Возврат Неопределено;
	
КонецФункции