
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОчиститьСообщения();
	Для Каждого Док Из ПараметрКоманды Цикл
		Идентификатор = РС_ОбщегоНазначения.ПолучитьЗначениеРеквизита(Док, "Идентификатор");
		Если Не ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИзменитьСтатусСчетФактуруНаПортале(Док,  Идентификатор, 1) = Неопределено Тогда
			ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОбновитьИдентификаторИСтатусДокументаСФ(Док, Идентификатор, 1, Истина);
		КонецЕсли;
		ОповеститьОбИзменении(Док);
	КонецЦикла;
	
	Оповестить("ПерепрочитатьФорму");
	
	Состояние(НСтр("ka='RS.GE-ს სერვერთან მუშაობა დასრულებულია';ru='Работа с сервером RS.GE завершена'"));
	
КонецПроцедуры
