Функция ВосстановлениеJSON(Свойство, Значение, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если Свойство = "orderdate" Тогда
		//"01/11/2018 16:17:33"
		//переводим в формат YYYYMMDDHHMMSS
		Г=Сред(Значение,7,4);
		М=Сред(Значение,4,2);
		Д=Лев(Значение,2);
		ч=Сред(Значение,12,2);
		мн=Сред(Значение,15,2);
		с=Прав(Значение,2);
		Возврат Дата(г+м+д+ч+мн+с);
	ИначеЕсли Свойство="price" ИЛИ Свойство="quantity" ИЛИ Свойство="unitpriceprice" Тогда
		Возврат Число(Значение);
	ИначеЕсли Свойство = "ДатаОбмена" Тогда	
		//"01/11/2018 16:17:33"
		//переводим в формат YYYYMMDDHHMMSS
		Г=Сред(Значение,7,4);
		М=Сред(Значение,4,2);
		Д=Лев(Значение,2);
		ч="00";
		мн="00";
		с="00";
		Возврат Дата(г+м+д+ч+мн+с);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

//Процедура выполняется в фоне после загрузки данных из удаленных рабочих мест в регистры ПМ_РозничныеПродажи и ПМ_РозничныеПродажи_Оплата
//В справочнике Номенклатура поставщика обновляется номенклатура
//в регистре ПМ_РозничныеПродажи заполняется номенклатура и единица измерения
Процедура ЗаполнитьНоменклатуруПоставщика(ПараметрыОбмена, АдресРезультата = Неопределено) Экспорт
	КассаККМ=ПараметрыОбмена.КассаККМ;
	ДатаОбмена=ПараметрыОбмена.ДатаОбмена;
	Если ТипЗнч(ДатаОбмена)=Тип("Строка") Тогда
	  ДатаОбмена=ВосстановлениеJSON("ДатаОбмена",ДатаОбмена);
	КонецЕсли; 
	тз=ПолучитьТаблицуСоответствий(КассаККМ, ДатаОбмена);
	Рег=РегистрыСведений.ПМ_РозничныеПродажи.СоздатьНаборЗаписей();
	Для каждого Выборка Из тз Цикл
		Рег.Отбор.КассаККМ.Установить(КассаККМ);
		Рег.Отбор.ДатаОбмена.Установить(ДатаОбмена);
		Рег.Отбор.Номенклатура_Наименование.Установить(Выборка.Номенклатура_Наименование);
		Рег.Отбор.Номенклатура_Код.Установить(Выборка.Номенклатура_Код);
		Рег.Отбор.ЕдиницаИзмерения_Наименование.Установить(Выборка.ЕдиницаИзмерения_Наименование);
		Рег.Прочитать();
		Записан=Ложь;
		Для каждого стр Из рег Цикл
		  Если ЗначениеЗаполнено(стр.Номенклатура) И ЗначениеЗаполнено(стр.ЕдиницаИзмерения) Тогда
			  Продолжить;
			КонецЕсли; 
			ЗаполнитьЗначенияСвойств(стр,Выборка,"Номенклатура,ЕдиницаИзмерения");		
			Записан=Истина;
		КонецЦикла; 
		Если Записан Тогда
			Попытка
		  	Рег.Записать();
			Исключение
				Сообщить(ОписаниеОшибки());
				Возврат;
			КонецПопытки;			
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

//Все=Ложь - возвращает таблицу номенклатуры, у которой найдено соответствие
//Все=Истина - возвращает все записи регистра
Функция ПолучитьТаблицуСоответствий(КассаККМ, ДатаОбмена, Все=Ложь) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	&КассаККМ,
	|	&ДатаОбмена,
	|	ПМ_РозничныеПродажи.Номенклатура_Код,
	|	ПМ_РозничныеПродажи.Номенклатура_Наименование,
	|	ПМ_РозничныеПродажи.ЕдиницаИзмерения_Наименование,
	|	СУММА(ПМ_РозничныеПродажи.Количество) КАК Количество,
	|	СУММА(ПМ_РозничныеПродажи.Сумма) КАК Сумма,
	|	ПМ_РозничныеПродажи.Номенклатура,
	|	ПМ_РозничныеПродажи.ЕдиницаИзмерения
	|ПОМЕСТИТЬ рег
	|ИЗ
	|	РегистрСведений.ПМ_РозничныеПродажи КАК ПМ_РозничныеПродажи
	|ГДЕ
	|	ПМ_РозничныеПродажи.КассаККМ = &КассаККМ
	|	И ПМ_РозничныеПродажи.ДатаОбмена = &ДатаОбмена
	|
	|СГРУППИРОВАТЬ ПО
	|	ПМ_РозничныеПродажи.Номенклатура_Код,
	|	ПМ_РозничныеПродажи.Номенклатура_Наименование,
	|	ПМ_РозничныеПродажи.ЕдиницаИзмерения_Наименование,
	|	ПМ_РозничныеПродажи.Номенклатура,
	|	ПМ_РозничныеПродажи.ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(НоменклатураККМ.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК знНоменклатура,
	|	рег.КассаККМ,
	|	рег.ДатаОбмена,
	|	рег.Номенклатура_Код,
	|	рег.Номенклатура_Наименование,
	|	рег.ЕдиницаИзмерения_Наименование,
	|	рег.Количество,
	|	рег.Сумма,
	|	ВЫБОР
	|		КОГДА рег.ЕдиницаИзмерения = НЕОПРЕДЕЛЕНО
	|				ИЛИ рег.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|				ИЛИ рег.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(НоменклатураККМ.Номенклатура.ЕдиницаИзмерения, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ рег.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ спр_ККМ
	|ИЗ
	|	рег КАК рег
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураККМ КАК НоменклатураККМ
	|		ПО рег.Номенклатура_Код = НоменклатураККМ.Идентификатор
	|			И рег.Номенклатура_Наименование = НоменклатураККМ.Наименование
	|			И (НЕ НоменклатураККМ.ПометкаУдаления)
	|ГДЕ
	|	НЕ НоменклатураККМ.Номенклатура ЕСТЬ NULL
	|	И НоменклатураККМ.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И НоменклатураККМ.Владелец = &КассаККМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	спр_ККМ.знНоменклатура КАК знНоменклатура,
	|	спр_ККМ.КассаККМ,
	|	спр_ККМ.ДатаОбмена,
	|	спр_ККМ.Номенклатура_Код,
	|	спр_ККМ.Номенклатура_Наименование,
	|	спр_ККМ.ЕдиницаИзмерения_Наименование,
	|	спр_ККМ.Количество,
	|	спр_ККМ.Сумма,
	|	спр_ККМ.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ спр
	|ИЗ
	|	спр_ККМ КАК спр_ККМ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НоменклатураККМ.Номенклатура,
	|	спр_ККМ.КассаККМ,
	|	спр_ККМ.ДатаОбмена,
	|	спр_ККМ.Номенклатура_Код,
	|	спр_ККМ.Номенклатура_Наименование,
	|	спр_ККМ.ЕдиницаИзмерения_Наименование,
	|	спр_ККМ.Количество,
	|	спр_ККМ.Сумма,
	|	ВЫБОР
	|		КОГДА спр_ККМ.ЕдиницаИзмерения = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЕСТЬNULL(НоменклатураККМ.Номенклатура.ЕдиницаИзмерения, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ спр_ККМ.ЕдиницаИзмерения
	|	КОНЕЦ
	|ИЗ
	|	спр_ККМ КАК спр_ККМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураККМ КАК НоменклатураККМ
	|		ПО спр_ККМ.Номенклатура_Код = НоменклатураККМ.Идентификатор
	|			И спр_ККМ.Номенклатура_Наименование = НоменклатураККМ.Наименование
	|ГДЕ
	|	НЕ НоменклатураККМ.Номенклатура ЕСТЬ NULL
	|	И НоменклатураККМ.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И НоменклатураККМ.Владелец <> &КассаККМ
	|	И спр_ККМ.знНоменклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	спр.Номенклатура_Код,
	|	спр.Номенклатура_Наименование,
	|	спр.знНоменклатура,
	|	спр.ЕдиницаИзмерения_Наименование,
	|	спр.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	спр.Количество,
	|	спр.Сумма,
	|	спр.КассаККМ,
	|	спр.ДатаОбмена,
	|	ВЫБОР
	|		КОГДА спр.знНоменклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				ИЛИ спр.ЕдиницаИзмерения = НЕОПРЕДЕЛЕНО
	|				ИЛИ спр.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|				ИЛИ спр.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Флаг
	|ПОМЕСТИТЬ спрНоменклатураПоставщика
	|ИЗ
	|	спр КАК спр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	спрНоменклатураПоставщика.ЕдиницаИзмерения,
	|	спрНоменклатураПоставщика.КассаККМ,
	|	спрНоменклатураПоставщика.ДатаОбмена,
	|	спрНоменклатураПоставщика.Номенклатура_Код,
	|	спрНоменклатураПоставщика.Номенклатура_Наименование КАК Номенклатура_Наименование,
	|	спрНоменклатураПоставщика.ЕдиницаИзмерения_Наименование КАК ЕдиницаИзмерения_Наименование,
	|	спрНоменклатураПоставщика.знНоменклатура КАК Номенклатура,
	|	спрНоменклатураПоставщика.Количество КАК Количество,
	|	спрНоменклатураПоставщика.Сумма КАК Сумма,
	|	спрНоменклатураПоставщика.Флаг
	|ИЗ
	|	спрНоменклатураПоставщика КАК спрНоменклатураПоставщика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	рег.ЕдиницаИзмерения,
	|	рег.КассаККМ,
	|	рег.ДатаОбмена,
	|	рег.Номенклатура_Код,
	|	рег.Номенклатура_Наименование,
	|	рег.ЕдиницаИзмерения_Наименование,
	|	рег.Номенклатура,
	|	рег.Количество,
	|	рег.Сумма,
	|	ВЫБОР
	|		КОГДА рег.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				ИЛИ рег.ЕдиницаИзмерения = НЕОПРЕДЕЛЕНО
	|				ИЛИ рег.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|				ИЛИ рег.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|ИЗ
	|	рег КАК рег
	|		ЛЕВОЕ СОЕДИНЕНИЕ спрНоменклатураПоставщика КАК спрНоменклатураПоставщика
	|		ПО рег.КассаККМ = спрНоменклатураПоставщика.КассаККМ
	|			И рег.ДатаОбмена = спрНоменклатураПоставщика.ДатаОбмена
	|			И рег.Номенклатура_Код = спрНоменклатураПоставщика.Номенклатура_Код
	|			И рег.Номенклатура_Наименование = спрНоменклатураПоставщика.Номенклатура_Наименование
	|			И рег.ЕдиницаИзмерения_Наименование = спрНоменклатураПоставщика.ЕдиницаИзмерения_Наименование
	|			И рег.Количество = спрНоменклатураПоставщика.Количество
	|			И рег.Сумма = спрНоменклатураПоставщика.Сумма
	|ГДЕ
	|	&Все = ИСТИНА
	|	И спрНоменклатураПоставщика.знНоменклатура ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("КассаККМ",КассаККМ);
	Запрос.УстановитьПараметр("ДатаОбмена",ДатаОбмена);
	Запрос.УстановитьПараметр("Все",Все);
  Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ПолучитьТаблицуСоответсвий()
 