
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаДокументов = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьКомпоновкуДанных(Истина);
	Выборка = Справочники.Организации.Выбрать();
	Если Выборка.Следующий() Тогда
		Организация = Выборка.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновкуДанных(ВсегдаИспользоватьНастройкиПоУмолчанию)
	
	СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Объект").ПолучитьМакет("СКДОтбора");
	
	URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	
	Компоновщик.Инициализировать(ИсточникНастроек);
	
	Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
					
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.КартыЛояльности.Очистить();

	СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Объект").ПолучитьМакет("СКДОтбора");
	
	ПараметрДатаотчета = Компоновщик.Настройки.ПараметрыДанных.Элементы.Найти("ДатаОтчета");
	Если ПараметрДатаотчета<>Неопределено Тогда
		 ПараметрДатаотчета.Значение = КонецДня(ДатаДокументов);
		 ПараметрДатаотчета.Использование = Истина;
	КонецЕсли;	
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Компоновщик.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТЗ = Новый ТаблицаЗначений;
	//ТЗ = ТаблицаОжиданий.Выгрузить();
	ТЗ = Объект.КартыЛояльности.Выгрузить();
	
	ПроцессорВывода.УстановитьОбъект(ТЗ);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	//ТаблицаОжиданий.Загрузить(ТЗ);	
	Объект.КартыЛояльности.Загрузить(ТЗ);	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	УстановитьСнятьФлажки(Ложь);
КонецПроцедуры
&НаКлиенте
Процедура УстановитьФлажки(Команда)
	УстановитьСнятьФлажки(Истина); 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьФлажки(знч_Загружать)
	
	Для каждого стрВыписки из Объект.КартыЛояльности Цикл
		Если Элементы.КартыЛояльности.ПроверитьСтроку(стрВыписки.ПолучитьИдентификатор()) ТОгда
			стрВыписки.Создать = знч_Загружать;
		КонецЕсли;	
	КонецЦикла;	
	
	//Малышев 2024-09-19 ONESOFT-3464 --)
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервере();
КонецПроцедуры


&НаСервере
Процедура СоздатьДокументыНаСервере()
	Об = РеквизитФормыВЗначение("Объект");

	КоличествоСозданныхДокументов = 0;
	МассивСтрок = Об.КартыЛояльности.НайтиСтроки(Новый Структура("Создать", Истина));
	Для каждого СтрокаМассива из МассивСтрок Цикл
		
		Если ЗначениеЗаполнено(СтрокаМассива.Документ) ТОгда
			Продолжить;
		КонецЕсли;	
		
		док = Документы.СписаниеБалловЛояльности.СоздатьДокумент();
		
		СтруктураЗаполнения = Новый Структура;
		СтруктураЗаполнения.Вставить("Дата", СтрокаМассива.Дата);
		СтруктураЗаполнения.Вставить("Организация", Организация);
		СтруктураЗаполнения.Вставить("Контрагент", СтрокаМассива.Контрагент);
		СтруктураЗаполнения.Вставить("Договор", СтрокаМассива.Договор);
		СтруктураЗаполнения.Вставить("Подразделение", СтруктурнаяЕдиница);
		СтруктураЗаполнения.Вставить("КартаЛояльности", СтрокаМассива.КартаЛояльности);
		СтруктураЗаполнения.Вставить("Автор", ПараметрыСеанса.ТекущийПользователь);
		
		СтруктураЗаполнения.Вставить("ВалютаДокумента", Константы.ВалютаУчета.Получить());
		СтруктураЗаполнения.Вставить("Курс", 1);
		СтруктураЗаполнения.Вставить("Кратность", 1);
		СтруктураЗаполнения.Вставить("НалогообложениеНДС", Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС);
		СтруктураЗаполнения.Вставить("ОсновнаяСтавкаНДС", Справочники.СтавкиНДС.НДС18);
		СтруктураЗаполнения.Вставить("СуммаВключаетНДС", Истина);
		
		Таб = Новый ТаблицаЗначений;
		Таб.Колонки.Добавить("Количество");
		Таб.Колонки.Добавить("Сумма");
		Таб.Колонки.Добавить("СуммаНДС");
		Таб.Колонки.Добавить("Всего");
		НовСтрока = Таб.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаМассива);
		СтруктураЗаполнения.Вставить("КартыЛояльностиДолги", Таб);
		
		док.Заполнить(СтруктураЗаполнения);
		
		док.Записать(РежимЗаписиДокумента.Проведение);
		КоличествоСозданныхДокументов = КоличествоСозданныхДокументов + 1;
		СтрокаМассива.Документ = Док.Ссылка;
	КонецЦикла;	
	
	ЗначениеВРеквизитФормы(Об,"Объект");
	Сообщить("Создано " + КоличествоСозданныхДокументов + " документов.");
КонецПроцедуры

