Процедура ЗаполнитьПланСчетов() Экспорт

	Макет = ПолучитьМакет("ПланСчетов");
	
	КрайняяЗапись = Ложь;
	НомерСтроки = 2;
	
	МассивВидовСубконто = Новый Массив;
	МассивИменВидовСубконто = Новый Массив;
	Выборка = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		//МассивИменВидовСубконто.Добавить(Выборка.Ссылка.ИмяПредопределенныхДанных);
		МассивИменВидовСубконто.Добавить(Выборка.Наименование);
		МассивВидовСубконто.Добавить(Выборка.Ссылка)
		
	КонецЦикла; 

	Пока Истина Цикл
	
		КодСчета = СокрЛП(Макет.Область(НомерСтроки, 1, НомерСтроки, 1).Текст);
		Если КодСчета = "" Тогда
		
			Прервать;
		
		КонецЕсли; 
		
		СчетСсылка = ПланыСчетов.Хозрасчетный.НайтиПоКоду(КодСчета);
		Если СчетСсылка.Пустая() Тогда
		
			СчетОбъект = ПланыСчетов.Хозрасчетный.СоздатьСчет();
			СчетОбъект.Код = КодСчета;
			
		Иначе
			
			СчетОбъект = СчетСсылка.ПолучитьОбъект();
		
		КонецЕсли; 
		
		ВидСчетаСтрока = СокрЛП(Макет.Область(НомерСтроки, 6, НомерСтроки, 6).Текст);
		ВалютныйСтрока = СокрЛП(Макет.Область(НомерСтроки, 7, НомерСтроки, 7).Текст);
		КоличественныйСтрока = СокрЛП(Макет.Область(НомерСтроки, 8, НомерСтроки, 8).Текст);
		ЗабалансовыйСтрока = СокрЛП(Макет.Область(НомерСтроки, 10, НомерСтроки, 10).Текст);
		ЗапретитьИспользоватьВПроводкахСтрока = СокрЛП(Макет.Область(НомерСтроки, 12, НомерСтроки, 12).Текст);
		
		СчетОбъект.Валютный = ?(ВалютныйСтрока = "1", Истина, Ложь);
		СчетОбъект.Количественный = ?(КоличественныйСтрока = "1", Истина, Ложь);
		СчетОбъект.Забалансовый = ?(ЗабалансовыйСтрока = "1", Истина, Ложь);
		СчетОбъект.ЗапретитьИспользоватьВПроводках = ?(ЗапретитьИспользоватьВПроводкахСтрока = "1", Истина, Ложь);
		
		Если ВидСчетаСтрока = "А" Тогда
			
			СчетОбъект.Вид = ВидСчета.Активный;
			
		ИначеЕсли ВидСчетаСтрока = "П" Тогда
			
			СчетОбъект.Вид = ВидСчета.Пассивный;
			
		ИначеЕсли ВидСчетаСтрока = "АП" Тогда	
			
			СчетОбъект.Вид = ВидСчета.АктивноПассивный;
		
		КонецЕсли; 
		
		СчетРодительСтрока = СокрЛП(Макет.Область(НомерСтроки, 9, НомерСтроки, 9).Текст);
		СчетОбъект.Родитель = ПланыСчетов.Хозрасчетный.НайтиПоКоду(СчетРодительСтрока);
		
		Субконто1Строка = СокрЛП(Макет.Область(НомерСтроки, 3, НомерСтроки, 3).Текст);
		Субконто2Строка = СокрЛП(Макет.Область(НомерСтроки, 4, НомерСтроки, 4).Текст);
		Субконто3Строка = СокрЛП(Макет.Область(НомерСтроки, 5, НомерСтроки, 5).Текст);
		
		
		ИндексСубконто = МассивИменВидовСубконто.Найти(Субконто1Строка);
		Если ИндексСубконто <> Неопределено Тогда
			
			ВидСубконто = МассивВидовСубконто.Получить(ИндексСубконто);
			
			Если СчетОбъект.ВидыСубконто.Найти(ВидСубконто, "ВидСубконто") = Неопределено Тогда
			
				НовыйВидСубконто = СчетОбъект.ВидыСубконто.Добавить();
				НовыйВидСубконто.ВидСубконто = ВидСубконто;
				НовыйВидСубконто.Суммовой = Истина;
			
			КонецЕсли; 
		
		КонецЕсли; 
		
		
		ИндексСубконто = МассивИменВидовСубконто.Найти(Субконто2Строка);
		Если ИндексСубконто <> Неопределено Тогда
		
			ВидСубконто = МассивВидовСубконто.Получить(ИндексСубконто);
			
			Если СчетОбъект.ВидыСубконто.Найти(ВидСубконто, "ВидСубконто") = Неопределено Тогда
			
				НовыйВидСубконто = СчетОбъект.ВидыСубконто.Добавить();
				НовыйВидСубконто.ВидСубконто = ВидСубконто;
				НовыйВидСубконто.Суммовой = Истина;
			
			КонецЕсли; 
		
		КонецЕсли; 
		
		ИндексСубконто = МассивИменВидовСубконто.Найти(Субконто3Строка);
		Если ИндексСубконто <> Неопределено Тогда
		
			ВидСубконто = МассивВидовСубконто.Получить(ИндексСубконто);
			
			Если СчетОбъект.ВидыСубконто.Найти(ВидСубконто, "ВидСубконто") = Неопределено Тогда
			
				НовыйВидСубконто = СчетОбъект.ВидыСубконто.Добавить();
				НовыйВидСубконто.ВидСубконто = ВидСубконто;
				НовыйВидСубконто.Суммовой = Истина;
			
			КонецЕсли; 
		
		КонецЕсли; 
		
		
		СчетОбъект.Наименование = СокрЛП(Макет.Область(НомерСтроки, 2, НомерСтроки, 2).Текст);
		СчетОбъект.КодБыстрогоВыбора = СокрЛП(Макет.Область(НомерСтроки, 11, НомерСтроки, 11).Текст);
		
		СчетОбъект.ОбменДанными.Загрузка = Истина;
		СчетОбъект.Записать();
		
		НомерСтроки = НомерСтроки + 1;
	
	КонецЦикла; 

КонецПроцедуры
 