
&После("НастройкиПрограммы")
Процедура РасшAzRy_НастройкиПрограммы(ТаблицаНастроек, Знач РежимРаботы)
	
	НоваяНастройка = Обработки.НастройкаПрограммы.ДобавитьНастройкуФлаг(ТаблицаНастроек,
		"ОтключениеКонтроляОстатковВДокументахДенежныхСредств",
		"ОбщиеНастройки",
		НСтр("ka='ნაშთების კონტროლის გათიშვა ბანკის  დოკუმენტებში ';ru='Отключение контроля остатков в документах денежных средств(РасходСоСчета)';en='ნაშთების კონტროლის გათიშვა ბანკის  დოკუმენტებში '"),
		НСтр("ka='.';ru='.';en='.'")
	);
	НоваяНастройка.ДобавлятьОтступ = Истина;
	НоваяНастройка.ПравоРедактирования = РежимРаботы.ЭтоАдминистраторПрограммы;	
	
КонецПроцедуры
