Функция СчетУчетаПотерьУжеСуществует(ТекущийСчетУчетаПотерь) ЭКСПОРТ
	ПЕРЕМ РЕЗ;
	
	РЕЗ = ИСТИНА;

	Если ТипЗНЧ(ТекущийСчетУчетаПотерь) = Тип ("ПланСчетовСсылка.Хозрасчетный") Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеНаПотери.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СписаниеНаПотери КАК СписаниеНаПотери
		|ГДЕ
		|	СписаниеНаПотери.СчетУчетаПотерь = &СчетУчетаПотерь";
		
		Запрос.УстановитьПараметр("СчетУчетаПотерь", ТекущийСчетУчетаПотерь);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		РЕЗ = НЕ РезультатЗапроса.Пустой();

	КонецЕсли;

	Возврат РЕЗ;
КонецФункции