
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Справочники.СписаниеНаПотери.СчетУчетаПотерьУжеСуществует(ЭтотОбъект.СчетУчетаПотерь) ИЛИ (НЕ ЗначениеЗаполнено(ЭтотОбъект.СчетУчетаПотерь)) Тогда
		
		ТекстСообщения = НСтр("ka='არ არის არჩეული ხარჯის ანგარიში.';ru='Неправильно выбран счет учета потерь.';en='არ არის არჩეული ხარჯის ანგარიში.'");
		
		РеквизитПроверки = "СчетУчетаПотерь";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,РеквизитПроверки,"Объект",Отказ);
	
	КонецЕсли;
	
КонецПроцедуры
