
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ ФОРМЫ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.СерверWorklogs = "pas.azrycloud.com";	
	Объ = РеквизитФормыВЗначение("Объект");
	Объ.WorklogResource = Объ.getMaxSelectVersion();
	ЗначениеВРеквизитФормы(Объ, "Объект");
	
КонецПроцедуры

#Область Accounts_and_AccountCategories

&НаКлиенте
Процедура ОбновитьТаблицуCategories(Команда)
	ОбновитьТаблицуCategoriesНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуCategoriesНаСервере()
	
	Объ = РеквизитФормыВЗначение("Объект");
	
	Ответ = Объ.GetAccountsAndAccountCategories();
	Если Ответ.ОщибкаСоединения Тогда // შეცდომა სერვერთან დაკავშირებისას
		Сообщить("შეცდომა სერვერთან დაკავშირებისას, მიზეზი: " + Ответ.Текст);
		Возврат;
	ИначеЕсли Ответ.ОщибкаКодСостояния Тогда // შეცდომა სერვერიდან დაბრუნებული კოდის პასუხის მიხედვით	
	    Сообщить("შეცდომა სერვერიდან დაბრუნებული კოდის (" + Ответ.HTTPЗапрос.КодСостояния + ") პასუხის მიხედვით, მიზეზი: " + Ответ.Текст);
		Возврат;
	КонецЕсли; 
		
	Объ.ДопИнфоКоличествоНовыхAccounts     = Ответ.ДопИнфо.КоличествоНовых;
	Объ.ДопИнфоКоличествоИзмененыхAccounts = Ответ.ДопИнфо.КоличествоИзмененые;
	
	ЗначениеВРеквизитФормы(Объ, "Объект");
	
КонецПроцедуры 

&НаКлиенте
Процедура СозданиеНовыхПроектов(Команда)
	СозданиеНовыхПроектовНаСервере();
	ОбновитьТаблицуCategoriesНаСервере();
КонецПроцедуры

&НаСервере
Процедура СозданиеНовыхПроектовНаСервере()
	
	Объ = РеквизитФормыВЗначение("Объект");
	Объ.СозданиеНовыхПроектов(); 
	ЗначениеВРеквизитФормы(Объ, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеНаименованийПроектов(Команда)
	ОбновлениеПроектовНаСервере();
	ОбновитьТаблицуCategoriesНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновлениеПроектовНаСервере()
	
	Объ = РеквизитФормыВЗначение("Объект");
	Ответ = Объ.ОбновлениеПроектов();
	
	Если Ответ.Ошибка Тогда
		Сообщить(Ответ.Текст);
		Возврат;
	КонецЕсли;
	ЗначениеВРеквизитФормы(Объ, "Объект");
		
КонецПроцедуры

#КонецОбласти

#Область Jira_Users

&НаКлиенте
Процедура СинхронизацияСJiraUsers(Команда)
	СинхронизацияСJiraUsersНаСервере();
КонецПроцедуры

&НаСервере
Процедура СинхронизацияСJiraUsersНаСервере()
	
	Объ = РеквизитФормыВЗначение("Объект");
	
	Ответ = Объ.ОбновитьТаблицаДжираПользователи();
	Если Ответ.ОщибкаСоединения Тогда // შეცდომა სერვერთან დაკავშირებისას
		Сообщить("შეცდომა სერვერთან დაკავშირებისას, მიზეზი: " + Ответ.Текст);
		Возврат;
	ИначеЕсли Ответ.ОщибкаКодСостояния Тогда // შეცდომა სერვერიდან დაბრუნებული კოდის პასუხის მიხედვით	
	    Сообщить("შეცდომა სერვერიდან დაბრუნებული კოდის (" + Ответ.HTTPЗапрос.КодСостояния + ") პასუხის მიხედვით, მიზეზი: " + Ответ.Текст);
		Возврат;
	КонецЕсли; 
		
	ЗначениеВРеквизитФормы(Объ, "Объект");	
	
КонецПроцедуры

#КонецОбласти

#Область Worklogs

&НаКлиенте
Процедура СинхронизацияСWorklogs(Команда)
	СинхронизацияСWorklogsНаСервере();
КонецПроцедуры

&НаСервере
Процедура СинхронизацияСWorklogsНаСервере()
	
	Объ = РеквизитФормыВЗначение("Объект");
	Если Не ЗначениеЗаполнено(Объ.ЗадНаРаботуМесацЗагрузки) Тогда
		Возврат;	
	КонецЕсли; 
	
	Ответ = Объ.ОбновитьТаблицуWorklogs();
	Если Ответ.ОщибкаСоединения Тогда // შეცდომა სერვერთან დაკავშირებისას
		Сообщить("შეცდომა სერვერთან დაკავშირებისას, მიზეზი: " + Ответ.Текст);
		Возврат;
	ИначеЕсли Ответ.ОщибкаКодСостояния Тогда // შეცდომა სერვერიდან დაბრუნებული კოდის პასუხის მიხედვით	
		Сообщить("შეცდომა სერვერიდან დაბრუნებული კოდის (" + Ответ.HTTPЗапрос.КодСостояния + ") პასუხის მიხედვით, მიზეზი: " + Ответ.Текст);
		Возврат;
	КонецЕсли; 
	
	Объ.ДопИнфоКоличествоНовыеСотрудники      = Ответ.ДопИнфо.КоличествоНовыеСотрудники;
	Объ.ДопИнфоКоличествоНовыеЗаданиеНаРаботу = Ответ.ДопИнфо.КоличествоНовыеЗаданиеНаРаботу;
	Объ.ДопИнфоWorklogsКолИзмененыеДлительностьВЧасах = Ответ.ДопИнфо.WorklogsКолИзмененыеДлительностьВЧасах;
	
	ЗначениеВРеквизитФормы(Объ, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеНовыхЗаданий(Команда)
	СозданиеНовыхЗаданийНаСервере();
КонецПроцедуры

&НаСервере
Процедура СозданиеНовыхЗаданийНаСервере()
	Объ = РеквизитФормыВЗначение("Объект");
	Объ.СоздатьЗаданияНаРаботу();
	ЗначениеВРеквизитФормы(Объ, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура WorklogsОбновлениеВремены(Команда)
	WorklogsОбновлениеВременыНаСервере();
КонецПроцедуры

&НаСервере
Процедура WorklogsОбновлениеВременыНаСервере()
	Объ = РеквизитФормыВЗначение("Объект");
	Объ.WorklogsОбновлениеВременыНаСервере();
	Объ.СинхронизацияСWorklogsНаСервере();
	ЗначениеВРеквизитФормы(Объ, "Объект");		
КонецПроцедуры

&НаКлиенте
Процедура WorklogsGetMaxVertionByDate(Команда)
	WorklogsGetMaxVertionByDateНаСервере();
КонецПроцедуры

&НаСервере
Процедура WorklogsGetMaxVertionByDateНаСервере()
	Объ = РеквизитФормыВЗначение("Объект");
	//Ответ = Объ.GetMaxVertionByDate(Дата(2021,1,1)); // TODO თარიღის გადაცემის შესაძლებლობაა დასამატი
	Объ.WorklogResource = Объ.getMaxSelectVersion();
	//Сообщить(Ответ);
	ЗначениеВРеквизитФормы(Объ, "Объект");		
КонецПроцедуры

#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ