
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дата = Параметры.Дата;
	Номер = Параметры.Номер;
	Организация = Параметры.Организация;
	Контрагент = Параметры.Контрагент;
	Договор = Параметры.Договор;
	СтруктурнаяЕдиница = Параметры.СтруктурнаяЕдиница;
	Ячейка = Параметры.Ячейка;
	
	Для каждого ТекСТрока Из Параметры.Таблица Цикл
		НоваяСтрока = Запасы.Добавить();
		НоваяСтрока.Номенклатура = ТекСТрока.Номенклатура;
		НоваяСтрока.ЕдиницаИзмерения = ТекСТрока.ЕдиницаИзмерения;
		НоваяСтрока.Количество = ТекСТрока.Количество;
	КонецЦикла;
	 
КонецПроцедуры
