
&Вместо("СвернутьНаборЗаписейХозрасчетный")
Процедура РасшAzRy_СвернутьНаборЗаписейХозрасчетный(НаборЗаписейРегистра)
				
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Период,
	|	Хозрасчетный.Активность,
	|	Хозрасчетный.СчетДт,
	|	Хозрасчетный.СчетКт,
	|	Хозрасчетный.Организация,
	|	Хозрасчетный.ВалютаДт,
	|	Хозрасчетный.ВалютаКт,
	|	СУММА(Хозрасчетный.Сумма) КАК Сумма,
	|	СУММА(Хозрасчетный.ВалютнаяСуммаДт) КАК ВалютнаяСуммаДт,
	|	СУММА(Хозрасчетный.ВалютнаяСуммаКт) КАК ВалютнаяСуммаКт,
	|	Хозрасчетный.Содержание,
	|	Хозрасчетный.СубконтоДт1,
	|	Хозрасчетный.СубконтоДт2,
	|	Хозрасчетный.СубконтоДт3,
	|	Хозрасчетный.СубконтоКт1,
	|	Хозрасчетный.СубконтоКт2,
	|	Хозрасчетный.СубконтоКт3,
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоДт1, """") КАК ВидСубконтоДт1,
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоДт2, """") КАК ВидСубконтоДт2,
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоДт3, """") КАК ВидСубконтоДт3,
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоКт1, """") КАК ВидСубконтоКт1,
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоКт2, """") КАК ВидСубконтоКт2,
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоКт3, """") КАК ВидСубконтоКт3,
	|	СУММА(Хозрасчетный.КоличествоДт) КАК КоличествоДт,
	|	СУММА(Хозрасчетный.КоличествоКт) КАК КоличествоКт
	|ИЗ
	// +++ { AzRy - [15.12.2021] - Jira: - Developer:გიორგი მამულაშვილი - Comment: მეთოდი გადატვირთულია თვითღირებულების გამო, ძველი ბაზიდან გადმოტანილი დოკუმენტების კორექტურად გატარების გამო
	//|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто КАК Хозрасчетный
	//|ГДЕ
	//|	Хозрасчетный.Регистратор = &Регистратор
	|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(, , Регистратор = &Регистратор, , ) КАК Хозрасчетный
	// +++ } AzRy - [15.12.2021] - Jira: - Developer:გიორგი მამულაშვილი - Comment: მეთოდი გადატვირთულია თვითღირებულების გამო, ძველი ბაზიდან გადმოტანილი დოკუმენტების კორექტურად გატარების გამო	
	|
	|СГРУППИРОВАТЬ ПО
	|	Хозрасчетный.Период,
	|	Хозрасчетный.Активность,
	|	Хозрасчетный.СчетДт,
	|	Хозрасчетный.СчетКт,
	|	Хозрасчетный.Организация,
	|	Хозрасчетный.ВалютаДт,
	|	Хозрасчетный.ВалютаКт,
	|	Хозрасчетный.Содержание,
	|	Хозрасчетный.СубконтоДт1,
	|	Хозрасчетный.СубконтоДт2,
	|	Хозрасчетный.СубконтоДт3,
	|	Хозрасчетный.СубконтоКт1,
	|	Хозрасчетный.СубконтоКт2,
	|	Хозрасчетный.СубконтоКт3,
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоДт2, """"),
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоДт3, """"),
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоКт1, """"),
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоКт2, """"),
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоКт3, """"),
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоДт1, """")
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Хозрасчетный.Сумма) <> 0
	|		ИЛИ СУММА(Хозрасчетный.ВалютнаяСуммаДт) <> 0
	|		ИЛИ СУММА(Хозрасчетный.ВалютнаяСуммаКт) <> 0)"; 

	Запрос.УстановитьПараметр("Регистратор", Ссылка);

	ТаблицаЗаписейРегистра = Запрос.Выполнить().Выгрузить();
	
	//НаборЗаписейРегистра.Загрузить(ТаблицаЗаписейРегистра);
	Для Каждого Стр Из ТаблицаЗаписейРегистра Цикл
		
		НоваяСтрока = НаборЗаписейРегистра.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		
		Д = 1;
		Пока Д <= 3 Цикл
			Если Стр["ВидСубконтоДт" + Строка(Д)] <> "" Тогда 
				БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, Стр["ВидСубконтоДт" + Строка(Д)].ИмяПредопределенныхДанных, Стр["СубконтоДт" + Строка(Д)]);
			КонецЕсли;
			Д = Д + 1;
		КонецЦикла;
		
		К = 1;
		Пока К <= 3 Цикл
			Если Стр["ВидСубконтоКт" + Строка(К)] <> "" Тогда 
				БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, Стр["ВидСубконтоКт" + Строка(К)].ИмяПредопределенныхДанных, Стр["СубконтоКт" + Строка(К)]);
			КонецЕсли;
			К = К + 1;
		КонецЦикла;	
	КонецЦикла;
		
КонецПроцедуры
