
Процедура ПроверкаМодифицированостиВопрос(Ссылка, Модифицированность, Отказ) Экспорт
	
	Если НЕ Модифицированность ИЛИ
		 НЕ УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПредупреждатьПриРедактированииДокументовИСправочников") ИЛИ
		 НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	//РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
	
	Ответ = Вопрос(НСтр("ka='ობიექტი შეცვლილია, ჩაიწეროს?';ru='Объект изменен. Записать?';en='Object izmenenb record?'"), РежимДиалогаВопрос.ДаНет, 0);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
