
// Задает текст состояние разделнного объекта, устанавливает доступность
// кнопок управления состоянием и флага ТолькоПросмотр формы
//
Процедура ОбработатьФлагРучногоИзменения(Знач Форма) Экспорт
	
	Элементы  = Форма.Элементы;
	
	Если Форма.РучноеИзменение = Неопределено Тогда
		Форма.ТекстРучногоИзменения = НСтр("ka='ელემენტი შეიქმნა ხელის რეჟიმში. ავტომატური განახლება შეუძლებელია.';ru='Элемент создан вручную. Автоматическое обновление не возможно.';en='Item created manually. Automatic updating is not possible.'");
		
		Элементы.ОбновитьИзКлассификатора.Доступность = Ложь;
		Элементы.Изменить.Доступность = Ложь;
		Форма.ТолькоПросмотр          = Ложь;
		Элементы.Родитель.Доступность = Истина;
		Элементы.Код.Доступность      = Истина;
		Если НЕ Форма.Объект.ЭтоГруппа Тогда
			Элементы.КоррСчет.Доступность = Истина;
		КонецЕсли;
	ИначеЕсли Форма.РучноеИзменение = Истина Тогда
		Форма.ТекстРучногоИзменения = НСтр("ka='ელემენტის ავტომატური განახლება უარყოფილია.';ru='Автоматическое обновление элемента отключено.';en='Automatic Updates is disabled element.'");
		
		Элементы.ОбновитьИзКлассификатора.Доступность = Истина;
		Элементы.Изменить.Доступность = Ложь;
		Форма.ТолькоПросмотр          = Ложь;
		Элементы.Родитель.Доступность = Ложь;
		Элементы.Код.Доступность      = Ложь;
		Если НЕ Форма.Объект.ЭтоГруппа Тогда
			Элементы.КоррСчет.Доступность = Ложь;
		КонецЕсли;
	Иначе
		Форма.ТекстРучногоИзменения = НСтр("ka='ელემენტის განახლება ავტომატურად ხდება.';ru='Элемент обновляется автоматически.';en='Item is updated automatically.'");
		
		Элементы.ОбновитьИзКлассификатора.Доступность = Ложь;
		Элементы.Изменить.Доступность = Истина;
		Форма.ТолькоПросмотр          = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Выдает пользователю вопрос об обновлении из общих данных.
// В случае утвердительного ответа, возвращает Истина.
//
Процедура ОбновитьЭлементИзКлассификатора(Знач Форма, ВыполнитьОбновление) Экспорт
	
	ТекстВопроса = НСтр("ka='ელემენტის მონაცემები შეიცვლება კლასიფიკატორიდან არსებული მონაცემებით. ხელით შეტანილი ყველა ცვლილება დაიკარგება. გავაგრძელოთ?';ru='Данные элемента будут заменены данными из классификатора."
"Все ручные изменения будут потеряны. Продолжить?'");
							
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("ВыполнитьОбновление", ВыполнитьОбновление);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОпределитьНеобходимостьОбновленияДанныхИзКлассификатора", Форма, ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	
КонецПроцедуры
