
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПеремещениеВА, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеВА);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеВА.Ссылка,
	|	ПеремещениеВА.Номер,
	|	ПеремещениеВА.Дата,
	|	ПеремещениеВА.Организация
	|ПОМЕСТИТЬ ВременнаяТаблицаШапка
	|ИЗ
	|	Документ.ПеремещениеВА КАК ПеремещениеВА
	|ГДЕ
	|	ПеремещениеВА.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка,
	|	ПеремещениеВАВнеоборотныеАктивы.НомерСтроки,
	|	ПеремещениеВАВнеоборотныеАктивы.ВнеоборотныйАктив,
	|	ПеремещениеВАВнеоборотныеАктивы.СтруктурнаяЕдиница,
	|	ПеремещениеВАВнеоборотныеАктивы.СтруктурнаяЕдиницаПолучатель,
	|	ПеремещениеВАВнеоборотныеАктивы.Адрес,
	|	ПеремещениеВАВнеоборотныеАктивы.АдресПолучатель,
	|	ПеремещениеВАВнеоборотныеАктивы.ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПеремещениеВАВнеоборотныеАктивы.ПервоначальнаяСтоимость,
	|	ПеремещениеВАВнеоборотныеАктивы.НачислятьАмортизациюВТекущемМесяце,
	|	ПеремещениеВАВнеоборотныеАктивы.СрокИспользованияДляВычисленияАмортизации,
	|	ПеремещениеВАВнеоборотныеАктивы.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ПеремещениеВАВнеоборотныеАктивы.СчетЗатрат,
	|	ПеремещениеВАВнеоборотныеАктивы.НаправлениеДеятельности,
	|	ПеремещениеВАВнеоборотныеАктивы.СчетЗатратРегл,
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка.Дата КАК Период,
	|	&ВалютаУчета КАК Валюта,
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка.Организация КАК Организация
	|ПОМЕСТИТЬ ВременнаяТаблицаВнеоборотныхАктивов
	|ИЗ
	|	Документ.ПеремещениеВА.ВнеоборотныеАктивы КАК ПеремещениеВАВнеоборотныеАктивы
	|ГДЕ
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка = &Ссылка";
	
	Запрос.ВыполнитьПакет();
	
	// Формирование таблиц движений по разделам учета.
	СформироватьТаблицаПараметрыВнеоборотныхАктивов(ДокументСсылкаПеремещениеВА, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_ПеремещениеВА(ДокументСсылкаПеремещениеВА, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПараметрыВнеоборотныхАктивов(ДокументСсылкаПеремещениеВА, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ТаблицаДокумента.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиница,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ТаблицаДокумента.НачислятьАмортизациюВТекущемМесяце КАК ПрименитьВТекущемМесяце,
	|	ТаблицаДокумента.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ТаблицаДокумента.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ТаблицаДокумента.СчетЗатрат КАК СчетЗатрат,
	|	ТаблицаДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаДокумента.АдресПолучатель КАК Адрес,
	|	ТаблицаДокумента.СчетЗатратРегл КАК СчетЗатратРегл 
	|ИЗ
	|	ВременнаяТаблицаВнеоборотныхАктивов КАК ТаблицаДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПараметрыВнеоборотныхАктивов", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаПараметрыВнеоборотныхАктивов()

