&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Владелец = Параметры.Владелец;
	Формула = Параметры.Формула;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодобратьСтатью(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Владелец", Владелец);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыборСтатьи", ЭтаФорма);
	
	ОткрытьФорму("Справочник.ДЛ_СтатьиУниверсальногоОтчета.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаОК(Команда)
	
	Закрыть(Формула);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыборСтатьи(Результат, ДопПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		
		Формула = Формула + ПолучитьИдентификаторСтатьиНаСервере(Результат);
		Возврат;
	
	КонецЕсли; 

КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьИдентификаторСтатьиНаСервере(Статья)

	Если НЕ ЗначениеЗаполнено(Статья) Тогда
	
		Возврат "";
		
	Иначе
		
		Возврат "[" + Статья.ИдентификаторФормулы + "]";
		
	КонецЕсли; 

КонецФункции // ()
 
 