#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура создает пустую временную таблицу изменения движений.
//
Процедура СоздатьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) Экспорт
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	Лицензии.НомерСтроки КАК НомерСтроки,
	|	Лицензии.Организация КАК Организация,
	|	Лицензии.Номенклатура КАК Номенклатура,
	|	Лицензии.Себестоимость КАК СуммаПередЗаписью,
	|	Лицензии.Себестоимость КАК СуммаИзменение,
	|	Лицензии.Себестоимость КАК СуммаПриЗаписи,
	|	Лицензии.Себестоимость КАК СуммаВалПередЗаписью,
	|	Лицензии.Себестоимость КАК СуммаВалИзменение,
	|	Лицензии.Себестоимость КАК СуммаВалПриЗаписи
	|ПОМЕСТИТЬ ДвиженияРасчетыСПокупателямиИзменение
	|ИЗ
	|	РегистрНакопления.РасчетыСПокупателями КАК РасчетыСПокупателями,
	|	РегистрНакопления.Лицензии КАК Лицензии");
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураВременныеТаблицы.Вставить("ДвиженияЛизензииИзменение", Ложь);
	
КонецПроцедуры // СоздатьПустуюВременнуюТаблицуИзменение()

#КонецОбласти

#КонецЕсли