#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)

	Если ПланыСчетов.Хозрасчетный.ПропущенаБизнесЛогикаПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Предопределенный 
		И Родитель <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Родитель") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ka='არ შეიძლება წინასწარგანსაზღვრული ანგარიშების დაქვემდებარების შეცვლა';ru='Нельзя изменять подчиненность предопределенных счетов!';en='You can not change the subordination of predefined accounts!'"), ЭтотОбъект, "Родитель", , Отказ);
	КонецЕсли;
	
	Порядок = ПолучитьПорядокКода();

	Если НЕ ЗначениеЗаполнено(КодБыстрогоВыбора) Тогда
		КодБыстрогоВыбора = СокрЛП(СтрЗаменить(Код, ".", ""));
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Удаление проверяемых реквизитов из структуры, в зависимости от функциональной 
	// опции.
	Если НЕ Константы.ФункциональнаяОпцияИспользоватьБюджетирование.Получить()
		  И ТипСчета <> Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗакрытия");
	КонецЕсли;
	
	Если Константы.ФункциональнаяОпцияИспользоватьБюджетирование.Получить()
	   И ТипСчета <> Перечисления.ТипыСчетов.НезавершенноеПроизводство
	   И ТипСчета <> Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗакрытия");
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли