
Процедура Печать1(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.AzRyПередачаИмуществаСотруднику.ПолучитьМакет("Макет1");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	AzRyШтрихкодыВнеоборотныеАктивы.Штрихкод КАК Штрихкод,
	|	AzRyШтрихкодыВнеоборотныеАктивы.ВнеоборотныеАктивы КАК ВнеоборотныеАктивы
	|ПОМЕСТИТЬ Штр
	|ИЗ
	|	РегистрСведений.AzRyШтрихкодыВнеоборотныеАктивы КАК AzRyШтрихкодыВнеоборотныеАктивы
	|ГДЕ
	|	AzRyШтрихкодыВнеоборотныеАктивы.ВнеоборотныеАктивы В
	|			(ВЫБРАТЬ
	|				AzRyПередачаИмуществаСотрудникуВнеоборотныеАктивы.ВнеоборотныйАктив
	|			ИЗ
	|				Документ.AzRyПередачаИмуществаСотруднику.ВнеоборотныеАктивы КАК AzRyПередачаИмуществаСотрудникуВнеоборотныеАктивы
	|			ГДЕ
	|				AzRyПередачаИмуществаСотрудникуВнеоборотныеАктивы.Ссылка = &Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	AzRyПередачаИмуществаСотруднику.Номер КАК Номер,
	|	AzRyПередачаИмуществаСотруднику.Дата КАК Дата,
	|	AzRyПередачаИмуществаСотруднику.Автор КАК Автор,
	|	AzRyПередачаИмуществаСотруднику.Комментарий КАК Комментарий,
	|	AzRyПередачаИмуществаСотруднику.HumanResources КАК HumanResources,
	|	AzRyПередачаИмуществаСотруднику.IT КАК IT,
	|	AzRyПередачаИмуществаСотруднику.ЗаведующийПоСкладу КАК ЗаведующийПоСкладу,
	|	AzRyПередачаИмуществаСотруднику.Склад КАК Склад,
	|	AzRyПередачаИмуществаСотруднику.Организация.НаименованиеАнглийское КАК Организация,
	|	AzRyПередачаИмуществаСотруднику.Сотрудник.Наименование КАК Сотрудник,
	|	AzRyПередачаИмуществаСотруднику.Сотрудник.Физлицо.ДатаРождения КАК ДатаРождения,
	|	AzRyПередачаИмуществаСотруднику.Сотрудник.Физлицо.ИНН КАК ИНН,
	|	AzRyПередачаИмуществаСотруднику.Организация.ИНН КАК ОрганизацияИНН
	|ИЗ
	|	Документ.AzRyПередачаИмуществаСотруднику КАК AzRyПередачаИмуществаСотруднику
	|ГДЕ
	|	AzRyПередачаИмуществаСотруднику.Ссылка В(&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	AzRyПередачаИмуществаСотрудникуВнеоборотныеАктивы.Ссылка КАК Ссылка,
	|	AzRyПередачаИмуществаСотрудникуВнеоборотныеАктивы.НомерСтроки КАК НомерСтроки,
	|	AzRyПередачаИмуществаСотрудникуВнеоборотныеАктивы.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	AzRyПередачаИмуществаСотрудникуВнеоборотныеАктивы.СтоимостьЗакупкиСНДС КАК СтоимостьЗакупкиСНДС,
	|	AzRyПередачаИмуществаСотрудникуВнеоборотныеАктивы.Штрихкод КАК Штрихкод
	|ИЗ
	|	Документ.AzRyПередачаИмуществаСотруднику.ВнеоборотныеАктивы КАК AzRyПередачаИмуществаСотрудникуВнеоборотныеАктивы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Штр КАК Штр
	|		ПО AzRyПередачаИмуществаСотрудникуВнеоборотныеАктивы.ВнеоборотныйАктив = Штр.ВнеоборотныеАктивы
	|ГДЕ
	|	AzRyПередачаИмуществаСотрудникуВнеоборотныеАктивы.Ссылка = &Ссылка";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка   = РезультатЗапроса[1].Выбрать();
	ВыборкаТипПродажи = РезультатЗапроса[2].Выбрать();
	
	//Выборка = РезультатЗапросаШапка.Выбрать();

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТипПродажи = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
	
		ОбластьШапка.Параметры.Организация  = Выборка.Организация;
		ОбластьШапка.Параметры.Сотрудник    = Выборка.Сотрудник;
		ОбластьШапка.Параметры.ДатаРождения = Формат(Выборка.ДатаРождения, "ДФ=dd.MM.yyyy");
		ОбластьШапка.Параметры.ИНН          = Выборка.ИНН; 
		ОбластьШапка.Параметры.Год          = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy") + " წელი";      
		ТабДок.Вывести(ОбластьШапка);
		
		//ВыборкаТипПродажи = Выборка.ВнеоборотныеАктивы.Выбрать();
		Сумма = 0;
		Пока ВыборкаТипПродажи.Следующий() Цикл
			ОбластьТипПродажи.Параметры.Заполнить(ВыборкаТипПродажи);
			ТабДок.Вывести(ОбластьТипПродажи, Выборка.Уровень());
			Сумма = Сумма + ВыборкаТипПродажи.СтоимостьЗакупкиСНДС;
		КонецЦикла;
	
		ОбластьПодвал.Параметры.Заполнить(Выборка);
		ОбластьПодвал.Параметры.Сумма = Сумма;
		ТабДок.Вывести(ОбластьПодвал, Выборка.Уровень());
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры

