
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.AzRyПередачаИмуществаСотруднику.Записывать = Истина;
	Для Каждого ТекСтрокаВнеоборотныеАктивы Из ВнеоборотныеАктивы Цикл
		Движение = Движения.AzRyПередачаИмуществаСотруднику.Добавить();
		Если ВидОперации = ПредопределенноеЗначение("Перечисление.AzRyВидыОперацийПередачаИмуществаСотруднику.Передача") Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Иначе 
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		КонецЕсли;		
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Сотрудник = Сотрудник;
		Движение.ВидОперации = ВидОперации;
		Движение.ВнеоборотныйАктив = ТекСтрокаВнеоборотныеАктивы.ВнеоборотныйАктив;
		Движение.Склад = Склад;
		Движение.IT = IT;
		Движение.HumanResources = HumanResources;
		Движение.ЗаведующийПоСкладу = ЗаведующийПоСкладу;
		Движение.Количество = 1;
		Движение.Сумма = ТекСтрокаВнеоборотныеАктивы.СтоимостьЗакупкиСНДС;
		Движение.Автор = Автор;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры