
Процедура СообщитьПользователю(ТекстСообщения)
	
	ПоказатьОповещениеПользователя(НСтр("ka='Оптимус: Фискальный регистратор';ru='Оптимус: Фискальный регистратор';en='Optimus: Fiscal registrar'"), , ТекстСообщения);
	
КонецПроцедуры

// Функция создает файл с командами для передачи на фискальный принтер
//
// Параметры:
//  Параметры   - Настройки для подключённого оборудования
//
// Возвращаемое значение:
//  <Булево> - Результат работы функции.
//
Функция СоздатьКоммандныйФайл(Параметры, МассивСКомандами, СтрокаЛога)
	Результат = Ложь;
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	
	//{R&K, ltd - Москаленко А.В.(21.10.2015)
	// 
	//R&K, ltd}
	
	
	Для Каждого Эл Из МассивСКомандами Цикл
		ТекстовыйДокумент.ДобавитьСтроку(Эл);		
	КонецЦикла;
	Попытка
		// Если это печать чека и нужно получать ответ от ФС
		Если Параметры.ВыполняемаяКоманда = "PrintReceipt" И Параметры.Свойство("ПолучатьОтветОтФС") И Параметры.ПолучатьОтветОтФС Тогда 
			Результат = Ложь;
			
			Попытка
				ПереместитьФайл(Параметры.КаталогСДаннымиЧеков +  Параметры.ИмяФайлаОтвета
									, Параметры.КаталогСДаннымиЧеков + "__PreDeletion__" + Формат(ТекущаяДата(),"ДФ=yyyyMMdd_HHmmss") + "_" +  Параметры.ИмяФайлаОтвета);
			Исключение
			КонецПопытки;
			
			ТекстовыйДокумент.Записать(Параметры.КаталогСДаннымиЧеков + Параметры.ИмяФайла);
			
			ФормаОбработки = ПолучитьФорму("Обработка.ОПТИМУС_ПечатьФискальныхЧеков.Форма.ФормаПечатьФискальногоЧека", Новый Структура("НастройкиФС", Параметры));
			
			ОтветФормы = ФормаОбработки.ОткрытьМодально();
			Результат = (ОтветФормы <> Неопределено) И (Не ОтветФормы.ОшибкаОперации);
			
			// Если файл был сформирован при работе то переименуем его
			Если (ОтветФормы <> Неопределено) И ОтветФормы.ФайлСуществует Тогда 
				ПереместитьФайл(Параметры.КаталогСДаннымиЧеков +  Параметры.ИмяФайлаОтвета
									, Параметры.КаталогСДаннымиЧеков + Формат(ТекущаяДата(),"ДФ=yyyyMMdd_HHmmss") + "_" +  Параметры.ИмяФайлаОтвета);
			КонецЕсли;
		Иначе
			// просто печатаем что пришло и ответа не ждём
			
			//{R&K, ltd - Москаленко А.В.(21.10.2015)
			//ТекстовыйДокумент.Записать(Параметры.КаталогСДаннымиЧеков + Параметры.ИмяФайла);
			//нужно записать файл в формате аски
			ТекстовыйДокумент.Записать(Параметры.КаталогСДаннымиЧеков + Параметры.ИмяФайла, КодировкаТекста.ANSI);

			//R&K, ltd}
			
			Результат = Истина;
		КонецЕсли;		
	Исключение
		ОписаниеОшибки = ИнформацияОбОшибке();
		СтрокаЛога = СтрокаЛога
		+ Символы.ПС + ?(ОписаниеОшибки.Причина = Неопределено, ОписаниеОшибки.Описание ,ОписаниеОшибки.Причина.Описание);
	КонецПопытки;
Возврат Результат;
КонецФункции

// Печать чека ККМ на обычном принтере
Процедура ПечатьНаПринтерЧекККМ(ВходныеПараметры = Неопределено, ВыходныеПараметры = Неопределено, Параметры, ПараметрыПодключения)
	// Если для фискального регистратора установлен параметр печати чека на обычном принтере и пробитие фискального чека было удачно напечатаем чек на обычном принтере
	Если Параметры.ПечататьНаОбычныйПринтер Тогда 
		Попытка
			МассивПараметров = Новый Массив();
			МассивПараметров.Добавить(ПредопределенноеЗначение("Документ.ЧекККМ.ПустаяСсылка"));
			Структура = Новый Структура("ДанныеЧека, Параметры,", ВходныеПараметры, Параметры);
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Обработка.ОПТИМУС_ПечатьФискальныхЧеков", "ЧекККМ", МассивПараметров, Структура);
		Исключение
			ОписаниеОшибки = ИнформацияОбОшибке();
			ОшибкаПриПечати = ?(ОписаниеОшибки.Причина = Неопределено, ОписаниеОшибки.Описание ,ОписаниеОшибки.Причина.Описание);
			Сообщить(ОшибкаПриПечати);
		КонецПопытки;
	КонецЕсли;	
КонецПроцедуры

// Печать отчета с гашением на обычном принтере
Процедура ПечатьНаПринтерОтчетСГашением(ВходныеПараметры = Неопределено, ВыходныеПараметры = Неопределено, Параметры, ПараметрыПодключения)
	// Если для фискального регистратора установлен параметр печати чека на обычном принтере и пробитие фискального чека было удачно напечатаем чек на обычном принтере
	Если Параметры.ПечататьНаОбычныйПринтер Тогда 
		Попытка
			МассивПараметров = Новый Массив();
			МассивПараметров.Добавить(ПредопределенноеЗначение("Документ.ЧекККМ.ПустаяСсылка"));
			Структура = Новый Структура("ДанныеЧека, Параметры,", ВходныеПараметры, Параметры);
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Обработка.ОПТИМУС_ПечатьФискальныхЧеков", "ОтчетСГашениемСНоменклатурой", МассивПараметров, Структура);
		Исключение
			ОписаниеОшибки = ИнформацияОбОшибке();
			ОшибкаПриПечати = ?(ОписаниеОшибки.Причина = Неопределено, ОписаниеОшибки.Описание ,ОписаниеОшибки.Причина.Описание);
			Сообщить(ОшибкаПриПечати);
		КонецПопытки;
	КонецЕсли;	
КонецПроцедуры


////////// ОБЩИЕ КОМАНДЫ ВСЕХ ОБРАБОТЧИКОВ //////////////

// Функция осуществляет подключение устройства.
//
// Параметры:
//  ОбъектДрайвера   - <*>
//           - ОбъектДрайвера драйвера торгового оборудования.
//
// Возвращаемое значение:
//  <Булево> - Результат работы функции.
//
Функция ПодключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт

	Результат = Истина;
	ПараметрыПодключения.Вставить("СерийныйНомерККМ", "0");
	ПараметрыПодключения.Вставить("ФРПодключен"     , Ложь);

	//Обязательные выходные
	ВыходныеПараметры = Новый Массив();

	// Проверка настроенных параметров
	НомерСекции					= Неопределено;
	Модель						= Неопределено;
    КаталогСДаннымиЧеков		= Неопределено;
	ВыводитьСписокТоваров		= Неопределено;
	
	Параметры.Свойство("НомерСекции"			, НомерСекции);
	Параметры.Свойство("Модель"					, Модель);
	Параметры.Свойство("КаталогСДаннымиЧеков"	, КаталогСДаннымиЧеков);
	Параметры.Свойство("ВыводитьСписокТоваров"	, ВыводитьСписокТоваров);
	
	Если НомерСекции				= Неопределено
		Или Модель					= Неопределено
		Или КаталогСДаннымиЧеков	= Неопределено
		Или ВыводитьСписокТоваров	= Неопределено Тогда
			Результат = Ложь;
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(НСтр("ru='Не настроены параметры устройства."
"Для корректной работы устройства необходимо задать параметры его работы."
"Сделать это можно при помощи формы ""Настройка параметров"" модели"
"подключаемого оборудования в форме ""Подключение и настройка оборудования"".';ka='მოწყობილობის პარამტრები გაუსწორებელია. მოწყობილობის კორექტული მუშაობისთვის აუცილებელია მისი მუშაობის პარამეტრების მიცემა. ამის გაკეთება შეიძლება შესაერთებელი მოწყობილობის ფორმა ""პარამეტრების გასწორების"" დახმარებით, ""მოწყობილობის შეერთება და გასწორება"" ფორმით.'"));
	КонецЕсли;
	// Конец: Проверка настроенных параметров

	Если Результат Тогда
		Если ПараметрыПодключения.ФРПодключен Тогда
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(НСтр("ka='ფისკალური რეგისტრატორი უკვე მიერთებულია';ru='Фискальный регистратор уже подключен';en='Fiscal printer is already connected'"));
			Результат = Ложь;
		Иначе
			ПараметрыПодключения.ФРПодключен = Истина;

			ВыходныеПараметры.Добавить(""); // Источник событий
			ВыходныеПараметры.Добавить(Неопределено); // Список событий
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Функция осуществляет отключение устройства.
//
// Параметры:
//  ОбъектДрайвера - <*>
//         - ОбъектДрайвера драйвера торгового оборудования.
//
// Возвращаемое значение:
//  <Булево> - Результат работы функции.
//
Функция ОтключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт

	Результат = Истина;

	//Обязательные выходные
	ВыходныеПараметры = Неопределено;

	ПараметрыПодключения.ФРПодключен = Ложь;

	Возврат Результат;

КонецФункции

// Функция получает, обрабатывает и перенаправляет на исполнение команду к драйверу
//
Функция ВыполнитьКоманду(Команда, ВходныеПараметры = Неопределено, ВыходныеПараметры = Неопределено,
                         ОбъектДрайвера, Параметры, ПараметрыПодключения) Экспорт

	Результат = Истина;

	//Обязательные выходные
	ВыходныеПараметры = Новый Массив();

	Параметры.Вставить("ВыполняемаяКоманда", Команда);
	
	// Открыть смену
	Если Команда = "OpenDay" ИЛИ Команда = "OpenShift" ИЛИ Команда = "ОткрытьСмену" Тогда
		Результат = ОткрытьСмену(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);

	ИначеЕсли Команда = "CloseShift" Тогда
		Результат = Истина;
		
	// Печать чека
	ИначеЕсли Команда = "PrintReceipt" Тогда
		ТаблицаНоменклатуры = ВходныеПараметры[0];
		ТаблицаОплат        = ВходныеПараметры[1];
		ОбщиеПараметры      = ВходныеПараметры[2];
		
		Результат = ПечатьЧека(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаНоменклатуры,
		                       ТаблицаОплат, ОбщиеПараметры, ВыходныеПараметры);		
		Если Результат Тогда 
			ПечатьНаПринтерЧекККМ(ВходныеПараметры, ВыходныеПараметры, Параметры, ПараметрыПодключения);					   
		КонецЕсли;

	// Фискализация чека.
	ИначеЕсли Команда = "CheckFiscalization" ИЛИ Команда = "ФискализацияЧека" Тогда
		//Результат = ПечатьЧекаПоШаблону(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры);
		ТаблицаНоменклатуры = ВходныеПараметры[0];
		ТаблицаОплат        = ВходныеПараметры[0].ТаблицаОплат;
		
		НоваяТаблицаОплат   = Новый Массив; 
		
		СуммаОплаты = 0;
		Для каждого СтрокаОплаты Из ТаблицаОплат Цикл
			
			Если СтрокаОплаты.ТипОплаты = 0 Тогда
				
				НоваяТаблицаОплат.Добавить(СтрокаОплаты);
				СуммаОплаты = СуммаОплаты + СтрокаОплаты.Сумма;
			
			КонецЕсли; 
		
		КонецЦикла; 
		
		ТаблицаОплат = НоваяТаблицаОплат;
		
		ОбщиеПараметры      = Новый Массив; //ВходныеПараметры[2];
		ОбщиеПараметры.Добавить(0);
		ОбщиеПараметры.Добавить(Истина);
		ОбщиеПараметры.Добавить(0);
		ОбщиеПараметры.Добавить(0);
		ОбщиеПараметры.Добавить(СуммаОплаты);//ВходныеПараметры[0].ДатаВремя);
		
		Результат = ПечатьЧека(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаНоменклатуры,
		                       ТаблицаОплат, ОбщиеПараметры, ВыходныеПараметры);		
		Если Результат Тогда 
			ПечатьНаПринтерЧекККМ(ВходныеПараметры, ВыходныеПараметры, Параметры, ПараметрыПодключения);					   
		КонецЕсли;
		
		
	// Печать слип чека
	ИначеЕсли Команда = "PrintText" Тогда
		СтрокаТекста = ВходныеПараметры[0];

		Результат = ПечатьТекста(ОбъектДрайвера, Параметры, ПараметрыПодключения,
		                         СтрокаТекста, ВыходныеПараметры);

	// Печать чека внесения/выемки
	ИначеЕсли Команда = "Encash" Тогда
		ТипИнкассации = ВходныеПараметры[0];
		Сумма         = ВходныеПараметры[1];

		Результат = Инкассация(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТипИнкассации, Сумма, ВыходныеПараметры);

	// Печать отчета без гашения
	ИначеЕсли Команда = "PrintXReport" Тогда
		Результат = НапечататьОтчетБезГашения(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);

	// Печать отчета с гашением
	ИначеЕсли Команда = "PrintZReport" Тогда
		Результат = НапечататьОтчетСГашением(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
		Если Результат Тогда 
			ПечатьНаПринтерОтчетСГашением(ВходныеПараметры, ВыходныеПараметры, Параметры, ПараметрыПодключения);					   
		КонецЕсли;
		
	// Тестирование устройства
	ИначеЕсли Команда = "CheckHealth" Тогда
		Результат = ТестУстройства(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	// Открытие денежного ящика
	ИначеЕсли Команда = "OpenCashDrawer" Тогда
		Результат = ОткрытьДенежныйЯщик(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
		// Получение версии драйвера
	ИначеЕсли Команда = "ПолучитьВерсиюДрайвера" Тогда
		Результат = ПолучитьВерсиюДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);

	// Открыть открытый чек
	ИначеЕсли Команда = "OpenCheck" ИЛИ Команда = "ОткрытьЧек"  Тогда
		ЧекВозврата   = ВходныеПараметры[0];
		ФискальныйЧек = ВходныеПараметры[1];
		Результат = ОткрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ЧекВозврата, ФискальныйЧек, ВыходныеПараметры);
		
	// Указанная команда не поддерживается данным драйвером
	Иначе
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ka='ბრაძანება  ""%Команда%"" მოცემული დრაივერით მხარდაჭერა არ გააჩნია.';ru='Команда ""%Команда%"" не поддерживается данным драйвером.';en='The ""% command%"" is not supported by this driver.'"));
		ВыходныеПараметры[1] = СтрЗаменить(ВыходныеПараметры[1], "%Команда%", Команда);
		Результат = Ложь;

	КонецЕсли;

	Возврат Результат;

КонецФункции


/////////////////////////////////////
// Функции-исполнители команд

///////// СПЕЦИФИЧНЫЕ ПО ТИПУ ОБОРУДОВАНИЯ КОМАНДЫ ////////////////

// Функция осуществляет открытие смены
Функция ОткрытьСмену(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	Результат = Истина;
	СтрокаЛога = "";

	СтрокаЛога = "----- " + НСтр("ka='ცვლის გახსნა';ru='Открытие смены';en='Opening of change'") + " -----";
	
	МассивСКомандами = Новый Массив();
	МассивСКомандами.Добавить("X,1,______,_,__;OPER;" + Лев(Строка(ПользователиКлиентСервер.ТекущийПользователь()), 20) + ";;");
	
	// Создадим командный файл для открытия смены
	Результат = СоздатьКоммандныйФайл(Параметры, МассивСКомандами, СтрокаЛога);
	
	Если Результат Тогда 
		// Заполнение выходных параметров
		ВыходныеПараметры.Добавить(0);
		ВыходныеПараметры.Добавить(0);
		ВыходныеПараметры.Добавить(0);
		ВыходныеПараметры.Добавить(ТекущаяДата());
		
		СообщитьПользователю(СтрокаЛога);
	Иначе
		// Заполнение выходных параметров
		ВыходныеПараметры.Добавить(0);
		ВыходныеПараметры.Добавить(СтрокаЛога);		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Функция осуществляет печать фискального чека
Функция ПечатьЧека(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаНоменклатуры,
                   ТаблицаОплат, ОбщиеПараметры, ВыходныеПараметры)

	Результат  = Истина;
	ПараметрыПодключения.Вставить("СтрокаЛога", "");

	МассивСКомандами = Новый Массив();
	
	// Открываем чек
	Результат = ОткрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения,
	                       ОбщиеПараметры[0] = 1, ОбщиеПараметры[1], ВыходныеПараметры);

	Если Результат = Истина И ОбщиеПараметры[0] = 1 Тогда 
		ПараметрыПодключения["ЧекОткрыт"] = Ложь;
		Возврат Истина
	КонецЕсли;
	
   	МассивСКомандами = Новый Массив();

	Если Результат Тогда
		ОшибкаПриПечатиСтроки = Ложь;
		Если Параметры.ВыводитьСписокТоваров Тогда 						   
			// Печатаем строки чека		
			Для ИндексМассива = 0 По ТаблицаНоменклатуры.Количество() - 1 Цикл
				Наименование  = ТаблицаНоменклатуры[ИндексМассива][0].Значение;
				Количество    = ТаблицаНоменклатуры[ИндексМассива][5].Значение;
				Цена          = ТаблицаНоменклатуры[ИндексМассива][4].Значение;
				ПроцентСкидки = ТаблицаНоменклатуры[ИндексМассива][8].Значение;
				Сумма         = ТаблицаНоменклатуры[ИндексМассива][9].Значение;
				НомерСекции   = ТаблицаНоменклатуры[ИндексМассива][3].Значение;
				СтавкаНДС     = ТаблицаНоменклатуры[ИндексМассива][12].Значение;

				Если НЕ НапечататьФискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения,
				                                   Наименование, Количество, Цена, ПроцентСкидки, Сумма,
				                                   НомерСекции, СтавкаНДС, ВыходныеПараметры, МассивСКомандами) Тогда
					ОшибкаПриПечатиСтроки = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе
			МассивСКомандами.Добавить("S,1,______,_,__;"
			+ ""
			+ ";" + Формат(ОбщиеПараметры[4], "ЧДЦ=2; ЧРД=,; ЧГ=0")
			+ ";" + ""
			+ ";" + Параметры.НомерСекции + ";1;1;0;0;");	
		КонецЕсли;
		
		Если Не ОшибкаПриПечатиСтроки Тогда
		  	// Закрываем чек
			Результат = ЗакрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаОплат, ВыходныеПараметры, МассивСКомандами);	
		Иначе
			Результат = Ложь;
		КонецЕсли;
	
	КонецЕсли;

	СообщитьПользователю(ПараметрыПодключения.СтрокаЛога);
	Возврат Результат;

КонецФункции

// Функция осуществляет печать слип-чека
Функция ПечатьТекста(ОбъектДрайвера, Параметры, ПараметрыПодключения,
                       СтрокаТекста, ВыходныеПараметры)

	Результат  = Истина;
	ПараметрыПодключения.Вставить("СтрокаЛога", "");

	МассивСКомандами = Новый Массив();
	
	// Открываем чек
	Результат = ОткрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, Ложь, Ложь, ВыходныеПараметры);

	// Печатаем строки чека
	Если Результат Тогда
		Для НомерСтроки = 1 По СтрЧислоСтрок(СтрокаТекста) Цикл
			ВыделеннаяСтрока = СтрПолучитьСтроку(СтрокаТекста, НомерСтроки);
			Если НЕ НапечататьНефискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения,
				                                     ВыделеннаяСтрока, ВыходныеПараметры, МассивСКомандами) Тогда
					Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	// Закрываем чек
	Если Результат Тогда
		ТаблицаОплат = Новый Массив();
		Результат = ЗакрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаОплат, ВыходныеПараметры, МассивСКомандами);
	КонецЕсли;

	СообщитьПользователю(ПараметрыПодключения.СтрокаЛога);
	Возврат Результат;

КонецФункции

// Функция осуществляет открытие нового чека.
//
Функция ОткрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ЧекВозврата, ФискальныйЧек, ВыходныеПараметры)

	Результат  = Истина;
	СтрокаЛога = "";

	мНомерСмены = 1;
	
	Д = ТекущаяДата();
	
	мНомерЧека  = Макс(1, Цел(9999*(Д - НачалоДня(Д))/86400));

	СтрокаЛога = СтрокаЛога + "===== " + ?(ЧекВозврата, НСтр("ka='დაბრუნების ჩეკის გახსნა';ru='Открытие чека возврата';en='The opening of the return receipt'"), НСтр("ka='გაყიდვის ჩეკის გახსნა';ru='Открытие чека продажи';en='Opening sales receipt'")) + " =====" + Символы.ПС;

	СтрокаЛога = СтрокаЛога + "=====" + ?(ФискальныйЧек, "== " + НСтр("ka='ფისკალური რეჟიმი';ru='Фискальный режим';en='fiscal control'"), " " + НСтр("ka='არაფისკალური რეჟიმი';ru='Нефискальный режим';en='non-fiscal mode'")) + "=====" + Символы.ПС;
	
	СтрокаЛога = СтрокаЛога + НСтр("ka='ქვითრის №';ru='№ чека';en='check number'")   + ": " + Формат(мНомерЧека,  "ЧЦ=4; ЧН=0; ЧВН=")
	           + "    "
	           + НСтр("ka='ცვლის №';ru='№ смены';en='number change'") + ": " + Формат(мНомерСмены, "ЧЦ=4; ЧН=0; ЧВН=") + Символы.ПС;

	НомерСмены = мНомерСмены;
	НомерЧека  = мНомерЧека;

	// Заполнение выходных параметров
	ВыходныеПараметры.Добавить(НомерСмены);
	ВыходныеПараметры.Добавить(НомерЧека);
	ВыходныеПараметры.Добавить(0);
	ВыходныеПараметры.Добавить(ТекущаяДата());

	ПараметрыПодключения.Вставить("ФискальныйЧек", ФискальныйЧек);
	ПараметрыПодключения.Вставить("ЧекОткрыт"    , Истина);
	ПараметрыПодключения.Вставить("ИтогЧека"     , 0);

	//ПараметрыПодключения.СтрокаЛога = ПараметрыПодключения.СтрокаЛога + СтрокаЛога;
	Возврат Результат;

КонецФункции

// Функция осуществляет печать фискальной строки.
//
Функция НапечататьФискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения,
                                   Наименование, Количество, Цена, ПроцентСкидки, Сумма,
                                   НомерСекции, СтавкаНДС, ВыходныеПараметры, МассивСКомандами)

	Результат = Истина;
	СтрокаЛога = "";

	Если Не ПараметрыПодключения.ЧекОткрыт Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ka='ჩეკი არ იქნა გახსნილი';ru='Чек не был открыт';en='The check was not open'"));
		Результат = Ложь;
	Иначе
		МассивСКомандами.Добавить("S,1,______,_,__;"
		+ Лев(Наименование, 20)
		+ ";" + Формат(Цена, "ЧРД=,; ЧГ=0")
		+ ";" + ?(Количество <> 1, Формат(Количество, "ЧДЦ=3; ЧРД=,; ЧГ=0"), "")
		+ ";" + Параметры.НомерСекции + ";1;1;0;0;");
		ПараметрыПодключения.ИтогЧека = ПараметрыПодключения.ИтогЧека + Сумма;
	КонецЕсли;

	ПараметрыПодключения.СтрокаЛога = ПараметрыПодключения.СтрокаЛога + СтрокаЛога;
	Возврат Результат;

КонецФункции

// Функция осуществляет печать нефискальной строки.
//
Функция НапечататьНефискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения, СтрокаТекста, ВыходныеПараметры, МассивСКомандами)

	Результат = Истина;

	ПараметрыПодключения.СтрокаЛога = ПараметрыПодключения.СтрокаЛога + СтрокаТекста + Символы.ПС;

	Возврат Результат;

КонецФункции

// Функция осуществляет закрытие ранее открытого чека.
//
Функция ЗакрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаОплат, ВыходныеПараметры, МассивСКомандами)

	Результат = Истина;
	СтрокаЛога = "";

	СуммаНаличнойОплаты     = 0;
	СуммаБезналичнойОплаты1 = 0;
	СуммаБезналичнойОплаты2 = 0;

	Для каждого Оплата Из ТаблицаОплат Цикл
	
		Если Оплата.ТипОплаты = 0 Тогда
		
			СуммаНаличнойОплаты = СуммаНаличнойОплаты + Оплата.Сумма;
			
		ИначеЕсли Оплата.ТипОплаты = 1 Тогда	
			
			СуммаБезналичнойОплаты1 = СуммаБезналичнойОплаты1 + Оплата.Сумма;
			
		ИначеЕсли Оплата.ТипОплаты = 2 Тогда		
			
			СуммаБезналичнойОплаты2 = СуммаБезналичнойОплаты2 + Оплата.Сумма;
			
		КонецЕсли; 
	
	КонецЦикла; 
	
	//Для ИндексОплаты = 0 По ТаблицаОплат.Количество() - 1 Цикл
	//	Если ТаблицаОплат[ИндексОплаты][0].Значение = 0 Тогда
	//		СуммаНаличнойОплаты = СуммаНаличнойОплаты + ТаблицаОплат[ИндексОплаты][1].Значение;
	//	ИначеЕсли ТаблицаОплат[ИндексОплаты][0].Значение = 1 Тогда
	//		СуммаБезналичнойОплаты1 = СуммаБезналичнойОплаты1 + ТаблицаОплат[ИндексОплаты][1].Значение;
	//	Иначе
	//		СуммаБезналичнойОплаты2 = СуммаБезналичнойОплаты2 + ТаблицаОплат[ИндексОплаты][1].Значение;
	//	КонецЕсли;
	//КонецЦикла;

	// Если безналичная оплата и для фискального регистратора не разрешено печатать фискальный чек
	Если Параметры.Свойство("ИспользоватьПриБезналичнойОплате") 
			И Не Параметры.ИспользоватьПриБезналичнойОплате И СуммаНаличнойОплаты = 0 Тогда 
		ПараметрыПодключения.ЧекОткрыт = Ложь;
		Возврат Истина;
	КонецЕсли;
	
	Если Не ПараметрыПодключения.ЧекОткрыт Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ka='ჩეკი არ იქნა გახსნილი';ru='Чек не был открыт';en='The check was not open'"));
		Результат = Ложь;
	Иначе
		Если ПараметрыПодключения.ФискальныйЧек Тогда
			// МассивСКомандами
			Если НЕ СуммаБезналичнойОплаты1 = 0 Тогда 
				МассивСКомандами.Добавить("T,1,______,_,__;1;" + Формат(СуммаБезналичнойОплаты1, "ЧРД=,; ЧГ=0") + ";;;;");
			КонецЕсли;
			
			Если НЕ СуммаБезналичнойОплаты2 = 0 Тогда 
				МассивСКомандами.Добавить("T,1,______,_,__;2;" + Формат(СуммаБезналичнойОплаты2, "ЧРД=,; ЧГ=0") + ";;;;");
			КонецЕсли;
			
			Если НЕ СуммаНаличнойОплаты = 0 Тогда 
				МассивСКомандами.Добавить("T,1,______,_,__;0;" + Формат(СуммаНаличнойОплаты, "ЧРД=,; ЧГ=0") + ";;;;");
			КонецЕсли;
			
			МассивСКомандами.Добавить("T,1,______,_,__;");
			
		КонецЕсли;
		
		ПараметрыПодключения.ЧекОткрыт = Ложь;
		
		Результат = СоздатьКоммандныйФайл(Параметры, МассивСКомандами, СтрокаЛога);
		Если Не Результат Тогда 
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(СтрокаЛога);
		КонецЕсли;
		
		СтрокаЛога = СтрокаЛога + "===== "
		                        + ?(ПараметрыПодключения.ФискальныйЧек,
		                            НСтр("ka='ფისკალური ჩეკის დახურვა';ru='Закрытие фискального чека';en='Closing a fiscal receipt'"),
		                            НСтр("ka='არაფისკალური ჩეკის დახურვა';ru='Закрытие нефискального чека';en='Closure of non-fiscal receipt'"))
		                        + " =====" + Символы.ПС;		
	КонецЕсли;

	ПараметрыПодключения.СтрокаЛога = ПараметрыПодключения.СтрокаЛога + СтрокаЛога;
	Возврат Результат;

КонецФункции

// Функция осуществляет внесение или выемку суммы на ФР.
//
Функция Инкассация(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТипИнкассации, Сумма, ВыходныеПараметры)

	Результат = Истина;

	СообщитьПользователю(?(ТипИнкассации = 1, НСтр("ka='თანხაზე შეტანა';ru='Внесение на сумму';en='Adding to the amount'"), НСтр("ka='ამოღება (მიუთითეთ თანხა)';ru='Выемка на сумму';en='The recess in the amount of'"))
	                                                 + " " + Сумма);

	// Заполнение выходных параметров
	ВыходныеПараметры.Добавить(1);
	ВыходныеПараметры.Добавить(1);
	ВыходныеПараметры.Добавить(0);
	ВыходныеПараметры.Добавить(ТекущаяДата());

	Возврат Результат;

КонецФункции

// Функция осуществляет снятие отчёта без гашения.
//
Функция НапечататьОтчетБезГашения(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	Результат = Истина;

	СообщитьПользователю(НСтр("ka='ანგარიშის ბეჭდვა დაფარვის გარეშე';ru='Печать отчета без гашения';en='Print the report without damping'"));

	// Заполнение выходных параметров
	ВыходныеПараметры.Добавить(1);
	ВыходныеПараметры.Добавить(1);
	ВыходныеПараметры.Добавить(0);
	ВыходныеПараметры.Добавить(ТекущаяДата());

	Возврат Результат;

КонецФункции

// Функция осуществляет снятие отчёта с гашением.
//
Функция НапечататьОтчетСГашением(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	Результат = Истина;

	СообщитьПользователю(НСтр("ka='ანგარიშის ბეჭდვა დაფარვით';ru='Печать отчета с гашением';en='Printing a report from the quenching'") + Символы.ПС
	                                                 + "----- " + НСтр("ka='ცვლა დახურულია';ru='Смена закрыта';en='Change is closed'")
	                                                 + " -----");

	// Заполнение выходных параметров
	ВыходныеПараметры.Добавить(1);
	ВыходныеПараметры.Добавить(1);
	ВыходныеПараметры.Добавить(0);
	ВыходныеПараметры.Добавить(ТекущаяДата());

	Возврат Результат;

КонецФункции

// Функция осуществляет открытие денежного ящика
//
Функция ОткрытьДенежныйЯщик(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	Результат = Истина;

	СообщитьПользователю(НСтр("ka='ფულის უჯრა გახსნილია';ru='Денежный ящик открыт';en='Cash drawer open'"));

	Возврат Результат;

КонецФункции

//////////// ДОПОЛНИТЕЛЬНЫЕ КОМАНДЫ ////////////////////

// Функция осуществляет снятие отчёта без гашения.
//
Функция ТестУстройства(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	Результат = Истина;

	ВыходныеПараметры.Добавить(?(Результат, 0, 999));
	ВыходныеПараметры.Добавить(НСтр("ka='ტესტირებამ წარმატებით ჩაიარა!';ru='Тестирование прошло успешно!';en='Testing is successful!'"));

	Возврат Результат;

КонецФункции

// Функция возвращает версию установленного драйвера
//
Функция ПолучитьВерсиюДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	Результат = Истина;

	ВыходныеПараметры.Добавить(НСтр("ka='დაყენებულია';ru='Установлен';en='Set'"));
	ВыходныеПараметры.Добавить(НСтр("ka='გაურკვეველია';ru='Не определена';en='Not determined'"));

	Попытка
		ВыходныеПараметры[1] = ОбъектДрайвера;
	Исключение
	КонецПопытки;

	Возврат Результат;

КонецФункции

Функция ПоддержкаАсинхронногоРежима() Экспорт

	Возврат Ложь;

КонецФункции // ()
 