
#Область ПеременныеФормы

&НаКлиенте
Перем ОбновитьПодчиненнуюСчетФактуру;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	ЭтотОбъект.ОснованиеСоздания = Параметры.Основание;
	
	//+++ Дмгг
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда 
		ПересчитатьКурсКратностьПриКопированииДокумента();
	КонецЕсли;
	//--- Дмгг
	
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);
	Контрагент = Объект.Контрагент;
	Договор = Объект.Договор;
	Если ЗначениеЗаполнено(Договор) Тогда
		ВалютаРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВалютаРасчетов");
	КонецЕсли;
	Заказ = Объект.Заказ;
	НациональнаяВалюта = УправлениеНебольшойФирмойПовтИсп.ПолучитьНациональнуюВалюту();
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", НациональнаяВалюта));
	КурсНациональнаяВалюта = СтруктураПоВалюте.Курс;
	КратностьНациональнаяВалюта = СтруктураПоВалюте.Кратность;
	
	//ПодольскийАИ #УчетПроектов 10.10.2020 {
	УчетПоПроектам = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ФункциональнаяОпцияУчетПоПроектам");
	//ПодольскийАИ #УчетПроектов 10.10.2020 }
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Параметры.Свойство("ВидОперацииВозврат") Тогда
			Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Параметры.Основание) И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС(Истина);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.Заказ) И Параметры.Свойство("Основание") И ТипЗнч(Параметры.Основание)=Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
			Для каждого строкаЗапасы Из Объект.Запасы Цикл
				РаботаСНоменклатуройСервер.ЗаполнитьДанныеВСтрокеТабличнойЧасти(Объект, "Запасы", строкаЗапасы);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	ПолучитьСтруктуруВидовОпераций();
	
	// Сформируем надпись цены и валюты.
	УчетВалютныхОпераций = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
	СтруктураНадписи = Новый Структура("ВидЦен, ВидСкидки, ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, НалогообложениеНДС, ДисконтнаяКарта, ПроцентСкидкиПоДисконтнойКарте", Объект.ВидЦен, Объект.ВидСкидкиНаценки, Объект.ВалютаДокумента, ВалютаРасчетов, Объект.Курс, КурсНациональнаяВалюта, Объект.СуммаВключаетНДС, УчетВалютныхОпераций, Объект.НалогообложениеНДС, Объект.ДисконтнаяКарта, Объект.ПроцентСкидкиПоДисконтнойКарте);
	ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
	
	ИменаТЧ = Новый Массив;
	ИменаТЧ.Добавить(Новый Структура("ИмяПоляПроверки, ИмяПоляОформления", "Объект.Запасы.СтранаПроисхождения", "ЗапасыНомерГТД"));
	
	ГрузовыеТаможенныеДекларацииСервер.ПриСозданииНаСервере(ЭтаФорма, ИменаТЧ, КэшЗначений);
	
	УстановитьВидимостьИДоступность();
	
	// Установка видимости реквизитов от пользовательских настроек
	УстановитьВидимостьОтПользовательскихНастроек(); 
	
	Элементы.Ячейка.Видимость = НЕ Объект.СтруктурнаяЕдиница.ОрдерныйСклад;
	
	//Установить надписи счет-фактура и основание
	НайденныйСчетФактура = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйСчетФактуру(Объект.Ссылка, Ложь);
	Элементы.СчетФактураНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьСчетФактура(НайденныйСчетФактура,,СчетФактураТекст);
	Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Объект.ДокументОснование);
	ЗаполнитьСписокДокументОснование();
	
	////-------------------------- // Россофт // --->
	НайденныйЭлНакладная = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйЭлНакладная(Объект.Ссылка);
	Элементы.ЭлектроннаяНакладнаяНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьЭлНакладная(НайденныйЭлНакладная);
	////-------------------------- //Россофт  // <---
	
	Пользователь = Пользователи.ТекущийПользователь();
	
	ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнойСклад");
	ОсновнойСклад = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
	
	// Установка видимости договора.
	УстановитьВидимостьДоговора();
	
	// Настройка подразделения
	Если НЕ ПолучитьФункциональнуюОпцию("УчетПоНесколькимПодразделениям") Тогда
		Элементы.ДополнительноПраваяКолонка.Объединенная = Истина;
	КонецЕсли;
	
	// ЕГАИС
	ИнтеграцияЕГАИСУНФ.УстановитьУсловноеОформлениеСправокЕГАИС(ЭтотОбъект);
	ИнтеграцияЕГАИСУНФ.ЗаполнитьНеобходимостьВводаСправкиНаАлкоголь(Объект.Запасы);
	// Конец ЕГАИС
	
	// ЭДО
	УстановитьВидЭД();
	
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.ДекорацияСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(Отказ, СтандартнаяОбработка, ПараметрыЭДОПриСоздании);
	// Конец ЭДО
	
	// ПодборНоменклатурыВДокументах
	ПодборНоменклатурыВДокументах.НазначитьФормуПодбора(ПараметрыОткрытияПодбора, Объект.Ссылка.Метаданные().Имя, "Запасы");
	// Конец ПодборНоменклатурыВДокументах
	
	// КопированиеСтрокТабличныхЧастей
	КопированиеТабличнойЧастиСервер.ПриСозданииНаСевере(Элементы, "Запасы");
	
	// ГрупповоеИзменениеСтрок
	ЗаполнитьСписокДействий();
	ГрупповоеИзменениеСтрокСервер.ПриСозданииНаСервере(НаборЭлементовГрупповогоИзмененияСтрокСервер(), ЭтотОбъект.ЗапасыИзменениеСтрокДействие);
	ЗапасыИзменениеСтрокДействиеПриОткрытии = ЗапасыИзменениеСтрокДействие;
	УстановитьПометку(Истина);
	// Конец ГрупповоеИзменениеСтрок
	
	ОбменСGoogle.ПодключитьОбработчикиСобытияАвтоподбор(ЭтотОбъект);
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	// АвтоматическиеСкидки.
	АвтоматическиеСкидкиПриСозданииНаСервере();
	ВидОперацииПродажаПокупателю = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю");
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере(Метаданные.Документы.РасходнаяНакладная.ТабличныеЧасти.Запасы, НастройкиЗагрузкиДанных, ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = УправлениеСвойствамиПереопределяемый.ЗаполнитьДополнительныеПараметры(Объект, "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПодключаемоеОборудование
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	СписокЭлектронныхВесов = МенеджерОборудованияВызовСервера.ПолучитьСписокОборудования("ЭлектронныеВесы", , МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента());
	Если СписокЭлектронныхВесов.Количество() = 0 Тогда
		// Нет подключенных весов.
		Элементы.ЗапасыПолучитьВес.Видимость = Ложь;
	КонецЕсли;
	Элементы.ЗапасыЗагрузитьДанныеИзТСД.Видимость = ИспользоватьПодключаемоеОборудование;
	// Конец ПодключаемоеОборудование
	
	//Ручные скидки
	СкидкиНаценкиКлиентСервер.РассчитатьСуммуИПроцентСкидки(ЭтотОбъект);
	//Конец Ручные скидки
	
	ОбновитьВидимостьИОстаткиВзаиморасчетов();	
	Элементы.ГруппаПредоплата.Заголовок = РаботаСФормойДокументаКлиентСервер.ПолучитьЗаголовокПредоплаты(Объект.Предоплата, Объект.ВалютаДокумента);
	
	// Серийные номера
	ИспользоватьСерийныеНомераОстатки = РаботаССерийнымиНомерами.ИспользоватьСерийныеНомераОстатки();
	
		// МобильноеПриложение
	Если МобильноеПриложениеВызовСервера.НужноОграничитьФункциональность() Тогда
		Элементы.ВидОперации.Видимость = Ложь;
		Элементы.ФормаОбщаяКомандаНапомнить.Видимость = Ложь;
		Элементы.ГруппаГлобальныеКоманды.Видимость = Ложь;
		Элементы.ФормаНастройкаДокумента.Видимость = Ложь;
		Элементы.ПоказатьВЖурналеКонтрагентов.Видимость = Ложь;
		Элементы.ФормаОбработкаНастройкаПрограммыБольшеВозможностейКонтекст.Видимость = Ложь;
		Элементы.ГруппаПредоплата.Видимость = Ложь;
		Элементы.ГруппаДополнительно.Видимость = Ложь;
		Элементы.ИтогСуммаНДС.Видимость = Ложь;
		Элементы.ГруппаСсылки.Видимость = Ложь;
		Элементы.ГруппаЦеныИВалюта.Видимость = Ложь;
		Элементы.ЗапасыГруппаКопированиеСтрок.Видимость = Ложь;
		Элементы.ЗапасыПодбор.Видимость = Ложь;
		Элементы.ЗагрузкаДанныхИзВнешнегоИсточника.Видимость = Ложь;
		Элементы.ЗапасыИзменитьСтроки.Видимость = Ложь;
		Элементы.ЗапасыСтавкаНДС.Видимость = Ложь;
		Элементы.ЗапасыСуммаНДС.Видимость = Ложь;
		
		Элементы.ФормаЗаписать.Видимость = Ложь;
		Элементы.ФормаПровести.Видимость = Ложь;
		Элементы.ФормаОтменаПроведения.Видимость = Ложь;
		Элементы.ФормаПоказатьВСписке.Видимость = Ложь;
		Элементы.ФормаКоманднаяПанельКомандыЭДО.Видимость = Ложь;
		Элементы.ФормаПровестиИЗакрыть.Заголовок = "Готово";
	КонецЕсли;
	// Конец МобильноеПриложение
	
	// ИнтеграцияГИСМ
	СформироватьТекстУведомлениеОбОтгрузкеМаркированнойПродукцииСервер();
	// Конец ИнтеграцияГИСМ
	
	ОпределитьВидимостьНастроекУчетаВНалогообложении();
	
	//++Lazare 13.12.2021
	ЗапретРедактирования = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ЗапретРедактированияПроведенныхДокументовРеализация");	
	//--Lazare 13.12.2021
	
	//Паганини#ЛимитиПокупателей_
	ПравоРедактированияЛимитов = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(, "ПравоРедактированияЛимитовПокупателей");
	Элементы.ОтключитьКонтрольЛимитаЗадолжностиПокупателя.ТолькоПросмотр = НЕ ПравоРедактированияЛимитов;
	//_Паганини#ЛимитиПокупателей
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПрочитатьВесИОбъемЕдиницыТовара();
		//Паганини_
		Объект.НомерТТН 					= "";
		Объект.IDTТН						= "";
		Объект.ФактурыАвансов.Очистить();
		//Объект.СтатусТТН					= Неопределено;
		//Объект.ДатаНачалаТранспортировки	= Дата(1,1,1);//_Паганини
		//ПаганиниDMS_
		Объект.TL_DMSNo  = "";
		//_ПаганиниDMS
		//Паганини#ЛимитиПокупателей_
		Если НЕ ПравоРедактированияЛимитов Тогда
			Объект.ОтключитьКонтрольЛимитаЗадолжностиПокупателя = Ложь;
		КонецЕсли;
		//_Паганини#ЛимитиПокупателей
		
	Иначе 
		//++Lazare 13.12.2021
		Если Объект.Проведен Тогда
			ТолькоПросмотр = ЗапретРедактирования;
			//КоманднаяПанель.Доступность =Не ЗапретРедактирования;
			//ЭтаФорма.Доступность = Не ЗапретРедактирования;
		КонецЕсли;
		//--Lazare 13.12.2021
		
	КонецЕсли;
	
	Если Параметры.Свойство("Страница")
		И НЕ ПустаяСтрока(Параметры.Страница)
		И НЕ Элементы.Найти(Параметры.Страница) = Неопределено Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы[Параметры.Страница];
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьСчетаБезвозмезднойПродажи(); //+++ Истмин
	КонецЕсли;
	
	ОбновитьВидимостьТраспортныхСредств();
	УстановкаФорматовЦен();// Kuzmich, 05.06.2019, Количество знаков после запятой в цене
	ОбщегоНазначенияПереопределяемый.УстановитьДополнительноеПоведениеСтандартныхКнопокТЧЗапасы(ЭтаФорма);// Kuzmich, 07.08.2019, Дополнительные инструменты в табличных частях документов движения товаров
	УстановитьВидимостьСотрудниковвТабЧастиЗапасы(); //+++ Дмгг БезвозмезднаяПродажаНаСотрудников
	
	ИспользоватьИсториюНалогообложенияКонтрагента = ПолучитьФункциональнуюОпцию("ФункциональнаяОпцияИспользоватьИсториюНалогообложенияКонтрагентов"); //+++ Дмгг
	
	Если Не (РольДоступна("ПолныеПрава") Или Не Константы.ФункционалПраваРедактированияНоменклатуры.Получить()) Тогда	
		ПравоИзмененияЦеныНоменклатурыВРасходнойНакладной = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(,"ПравоИзмененияЦеныНоменклатурыВРасходнойНакладной");//Паганини	
		Элементы.ЗапасыЦена.ТолькоПросмотр  = Не ПравоИзмененияЦеныНоменклатурыВРасходнойНакладной;
		Элементы.ЗапасыСумма.ТолькоПросмотр = Не ПравоИзмененияЦеныНоменклатурыВРасходнойНакладной;
	КонецЕсли;
	//Lazare_
	Если Не РольДоступна("ПолныеПрава") Тогда				
		МассивГрупп = ОбщегоНазначения.ПолучитьГруппыНоменклатурыИзНастроекПользователя("ЗапретРедактированияЦенВДокументахРазрезеГруппНоменклатуры");
		ГруппыПользователя.ЗагрузитьЗначения(МассивГрупп);		
	КонецЕсли;
	//_Lazare
	
	НайденныйНалоговыйДокумент = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйНалоговыйДокумент(Объект.Ссылка);
	Элементы.НалоговыйДокументНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьНалоговыйДокумент(НайденныйНалоговыйДокумент);
	
	
	УстановитьВидимостьИсполнительовВТабЧастиЗапасы();//Lazare 26.10.2021
	//+++ Дмгг
	КолвоБалов = 0;
	КоэффициентЛояльности = 0;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		КоэффициентЛояльности = Объект.КартаЛояльности.Владелец.КоэфициентПересчета;
		Если ЗначениеЗаполнено(Объект.КартаЛояльности) Тогда 
			Элементы.ДоступноБалов.Заголовок = НСтр("ru = 'Достуно балов: '; ka = 'Достуно балов: '; en = 'Достуно балов: '") + Объект.ДоступноБалов;
		КонецЕсли;
	КонецЕсли;
	
	ИспользоватьКартыЛояльности = ПолучитьФункциональнуюОпцию("ИспользоватьКартыЛояльности");
	
	УстановитьВидимостьДокументАвтоматическогоПроизводства();
	//--- Дмгг
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СтатистикаИспользованияФормКлиент.ПроверитьЗаписатьСтатистикуКоманды(
		"СоздатьНаОсновании.РасходнаяНакладная",
		ЭтотОбъект.ВладелецФормы,
		ЭтотОбъект.ОснованиеСоздания
	);
	
	// ГрупповоеИзменениеСтрок
	ОпределитьОбъектИзменений();
	// Конец ГрупповоеИзменениеСтрок
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	// Конец ПодключаемоеОборудование
	
	// ЭДО
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец ЭДО
	
	//+++ Дмгг
	УстановитьВиимостИспользованияБалов();
	//--- Дмгг
	
	ОбновитьПодвалФормы();
	
	СформироватьПроверкаВидимостьДоступностьСервер();
	//ЗаполнитьИтогКоличество(); //+++ Дмгг
	ЗаполнитьЦенуЗакупки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	// АвтоматическиеСкидки
	// Выведем сообщение о рассчёте скидок, если нажата кнопка "Провести и закрыть" или форма закрывается по крестику, с сохранением изменений.
	Если ИспользоватьАвтоматическиеСкидки И СкидкиРассчитаныПередЗаписью Тогда
		ПоказатьОповещениеПользователя("Изменение:", 
										ПолучитьНавигационнуюСсылку(Объект.Ссылка), 
										Строка(Объект.Ссылка)+". Автоматические скидки (наценки) рассчитаны!", 
										БиблиотекаКартинок.Информация32);
	КонецЕсли;
	// Конец АвтоматическиеСкидки
	
	СтатистикаИспользованияФормКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы);
	
	Если НЕ ЗавершениеРаботы Тогда
		// ГрупповоеИзменениеСтрок
		СохранитьТекущееДействиеИзмененияСтрок();
	КонецЕсли;
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Документ.СчетФактура.Форма.ФормаДокумента" Тогда
		
		СчетФактураТекст = "Счет-фактура: " + ВыбранноеЗначение;
		Элементы.СчетФактураНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьСчетФактура(ВыбранноеЗначение);
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ПечатьТТН.Форма.ДанныеПечати" Тогда
		
		Для каждого ЗначенияРеквизита Из ВыбранноеЗначение Цикл
			
			Если ЗначенияРеквизита.Ключ = "БанковскийСчетОрганизации" Тогда
				
				Объект.БанковскийСчет = ЗначенияРеквизита.Значение;
				
			Иначе
				
				Объект[ЗначенияРеквизита.Ключ] = ЗначенияРеквизита.Значение;
				
			КонецЕсли;
			
			Модифицированность = Истина;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование"
		И ВводДоступен() И Не СчитанаДисконтнаяКарта Тогда
		Если ИмяСобытия = "ScanData" Тогда
			//Преобразуем предварительно к ожидаемому формату
			Данные = Новый Массив();
			Если Параметр[1] = Неопределено Тогда
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[0], 1)); // Достаем штрихкод из основных данных
			Иначе
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[1][1], 1)); // Достаем штрихкод из дополнительных данных
			КонецЕсли;
			
    		ТекШтрихкод = Данные[0].Штрихкод;
	
			ВариантРаспознаванияШтрихкода = ПолучитьВариантРаспознаванияШтрихкода();
			//Если (ВариантРаспознаванияШтрихкода = ПредопределенноеЗначение("Перечисление.ВариантыРаспознованияШтрихкодов.Вес") И СтрДлина(ТекШтрихкод) = 13)
			//	ИЛИ ВариантРаспознаванияШтрихкода = ПредопределенноеЗначение("Перечисление.ВариантыРаспознованияШтрихкодов.Цена") Тогда
			Если ((ВариантРаспознаванияШтрихкода = ПредопределенноеЗначение("Перечисление.ВариантыРаспознованияШтрихкодов.Вес") И СтрДлина(ТекШтрихкод) = 13)
				ИЛИ ВариантРаспознаванияШтрихкода = ПредопределенноеЗначение("Перечисление.ВариантыРаспознованияШтрихкодов.Цена"))
				И Лев(ТекШтрихкод,3) = "990" Тогда
	
				ДобавитьШтрихкодВТабличнуюЧасть(ТекШтрихкод, ВариантРаспознаванияШтрихкода);
				Возврат;
		
			КонецЕсли; 			
			
			ПолученыШтрихкоды(Данные);
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	// ДисконтныеКарты
	Если СчитанаДисконтнаяКарта Тогда
		СчитанаДисконтнаяКарта = Ложь;
	КонецЕсли;
	// Конец ДисконтныеКарты
	
	Если ИмяСобытия = "ОбновитьДокументИБПослеЗаполнения" Тогда
		
		ЭтотОбъект.Прочитать();
		
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновлениеТекстаПроСчетФактуру" 
		И ТипЗнч(Параметр) = Тип("Структура") 
		И Параметр.ДокументОснование = Объект.Ссылка Тогда
		
		СчетФактураТекст = Параметр.Представление;
		Элементы.СчетФактураНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьСчетФактура(Параметр.Представление);
		
	ИначеЕсли ИмяСобытия = "Запись_Контрагент" 
		И ЗначениеЗаполнено(Параметр)
		И Объект.Контрагент = Параметр Тогда
			
		УстановитьВидимостьДоговора();
		
	ИначеЕсли ИмяСобытия = "ПодборПроизведен" 
		И ЗначениеЗаполнено(Параметр) 
		//Проверка на владельца формы
		И Источник <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")
		И Источник = УникальныйИдентификатор
		Тогда
		
		АдресЗапасовВХранилище	= Параметр;
		
		ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, "Запасы", Истина, Истина);
		
		РассчитатьОбъемИВесВДокументе();
	
	ИначеЕсли ИмяСобытия = "ПодборСерий"
		И ЗначениеЗаполнено(Параметр) 
		//Проверка на владельца формы
		И Источник <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")
		И Источник = УникальныйИдентификатор
		Тогда
		
		ИзменилосьКоличество = ПолучитьСерийныеНомераИзХранилища(Параметр.АдресВоВременномХранилище, Параметр.КлючСтроки);
		Если ИзменилосьКоличество Тогда
			РассчитатьСуммуВСтрокеТабличнойЧасти();
		КонецЕсли; 
		
	КонецЕсли;
	
	// КопированиеСтрокТабличныхЧастей
	Если ИмяСобытия = "БуферОбменаТабличнаяЧастьКопированиеСтрок" Тогда
		КопированиеТабличнойЧастиКлиент.ОбработкаОповещения(Элементы, "Запасы");
	КонецЕсли;
	
	// ИнтеграцияГИСМ
	Если ИмяСобытия = "Запись_УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ"
		И Параметр.Основание = Объект.Ссылка Тогда
		
		СформироватьТекстУведомлениеОбОтгрузкеМаркированнойПродукцииСервер();
		
	КонецЕсли;
	 // Конец ИнтеграцияГИСМ
	
	// Обсуждения
	ОбсужденияКлиент.ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтотОбъект, Объект.Ссылка);
	// Конец Обсуждения
	
	// ЭДО
	ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
	ПараметрыОповещения.Форма = ЭтотОбъект;
	ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
	ПараметрыОповещения.ДекорацияСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
	// Конец ЭДО
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтеграцияГИСМ
	Если ИмяСобытия = "ИзменениеСостоянияГИСМ"
		И Параметр.Ссылка = Объект.Ссылка Тогда
		
		ОбновитьСтатусГИСМ();
		
	КонецЕсли;
	
	Если ИмяСобытия = "ВыполненОбменГИСМ"
		И (Параметр = Неопределено
		Или (ТипЗнч(Параметр) = Тип("Структура") И Параметр.ОбновлятьСтатусГИСМФормахВДокументах)) Тогда
		
		ОбновитьСтатусГИСМ();
		
	КонецЕсли;
	// Конец ИнтеграцияГИСМ
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтеграцияГИСМ
	СформироватьТекстУведомлениеОбОтгрузкеМаркированнойПродукцииСервер();
	// Конец ИнтеграцияГИСМ
	
	// ИнтеграцияГИСМ
	СформироватьТекстУведомлениеОбОтгрузкеМаркированнойПродукцииСервер();
	// Конец ИнтеграцияГИСМ
	
	ПрочитатьВесИОбъемЕдиницыТовара();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "Проведение"+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ЭтотОбъект.ИмяФормы));
	КонецЕсли;
	// СтандартныеПодсистемы.ОценкаПроизводительности
	
	ОбновитьПодчиненнуюСчетФактуру = Модифицированность;
	
	// АвтоматическиеСкидки
	СкидкиРассчитаныПередЗаписью = Ложь;
	// Если документ проводится, проверим рассчитанность скидок.
	выключениеАвтоматическихСкидок = получитьЗначениевыключениеАвтоматическихСкидок();
	Если ИспользоватьАвтоматическиеСкидки И Объект.ВидОперации = ВидОперацииПродажаПокупателю И Не выключениеАвтоматическихСкидок Тогда
		
		Если Не Объект.СкидкиРассчитаны И СкидкиИзменились() Тогда
			РассчитатьСкидкиНаценкиКлиент();
			РассчиталиСкидки = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Рассчитаны автоматические скидки (наценки)!";
			Сообщение.КлючДанных = Объект.Ссылка;
			Сообщение.Сообщить();
			
			СкидкиРассчитаныПередЗаписью = Истина;
		Иначе
			Объект.СкидкиРассчитаны = Истина;
			ОбновитьКартинкуАвтоСкидкиПослеЗаписи = Истина;
		КонецЕсли;
		ОкруглениеСуммы();
	КонецЕсли;
	
	// Конец АвтоматическиеСкидки
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
	
	//++Lazare 29-10-2021
	Если Объект.ОптоваяЦенаВДок = ПредопределенноеЗначение("Справочник.ВидыЦен.Оптовая")и 
		ПолучитьФункционалТипЦеныНоменклатурыПоКоличеству()  и Объект.ВывестиСообщение = Истина
		Тогда 
		
		Вопр = Вопрос("საქონელი გამოიწერა საბითუმო ფასში, გთხოვთ მოახდინოთ მყიდველის იდენტიფიცირება",
		РежимДиалогаВопрос.ДаНет,
		0, 			
		КодВозвратаДиалога.Да, 
		"" 
		);		
		Если Вопр = КодВозвратаДиалога.Нет Тогда 			
			Отказ = Истина ;	
		Иначе 
			Объект.ВывестиСообщение = Ложь ;		
		КонецЕсли;

	КонецЕсли;
	//--Lazare 29-10-2021
		
	Если ПолучитьФункционалТипЦеныНоменклатурыПоКоличеству() и  ЗначениеЗаполнено(Объект.ОптоваяЦенаВДок) Тогда 
		
		Если Объект.ОптоваяЦенаВДок <> ПредопределенноеЗначение("Справочник.ВидыЦен.Учетная") Тогда 		
			Вопр = Вопрос("საქონელი გამოიწერა საცალო ფასის ტიპისგან განსხვავებული ფასის ტიპით, გთხოვთ მოახდინოთ მყიდველის იდენტიფიცირება.",
			РежимДиалогаВопрос.ДаНет,
			0, 			
			КодВозвратаДиалога.Да, 
			"" 
			);		
			Если Вопр = КодВозвратаДиалога.Нет Тогда 			
				Отказ = Истина ;	
			Иначе 
				Объект.ВывестиСообщение = Ложь ;		
			КонецЕсли;
		КонецЕсли
		
	КонецЕсли;
	
	

		
КонецПроцедуры

&НаСервере
Функция получитьЗначениевыключениеАвтоматическихСкидок()
	 выключениеАвтоматическихСкидок = Константы.выключениеАвтоматическихСкидок.Получить();
	 
	 Возврат выключениеАвтоматическихСкидок;
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ТекстСообщения = "";
		ПроверитьСоответствиеДоговораУсловиямДокумента(ТекстСообщения, Объект.Договор, Объект.Ссылка, Объект.Организация, Объект.Контрагент, Объект.ВидОперации, Отказ);
		
		Если ТекстСообщения <> "" Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ?(Отказ, НСтр("ru='Документ не проведен! ';ka='დოკუმენტი არ გატარებულა!'") + ТекстСообщения, ТекстСообщения);
			
			Если Отказ Тогда
				Сообщение.ПутьКДанным = "Объект";
				Сообщение.Поле = "Договор";
				Сообщение.Сообщить();
				Возврат;
			Иначе
				Сообщение.Сообщить();
			КонецЕсли;
		КонецЕсли;
		
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПоказатСебестоимостиВТаблице") Тогда
			Для Каждого Стр Из Объект.Запасы Цикл
				Если Стр.Цена < Стр.Себестоимость Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = ""+ Стр.Номенклатура +"-ის თვითღირებულება აღემატება ფასს";
					Сообщение.КлючДанных = Объект.Ссылка;
					Сообщение.Сообщить();
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;//Т
		// Kuzmich, 22.11.2020, Реквизиты УдерживатьПенсию и СчетДоходовБП в табличной части Запасы для вида операции БезвозмезднаяПродажаСотруднику в документе РасходнаяНакладная
		Если ТекущийОбъект.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику Тогда
			Для Каждого ТекущаяСтрока Из ТекущийОбъект.Запасы Цикл
				Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.СчетДоходовБП) Тогда
					ТекущаяСтрока.СчетДоходовБП = ТекущийОбъект.СчетДоходовБП;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// Kuzmich, 22.11.2020, Реквизиты УдерживатьПенсию и СчетДоходовБП в табличной части Запасы для вида операции БезвозмезднаяПродажаСотруднику в документе РасходнаяНакладная
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// Обсуждения
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Модифицированность",Модифицированность);
	// Конец Обсуждения

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбменСGoogle.УвеличитьЗначениеСчетчикаПодсказок(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// АвтоматическиеСкидки
	Если ОбновитьКартинкуАвтоСкидкиПослеЗаписи Тогда
		Элементы.ЗапасыРассчитатьСкидкиНаценки.Картинка = БиблиотекаКартинок.Обновить;
		ОбновитьКартинкуАвтоСкидкиПослеЗаписи = Ложь;
	КонецЕсли;
	// Конец АвтоматическиеСкидки
	
	// ЭДО
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.ДекорацияСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец ЭДО
	
	ОбновитьВидимостьИОстаткиВзаиморасчетов();
	
	// ГрупповоеИзменениеСтрок
	Если Элементы.ГруппаЗапасыИзменениеСтрок.Видимость Тогда
		УстановитьПометку(Истина);
	КонецЕсли;
	// Конец ГрупповоеИзменениеСтрок
	
	// ЕГАИС
	УстановитьДоступностьЭлементовЕГАИС();
	ИнтеграцияЕГАИСУНФ.ЗаполнитьНеобходимостьВводаСправкиНаАлкоголь(Объект.Запасы);
	// Конец ЕГАИС
	
	// ИнтеграцияГИСМ
	СформироватьТекстУведомлениеОбОтгрузкеМаркированнойПродукцииСервер();
	// Конец ИнтеграцияГИСМ
	
	ПрочитатьВесИОбъемЕдиницыТовара();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЗаполненЗаказ = Ложь;
	ЗаполненЗаказВозврат = Ложь;
	Для каждого СтрокаТЧ Из Объект.Запасы Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Заказ) Тогда
			Если ТипЗнч(СтрокаТЧ.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				ЗаполненЗаказ = Истина;
			Иначе
				ЗаполненЗаказВозврат = Истина;
			КонецЕсли;
			Прервать;
		КонецЕсли;		
	КонецЦикла;	
	
	Если ЗаполненЗаказ Тогда
		Оповестить("Запись_РасходнаяНакладная", Объект.Ссылка);
	КонецЕсли;
	
	Оповестить("ОповещениеОбИзмененииДолга");
	
	Если НЕ СчетФактураТекст = ""
		И ?(НЕ ОбновитьПодчиненнуюСчетФактуру = Неопределено, ОбновитьПодчиненнуюСчетФактуру, Ложь) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросОбИзмененииПодчиненнойСчетФактурыЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ka='დოკუმენტში განხორციელდა ცვლილებები. საჭიროა თუ არა დაქვემდებარებული ანგარიშფაქტურის განმეორებით შევსება?';ru='В документе были произведены изменения. Требуется ли повторно заполнить подчиненный Счет-фактуру?';en='The document changes were made. Do I need to re-fill the subordinate invoice?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ПринудительноЗакрытьФорму") И ПараметрыЗаписи.ПринудительноЗакрытьФорму Тогда
		Закрыть();
	КонецЕсли;
	
	ЗаполнитьЦенуЗакупки();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
КонецПроцедуры

&НаКлиенте
Процедура ЯчейкаПриИзменении(Элемент)
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОткрытие(Элемент, СтандартнаяОбработка)
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "Открытие");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Обработка события изменения даты.
	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(ДатаПередИзменением, ВалютаРасчетов);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВалютаРасчетов) Тогда
			ПересчитатьКурсКратностьВалютыРасчетов(СтруктураДанные);
		КонецЕсли;	
		
		// Сформируем надпись цены и валюты.
		СтруктураНадписи = Новый Структура("ВидЦен, ВидСкидки, ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, НалогообложениеНДС, ДисконтнаяКарта, ПроцентСкидкиПоДисконтнойКарте", Объект.ВидЦен, Объект.ВидСкидкиНаценки, Объект.ВалютаДокумента, ВалютаРасчетов, Объект.Курс, КурсНациональнаяВалюта, Объект.СуммаВключаетНДС, УчетВалютныхОпераций, Объект.НалогообложениеНДС, Объект.ДисконтнаяКарта, Объект.ПроцентСкидкиПоДисконтнойКарте);
		ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
		
		// ДисконтныеКарты
		// В этой процедуре происходить вызов не модального окна вопроса.
		ПересчитатьПроцентСкидкиПриИзмененииДатыДокумента();
		// Конец ДисконтныеКарты		
		
		ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС(Ложь)//+++ Дмгг
	КонецЕсли;
	
	// АвтоматическиеСкидки
	ДатаДокументаИзмененаВручную = Истина;
	СброситьФлагСкидкиРассчитаныКлиент("ДатаПриИзменении");
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	// Обработка события изменения организации.
	Объект.БанковскийСчет = "";
	Объект.Номер = "";
	СтруктураДанные = ПолучитьДанныеОрганизацияПриИзменении();
	Компания = СтруктураДанные.Компания;
	
	Объект.ПодписьРуководителя = СтруктураДанные.ПодписьРуководителя;
	Объект.ПодписьГлавногоБухгалтера = СтруктураДанные.ПодписьГлавногоБухгалтера;
	Объект.ИспользоватьФаксимиле = СтруктураДанные.ИспользоватьФаксимиле;
	
	Объект.Договор = ПолучитьДоговорПоУмолчанию(Объект.Ссылка, Объект.Контрагент, Объект.Организация, Объект.ВидОперации);
	ОбработатьИзменениеДоговора();
	
	// Сформируем надпись цены и валюты.
	СтруктураНадписи = Новый Структура("ВидЦен, ВидСкидки, ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, НалогообложениеНДС, ДисконтнаяКарта, ПроцентСкидкиПоДисконтнойКарте", Объект.ВидЦен, Объект.ВидСкидкиНаценки, Объект.ВалютаДокумента, ВалютаРасчетов, Объект.Курс, КурсНациональнаяВалюта, Объект.СуммаВключаетНДС, УчетВалютныхОпераций, Объект.НалогообложениеНДС, Объект.ДисконтнаяКарта, Объект.ПроцентСкидкиПоДисконтнойКарте);
	ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
	ОпределитьВидимостьНастроекУчетаВНалогообложении();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность(Истина);
	Объект.Предоплата.Очистить();
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю") Тогда
		Элементы.Подразделение.АвтоВыборНезаполненного = Истина;
		Элементы.Подразделение.АвтоОтметкаНезаполненного = Истина;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику") Тогда
		Элементы.Подразделение.АвтоВыборНезаполненного = Ложь;
		Элементы.Подразделение.АвтоОтметкаНезаполненного = Ложь;
		ОтключитьОтметкуНезаполненного();
		Объект.ЦенаВключаетНалоги = ПредопределенноеЗначение("Перечисление.ВидВлключениеНалоговВЦену.ЦенаВключаетНалоги");
		ЦенаВключаетНалогиПриИзменении(Неопределено);
	Иначе
		Элементы.Подразделение.АвтоВыборНезаполненного = Ложь;
		Элементы.Подразделение.АвтоОтметкаНезаполненного = Ложь;
		ОтключитьОтметкуНезаполненного();
	КонецЕсли;                                                                                       
	
	Объект.Договор = ПолучитьДоговорПоУмолчанию(Объект.Ссылка, Объект.Контрагент, Объект.Организация, Объект.ВидОперации);
	ОбработатьИзменениеДоговора();
	
	// Сформируем надпись цены и валюты.
	СтруктураНадписи = Новый Структура("ВидЦен, ВидСкидки, ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, НалогообложениеНДС, ДисконтнаяКарта, ПроцентСкидкиПоДисконтнойКарте", Объект.ВидЦен, Объект.ВидСкидкиНаценки, Объект.ВалютаДокумента, ВалютаРасчетов, Объект.Курс, КурсНациональнаяВалюта, Объект.СуммаВключаетНДС, УчетВалютныхОпераций, Объект.НалогообложениеНДС, Объект.ДисконтнаяКарта, Объект.ПроцентСкидкиПоДисконтнойКарте);
	ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
	ОпределитьВидимостьНастроекУчетаВНалогообложении();
	
	УстановитьВидимостьСотрудниковвТабЧастиЗапасы(); //+++ Дмгг
	
	ЦенаПоСебестоимостиПриИзменении(Элементы.ЦенаПоСебестоимости); // Kuzmich, 16.02.2020, Цена по себестоимости при безвозмездной продаже сотруднику
КонецПроцедуры

&НаКлиенте
Процедура СтруктурнаяЕдиницаПриИзменении(Элемент)
	
	УстановитьВидимостьЯчейки("Ячейка", Объект.СтруктурнаяЕдиница);
	// Kuzmich, 12.05.2019, Заполнение типа цен из настроек склада
	СтруктураПроверкиЦен = ПроверитьВидЦен();
	Если НЕ СтруктураПроверкиЦен = НЕОПРЕДЕЛЕНО Тогда
		ДополнительныеПараметры = Новый Структура("ВалютаРасчетовПередИзменением", Объект.ВалютаДокумента);
		ОткрытьФормуЦеныИВалютаЗавершение(СтруктураПроверкиЦен, ДополнительныеПараметры);
		Модифицированность = Истина;
		СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элементы.ЦеныИВалюта, "Нажатие");
	КонецЕсли;
	// Kuzmich, 12.05.2019, Заполнение типа цен из настроек склада
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
	СтруктураДанные = ПолучитьДанныеСтруктурнойЕдиницыПриИзменении(Объект.СтруктурнаяЕдиница);
	
	Объект.ПодписьКладовщика = СтруктураДанные.ПодписьКладовщика;

	ПересчитатьПолеКоличествоЗапасовНаСкладеВТчЗапасы(Объект.СтруктурнаяЕдиница); //++Lazare01.11.2021 
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПередИзменением = Контрагент;
	КонтрагентВестиРасчетыПоЗаказамПередИзменением = КонтрагентВестиРасчетыПоЗаказам;
	Контрагент = Объект.Контрагент;
	
	Если КонтрагентПередИзменением <> Объект.Контрагент Тогда
		
		ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС();
		
		Объект.БанковскийСчетКонтрагента = Неопределено;
		Объект.АдресДоставки = "";
		
		ВидимостьДоговораПередИзменением = Элементы.Договор.Видимость;
		
		СтруктураДанные = ПолучитьДанныеКонтрагентПриИзменении(Объект.Дата, Объект.ВалютаДокумента, Объект.Контрагент, Объект.Организация);
		
		// Дисконтные карты
		СтруктураДанные.Вставить("ВызовИзПроцедурыПриИзмененииКонтрагента", Истина);
		// Конец Дисконтные карты.
		
		Объект.Договор = СтруктураДанные.Договор;
		Объект.КонтактноеЛицоПодписант = СтруктураДанные.КонтактноеЛицоПодписант;
		ДоговорПередИзменением = Договор;
		Договор = Объект.Договор;
		
		ПечатьДокументовУНФКлиент.ПриИзмененииДоговораКонтрагента(Объект.Договор, Объект.ОснованиеПечатиСсылка, Объект.ОснованиеПечати);
		
		Если Объект.Предоплата.Количество() > 0
			И Объект.Договор <> ДоговорПередИзменением Тогда
			
			ПараметрыДокумента = Новый Структура;
			ПараметрыДокумента.Вставить("ИзменениеКонтрагента", Истина);
			ПараметрыДокумента.Вставить("ДанныеДоговора", СтруктураДанные);
			ПараметрыДокумента.Вставить("КонтрагентПередИзменением", КонтрагентПередИзменением);
			ПараметрыДокумента.Вставить("КонтрагентВестиРасчетыПоЗаказамПередИзменением", КонтрагентВестиРасчетыПоЗаказамПередИзменением);
			ПараметрыДокумента.Вставить("ВидимостьДоговораПередИзменением", ВидимостьДоговораПередИзменением);
			ПараметрыДокумента.Вставить("ДоговорПередИзменением", ДоговорПередИзменением);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ВопросОбОчисткеПредоплатыЗавершение", ЭтотОбъект, ПараметрыДокумента);
			ТекстВопроса = НСтр("ka='წინასწარი გადახდის ჩათვლა გაიწმინდება, გავაგრძელოთ?';ru='Зачет предоплаты будет очищен, продолжить?';en='Passed prepayment will be cleared to continue?'");
			
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			Возврат;
		КонецЕсли;
		
		ОбработатьИзменениеУсловийДоговора(СтруктураДанные, ДоговорПередИзменением);
		Объект.ФактурыАвансов.Очистить();//Паганини
		
	Иначе
		
		Объект.Договор = Договор; // Восстанавливаем автоматически очищеный договор.
		Объект.Заказ = Элементы.Заказ.ОграничениеТипа.ПривестиЗначение(Заказ);;
		
	КонецЕсли;
	
	Заказ = Объект.Заказ;
	
	// АвтоматическиеСкидки
	СброситьФлагСкидкиРассчитаныКлиент("КонтрагентПриИзменении");
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
	ЗаполнитьТС();
	
	//+++ Lazare 26.10.2021	
	ЗаполнитьОтветственногоИзКонтрагента = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ЗаполнитьОтветственногоИзКонтрагента");	
	Если  ЗаполнитьОтветственногоИзКонтрагента Тогда 	
		Объект.Ответственный = РС_ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.Контрагент,"Ответственный");	
	КонецЕсли;
	//--- Lazare_26.10.2021

	
КонецПроцедуры

Процедура ЗаполнитьТС()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Если Объект.ПоказатьТранспортныеСредства = Истина Тогда
			Объект.ТранспортныеСредства.Очистить();
			Объект.ТранспортныеСредства.Загрузить(Контрагент.ТранспортныеСредства.Выгрузить());
		Иначе 
			Если Контрагент.ТранспортныеСредства.ВыгрузитьКолонку("ТранпсортноеСедство").Количество() > 0 Тогда 
				Объект.ТранпсортноеСедство = Контрагент.ТранспортныеСредства.ВыгрузитьКолонку("ТранпсортноеСедство")[0];
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
			  
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ОбработатьИзменениеДоговора();
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = ПолучитьПараметрыФормыВыбора(Объект.Ссылка, Объект.Организация, Объект.Контрагент, Объект.Договор, Объект.ВидОперации);
	Если ПараметрыФормы.КонтролироватьВыборДоговора Тогда
		
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.ДоговорыКонтрагентов.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
	Если Объект.Предоплата.Количество() > 0
		И Объект.Заказ <> Заказ
		И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю") Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаказПриИзмененииЗавершение", ЭтотОбъект), НСтр("ka='წინასწარი გადახდის ჩათვლა გაიწმინდება, გავაგრძელოთ?';ru='Зачет предоплаты будет очищен, продолжить?';en='Passed prepayment will be cleared to continue?'"), Режим, 0);
		Возврат;
	КонецЕсли;
	
	ЗаказПриИзмененииФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.Предоплата.Очистить();
	Иначе
		Объект.Заказ = Элементы.Заказ.ОграничениеТипа.ПривестиЗначение(Заказ);
		Возврат;
	КонецЕсли;
	
	ЗаказПриИзмененииФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзмененииФрагмент()
	
	Заказ = Объект.Заказ;
	
	// АвтоматическиеСкидки
	СброситьФлагСкидкиРассчитаныКлиент("ЗаказПриИзменении");
	// Конец АвтоматическиеСкидки
	
КонецПроцедуры

&НаКлиенте
Процедура ОстатокВзаиморасчетовОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСФормойДокументаКлиент.ОткрытьОтчетВзаиморасчетрыСКонтрагентом(Объект.Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "НачалоВыбора");
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "удалить" Тогда
		Объект.ДокументОснование = Неопределено;
		Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Неопределено);
		Модифицированность = Истина;
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "заполнить" Тогда
		ЗаполнитьПоОснованиюНачало();
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "выбрать" Тогда
		//Выбрать основание
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборТипаОснованияЗавершение", ЭтотОбъект);
		ПоказатьВыборИзМеню(ОписаниеОповещения, СписокДокументОснование, Элементы.ДокументОснованиеНадпись);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "открыть" Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) тогда
			возврат;
		КонецЕсли;
		
		РаботаСФормойДокументаКлиент.ОткрытьФормуДокументаПоТипу(Объект.ДокументОснование);
		
	КонецЕсли;
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ОбработкаНавигационнойСсылки");
	
КонецПроцедуры

&НаКлиенте
Процедура СчетФактураНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	УправлениеНебольшойФирмойКлиент.ОткрытьСчетФактуру(ЭтотОбъект);
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ОбработкаНавигационнойСсылки");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборТипаОснованияЗавершение(ВыбИмяФормы, Параметры) Экспорт
	
	Если ВыбИмяФормы<>Неопределено Тогда
		
		СтруктураПараметровОтбора = Новый Структура();
		Для каждого элОтбора Из ПараметрыВыбораДокументаОснования Цикл
			ИмяПоляОтбора = СтрЗаменить(элОтбора.Имя,"Отбор.","");
			СтруктураПараметровОтбора.Вставить(ИмяПоляОтбора, элОтбора.Значение);
		КонецЦикла;
		Если ВыбИмяФормы.Значение = "Документ.ПриемИПередачаВРемонт.ФормаВыбора" Тогда
			СтруктураПараметровОтбора.Вставить("Отбор", Новый Структура("ВариантРемонта", ПредопределенноеЗначение("Перечисление.ВариантыРемонта.НашаМастерскаяМногоэтапныйРемонт")));
		КонецЕсли;
		_ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыбратьОснованиеЗавершение", ЭтотОбъект);
		ОткрытьФорму(ВыбИмяФормы.Значение, СтруктураПараметровОтбора, ЭтотОбъект, ,,,_ОповещениеОЗакрытии);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОснованиеЗавершение(ВыбЗначение, Параметры) Экспорт

	Если ВыбЗначение<>Неопределено Тогда
		Объект.ДокументОснование = ВыбЗначение;
		Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(ВыбЗначение);
		Модифицированность = Истина;
		
		ЗаполнитьПоОснованиюНачало();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованиюНачало() Экспорт

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоОснованиюЗавершение", ЭтотОбъект);
	ПоказатьВопрос(
		ОписаниеОповещения, 
		НСтр("ka='შევავსოთ დოკუმენტი არჩეული საფუძვლით?';ru='Заполнить документ по выбранному основанию?';en='Complete the document by the selected base?'"), 
		РежимДиалогаВопрос.ДаНет, 0);		

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованиюЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Ответ = Результат;
    Если Ответ = КодВозвратаДиалога.Да Тогда
        ЗаполнитьПоДокументу(Объект.ДокументОснование);
        УстановитьВидимостьИДоступность();
		ОбновитьПодвалФормы();
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкидкаПроцентПриИзменении(Элемент)
	
	ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьПроцентСкидкиНаценки");
	ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "ПроцентСкидкиНаценки";
	ЗапасыИзменениеСтрокЗначение = СкидкаПроцент;
	Модифицированность = Истина;
	
	ОбработатьТаблицу();
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
КонецПроцедуры

&НаКлиенте
Процедура СкидкаСуммаПриИзменении(Элемент)
	
	ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСкидкуСуммой");
	ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Сумма";
	ЗапасыИзменениеСтрокЗначение = СкидкаСумма;
	Модифицированность = Истина;
	
	ОбработатьТаблицу();
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураДоставкиПриИзменении(Элемент)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Номенклатура", Объект.НоменклатураДоставки);
	СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	Объект.СтавкаНДСДоставки = СтруктураДанные.СтавкаНДС;
	ОбновитьСуммуНДСДоставки();
	
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьДоставкиПриИзменении(Элемент)
	
	ОбновитьСуммуНДСДоставки();
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСДоставкиПриИзменении(Элемент)
	
	ОбновитьСуммуНДСДоставки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммуНДСДоставки()
	
	СтавкаНДСДоставки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(Объект.СтавкаНДСДоставки);
	
	Если Объект.СуммаВключаетНДС Тогда
		Объект.СуммаНДСДоставки = Объект.СтоимостьДоставки - Объект.СтоимостьДоставки / ((СтавкаНДСДоставки + 100) / 100);
		СтоимостьДоставкиСНДС = Объект.СтоимостьДоставки;
	Иначе
		Объект.СуммаНДСДоставки = Объект.СтоимостьДоставки * СтавкаНДСДоставки / 100;
		СтоимостьДоставкиСНДС = Объект.СтоимостьДоставки + Объект.СуммаНДСДоставки;
	КонецЕсли;
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммуНДСДоставкиПриРасчете()
	
	СтавкаНДСДоставки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(Объект.СтавкаНДСДоставки);
	
	Объект.СуммаНДСДоставки = СтоимостьДоставкиСНДС - СтоимостьДоставкиСНДС / ((СтавкаНДСДоставки + 100) / 100);
	Объект.СтоимостьДоставки = СтоимостьДоставкиСНДС - ?(Объект.СуммаВключаетНДС, 0, Объект.СуммаНДСДоставки);
	
КонецПроцедуры

//+++ Дмгг
&НаКлиенте
Процедура КартаЛояльностиПриИзменении(Элемент)
	
	Объект.ДоступноБалов = 0;
	КолвоБалов = 0;
	КоэффициентЛояльности = 0;
	
	Если ЗначениеЗаполнено(Объект.КартаЛояльности) Тогда 
		
		КолвоБалов = УстановитьКоличествоДоступныхБалов(Объект.КартаЛояльности, Объект.Контрагент, Объект.Дата, КоэффициентЛояльности);
		Объект.ДоступноБалов = КолвоБалов;
		
	КонецЕсли;
	
	Объект.ПроцентСкидкиПоКартеЛояльности = УправлениеНебольшойФирмойСервер.ВычислитьПроцентСкидкиПоКартеЛояльности(ДатаДокумента, Объект.КартаЛояльности);
	
	СброситьФлагСкидкиРассчитаныКлиент("ПерезаполнениеПоДаннымФормыЦеныИВалюта");
	
	Для Каждого СтрокЗапасы из Объект.Запасы Цикл
		Если Объект.ПроцентСкидкиПоКартеЛояльности = 0 Тогда 
			СтрокЗапасы.ПроцентСкидкаЛояльности = 0;
		КонецЕсли;
		РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокЗапасы, Истина);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(объект.КартаЛояльности) Тогда 
		Объект.ПроцентСкидкиПоКартеЛояльности = ПолучитьПроцентСкидкиЛояльности(); 
		Объект.ПроцентНакопленияБалов = ПолучитьПроцентНакопления(); 
		
		Для Каждого Строк из Объект.Запасы Цикл 
			Строк.ПроцентАвтоматическойСкидки = 0;
			Строк.ПроцентСкидкаЛояльности = Объект.ПроцентСкидкиПоКартеЛояльности;
			РассчитатьСуммуВСтрокеТабличнойЧасти(Строк);
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьВиимостИспользованияБалов();
	
	Элементы.ДоступноБалов.Заголовок = НСтр("ru = 'Доступно балов: '; ka = 'ხელმისაწვდომი ქულები: !'; en = 'Доступно балов: '") + КолвоБалов;
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидИспользоыванияБаловПриИзменении(Элемент)
	
	Если Объект.ВидИспользоыванияБалов = ПредопределенноеЗначение("Перечисление.ВидыИспользованияБалов.Расход") Тогда 
		Для Каждого Строк Из Объект.Запасы Цикл 
			Строк.БалыРасход = 0;
		КонецЦикла;
	КонецЕсли;
	
	УстановитьВиимостИспользованияБалов();
	
КонецПроцедуры
//--- Дмгг

#КонецОбласти

#Область ОбработчикиСобытийЭлементовПодвалаФормы

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДокументОснование()
	
	СписокДокументОснование.Очистить();
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРемонты") Тогда
		СписокДокументОснование.Добавить("Документ.ПриемИПередачаВРемонт.ФормаВыбора", "Прием в ремонт");
	КонецЕсли;
	СписокДокументОснование.Добавить("Документ.ПриходнаяНакладная.ФормаВыбора", "Приходная накладная");
	СписокДокументОснование.Добавить("Документ.СчетНаОплату.ФормаВыбора", "Счет на оплату");
	СписокДокументОснование.Добавить("Документ.ПеремещениеЗапасов.ФормаВыбора", "Перемещение запасов");
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуПроизводство") Тогда
		СписокДокументОснование.Добавить("Документ.СборкаЗапасов.ФормаВыбора", "Производство");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСтранаПроисхожденияПриИзменении(Элемент)
	
	Если КэшЗначений.УчетГТД Тогда
	
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтранаПроисхождения)
			ИЛИ СтрокаТабличнойЧасти.СтранаПроисхождения = КэшЗначений.Россия Тогда
			
			СтрокаТабличнойЧасти.НомерГТД = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНомерГТДПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	Если СтрокаТабличнойЧасти <> Неопределено
		И ЗначениеЗаполнено(СтрокаТабличнойЧасти.НомерГТД) Тогда
		
		ДатаГТД = ГрузовыеТаможенныеДекларацииКлиент.ВыделитьДатуИзНомераГТД(Строка(СтрокаТабличнойЧасти.НомерГТД));
		Если ДатаГТД > КонецДня(Объект.Дата) Тогда
			
			ТекстСообщения = НСтр("ka='ყურადღება! არჩეული სატვირთო-საბაჟო დეკლარაცია დათარიღებულია უფრო გვიანი თარიღით, ვიდრე მიმდინარე დოკუმენტი';ru='Внимание! Выбранная ГТД датирована более поздней датой, чем текущий документ';en='Attention! Selected GTD dated later date than the current document'");
			Прилипалка = СтрШаблон("Объект.Запасы[%1].НомерГТД", СтрокаТабличнойЧасти.ПолучитьИдентификатор());
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Прилипалка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапасы

&НаКлиенте
Процедура ЗапасыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
		СтрокаТабличнойЧасти.Усушка_СписаниеНаПотери = СтрокаТабличнойЧасти_Номенклатура_Усушка_СписаниеНаПотери(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
	КонецЕсли;
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
	СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	//Lazare_
	Если ПолучитьФункционалТипЦеныНоменклатурыПоКоличеству() Тогда 
		//СтрокаТабличнойЧасти.Количество = 1;
		ОптоваяЦена = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
		ВидЦен = УправлениеНебольшойФирмойСервер.ПолучитьВидЦеныПоДиапазонуКоличестваНоменклатуры(СтруктураДанные,СтрокаТабличнойЧасти.Количество);		
		Объект.ОптоваяЦенаВДок = ВидЦен;
	КонецЕсли;
	
	//_Lazare
	Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда
		
		СтруктураДанные.Вставить("ДатаОбработки",	 Объект.Дата);
		СтруктураДанные.Вставить("ВалютаДокумента",  Объект.ВалютаДокумента);
		СтруктураДанные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
		//Lazare_
		Если ВидЦен = Неопределено Тогда 
		СтруктураДанные.Вставить("ВидЦен", Объект.ВидЦен);
		Иначе 
		СтруктураДанные.Вставить("ВидЦен",ВидЦен);//Было
		КонецЕсли;
		//_Lazare
		СтруктураДанные.Вставить("Коэффициент", 1);
		СтруктураДанные.Вставить("ВидСкидкиНаценки", Объект.ВидСкидкиНаценки);
		
	КонецЕсли;
	
	// ДисконтныеКарты
	СтруктураДанные.Вставить("ДисконтнаяКарта", Объект.ДисконтнаяКарта);
	СтруктураДанные.Вставить("КартаЛояльности", Объект.КартаЛояльности); //+++ Дмгг
	СтруктураДанные.Вставить("ПроцентСкидкиПоДисконтнойКарте", Объект.ПроцентСкидкиПоДисконтнойКарте);
	//СтруктураДанные.Вставить("ПроцентСкидкиПоКартеЛояльности", Объект.ПроцентСкидкиПоКартеЛояльности); //+++ Дмгг
	// Конец ДисконтныеКарты
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.СтранаПроисхождения = СтруктураДанные.СтранаПроисхождения;
	СтрокаТабличнойЧасти.НомерГТД = Неопределено;
	//СтрокаТабличнойЧасти.Количество = 1;//Паганини
	СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
	СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = СтруктураДанные.ПроцентСкидкиНаценки;
	//+++ Дмгг
	Если ЗначениеЗаполнено(Объект.КартаЛояльности) Тогда 
		СтрокаТабличнойЧасти.ПроцентСкидкаЛояльности = ПолучитьПроцентСкидкиЛояльности(); //СтруктураДанные.ПроцентСкидкаЛояльности; //+++ Дмгг
	КонецЕсли;
	//--- Дмгг
	СтрокаТабличнойЧасти.СтавкаНДС = СтруктураДанные.СтавкаНДС;
	СтрокаТабличнойЧасти.Содержание = "";
	
	СтрокаТабличнойЧасти.ТипНоменклатурыЗапас = СтруктураДанные.ЭтоЗапас;
	СтрокаТабличнойЧасти.НеобходимостьВводаСправкиНаАлкоголь = СтруктураДанные.ЭтоАлкогольнаяПродукция;
	
	СтрокаТабличнойЧасти.ВесЕдиницыТовара = СтруктураДанные.ВесЕдиницыТовара;
	СтрокаТабличнойЧасти.Вес = СтруктураДанные.ВесЕдиницыТовара * СтрокаТабличнойЧасти.Количество;
	СтрокаТабличнойЧасти.ОбъемЕдиницыТовара = СтруктураДанные.ОбъемЕдиницыТовара;
	СтрокаТабличнойЧасти.Объем = СтруктураДанные.ОбъемЕдиницыТовара * СтрокаТабличнойЧасти.Количество;
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	СтрокаТабличнойЧасти.СчетУчетаВыручкиОтПродажРегл = СтруктураДанные.СчетУчетаВыручкиОтПродажРегл;
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	СтрокаТабличнойЧасти.НаправлениеДеятельности = СтруктураДанные.НаправлениеДеятельности; //+++ Дмгг
	//Серийные номера
	Для каждого ВыделеннаяСтрока Из Элементы.Запасы.ВыделенныеСтроки Цикл
		ТекущиеДанныеСтроки = Элементы.Запасы.ДанныеСтроки(ВыделеннаяСтрока);
		РаботаССерийнымиНомерамиКлиентСервер.УдалитьСерийныеНомераПоКлючуСвязи(Объект.СерийныеНомера, ТекущиеДанныеСтроки,,ИспользоватьСерийныеНомераОстатки);
	КонецЦикла;
	
	ОбновитьНаименованиеДляРС(СтрокаТабличнойЧасти);
	// Kuzmich, 16.02.2020, Цена по себестоимости при безвозмездной продаже сотруднику
	Если (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику")) И Объект.ЦенаПоСебестоимости Тогда
		СтрокаТабличнойЧасти.Цена = ПолучитьЦенуПоСебестоимости(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
	КонецЕсли;
	// Kuzmich, 16.02.2020, Цена по себестоимости при безвозмездной продаже сотруднику
	//+++ Дмгг
	//РассчитатьСуммуВСтрокеТабличнойЧасти();
	Если ЗначениеЗаполнено(Объект.КартаЛояльности) Тогда 
		Для Каждого Строк из Объект.Запасы Цикл 
			Строк.ПроцентСкидкаЛояльности = Объект.ПроцентСкидкиПоКартеЛояльности;
			РассчитатьСуммуВСтрокеТабличнойЧасти(Строк);
		КонецЦикла;
	Иначе
		РассчитатьСуммуВСтрокеТабличнойЧасти();
	КонецЕсли;
	//--- Дмгг
	ОбновитьПодвалФормы();
	РассчитатьОбъемИВесВДокументе();
	
	СтрокаТабличнойЧасти.Себестоимость = ПолучитьСебестоимостьНоменклатуры(СтрокаТабличнойЧасти.Номенклатура , СтрокаТабличнойЧасти.Характеристика);
	//ЗаполнитьИтогКоличество(); //+++ Дмгг;
	
	СтрокаТабличнойЧасти.ЦенаЗакупки = ПолучитьЦенуЗакупки(СтрокаТабличнойЧасти.Номенклатура,СтрокаТабличнойЧасти.Характеристика);
	
	//Lazare_	
	Если ГруппыПользователя.Количество() Тогда 		
		
		ГруппаНоменклатуры = РС_ОбщегоНазначения.ПолучитьЗначениеРеквизита(Элементы.Запасы.ТекущиеДанные.Номенклатура, "Родитель");
		НайденнаяГруппа    = ГруппыПользователя.НайтиПоЗначению(ГруппаНоменклатуры) ;		
		
		Если НайденнаяГруппа = Неопределено Тогда  		
			СтрокаТабличнойЧасти.ТолькоПросмотр = Истина
		Иначе 
			СтрокаТабличнойЧасти.ТолькоПросмотр = Ложь		
		КонецЕсли;		
	КонецЕсли;  				
	//_Lazare

	 СтрокаТабличнойЧасти.КоличествоНаСкладе = УправлениеНебольшойФирмойСервер.ПолучитьКоличествоЗапасовНаСкладе(Объект.Дата,СтрокаТабличнойЧасти.Номенклатура,Объект.Организация,Объект.СтруктурнаяЕдиница);
	
КонецПроцедуры

//+++ Дмгг
&НаСервере
Функция ПолучитьПроцентНакопления()

	ВсегоПоДокументу = Объект.Запасы.Итог("Сумма");
	
	СуммаПорогаПоКарте = 0;
	ПроцентПорога = 0;
	
	СуммаПорогаПоКарте = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок[0].НижняяГраницаЛояльность;
	
	Для Сч = 0 По Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок.Количество() - 1 Цикл 
		
		Если ВсегоПоДокументу >= СуммаПорогаПоКарте Тогда 
			ПроцентПорога = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок[СЧ].СкидкаЛояльность;
			Если Сч <> Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок.Количество() - 1 Тогда 
				СуммаПорогаПоКарте = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок[СЧ+1].НижняяГраницаЛояльность;
			Иначе
				Прервать;
			КонецЕсли;
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПроцентПорога;

КонецФункции // ПолучитьПроцентНакопления()

&НаСервере
Функция ПолучитьПроцентСкидкиЛояльности()

	//ВсегоПоДокументу = Объект.Запасы.Итог("Всего");
	ВсегоПоДокументу = 0;
	тзЗапасы = Объект.Запасы.Выгрузить(,"Количество, Цена");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзЗапасы.Цена КАК Цена,
		|	тзЗапасы.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Запасы
		|ИЗ
		|	&тзЗапасы КАК тзЗапасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВТ_Запасы.Цена * ВТ_Запасы.Количество), 0) КАК СуммаБезСкидок
		|ИЗ
		|	ВТ_Запасы КАК ВТ_Запасы";
	
	Запрос.УстановитьПараметр("тзЗапасы", тзЗапасы);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВсегоПоДокументу = ВыборкаДетальныеЗаписи.СуммаБезСкидок;
	КонецЦикла;
	
	СуммаПорогаПоКарте = 0;
	ПроцентПорога = 0;
	
	СуммаПорогаПоКарте = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок[0].НижняяГраница;
	
	Для Сч = 0 По Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок.Количество() - 1 Цикл 
		
		Если ВсегоПоДокументу >= СуммаПорогаПоКарте Тогда 
			ПроцентПорога = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок[СЧ].Скидка;
			Если Сч <> Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок.Количество() - 1 Тогда 
				СуммаПорогаПоКарте = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок[СЧ+1].НижняяГраница;
			Иначе
				Прервать;
			КонецЕсли;
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПроцентПорога;

КонецФункции

&НаСервере
Функция ПолучитьСебестоимостьНоменклатуры(Номенклатура , Характеристика)
	
	
	Если Константы.ПоказатСебестоимостиВТаблице.Получить() = Истина Тогда
		Если ЗначениеЗаполнено(Характеристика) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
				|	СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток,
				|	ЗапасыОстатки.Номенклатура,
				|	ЗапасыОстатки.Характеристика
				|ИЗ
				|	РегистрНакопления.Запасы.Остатки(
				|			,
				|			Номенклатура = &Номенклатура
				|				И Характеристика = &Характеристика
				|				И СчетУчетаРегл = &СчетУчета) КАК ЗапасыОстатки
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗапасыОстатки.Номенклатура,
				|	ЗапасыОстатки.Характеристика";
			
			Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
			Запрос.УстановитьПараметр("СчетУчета", Номенклатура.СчетУчетаЗапасовРегл);
			Запрос.УстановитьПараметр("Характеристика", Характеристика);
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
				|	СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток,
				|	ЗапасыОстатки.Номенклатура
				|ИЗ
				|	РегистрНакопления.Запасы.Остатки(
				|			,
				|			Номенклатура = &Номенклатура
				|				И СчетУчетаРегл = &СчетУчета) КАК ЗапасыОстатки
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗапасыОстатки.Номенклатура";
			
			Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
			Запрос.УстановитьПараметр("СчетУчета", Номенклатура.СчетУчетаЗапасовРегл);
		КонецЕсли;
			
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		 Себетоимость =  ВыборкаДетальныеЗаписи.СуммаОстаток/ ВыборкаДетальныеЗаписи.КоличествоОстаток;
		
	КонецЦикла;
	
	Возврат Себетоимость;

	КонецЕсли;

	
КонецФункции

&НаКлиенте
Процедура ЗапасыХарактеристикаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура",	 СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Характеристика",	 СтрокаТабличнойЧасти.Характеристика);
	//Lazare_
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	Если ПолучитьФункционалТипЦеныНоменклатурыПоКоличеству() Тогда 
		СтрокаТабличнойЧасти.Количество = 1;
		ОптоваяЦена = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
		ВидЦен = УправлениеНебольшойФирмойСервер.ПолучитьВидЦеныПоДиапазонуКоличестваНоменклатуры(СтруктураДанные,СтрокаТабличнойЧасти.Количество);
		Объект.ОптоваяЦенаВДок = ВидЦен;
	КонецЕсли;
	//_Lazare
	
	Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда
		
		СтруктураДанные.Вставить("ДатаОбработки",	 	Объект.Дата);
		СтруктураДанные.Вставить("ВалютаДокумента",	 	Объект.ВалютаДокумента);
		СтруктураДанные.Вставить("СуммаВключаетНДС", 	Объект.СуммаВключаетНДС);
		
		СтруктураДанные.Вставить("СтавкаНДС", 			СтрокаТабличнойЧасти.СтавкаНДС);
		СтруктураДанные.Вставить("Цена",			 	СтрокаТабличнойЧасти.Цена);
		//Lazare_
		Если ВидЦен = Неопределено Тогда 
		СтруктураДанные.Вставить("ВидЦен", Объект.ВидЦен);//Было
		Иначе 
			СтруктураДанные.Вставить("ВидЦен", ВидЦен);
		КонецЕсли;
		//_Lazare
		СтруктураДанные.Вставить("ЕдиницаИзмерения", СтрокаТабличнойЧасти.ЕдиницаИзмерения);
		
	КонецЕсли;
	
	СтруктураДанные = ПолучитьДанныеХарактеристикаПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
	СтрокаТабличнойЧасти.Содержание = "";
	
	ОбновитьНаименованиеДляРС(СтрокаТабличнойЧасти);
	// Kuzmich, 16.02.2020, Цена по себестоимости при безвозмездной продаже сотруднику
	Если (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику")) И Объект.ЦенаПоСебестоимости Тогда
		СтрокаТабличнойЧасти.Цена = ПолучитьЦенуПоСебестоимости(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
	КонецЕсли;
	// Kuzmich, 16.02.2020, Цена по себестоимости при безвозмездной продаже сотруднику
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	ОбновитьПодвалФормы();
	
	СтрокаТабличнойЧасти.Себестоимость = ПолучитьСебестоимостьНоменклатуры(СтрокаТабличнойЧасти.Номенклатура , СтрокаТабличнойЧасти.Характеристика);

	
КонецПроцедуры


&НаКлиенте
Процедура ЗапасыСодержаниеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание = 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
		ШаблонСодержания = УправлениеНебольшойФирмойСервер.ПолучитьТекстСодержания(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.Характеристика);
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(ШаблонСодержания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	СтрокаТабличнойЧасти.Вес = СтрокаТабличнойЧасти.ВесЕдиницыТовара * СтрокаТабличнойЧасти.Количество;
	СтрокаТабличнойЧасти.Объем = СтрокаТабличнойЧасти.ОбъемЕдиницыТовара * СтрокаТабличнойЧасти.Количество;
	// Kuzmich, 16.02.2020, Цена по себестоимости при безвозмездной продаже сотруднику
	Если (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику")) И Объект.ЦенаПоСебестоимости Тогда
		СтрокаТабличнойЧасти.Цена = ПолучитьЦенуПоСебестоимости(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
	КонецЕсли;
	// Kuzmich, 16.02.2020, Цена по себестоимости при безвозмездной продаже сотруднику
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	
	//Lazare_
	Если ПолучитьФункционалТипЦеныНоменклатурыПоКоличеству() Тогда 		
		СтруктураДанные = Новый Структура ;
		СтруктураДанные.Вставить("Организация", Объект.Организация);
		СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
		СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
		ОптоваяЦена = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
		ВидЦен = УправлениеНебольшойФирмойСервер.ПолучитьВидЦеныПоДиапазонуКоличестваНоменклатуры(СтруктураДанные,СтрокаТабличнойЧасти.Количество);
		Если ВидЦен = ПредопределенноеЗначение("Справочник.ВидыЦен.Оптовая")  Тогда 		
			ОптоваяЦена = ВидЦен;
		КонецЕсли;
		Если ВидЦен <>  ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка")или ВидЦен <> Неопределено Тогда 
			СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
			СтруктураДанные.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
			СтруктураДанные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
			Если ВидЦен = Неопределено Тогда 
			СтруктураДанные.Вставить("ВидЦен",Объект.ВидЦен);	
			Иначе 	
			СтруктураДанные.Вставить("ВидЦен", ВидЦен);
			КонецЕсли;
			СтруктураДанные.Вставить("Коэффициент", 1);
			СтруктураДанные.Вставить("ВидСкидкиНаценки", Объект.ВидСкидкиНаценки);
			СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
			СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
			РассчитатьСуммуВСтрокеТабличнойЧасти();
			Объект.ОптоваяЦенаВДок = ВидЦен;
		КонецЕсли;			
	КонецЕсли;
	//Lazare_
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	Если СтрокаТабличнойЧасти.Усушка_КоличествоСобрПотери<>0 И Усушка_ТекущееКоличество<>0 Тогда
		СтрокаТабличнойЧасти.Усушка_КоличествоСобрПотери = СтрокаТабличнойЧасти.Усушка_КоличествоСобрПотери * СтрокаТабличнойЧасти.Количество / Усушка_ТекущееКоличество;
		СтрокаТабличнойЧасти.Усушкa_КоличествоСтарое = СтрокаТабличнойЧасти.Усушкa_КоличествоСтарое * СтрокаТабличнойЧасти.Количество / Усушка_ТекущееКоличество;
	КонецЕсли;
	// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	
	//+++ Дмгг
	Если ЗначениеЗаполнено(объект.КартаЛояльности) Тогда 
		Объект.ПроцентСкидкиПоКартеЛояльности = ПолучитьПроцентСкидкиЛояльности(); 
		Объект.ПроцентНакопленияБалов = ПолучитьПроцентНакопления();
		Для Каждого Строк из Объект.Запасы Цикл 
			Строк.ПроцентСкидкаЛояльности = Объект.ПроцентСкидкиПоКартеЛояльности;
			РассчитатьСуммуВСтрокеТабличнойЧасти(Строк);
		КонецЦикла;
	КонецЕсли;
	//--- Дмгг
	ОбновитьПодвалФормы();
	РассчитатьОбъемИВесВДокументе();
	//ЗаполнитьИтогКоличество(); //+++ Дмгг;
	
	
КонецПроцедуры // ЗапасыКоличествоПриИзменении()

&НаКлиенте
Процедура ЗапасыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти.ЕдиницаИзмерения = ВыбранноеЗначение Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаТабличнойЧасти.Цена = 0
		И СтрокаТабличнойЧасти.Вес = 0
		И СтрокаТабличнойЧасти.Объем = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийКоэффициент = 0;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		ТекущийКоэффициент = 1;
	КонецЕсли;
	
	Коэффициент = 0;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		Коэффициент = 1;
	КонецЕсли;
	
	Если ТекущийКоэффициент = 0 И Коэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ЕдиницаИзмерения, ВыбранноеЗначение);
	ИначеЕсли ТекущийКоэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	ИначеЕсли Коэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(СтрокаТабличнойЧасти.Номенклатура, Неопределено, ВыбранноеЗначение);
	ИначеЕсли ТекущийКоэффициент = 1 И Коэффициент = 1 Тогда
		СтруктураДанные = Новый Структура("ТекущийКоэффициент, Коэффициент", 1, 1);
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(
		СтруктураДанные,
		ВесИОбъемЕдиницТоваров(СтрокаТабличнойЧасти.Номенклатура, ВыбранноеЗначение, Коэффициент));
	КонецЕсли;
	
	Если СтруктураДанные.ТекущийКоэффициент <> 0 Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Цена * СтруктураДанные.Коэффициент / СтруктураДанные.ТекущийКоэффициент;
		СтрокаТабличнойЧасти.ВесЕдиницыТовара = СтруктураДанные.ВесЕдиницыТовара;
		СтрокаТабличнойЧасти.Вес = СтрокаТабличнойЧасти.ВесЕдиницыТовара * СтрокаТабличнойЧасти.Количество;
		СтрокаТабличнойЧасти.ОбъемЕдиницыТовара = СтруктураДанные.ОбъемЕдиницыТовара;
		СтрокаТабличнойЧасти.Объем = СтрокаТабличнойЧасти.ОбъемЕдиницыТовара * СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	ОбновитьПодвалФормы();
	РассчитатьОбъемИВесВДокументе();
	
КонецПроцедуры // ЗапасыЕдиницаИзмеренияОбработкаВыбора()

&НаКлиенте
Процедура ЗапасыЦенаПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	ОбновитьПодвалФормы();
	
	//+++ Дмгг
	Если ЗначениеЗаполнено(объект.КартаЛояльности) Тогда 
		
		Объект.ПроцентСкидкиПоКартеЛояльности = ПолучитьПроцентСкидкиЛояльности(); 
		
		Для Каждого Строк из Объект.Запасы Цикл 
			Строк.ПроцентСкидкаЛояльности = Объект.ПроцентСкидкиПоКартеЛояльности;
			РассчитатьСуммуВСтрокеТабличнойЧасти(Строк);
		КонецЦикла;
		
		Объект.ПроцентНакопленияБалов = ПолучитьПроцентНакопления();
		
	//Иначе
	//	
	//	РассчитатьСуммуВСтрокеТабличнойЧасти();
	//	ОбновитьПодвалФормы();
		
	КонецЕсли;
	//--- Дмгг 
	
	//ПравоИзмененияЦеныНоменклатурыВРасходнойНакладной(Элементы.Запасы.ТекущиеДанные.Номенклатура);
		
	
КонецПроцедуры // ЗапасыЦенаПриИзменении()

&НаКлиенте
Процедура ЗапасыПроцентСкидкиНаценкиПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	ОбновитьПодвалФормы();
	
КонецПроцедуры // ЗапасыПроцентСкидкиНаценкиПриИзменении()

&НаКлиенте
Процедура ЗапасыПроцентСкидкаЛояльностиПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	СтрокаТабличнойЧасти.ПроцентАвтоматическойСкидки = 0;
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	Если ОБъект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику") Тогда 
		// Цена.
		Если СтрокаТабличнойЧасти.Количество <> 0 Тогда
			СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
		КонецЕсли;
		// Скидка.
		Если СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 100 Тогда
			СтрокаТабличнойЧасти.Цена = 0;
		ИначеЕсли СтрокаТабличнойЧасти.ПроцентСкидкиНаценки <> 0 И СтрокаТабличнойЧасти.Количество <> 0 Тогда
			СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / ((1 - СтрокаТабличнойЧасти.ПроцентСкидкиНаценки / 100) * СтрокаТабличнойЧасти.Количество);
		КонецЕсли;
		РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
		СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
		// АвтоматическиеСкидки.
		СброситьФлагСкидкиРассчитаныКлиент("РассчитатьСуммуВСтрокеТабличнойЧасти", "Сумма");
		СтрокаТабличнойЧасти.ПроцентАвтоматическойСкидки = 0;
		СтрокаТабличнойЧасти.СуммаАвтоматическойСкидки = 0;
		СтрокаТабличнойЧасти.ОбщаяСуммаСкидкиБольшеСуммы = Ложь;
		// Конец АвтоматическиеСкидки
		//Ручная скидка - заполнение полей ввода на форме
		СкидкиНаценкиКлиентСервер.РассчитатьСуммуИПроцентСкидки(ЭтотОбъект);
		//Конец Ручная скидка	
	Иначе
		// Kuzmich, 22.11.2020, Реквизиты УдерживатьПенсию и СчетДоходовБП в табличной части Запасы для вида операции БезвозмезднаяПродажаСотруднику в документе РасходнаяНакладная
		Если СтрокаТабличнойЧасти.Количество = 0 Тогда
			СтрокаТабличнойЧасти.Количество = 1;
		КонецЕсли;
		// Kuzmich, 22.11.2020, Реквизиты УдерживатьПенсию и СчетДоходовБП в табличной части Запасы для вида операции БезвозмезднаяПродажаСотруднику в документе РасходнаяНакладная
		Если Объект.ЦенаВключаетНалоги = ПредопределенноеЗначение("Перечисление.ВидВлключениеНалоговВЦену.ЦенаБезНалогов") Тогда 
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
			Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВидУдержанияПФ) И СтрокаТабличнойЧасти.УдерживатьПенсию Тогда
				УдержаниеПенсии = СтрокаТабличнойЧасти.Сумма * 0.02;
			Иначе 
				УдержаниеПенсии = 0;
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВидНалогаНДФЛ) Тогда
				СуммаНДФЛ = (СтрокаТабличнойЧасти.Сумма - УдержаниеПенсии) * 0.2;
			Иначе
				СуммаНДФЛ = 0;
			КонецЕсли;
			СуммаНДС = (СтрокаТабличнойЧасти.Сумма - УдержаниеПенсии - СуммаНДФЛ)-(СтрокаТабличнойЧасти.Сумма - УдержаниеПенсии - СуммаНДФЛ)/(1 + (СтавкаНДС/100));
			Всего = СтрокаТабличнойЧасти.Сумма;
			СтрокаТабличнойЧасти.Цена = (СтрокаТабличнойЧасти.Сумма - УдержаниеПенсии - СуммаНДФЛ - СуммаНДС) / СтрокаТабличнойЧасти.Количество;
			СтрокаТабличнойЧасти.СуммаНДС = СуммаНДС;
			СтрокаТабличнойЧасти.СуммаНДФЛ = СуммаНДФЛ;
			СтрокаТабличнойЧасти.УдержаниеПенсии = УдержаниеПенсии;
			СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма;
		ИначеЕсли Объект.ЦенаВключаетНалоги = ПредопределенноеЗначение("Перечисление.ВидВлключениеНалоговВЦену.ЦенаВключаетНалоги") Тогда 
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
			СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВидУдержанияПФ) И СтрокаТабличнойЧасти.УдерживатьПенсию Тогда
				СтрокаТабличнойЧасти.УдержаниеПенсии = СтрокаТабличнойЧасти.Сумма * 0.02;
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВидНалогаНДФЛ) Тогда
				СтрокаТабличнойЧасти.СуммаНДФЛ = (СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.УдержаниеПенсии) * 0.2;
			КонецЕсли;
			СтрокаТабличнойЧасти.СуммаНДС = (СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.УдержаниеПенсии - СтрокаТабличнойЧасти.СуммаНДФЛ)-(СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.УдержаниеПенсии - СтрокаТабличнойЧасти.СуммаНДФЛ)/(1 + (СтавкаНДС/100));
			СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ЗапасыСуммаПриИзменении()

&НаКлиенте
Процедура ЗапасыСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	
КонецПроцедуры // ЗапасыСтавкаНДСПриИзменении()

&НаКлиенте
Процедура ЗапасыСуммаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);	
	
КонецПроцедуры // ЗапасыСуммаНДСПриИзменении()

&НаКлиенте
Процедура ЗапасыСодержаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.Запасы.ТекущиеДанные;
	СтуктураРеквизита = Новый Структура("Объект,ТабЧасть,НомерСтроки,ИмяРеквизита", "Объект","Запасы",ТекСтрока.НомерСтроки-1,"Содержание");
	ОбщегоНазначенияКлиентПереопределяемый.ПоказатьФормуРедактированияРеквизита(Элемент.ТекстРедактирования, ЭтотОбъект, СтуктураРеквизита, Строка(ТекСтрока.Номенклатура)+": содержание");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСправкаБНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Запасы.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		
		НоменклатураЕГАИС = НоменклатураПоКлассификаторуЕГАИС(ТекущаяСтрока.Номенклатура);
		Если Не ЗначениеЗаполнено(НоменклатураЕГАИС) Тогда
			Возврат;
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		
		Отбор = Новый Структура;
		Отбор.Вставить("АлкогольнаяПродукция", НоменклатураЕГАИС);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", Отбор);
		
		ОткрытьФорму("Справочник.СправкиБЕГАИС.ФормаВыбора",
			ПараметрыФормы,
			Элемент,,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция НоменклатураПоКлассификаторуЕГАИС(Номенклатура)

	Возврат ИнтеграцияЕГАИСУНФ.НоменклатураПоКлассификаторуЕГАИС(Номенклатура);

КонецФункции

&НаКлиенте
Процедура ЗапасыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьПодвалФормы();
	РассчитатьОбъемИВесВДокументе();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыВесПриИзменении(Элемент)
	
	РассчитатьОбъемИВесВДокументе();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыОбъемПриИзменении(Элемент)
	
	РассчитатьОбъемИВесВДокументе();
	
КонецПроцедуры


&НаСервере
Процедура СформироватьПроверкаВидимостьДоступностьСервер()
	
	Если КОнстанты.ЗапретРедактированияДокументовОператоров.Получить() = Истина 
		И Не РольДоступна("АдминистраторСистемы") И ПараметрыСеанса.ТекущийПользователь <> Объект.Автор Тогда
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		
	КонецЕсли;

	
	//Т 
	Если Константы.ПоказатСебестоимостиВТаблице.Получить() = Истина Тогда
		ЭтаФорма.Элементы.ЗапасыСебестоимость.Видимость = Истина;
	КонецЕсли;


	Если Не РольДоступна("АдминистраторСистемы") = Истина И Константы.ФункциональДляУдаленияСвязанныхОбъектов.Получить() = Истина Тогда
		ЭтаФорма.Элементы.ДокументОснование.ТолькоПросмотр = Истина;
		ЭтаФорма.Элементы.Заказ.ТолькоПросмотр = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыПредоплата

&НаКлиенте
Процедура ПредоплатаСуммаРасчетовПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Предоплата.ТекущиеДанные;
		
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
			?(Объект.Курс = 0,
			1,
			Объект.Курс),
		СтрокаТабличнойЧасти.Курс
	);
	
	СтрокаТабличнойЧасти.Кратность = ?(
		СтрокаТабличнойЧасти.Кратность = 0,
			?(Объект.Кратность = 0,
			1,
			Объект.Кратность),
		СтрокаТабличнойЧасти.Кратность
	);
	
	СтрокаТабличнойЧасти.СуммаПлатежа = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
		СтрокаТабличнойЧасти.СуммаРасчетов,
		СтрокаТабличнойЧасти.Курс,
		?(Объект.ВалютаДокумента = НациональнаяВалюта, КурсНациональнаяВалюта, Объект.Курс),
		СтрокаТабличнойЧасти.Кратность,
		?(Объект.ВалютаДокумента = НациональнаяВалюта,КратностьНациональнаяВалюта, Объект.Кратность)
	);

КонецПроцедуры

&НаКлиенте
Процедура ПредоплатаСуммаПлатежаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Предоплата.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
		1,
		СтрокаТабличнойЧасти.Курс
	);
	
	СтрокаТабличнойЧасти.Кратность = 1;
	
	СтрокаТабличнойЧасти.Курс =
		?(СтрокаТабличнойЧасти.СуммаРасчетов = 0,
			1,
			СтрокаТабличнойЧасти.СуммаПлатежа
		  / СтрокаТабличнойЧасти.СуммаРасчетов
		  * Объект.Курс
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредоплатаДокументПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Предоплата.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Документ) Тогда
		
		СтруктураДанные = ПолучитьДанныеДокументПриИзменении(СтрокаТабличнойЧасти.Документ, Объект.Договор);
		
		СтрокаТабличнойЧасти.СуммаРасчетов = СтруктураДанные.СуммаРасчетов;
		//+++ Дмгг
		//СтрокаТабличнойЧасти.Курс = 
		//	?(СтрокаТабличнойЧасти.Курс = 0,
		//		?(Объект.Курс = 0,
		//		1,
		//		Объект.Курс),
		//	СтрокаТабличнойЧасти.Курс
		//);
		//
		//СтрокаТабличнойЧасти.Кратность =
		//	?(СтрокаТабличнойЧасти.Кратность = 0,
		//		?(Объект.Кратность = 0,
		//		1,
		//		Объект.Кратность),
		//	СтрокаТабличнойЧасти.Кратность
		//);
		
		СтрокаТабличнойЧасти.Курс = 
			?(СтрокаТабличнойЧасти.Курс = 0,
				?(СтруктураДанные.ДокументКурс = 0,
				?(Объект.Курс = 0,
				1,
				Объект.Курс),
				СтруктураДанные.ДокументКурс),
			СтрокаТабличнойЧасти.Курс
		);
		
		СтрокаТабличнойЧасти.Кратность =
			?(СтрокаТабличнойЧасти.Кратность = 0,
				?(СтруктураДанные.ДокументКратность = 0,
				?(Объект.Курс = 0,
				1,
				Объект.Курс),
				СтруктураДанные.ДокументКратность),
			СтрокаТабличнойЧасти.Кратность
		);
		//--- Дмгг
		
		СтрокаТабличнойЧасти.СуммаПлатежа = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
			СтрокаТабличнойЧасти.СуммаРасчетов,
			СтрокаТабличнойЧасти.Курс,
			?(Объект.ВалютаДокумента = НациональнаяВалюта, КурсНациональнаяВалюта, Объект.Курс),
			СтрокаТабличнойЧасти.Кратность,
			?(Объект.ВалютаДокумента = НациональнаяВалюта,КратностьНациональнаяВалюта, Объект.Кратность)
		);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеДокументПриИзменении(Документ, Договор)
	
	СтруктураДанные = Новый Структура();
	
	СтруктураДанные.Вставить("СуммаРасчетов", Документ.РасшифровкаПлатежа.Итог("СуммаРасчетов"));
	//+++ Дмгг
	МассивСтрокВДокументе = Документ.РасшифровкаПлатежа.НайтиСтроки(Новый Структура("ПризнакАванса, Договор, Документ", ИСТИНА, Договор, НЕОПРЕДЕЛЕНО));
	
	Если МассивСтрокВДокументе.Количество() > 0 Тогда 
		СтруктураДанные.Вставить("ДокументКурс", МассивСтрокВДокументе[0].Курс);
		СтруктураДанные.Вставить("ДокументКратность", МассивСтрокВДокументе[0].Кратность);
	Иначе
		СтруктураДанные.Вставить("ДокументКурс", 0);
		СтруктураДанные.Вставить("ДокументКратность", 0);
	КонецЕсли;
	//--- Дмгг
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДокументПриИзменении()

&НаКлиенте
Процедура ПредоплатаКурсПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Предоплата.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
		1,
		СтрокаТабличнойЧасти.Курс
	);
	
	СтрокаТабличнойЧасти.Кратность = ?(
		СтрокаТабличнойЧасти.Кратность = 0,
		1,
		СтрокаТабличнойЧасти.Кратность
	);
	
	СтрокаТабличнойЧасти.СуммаПлатежа = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
		СтрокаТабличнойЧасти.СуммаРасчетов,
		СтрокаТабличнойЧасти.Курс,
		?(Объект.ВалютаДокумента = НациональнаяВалюта, КурсНациональнаяВалюта, Объект.Курс),
		СтрокаТабличнойЧасти.Кратность,
		?(Объект.ВалютаДокумента = НациональнаяВалюта,КратностьНациональнаяВалюта, Объект.Кратность)
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредоплатаКратностьПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Предоплата.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Курс = ?(
		СтрокаТабличнойЧасти.Курс = 0,
		1,
		СтрокаТабличнойЧасти.Курс
	);
	
	СтрокаТабличнойЧасти.Кратность = ?(
		СтрокаТабличнойЧасти.Кратность = 0,
		1,
		СтрокаТабличнойЧасти.Кратность
	);
	
	СтрокаТабличнойЧасти.СуммаПлатежа = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
		СтрокаТабличнойЧасти.СуммаРасчетов,
		СтрокаТабличнойЧасти.Курс,
		?(Объект.ВалютаДокумента = НациональнаяВалюта, КурсНациональнаяВалюта, Объект.Курс),
		СтрокаТабличнойЧасти.Кратность,
		?(Объект.ВалютаДокумента = НациональнаяВалюта,КратностьНациональнаяВалюта, Объект.Кратность)
	);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблиц

&НаКлиенте
Процедура ПредоплатаПриИзменении(Элемент)
	
	Элементы.ГруппаПредоплата.Заголовок = РаботаСФормойДокументаКлиентСервер.ПолучитьЗаголовокПредоплаты(Объект.Предоплата, Объект.ВалютаДокумента);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПередУдалением(Элемент, Отказ)
	
	// Серийные номера
	Для каждого ВыделеннаяСтрока Из Элементы.Запасы.ВыделенныеСтроки Цикл
		ТекущиеДанныеСтроки = Элементы.Запасы.ДанныеСтроки(ВыделеннаяСтрока);
		РаботаССерийнымиНомерамиКлиентСервер.УдалитьСерийныеНомераПоКлючуСвязи(Объект.СерийныеНомера, ТекущиеДанныеСтроки,,ИспользоватьСерийныеНомераОстатки);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьЦеныИВалюту(Элемент, СтандартнаяОбработка)
	
	Если ЭтаФорма.ТолькоПросмотр = Истина Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ОбработатьИзмененияПоКнопкеЦеныИВалюты(Объект.ВалютаДокумента);
	Модифицированность = Истина;
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "Нажатие");
	
КонецПроцедуры // РедактироватьЦеныИВалюту()

&НаКлиенте
Процедура ЗаполнитьПоОснованию(Команда)
	
	Ответ = Неопределено;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоОснованиюЗавершение", ЭтотОбъект), НСтр("ka='დოკუმენტი სრულიად შეივსება ""საფუძვლით""! გავაგრძელოთ ოპერაცია?';ru='Документ будет полностью перезаполнен по ""Основанию""! Продолжить выполнение операции?';en='The document will be fully refilled by ""base""! To continue the operation?'"), РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЗаказу(Команда)
	
	Ответ = Неопределено;

	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоЗаказуЗавершение", ЭтотОбъект), НСтр("ka='დოკუმენტი სრულიად შეივსება ""შეკვეთით""! გავაგრძელოთ ოპერაცია?';ru='Документ будет полностью перезаполнен по ""Заказу""! Продолжить выполнение операции?';en='The document will be fully refilled by ""order""! To continue the operation?'"), РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЗаказуЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Ответ = Результат;
    Если Ответ = КодВозвратаДиалога.Да Тогда
        ЗаполнитьПоДокументу(Объект.Заказ);
        УстановитьВидимостьИДоступность();
		ОбновитьПодвалФормы();
    КонецЕсли;

КонецПроцедуры // ЗаполнитьПоЗаказу()

&НаКлиенте
Процедура РедактироватьЗачетПредоплаты(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПоказатьПредупреждение(, НСтр("ka='დასაწყისში მიუთითეთ კონტრაგენტი!';ru='Укажите вначале контрагента!';en='Specify the first contractor!'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Договор) Тогда
		ПоказатьПредупреждение(, НСтр("ka='დასაწყისში მიუთითეთ კონტრაგენტის ხელშეკრულება!';ru='Укажите вначале договор контрагента!';en='Specify the first contract counterparty!'"));
		Возврат;
	КонецЕсли;
	
	МассивЗаказов = Новый Массив;
	Для каждого ТекЭлемент Из Объект.Запасы Цикл
		СтруктураЗаказа = Новый Структура("Заказ, Всего");
		СтруктураЗаказа.Заказ = ?(ТекЭлемент.Заказ = Неопределено, ПредопределенноеЗначение("Документ.ЗаказПокупателя.ПустаяСсылка"), ТекЭлемент.Заказ);
		СтруктураЗаказа.Всего = ТекЭлемент.Всего;
		МассивЗаказов.Добавить(СтруктураЗаказа);
	КонецЦикла;
	// Доставка
	Если СтоимостьДоставкиСНДС>0 Тогда
		СтруктураЗаказа = Новый Структура("Заказ, Всего");
		СтруктураЗаказа.Заказ = ?(Заказ = Неопределено, ПредопределенноеЗначение("Документ.ЗаказПокупателя.ПустаяСсылка"), Заказ);
		СтруктураЗаказа.Всего = СтоимостьДоставкиСНДС;
		МассивЗаказов.Добавить(СтруктураЗаказа);
	КонецЕсли; 
	// КонецДоставка
	
	АдресПредоплатаВХранилище = ПоместитьПредоплатаВХранилище();
	ПараметрыПодбора = Новый Структура(
		"АдресПредоплатаВХранилище,
		|Подбор,
		|ЕстьЗаказ,
		|ЗаказВШапке,
		|Компания,
		|Заказ,
		|Дата,
		|Ссылка,
		|Контрагент,
		|Договор,
		|Курс,
		|Кратность,
		|ВалютаДокумента,
		|СуммаДокумента",
		АдресПредоплатаВХранилище, // АдресПредоплатаВХранилище
		?(Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю"), Истина, Ложь), // Подбор
		Истина, // ЕстьЗаказ
		ЗаказВШапке, // ЗаказВШапке
		Компания, // Компания
		?(КонтрагентВестиРасчетыПоЗаказам, ?(ЗаказВШапке, Объект.Заказ, МассивЗаказов), Неопределено), // Заказ
		Объект.Дата, // Дата
		Объект.Ссылка, // Ссылка
		Объект.Контрагент, // Контрагент
		Объект.Договор, // Договор
		Объект.Курс, // Курс
		Объект.Кратность, // Кратность
		Объект.ВалютаДокумента, // ВалютаДокумента
		Объект.Запасы.Итог("Всего") + СтоимостьДоставкиСНДС // СуммаДокумента
	);
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю") Тогда
		КодВозврата = Неопределено;

		ОткрытьФорму("ОбщаяФорма.ФормаПодбораАвансовПокупателей", ПараметрыПодбора,,,,, Новый ОписаниеОповещения("РедактироватьЗачетПредоплатыЗавершение1", ЭтотОбъект, Новый Структура("АдресПредоплатаВХранилище, ПараметрыПодбора", АдресПредоплатаВХранилище, ПараметрыПодбора)));
        Возврат;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику") Тогда
		ОткрытьФорму("ОбщаяФорма.ФормаПодбораАвансовПоставщикам", ПараметрыПодбора,,,,, Новый ОписаниеОповещения("РедактироватьЗачетПредоплатыЗавершение", ЭтотОбъект, Новый Структура("АдресПредоплатаВХранилище", АдресПредоплатаВХранилище)));
        Возврат;
	КонецЕсли;
	
	РедактироватьЗачетПредоплатыФрагмент1(АдресПредоплатаВХранилище, КодВозврата);
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьЗачетПредоплатыЗавершение1(Результат, ДополнительныеПараметры) Экспорт
    
    АдресПредоплатаВХранилище = ДополнительныеПараметры.АдресПредоплатаВХранилище;
    ПараметрыПодбора = ДополнительныеПараметры.ПараметрыПодбора;
    
    
    КодВозврата = Результат;
    
    РедактироватьЗачетПредоплатыФрагмент1(АдресПредоплатаВХранилище, КодВозврата);

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьЗачетПредоплатыФрагмент1(Знач АдресПредоплатаВХранилище, Знач КодВозврата)
    
    РедактироватьЗачетПредоплатыФрагмент(АдресПредоплатаВХранилище, КодВозврата);

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьЗачетПредоплатыЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    АдресПредоплатаВХранилище = ДополнительныеПараметры.АдресПредоплатаВХранилище;
    
    
    КодВозврата = Результат;
    
    РедактироватьЗачетПредоплатыФрагмент(АдресПредоплатаВХранилище, КодВозврата);

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьЗачетПредоплатыФрагмент(Знач АдресПредоплатаВХранилище, Знач КодВозврата)
    
    Если (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю")
        ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику"))
        И (КодВозврата = КодВозвратаДиалога.OK) Тогда
        ПолучитьПредоплатаИзХранилища(АдресПредоплатаВХранилище);
	КонецЕсли;

КонецПроцедуры // РедактироватьЗачетПредоплаты()

// ПодключаемоеОборудование
&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	ТекШтрихкод = "";
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект, Новый Структура("ТекШтрихкод", ТекШтрихкод)), ТекШтрихкод, НСтр("ka='შეიყვანეთ შტრიხკოდი';ru='Введите штрихкод';en='enter the barcode'"));

КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ТекШтрихкод = ?(Результат = Неопределено, ДополнительныеПараметры.ТекШтрихкод, Результат);
	
	ВариантРаспознаванияШтрихкода = ПолучитьВариантРаспознаванияШтрихкода();
	//Если (ВариантРаспознаванияШтрихкода = ПредопределенноеЗначение("Перечисление.ВариантыРаспознованияШтрихкодов.Вес") И СтрДлина(ТекШтрихкод) = 13)
	//	ИЛИ ВариантРаспознаванияШтрихкода = ПредопределенноеЗначение("Перечисление.ВариантыРаспознованияШтрихкодов.Цена") Тогда
	Если ((ВариантРаспознаванияШтрихкода = ПредопределенноеЗначение("Перечисление.ВариантыРаспознованияШтрихкодов.Вес") И СтрДлина(ТекШтрихкод) = 13)
				ИЛИ ВариантРаспознаванияШтрихкода = ПредопределенноеЗначение("Перечисление.ВариантыРаспознованияШтрихкодов.Цена"))
				И Лев(ТекШтрихкод,3) = "990" Тогда
	
		ДобавитьШтрихкодВТабличнуюЧасть(ТекШтрихкод, ВариантРаспознаванияШтрихкода);
		Возврат;
		
	КонецЕсли; 
    
    Если НЕ ПустаяСтрока(ТекШтрихкод) Тогда
        ПолученыШтрихкоды(Новый Структура("Штрихкод, Количество", ТекШтрихкод, 1));
    КонецЕсли;

КонецПроцедуры // ПоискПоШтрихкоду()

&НаКлиенте
Процедура ПолучитьВес(Команда)
	
	ПодключаемоеОборудованиеУНФКлиент.ПолучениеВесаСЭлектронныхВесовДляТабличнойЧасти(ЭтотОбъект, "Запасы");
	
КонецПроцедуры // ПолучитьВес()

&НаКлиенте
Процедура ПолучитьВесЗавершение(Параметры) Экспорт
	
	СтрокаТабличнойЧасти = Параметры;
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзТСД(Команда)
	
	ПодключаемоеОборудованиеУНФКлиент.ПолучитьДанныеИзТСД(ЭтотОбъект);
	
КонецПроцедуры // ЗагрузитьДанныеИзТСД()
// Конец ПодключаемоеОборудование

&НаКлиенте
Процедура НастройкаДокумента(Команда)
	
	// 1. Формируем структуру параметров для заполнения формы "Настройка документа".
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПоложениеЗаказаПокупателяВДокументахОтгрузки", 	Объект.ПоложениеЗаказаПокупателя);
	//Lazare_
	СтруктураПараметров.Вставить("ПоложениеСкладаВДокументахОтгрузки", 	Объект.ПоложениеСклада);
	//_Lazare	
	СтруктураПараметров.Вставить("БылиВнесеныИзменения", 						Ложь);
	
	СтруктураНастройкаДокумента = Неопределено;
	
	ОткрытьФорму("ОбщаяФорма.НастройкаДокумента", СтруктураПараметров,,,,, Новый ОписаниеОповещения("НастройкаДокументаЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаДокументаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	// 2. Открвыаем форму "Цены и Валюта".
	СтруктураНастройкаДокумента = Результат;
	
	// 3. Применяем изменения, сделанные в форме "Настройка документа".
	Если ТипЗнч(СтруктураНастройкаДокумента) = Тип("Структура") И СтруктураНастройкаДокумента.БылиВнесеныИзменения Тогда
		
		Объект.ПоложениеСклада = СтруктураНастройкаДокумента.ПоложениеСкладаВДокументахОтгрузки;
		УстановитьВидимостьОтПользовательскихНастроек();
		
		// ГрупповоеИзменениеСтрок
		ЗаполнитьСписокДействий();
		
	КонецЕсли;
	
	//Lazare_  // Применяем изменения, сделанные в форме "Настройка документа".
	Если ТипЗнч(СтруктураНастройкаДокумента) = Тип("Структура") И СтруктураНастройкаДокумента.БылиВнесеныИзменения Тогда
		
		Объект.ПоложениеЗаказаПокупателя = СтруктураНастройкаДокумента.ПоложениеЗаказаПокупателяВДокументахОтгрузки;
		УстановитьВидимостьОтПользовательскихНастроек();
		
		//// ГрупповоеИзменениеСтрок
		//ЗаполнитьСписокДействий();
		
	КонецЕсли;
	//_Lazare
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРезервЗаполнитьПоРезервам(Команда)
	
	Если Объект.Запасы.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='ცხრილი ""მარაგები და მომსახურებები"" შევსებული არ არის!';ru='Табличная часть ""Запасы и услуги"" не заполнена!';en='A table of the ""Reserves and services"" is not full!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКолонкуРезервПоРезервамНаСервере();
	
КонецПроцедуры // ИзменитьРезервЗаполнитьПоРезервам()

&НаКлиенте
Процедура ИзменитьРезервОчиститьРезерв(Команда)
	
	Если Объект.Запасы.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ka='ცხრილი ""მარაგები და მომსახურებები"" შევსებული არ არის!';ru='Табличная часть ""Запасы и услуги"" не заполнена!';en='A table of the ""Reserves and services"" is not full!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
		
		Если СтрокаТабличнойЧасти.ТипНоменклатурыЗапас Тогда
			СтрокаТабличнойЧасти.Резерв = 0;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ИзменитьРезервЗаполнитьПоОстаткам()

&НаКлиенте
Процедура ДекорацияПечатьНажатие(Элемент)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КонтекстПечати", Объект);
	
	НаборОснований = Новый Массив;
	Если НЕ ЗаказВШапке Тогда
		
		Для каждого СтрокаТаблицы Из Объект.Запасы Цикл
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.Заказ)
				И НаборОснований.Найти(СтрокаТаблицы.Заказ) = Неопределено Тогда
				
				НаборОснований.Добавить(СтрокаТаблицы.Заказ);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование)
		И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		
		НаборОснований.Добавить(Объект.ДокументОснование);
		
	КонецЕсли;
	
	Если НаборОснований.Количество() > 0 Тогда
		
		ПараметрыОткрытия.Вставить("НаборОснований", НаборОснований);
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзмененияРеквизитовПечати", ЭтотОбъект);
	ОткрытьФорму("Обработка.РеквизитыПечати.Форма.РеквизитыПечатиРасходнаяНакладная", ПараметрыОткрытия, ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

// ЕГАИС
&НаКлиенте
Процедура ПередатьДанныеВЕГАИС(Команда)
	
	Если Модифицированность ИЛИ НЕ Объект.Проведен Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Перед выполнение операции необходимо провести документ.';ru='Перед выполнение операции необходимо провести документ.';en='Before the operation it is necessary to hold the paper.'"));
		Возврат;
	КонецЕсли;
	
	Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='ესასს-ის ზედნადების გადაცემა მხარდაჭერილია მხოლოდ ოპერაცია ""მომწოდებლისთვის დაბრუნება""-სთვის.';ru='Передача накладной ЕГАИС поддерживается только для операции ""Возврат поставщику"".';en='Transfer EGAIS bill is supported only for the operation ""Return to supplier"".'"));
		Возврат;
	КонецЕсли;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеПередачаДанныхВЕГАИС", ЭтотОбъект);
	
	Отказ = Ложь;
	ПодготовитьТТН(Объект.Ссылка, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.ТТН");
	
	ВходныеПараметры = ИнтеграцияЕГАИСКлиентСервер.ПараметрыИсходящегоЗапроса(ВидДокумента);
	ВходныеПараметры.ДокументСсылка = Объект.ТоварноТранспортнаяНакладнаяЕГАИС;
	
	ИнтеграцияЕГАИСКлиент.НачатьФормированиеИсходящегоЗапроса(
		ОбработчикОповещения,
		ВидДокумента,
		ВходныеПараметры);
	
	Оповестить("ОбновитьСписокЗапросовЕГАИС");
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПередачаДанныхВЕГАИС(ДанныеОтЕГАИС, ДополнительныеПараметры) Экспорт
	
	Если НЕ ДанныеОтЕГАИС = Неопределено Тогда
		Если НЕ ДанныеОтЕГАИС.Результат Тогда
			СтрокаСообщения = НСтр("ka='Ошибка передачи данных в ЕГАИС';ru='Ошибка передачи данных в ЕГАИС';en='Error transferring data EGAIS'") 
				+ Символы.ПС + ДанныеОтЕГАИС.ОписаниеОшибки;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения);
		Иначе
			Объект.ПереданВЕГАИС = Истина;
			Модифицированность = Истина;
		КонецЕсли;
		
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
		
		УстановитьДоступностьЭлементовЕГАИС();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьТТН(ДокументСсылка, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КлассификаторОрганизацийЕГАИС.Ссылка КАК ОрганизацияЕГАИС,
	|	НастройкиОбменаЕГАИС.Организация,
	|	НастройкиОбменаЕГАИС.ТорговаяТочка
	|ПОМЕСТИТЬ Вт_ОрганизацииЕГАИС
	|ИЗ
	|	РегистрСведений.НастройкиОбменаЕГАИС КАК НастройкиОбменаЕГАИС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторОрганизацийЕГАИС КАК КлассификаторОрганизацийЕГАИС
	|		ПО НастройкиОбменаЕГАИС.ИдентификаторФСРАР = КлассификаторОрганизацийЕГАИС.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходнаяНакладная.Номер КАК Номер,
	|	РасходнаяНакладная.Дата КАК Дата,
	|	СоответствиеКонтрагентаОрганизацииЕГАИС.ОрганизацияЕГАИС КАК Грузополучатель,
	|	РасходнаяНакладная.ВидОперации,
	|	Вт_ОрганизацииЕГАИС.ОрганизацияЕГАИС
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОрганизацийЕГАИС КАК СоответствиеКонтрагентаОрганизацииЕГАИС
	|		ПО РасходнаяНакладная.Контрагент = СоответствиеКонтрагентаОрганизацииЕГАИС.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОрганизацииЕГАИС КАК Вт_ОрганизацииЕГАИС
	|		ПО РасходнаяНакладная.Организация = Вт_ОрганизацииЕГАИС.Организация
	|			И РасходнаяНакладная.СтруктурнаяЕдиница = Вт_ОрганизацииЕГАИС.ТорговаяТочка
	|ГДЕ
	|	РасходнаяНакладная.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(Товары.Номенклатура.АлкогольнаяПродукция, ЛОЖЬ) КАК АлкогольнаяПродукция,
	|	Товары.СправкаБ.АлкогольнаяПродукция КАК АлкогольнаяПродукцияСправкиБ,
	|	СправкиАЕГАИС.Ссылка КАК СправкаА,
	|	Товары.СправкаБ КАК СправкаБ,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.Всего КАК Сумма,
	|	Товары.СправкаБ.НомерСправкиА КАК НомерСправкиА
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СправкиАЕГАИС КАК СправкиАЕГАИС
	|		ПО Товары.СправкаБ.НомерСправкиА = СправкиАЕГАИС.РегистрационныйНомер
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И ЕСТЬNULL(Товары.Номенклатура.АлкогольнаяПродукция, ЛОЖЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Результат = Запрос.ВыполнитьПакет();
	ВыборкаДокумент = Результат[1].Выбрать();
	ВыборкаТовары = Результат[2].Выбрать();
	Если ВыборкаДокумент.Следующий() Тогда
		
		Если НЕ ЗначениеЗаполнено(ВыборкаДокумент.Грузополучатель) Тогда
			Отказ = Истина;
			СтрокаОшибки = НСтр("ka='ესასს-ის კლასიფიკატორთან კონტრაგენტის შესაბამისობის დადგენა ვერ მოხერხდა.';ru='Не удалось определить соответствие контрагента классификатору ЕГАИС.';en='Unable to determine whether the counterparty classifier EGAIS.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрокаОшибки,
				ДокументСсылка,
				"Объект.Контрагент");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ВыборкаДокумент.ОрганизацияЕГАИС) Тогда
			Отказ = Истина;
			СтрокаОшибки = НСтр("ka='ესასს-ის კლასიფიკატორთან ორგანიზაციის შესაბამისობის დადგენა ვერ მოხერხდა.';ru='Не удалось определить соответствие организации классификатору ЕГАИС.';en='Unable to determine whether the organization classifier EGAIS.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрокаОшибки,
				ДокументСсылка,
				"Объект.Организация");
		КонецЕсли;
		
		КоличествоСтрок = ВыборкаТовары.Количество();
		Если КоличествоСтрок = 0 Тогда
			Отказ = Истина;
			СтрокаОшибки = НСтр("ka='ესასს-ის კლასიფიკატორის მიხედვით ალკოჰოლური პროდუქციის შესაბამისობის დადგენა ვერ მოხერხდა.';ru='Не удалось определить соответствие алкогольной продукции по классификатору ЕГАИС.';en='Unable to determine the suitability of alcoholic beverages Classifier EGAIS.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрокаОшибки,
				ДокументСсылка,
				"Объект.Запасы");
		КонецЕсли;
		
		// Товары.
		Пока ВыборкаТовары.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(ВыборкаТовары.НомерСправкиА) Тогда
				Отказ = Истина;
				СтрокаОшибки = НСтр("ka='სტრიქონ %-ში ცნობა ბ-ში ცნობა ა-ს ნომერი არ არის შევსებული.';ru='В строке %1 в справке Б не заполнен номер справки А.';en='Line% 1 in the certificate B is empty reference number A.'");
				СтрокаОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаОшибки, ВыборкаТовары.НомерСтроки);
				ИмяПоляТоваров = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.Запасы", ВыборкаТовары.НомерСтроки, "СправкаБ");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрокаОшибки,
					ДокументСсылка,
					ИмяПоляТоваров);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаТовары.СправкаБ) Тогда
				Если НЕ ЗначениеЗаполнено(ВыборкаТовары.АлкогольнаяПродукцияСправкиБ)
					И ЗначениеЗаполнено(ВыборкаТовары.СправкаБ) Тогда
					Отказ = Истина;
					СтрокаОшибки = НСтр("ka='სტრიქონ %1-ში არ არის შევსებული ალკოჰოლური პროდუქცია ცნობა ბ-ში.';ru='В строке %1 не заполнена алкогольная продукция в справке Б.';en='Line% 1 is not filled with alcoholic beverages in B. Help'");
					СтрокаОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаОшибки, ВыборкаТовары.НомерСтроки);
					ИмяПоляТоваров = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.Запасы", ВыборкаТовары.НомерСтроки, "СправкаБ");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						СтрокаОшибки,
						ДокументСсылка,
						ИмяПоляТоваров);
				КонецЕсли;
			Иначе
				Отказ = Истина;
				СтрокаОшибки = НСтр("ka='სტრიქონ %1-ში ცნობა ბ არ არის შევსებული.';ru='В строке %1 не заполнена справка Б.';en='On line 1 is not filled% certificate B.'");
				СтрокаОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаОшибки, ВыборкаТовары.НомерСтроки);
				ИмяПоляТоваров = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.Запасы", ВыборкаТовары.НомерСтроки, "СправкаБ");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрокаОшибки,
					ДокументСсылка,
					ИмяПоляТоваров);
			КонецЕсли;
			
		КонецЦикла;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		ДанныеТТН = Новый Структура;
		ДанныеТТН.Вставить("ВыборкаДокумент", ВыборкаДокумент);
		ДанныеТТН.Вставить("ВыборкаТовары", ВыборкаТовары);
		
		ПодготовленнаяТТН = ИнтеграцияЕГАИСУНФ.СформироватьТТНПоДаннымДокумента(Объект.Ссылка, ДанныеТТН);
		Если Не ЗначениеЗаполнено(ПодготовленнаяТТН) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Объект.ТоварноТранспортнаяНакладнаяЕГАИС = ПодготовленнаяТТН;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОчиститьСообщения();
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РежимЗаписи",		РежимЗаписиДокумента.Проведение);
	ПараметрыЗаписи.Вставить("РежимПроведения",	РежимПроведенияДокумента.Неоперативный);
	ПараметрыЗаписи.Вставить("ПринудительноЗакрытьФорму", Истина);
	
	Отказ = Ложь ;
	
	Если Не Отказ Тогда
		Записать(ПараметрыЗаписи);
		СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элементы.ФормаПровестиИЗакрыть, "Нажатие");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКоманда(Команда)
	
	ОчиститьСообщения();
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РежимЗаписи",		РежимЗаписиДокумента.Запись);
	
	Записать(ПараметрыЗаписи);
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элементы.ФормаЗаписать, "Нажатие");
	
КонецПроцедуры

&НаКлиенте
Процедура Провести(Команда)
	
	ОчиститьСообщения();
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РежимЗаписи",		РежимЗаписиДокумента.Проведение);
	ПараметрыЗаписи.Вставить("РежимПроведения",	РежимПроведенияДокумента.Неоперативный);
	
	Отказ = Ложь ;
	
	Если Не Отказ Тогда
		Записать(ПараметрыЗаписи);
		СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элементы.ФормаПровести, "Нажатие");
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура РежимГТД(Команда)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РежимГТД", "Пометка", НЕ Элементы.РежимГТД.Пометка);
	
	ИзменитьРежимРаботаГТД(Элементы.РежимГТД.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьРежимРаботаГТД()
	
	НеизменяемыеРеквизиты = Новый Массив;
	НеизменяемыеРеквизиты.Добавить("ЗапасыПометка");
	НеизменяемыеРеквизиты.Добавить("ЗапасыНомерСтроки");
	НеизменяемыеРеквизиты.Добавить("ЗапасыНоменклатура");
	НеизменяемыеРеквизиты.Добавить("ЗапасыХарактеристика");
	НеизменяемыеРеквизиты.Добавить("ЗапасыПартия");
	НеизменяемыеРеквизиты.Добавить("ЗапасыКоличество");
	НеизменяемыеРеквизиты.Добавить("ЗапасыЕдиницаИзмерения");
	НеизменяемыеРеквизиты.Добавить("ЗапасыСтранаПроисхождения");
	НеизменяемыеРеквизиты.Добавить("ЗапасыНомерГТД");
	
	Для каждого ЭлементФормы Из Элементы.Запасы.ПодчиненныеЭлементы Цикл
		
		Если НеизменяемыеРеквизиты.Найти(ЭлементФормы.Имя) = Неопределено
			И ЭлементФормы.Видимость = Истина Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ЭлементФормы.Имя, "Видимость", Ложь);
			КэшЗначений.ОбрабатываемыеРеквизиты.Добавить(ЭлементФормы.Имя);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыЕдиницаИзмерения", "Доступность", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьРежимРаботаГТД()
	
	Для каждого ИмяЭлементаФормы Из КэшЗначений.ОбрабатываемыеРеквизиты Цикл
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ИмяЭлементаФормы, "Видимость", Истина);
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыЕдиницаИзмерения", "Доступность", Истина);
	
	КэшЗначений.ОбрабатываемыеРеквизиты = Новый Массив;
	
КонецПроцедуры

&НаКлиенте 
Процедура ИзменитьРежимРаботаГТД(ВключитьРежимГТД)
	
	Если НЕ КэшЗначений.Свойство("ОбрабатываемыеРеквизиты") Тогда
		
		КэшЗначений.Вставить("ОбрабатываемыеРеквизиты", Новый Массив);
		
	КонецЕсли;
	
	Если ВключитьРежимГТД Тогда
		
		ВключитьРежимРаботаГТД();
		
	Иначе
		
		ВыключитьРежимРаботаГТД();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьИзмененияРеквизитовПечати(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ПечатьДокументовУНФКлиент.ОбновитьЗначенияРеквизитовПечати(ЭтотОбъект, Результат.ИзмененныеРеквизиты);
		
		Если Результат.Свойство("Команда") Тогда
			
			Подключаемый_ВыполнитьКомандуПечати(Результат.Команда);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеСтруктурнойЕдиницыПриИзменении(СтруктурнаяЕдиница)
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("ПодписьКладовщика", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктурнаяЕдиница, "ПодписьМол"));
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоДокументу(ДокОснование)
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.Заполнить(ДокОснование);
	ЗначениеВРеквизитФормы(Документ, "Объект");
	Модифицированность = Истина;
	
	ИнтеграцияЕГАИСУНФ.ЗаполнитьНеобходимостьВводаСправкиНаАлкоголь(Объект.Запасы);
	
	Если Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС") Тогда
		
		Элементы.ЗапасыСтавкаНДС.Видимость = Истина;
		Элементы.ЗапасыСуммаНДС.Видимость = Истина;
		Элементы.ЗапасыВсего.Видимость = Истина;
		Элементы.СчетФактураНадпись.Видимость = Истина;
		
	Иначе
		
		Элементы.ЗапасыСтавкаНДС.Видимость = Ложь;
		Элементы.ЗапасыСуммаНДС.Видимость = Ложь;
		Элементы.ЗапасыВсего.Видимость = Ложь;
		Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НаЭкспорт Тогда
			Элементы.СчетФактураНадпись.Видимость = Истина;
		Иначе
			Элементы.СчетФактураНадпись.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьВидимостьДоговора();
	
КонецПроцедуры // ЗаполнитьПоДокументу()

&НаСервере
Функция ПолучитьДанныеДатаПриИзменении(ДатаПередИзменением, ВалютаРасчетов)
	
	РазностьДат = УправлениеНебольшойФирмойСервер.ПроверитьНомерДокумента(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
	ВалютаКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", ВалютаРасчетов));
		
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить(
		"РазностьДат",
		РазностьДат
	);
	СтруктураДанные.Вставить(
		"ВалютаКурсКратность",
		ВалютаКурсКратность
	);
	
	//ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС();
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДатаПриИзменении()

&НаСервере
Функция ПолучитьДанныеОрганизацияПриИзменении()
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Компания", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация));
	СтруктураДанные.Вставить("ПодписьРуководителя", Объект.Организация.ПодписьРуководителя);
	СтруктураДанные.Вставить("ПодписьГлавногоБухгалтера", Объект.Организация.ПодписьГлавногоБухгалтера);
	СтруктураДанные.Вставить("ИспользоватьФаксимиле", ПодписьДокументовУНФ.НадоВключитьФаксимиле(Объект.Организация, "РасходнаяНакладная"));
	
	ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС();
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеОрганизацияПриИзменении()

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные) Экспорт
	
	СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("СтранаПроисхождения", СтруктураДанные.Номенклатура.СтранаПроисхождения);
	СтруктураДанные.Вставить("ЭтоЗапас", СтруктураДанные.Номенклатура.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас"));
	
	Если СтруктураДанные.Свойство("НалогообложениеНДС") 
		И НЕ СтруктураДанные.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС") Тогда
		
		Если СтруктураДанные.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС") Тогда
			СтруктураДанные.Вставить("СтавкаНДС", УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС());
		Иначе
			СтруктураДанные.Вставить("СтавкаНДС", УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль());
		КонецЕсли;	
																
	ИначеЕсли ЗначениеЗаполнено(СтруктураДанные.Номенклатура.СтавкаНДС) Тогда
		СтруктураДанные.Вставить("СтавкаНДС", СтруктураДанные.Номенклатура.СтавкаНДС);
	Иначе
		СтруктураДанные.Вставить("СтавкаНДС", СтруктураДанные.Организация.СтавкаНДСПоУмолчанию);
	КонецЕсли;	
		
	Если СтруктураДанные.Свойство("ВидЦен") Тогда
		Цена = УправлениеНебольшойФирмойСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураДанные);
		СтруктураДанные.Вставить("Цена", Цена);
	Иначе
		СтруктураДанные.Вставить("Цена", 0);
	КонецЕсли;
	
	Если СтруктураДанные.Свойство("ВидСкидкиНаценки") 
		И ЗначениеЗаполнено(СтруктураДанные.ВидСкидкиНаценки) Тогда
		СтруктураДанные.Вставить("ПроцентСкидкиНаценки", СтруктураДанные.ВидСкидкиНаценки.Процент);
	Иначе	
		СтруктураДанные.Вставить("ПроцентСкидкиНаценки", 0);
	КонецЕсли;
		
	Если СтруктураДанные.Свойство("ПроцентСкидкиПоДисконтнойКарте") 
		И ЗначениеЗаполнено(СтруктураДанные.ДисконтнаяКарта) Тогда
		ТекПроцент = СтруктураДанные.ПроцентСкидкиНаценки;
		СтруктураДанные.Вставить("ПроцентСкидкиНаценки", ТекПроцент + СтруктураДанные.ПроцентСкидкиПоДисконтнойКарте);
	КонецЕсли;
	
	//Серийные номера
	СтруктураДанные.Вставить("ИспользоватьСерийныеНомера", СтруктураДанные.Номенклатура.ИспользоватьСерийныеНомера);
	//Серийные номера
	
	СтруктураДанные.Вставить("ЭтоАлкогольнаяПродукция", СтруктураДанные.Номенклатура.АлкогольнаяПродукция);
	
	СтруктураДанные.Вставить("ВесЕдиницыТовара", СтруктураДанные.Номенклатура.Вес);
	СтруктураДанные.Вставить("ОбъемЕдиницыТовара", СтруктураДанные.Номенклатура.Объем);
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	СчетУчетаВыручкиОтПродажРегл = СтруктураДанные.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл;
	Если НЕ ЗначениеЗаполнено(СчетУчетаВыручкиОтПродажРегл) Тогда
		СчетУчетаВыручкиОтПродажРегл = Справочники.НаправленияДеятельности.ОсновноеНаправление.СчетУчетаВыручкиОтПродажРегл;
	КонецЕсли;
	СтруктураДанные.Вставить("СчетУчетаВыручкиОтПродажРегл", СчетУчетаВыручкиОтПродажРегл);
	// Kuzmich, 21.05.2019, Счет выручки в табличной части
	
	СтруктураДанные.Вставить("НаправлениеДеятельности", СтруктураДанные.Номенклатура.НаправлениеДеятельности); //+++ Дмгг
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()

&НаСервереБезКонтекста
Функция ПолучитьДанныеХарактеристикаПриИзменении(СтруктураДанные)
	
	Если СтруктураДанные.Свойство("ВидЦен") Тогда
		
		Если ТипЗнч(СтруктураДанные.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
			СтруктураДанные.Вставить("Коэффициент", СтруктураДанные.ЕдиницаИзмерения.Коэффициент);
		Иначе
			СтруктураДанные.Вставить("Коэффициент", 1);
		КонецЕсли;
		
		Цена = УправлениеНебольшойФирмойСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураДанные);
		СтруктураДанные.Вставить("Цена", Цена);
		
	Иначе
		
		СтруктураДанные.Вставить("Цена", 0);
		
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеХарактеристикаПриИзменении()

&НаСервереБезКонтекста
Функция ПолучитьДанныеЕдиницаИзмеренияПриИзменении(Номенклатура, ТекущаяЕдиницаИзмерения = Неопределено, ЕдиницаИзмерения = Неопределено)
	
	Результат = Новый Структура;
	
	Если ТекущаяЕдиницаИзмерения = Неопределено Тогда
		Результат.Вставить("ТекущийКоэффициент", 1);
	Иначе
		Результат.Вставить("ТекущийКоэффициент", ТекущаяЕдиницаИзмерения.Коэффициент);
	КонецЕсли;
	
	Если ЕдиницаИзмерения = Неопределено Тогда
		Результат.Вставить("Коэффициент", 1);
	Иначе
		Результат.Вставить("Коэффициент", ЕдиницаИзмерения.Коэффициент);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(
	Результат,
	ВесИОбъемЕдиницТоваров(Номенклатура, ЕдиницаИзмерения, Результат.Коэффициент));
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВесИОбъемЕдиницТоваров(Знач Номенклатура, Знач ЕдиницаИзмерения, Знач Коэффициент)
	
	Возврат РегистрыСведений.ВесИОбъемЕдиницТоваров.Значения(Номенклатура, ЕдиницаИзмерения, Коэффициент);
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеКонтрагентПриИзменении(Дата, ВалютаДокумента, Контрагент, Организация)
	
	ДоговорПоУмолчанию = ПолучитьДоговорПоУмолчанию(Объект.Ссылка, Контрагент, Организация, Объект.ВидОперации);
	
	СтруктураДанные = Новый Структура();
	
	СтруктураДанные.Вставить(
		"КонтактноеЛицоПодписант",
		Контрагент.КонтактноеЛицоПодписант
	);
	
	СтруктураДанные.Вставить(
		"Договор",
		ДоговорПоУмолчанию
	);
	
	СтруктураДанные.Вставить(
		"НаименованиеДоговора",
		ДоговорПоУмолчанию.Наименование
	);
	
	СтруктураДанные.Вставить(
		"ВалютаРасчетов",
		ДоговорПоУмолчанию.ВалютаРасчетов
	);
	
	СтруктураДанные.Вставить(
		"ВалютаРасчетовКурсКратность",
		РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", ДоговорПоУмолчанию.ВалютаРасчетов))
	);
	
	СтруктураДанные.Вставить(
		"РасчетыВУсловныхЕдиницах",
		ДоговорПоУмолчанию.РасчетыВУсловныхЕдиницах
	);
	
	СтруктураДанные.Вставить(
		"ВидСкидкиНаценки",
		ДоговорПоУмолчанию.ВидСкидкиНаценки
	);
	
	СтруктураДанные.Вставить(
		"ВидЦен",
		ДоговорПоУмолчанию.ВидЦен
	);
	
	СтруктураДанные.Вставить(
		"СуммаВключаетНДС",
		?(ЗначениеЗаполнено(ДоговорПоУмолчанию.ВидЦен), ДоговорПоУмолчанию.ВидЦен.ЦенаВключаетНДС, Неопределено)
	);
	
	УстановитьВидимостьДоговора();
	
	ОбновитьВидимостьИОстаткиВзаиморасчетов();
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеКонтрагентПриИзменении()

&НаСервереБезКонтекста
Функция ПолучитьДанныеДоговорПриИзменении(Дата, ВалютаДокумента, Договор)
		
	СтруктураДанные = Новый Структура();
	
	СтруктураДанные.Вставить(
		"НаименованиеДоговора",
		Договор.Наименование
	);
	
	СтруктураДанные.Вставить(
		"ВалютаРасчетов",
		Договор.ВалютаРасчетов
	);
	
	СтруктураДанные.Вставить(
		"ВалютаРасчетовКурсКратность",
		РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Договор.ВалютаРасчетов))
	);
	
	СтруктураДанные.Вставить(
		"ВидЦен",
		Договор.ВидЦен
	);
	
	СтруктураДанные.Вставить(
		"ВидСкидкиНаценки",
		Договор.ВидСкидкиНаценки
	);
	
	СтруктураДанные.Вставить(
		"РасчетыВУсловныхЕдиницах",
		Договор.РасчетыВУсловныхЕдиницах
	);
	
	СтруктураДанные.Вставить(
		"СуммаВключаетНДС",
		?(ЗначениеЗаполнено(Договор.ВидЦен), Договор.ВидЦен.ЦенаВключаетНДС, Неопределено)
	);
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДоговорПриИзменении()

&НаСервере
Процедура ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС(ЭтоОткрытие = Ложь)
	
	НалогообложениеПередИзменением = Объект.НалогообложениеНДС;
	СтавкаНДСПередИзменением = Объект.ОсновнаяСтавкаНДС;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение") Тогда
		
		//Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
			
			Если ИспользоватьИсториюНалогообложенияКонтрагента Тогда 
				СтруктураНалогообложения = УправлениеНебольшойФирмойСервер.НалогообложениеНДС_СтруктураСНДС(Объект.Организация,, Объект.Дата, Объект.Контрагент);
				Объект.НалогообложениеНДС = СтруктураНалогообложения.НалогообложениеНДС;
				Объект.ОсновнаяСтавкаНДС = СтруктураНалогообложения.СтавкаНДС;               
			Иначе
				Объект.НалогообложениеНДС = УправлениеНебольшойФирмойСервер.НалогообложениеНДС(Объект.Организация,, Объект.Дата, Объект.Контрагент,, ИСТИНА);
			КонецЕсли;
			
		//Иначе
		//	ДоговорДляНалогообложения = ?(ЗначениеЗаполнено(Объект.Договор), Объект.Договор, Объект.Контрагент.ДоговорПоУмолчанию);
		//	
		//	Если ИспользоватьИсториюНалогообложенияКонтрагента Тогда 
		//		СтруктураНалогообложения = УправлениеНебольшойФирмойСервер.НалогообложениеНДС_СтруктураСНДС(Объект.Организация,,Объект.Дата,Объект.Контрагент,ДоговорДляНалогообложения);
		//		Объект.НалогообложениеНДС = СтруктураНалогообложения.НалогообложениеНДС;
		//		Объект.ОсновнаяСтавкаНДС = СтруктураНалогообложения.СтавкаНДС;
		//	Иначе
		//		Объект.НалогообложениеНДС = УправлениеНебольшойФирмойСервер.НалогообложениеНДС(Объект.Организация,, Объект.Дата, Объект.Контрагент, ДоговорДляНалогообложения);//);
		//	КонецЕсли;
		//КонецЕсли;
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения") Тогда
		
		Если ИспользоватьИсториюНалогообложенияКонтрагента Тогда
			СтруктураНалогообложения = УправлениеНебольшойФирмойСервер.НалогообложениеНДС_СтруктураСНДС(Объект.Организация,, Объект.Дата, Объект.Контрагент);
			Объект.НалогообложениеНДС = ?(ТипЗнч(СтруктураНалогообложения) = Тип("Структура"), СтруктураНалогообложения.НалогообложениеНДС, СтруктураНалогообложения);
			Объект.ОсновнаяСтавкаНДС = СтруктураНалогообложения.СтавкаНДС;
		Иначе
			Объект.НалогообложениеНДС = УправлениеНебольшойФирмойСервер.НалогообложениеНДС(Объект.Организация,, Объект.Дата, Объект.Контрагент,, ИСТИНА);
		КонецЕсли;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.НалогообложениеНДС) Тогда
		
		Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС");
		Объект.ОсновнаяСтавкаНДС = Справочники.СтавкиНДС.НДС18;
		
	КонецЕсли;
	
	Если НЕ НалогообложениеПередИзменением = Объект.НалогообложениеНДС ИЛИ ЭтоОткрытие
			ИЛИ (ИспользоватьИсториюНалогообложенияКонтрагента И НЕ СтавкаНДСПередИзменением = Объект.ОсновнаяСтавкаНДС) Тогда
		ЗаполнитьСтавкуНДСПоНалогообложениеНДС();
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСтавкуНДСПоНалогообложениеНДС()

&НаСервере
Процедура ЗаполнитьСтавкуНДСПоНалогообложениеНДС()
	
	СтавкаНДСПоУмолчанию = ?(ИспользоватьИсториюНалогообложенияКонтрагента, Объект.ОсновнаяСтавкаНДС, СтавкаНДСПоУмолчанию); //+++ Дмгг
	
	Если Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС") Тогда
		
		Элементы.ЗапасыСтавкаНДС.Видимость = Истина;
		Элементы.ЗапасыСуммаНДС.Видимость = Истина;
		Элементы.ЗапасыВсего.Видимость = Истина;
		Элементы.СчетФактураНадпись.Видимость = Истина;
		
		Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
			
			//Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС) Тогда
			//	СтрокаТабличнойЧасти.СтавкаНДС = СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС;
			//Иначе
			//	СтрокаТабличнойЧасти.СтавкаНДС = Объект.Организация.СтавкаНДСПоУмолчанию;
			//КонецЕсли;	
			
			Если ИспользоватьИсториюНалогообложенияКонтрагента Тогда
				СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
			ИначеЕсли ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС) Тогда
				СтрокаТабличнойЧасти.СтавкаНДС = СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС;
			Иначе
				СтрокаТабличнойЧасти.СтавкаНДС = Объект.Организация.СтавкаНДСПоУмолчанию;
			КонецЕсли;	

			
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
			СтрокаТабличнойЧасти.СуммаНДС = ?(Объект.СуммаВключаетНДС, 
									  		СтрокаТабличнойЧасти.Сумма - (СтрокаТабличнойЧасти.Сумма) / ((СтавкаНДС + 100) / 100),
									  		СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100);
			СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
			
		КонецЦикла;	
		
	Иначе
		
		Элементы.ЗапасыСтавкаНДС.Видимость = Ложь;
		Элементы.ЗапасыСуммаНДС.Видимость = Ложь;
		Элементы.ЗапасыВсего.Видимость = Ложь;
		
		Если Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС") Тогда
			СтавкаНДСПоУмолчанию = ?(ИспользоватьИсториюНалогообложенияКонтрагента, СтавкаНДСПоУмолчанию, УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС());
			Элементы.СчетФактураНадпись.Видимость = Ложь;
		Иначе
			СтавкаНДСПоУмолчанию = ?(ИспользоватьИсториюНалогообложенияКонтрагента, СтавкаНДСПоУмолчанию, УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС());
			Элементы.СчетФактураНадпись.Видимость = Истина;
		КонецЕсли;	
		
		Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
		
			СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
			СтрокаТабличнойЧасти.СуммаНДС = 0;
			
			СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма;
			
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры // ЗаполнитьСтавкуНДСПоНалогообложениеНДС()	

&НаКлиенте
Процедура РассчитатьСуммуНДС(СтрокаТабличнойЧасти)
	
	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
	
	Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику") Тогда 
		
		СтрокаТабличнойЧасти.СуммаНДС = ?(Объект.СуммаВключаетНДС, 
										  СтрокаТабличнойЧасти.Сумма - (СтрокаТабличнойЧасти.Сумма) / ((СтавкаНДС + 100) / 100),
										  СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100);
										  
	Иначе 
		Если Объект.ЦенаВключаетНалоги = ПредопределенноеЗначение("Перечисление.ВидВлключениеНалоговВЦену.ЦенаБезНалогов") Тогда 
			
			Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
			СтрокаТабличнойЧасти.СуммаНДС = Сумма * (СтавкаНДС/100);
			
		ИначеЕсли Объект.ЦенаВключаетНалоги = ПредопределенноеЗначение("Перечисление.ВидВлключениеНалоговВЦену.ЦенаВключаетНалоги") Тогда 
			
			СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
			
			СтрокаТабличнойЧасти.УдержаниеПенсии = ?(СтрокаТабличнойЧасти.УдерживатьПенсию ,СтрокаТабличнойЧасти.Сумма * 0.02, 0);
			СтрокаТабличнойЧасти.СуммаНДФЛ = (СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.УдержаниеПенсии) * 0.2;
			СтрокаТабличнойЧасти.СуммаНДС = (СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.УдержаниеПенсии - СтрокаТабличнойЧасти.СуммаНДФЛ)-(СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.УдержаниеПенсии - СтрокаТабличнойЧасти.СуммаНДФЛ)/(1 + (СтавкаНДС/100));
			СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
			
		КонецЕсли;
	КонецЕсли;
	
		
КонецПроцедуры // РассчитатьСуммуНДС()

&НаКлиенте
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти = Неопределено, СброситьФлагСкидкиРассчитаны = Истина) Экспорт 
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	КонецЕсли;
	
	//+++ Дмгг
	// Отдляем типовой механизм от безвозмезной продажи на сотрудника
	Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику") Тогда 
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
		
		//Если СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 100 Тогда //+++ Дмгг
		Если НЕ ИспользоватьКартыЛояльности Тогда
			
			Если СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 100 Тогда
				
				СтрокаТабличнойЧасти.Сумма = 0;
				
			ИначеЕсли НЕ СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 0
				И НЕ СтрокаТабличнойЧасти.Количество = 0 Тогда
				
				СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Сумма * (1 - СтрокаТабличнойЧасти.ПроцентСкидкиНаценки / 100);
				
			КонецЕсли;
			
		ИначеЕсли СтрокаТабличнойЧасти.ПроцентАвтоматическойСкидки <> 0 Тогда 
			
			Если СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 100 Тогда
				
				СтрокаТабличнойЧасти.Сумма = 0;
				
			ИначеЕсли НЕ СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 0
				И НЕ СтрокаТабличнойЧасти.Количество = 0 Тогда
				
				СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Сумма * (1 - СтрокаТабличнойЧасти.ПроцентАвтоматическойСкидки / 100) * (1 - СтрокаТабличнойЧасти.ПроцентСкидкиНаценки / 100);
				
			ИначеЕсли СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 0
				И НЕ СтрокаТабличнойЧасти.Количество = 0 Тогда
				
				СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Сумма * (1 - СтрокаТабличнойЧасти.ПроцентАвтоматическойСкидки / 100);
				
			КонецЕсли;
			
			СтрокаТабличнойЧасти.ПроцентСкидкаЛояльности = 0;
			
		Иначе
			
			Если СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 100 ИЛИ СтрокаТабличнойЧасти.ПроцентСкидкаЛояльности = 100 Тогда //+++ Дмгг
				
				СтрокаТабличнойЧасти.Сумма = 0;
				
				//ИначеЕсли НЕ СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 0
				//	И НЕ СтрокаТабличнойЧасти.Количество = 0 Тогда
			ИначеЕсли (НЕ СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 0 ИЛИ НЕ СтрокаТабличнойЧасти.ПроцентСкидкаЛояльности = 0)
				И НЕ СтрокаТабличнойЧасти.Количество = 0 Тогда
				
				//+++ Дмгг
				//СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Сумма * (1 - СтрокаТабличнойЧасти.ПроцентСкидкиНаценки / 100);
				Если СтрокаТабличнойЧасти.ПроцентСкидкаЛояльности = 0 Тогда 
					СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Сумма * (1 - СтрокаТабличнойЧасти.ПроцентСкидкиНаценки / 100);
				Иначе
					СтрокаТабличнойЧасти.Сумма = (СтрокаТабличнойЧасти.Сумма * (1 - СтрокаТабличнойЧасти.ПроцентСкидкаЛояльности / 100)) * (1 - СтрокаТабличнойЧасти.ПроцентСкидкиНаценки / 100);
				КонецЕсли;
				//--- Дмгг
			КонецЕсли;
		КонецЕсли;
		
		РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
		СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
		
		// АвтоматическиеСкидки.
		Если СброситьФлагСкидкиРассчитаны Тогда
			ТребуетсяПересчетАвтоматическихСкидок = СброситьФлагСкидкиРассчитаныКлиент("РассчитатьСуммуВСтрокеТабличнойЧасти");
		КонецЕсли;
		
		Если НЕ ИспользоватьКартыЛояльности Тогда 
			СтрокаТабличнойЧасти.ПроцентАвтоматическойСкидки = 0;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.СуммаАвтоматическойСкидки = 0;
		Если СтрокаТабличнойЧасти.Свойство("ОбщаяСуммаСкидкиБольшеСуммы") Тогда
			СтрокаТабличнойЧасти.ОбщаяСуммаСкидкиБольшеСуммы = Ложь;
		КонецЕсли;

		// Конец АвтоматическиеСкидки
		
		//Ручная скидка - заполнение полей ввода на форме
		СкидкиНаценкиКлиентСервер.РассчитатьСуммуИПроцентСкидки(ЭтотОбъект);
		//Конец Ручная скидка
		
		// Серийные номера
		Если ИспользоватьСерийныеНомераОстатки<>Неопределено Тогда
			РаботаССерийнымиНомерамиКлиентСервер.ОбновитьСерийныеНомераКоличество(Объект, СтрокаТабличнойЧасти);
		КонецЕсли;
	Иначе 
		
		Если Объект.ЦенаВключаетНалоги = ПредопределенноеЗначение("Перечисление.ВидВлключениеНалоговВЦену.ЦенаБезНалогов") Тогда 
			
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
			
			Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
			СтрокаТабличнойЧасти.СуммаНДС = Сумма * (СтавкаНДС/100);
			
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВидНалогаНДФЛ) Тогда 
				СтрокаТабличнойЧасти.СуммаНДФЛ = (Сумма + СтрокаТабличнойЧасти.СуммаНДС) * 1.25 - (Сумма + СтрокаТабличнойЧасти.СуммаНДС);
			Иначе 
				СтрокаТабличнойЧасти.СуммаНДФЛ = 0;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВидУдержанияПФ) И СтрокаТабличнойЧасти.УдерживатьПенсию Тогда
				СтрокаТабличнойЧасти.УдержаниеПенсии = (Сумма + СтрокаТабличнойЧасти.СуммаНДС + СтрокаТабличнойЧасти.СуммаНДФЛ)/0.98*0.02;
			Иначе 
				СтрокаТабличнойЧасти.УдержаниеПенсии = 0;
			КонецЕсли;
			
			СтрокаТабличнойЧасти.Сумма = Сумма + СтрокаТабличнойЧасти.СуммаНДС + СтрокаТабличнойЧасти.СуммаНДФЛ + СтрокаТабличнойЧасти.УдержаниеПенсии;
			СтрокаТабличнойЧасти.Всего = Сумма + СтрокаТабличнойЧасти.СуммаНДС + СтрокаТабличнойЧасти.СуммаНДФЛ + СтрокаТабличнойЧасти.УдержаниеПенсии;
			
		ИначеЕсли Объект.ЦенаВключаетНалоги = ПредопределенноеЗначение("Перечисление.ВидВлключениеНалоговВЦену.ЦенаВключаетНалоги") Тогда 
			
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
			
			СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
			
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВидУдержанияПФ) И СтрокаТабличнойЧасти.УдерживатьПенсию Тогда
				СтрокаТабличнойЧасти.УдержаниеПенсии = СтрокаТабличнойЧасти.Сумма * 0.02;
			Иначе 
				СтрокаТабличнойЧасти.УдержаниеПенсии = 0;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВидНалогаНДФЛ) Тогда
				СтрокаТабличнойЧасти.СуммаНДФЛ = (СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.УдержаниеПенсии) * 0.2;
			Иначе 
				СтрокаТабличнойЧасти.СуммаНДФЛ = 0;
			КонецЕсли;
			
			СтрокаТабличнойЧасти.СуммаНДС = (СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.УдержаниеПенсии - СтрокаТабличнойЧасти.СуммаНДФЛ)-(СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.УдержаниеПенсии - СтрокаТабличнойЧасти.СуммаНДФЛ)/(1 + (СтавкаНДС/100));
			СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьПодвалФормы(); //+++ Истомин
	
КонецПроцедуры // РассчитатьСуммуВСтрокеТабличнойЧасти()

&НаКлиенте
Процедура ПересчитатьКурсКратностьВалютыРасчетов(СтруктураДанные)
	
	КурсНовый = ?(СтруктураДанные.ВалютаКурсКратность.Курс = 0, 1, СтруктураДанные.ВалютаКурсКратность.Курс);
	КратностьНовый = ?(СтруктураДанные.ВалютаКурсКратность.Кратность = 0, 1, СтруктураДанные.ВалютаКурсКратность.Кратность);
	
	Если Объект.Курс <> КурсНовый
		ИЛИ Объект.Кратность <> КратностьНовый Тогда
		
		КурсВалютыСтрокой = Строка(Объект.Кратность) + " " + СокрЛП(ВалютаРасчетов) + " = " + Строка(Объект.Курс) + " " + СокрЛП(НациональнаяВалюта);
		КурсНовыйВалютыСтрокой = Строка(КратностьНовый) + " " + СокрЛП(ВалютаРасчетов) + " = " + Строка(КурсНовый) + " " + СокрЛП(НациональнаяВалюта);
		
		ПараметрыВопроса = Новый Структура;
		ПараметрыВопроса.Вставить("КурсНовый", КурсНовый);
		ПараметрыВопроса.Вставить("КратностьНовый", КратностьНовый);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросОПересчетеКурсаКратностиВалютыРасчетовЗавершение", ЭтотОбъект, ПараметрыВопроса);
		
		ТекстВопроса = НСтр("ru = 'На дату документа у валюты расчетов (" + КурсВалютыСтрокой + ") был задан курс.
									|Установить курс расчетов (" + КурсНовыйВалютыСтрокой + ") в соответствии с курсом валюты?'; ka = 'დოკუმენტის თარიღისთვის ანგარიშსწორების ვალუტას ჰქონდა მითითებული (" + КурсВалютыСтрокой + ") კურსი.
		|დაყენდეს ანგარიშსწორების კურსი (" + КурсНовыйВалютыСтрокой + ") ვალუტის კურსთან შესაბამისობაში?'");
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КОнецПроцедуры // ПересчитатьКурсКратностьВалютыРасчетов()

&НаКлиенте
Процедура ВопросОПересчетеКурсаКратностиВалютыРасчетовЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Объект.Курс = ДополнительныеПараметры.КурсНовый;
		Объект.Кратность = ДополнительныеПараметры.КратностьНовый;
		
		Для каждого СтрокаТабличнойЧасти Из Объект.Предоплата Цикл
			СтрокаТабличнойЧасти.СуммаПлатежа = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
				СтрокаТабличнойЧасти.СуммаРасчетов,
				СтрокаТабличнойЧасти.Курс,
				?(Объект.ВалютаДокумента = НациональнаяВалюта, КурсНациональнаяВалюта, Объект.Курс),
				СтрокаТабличнойЧасти.Кратность,
				?(Объект.ВалютаДокумента = НациональнаяВалюта, КратностьНациональнаяВалюта, Объект.Кратность));
		КонецЦикла;
			
		// Сформируем надпись цены и валюты.
		СтруктураНадписи = Новый Структура("ВидЦен, ВидСкидки, ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, НалогообложениеНДС, ДисконтнаяКарта, ПроцентСкидкиПоДисконтнойКарте", Объект.ВидЦен, Объект.ВидСкидкиНаценки, Объект.ВалютаДокумента, ВалютаРасчетов, Объект.Курс, КурсНациональнаяВалюта, Объект.СуммаВключаетНДС, УчетВалютныхОпераций, Объект.НалогообложениеНДС, Объект.ДисконтнаяКарта, Объект.ПроцентСкидкиПоДисконтнойКарте);
		ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзмененияПоКнопкеЦеныИВалюты(Знач ВалютаРасчетовПередИзменением, ПерезаполнитьЦены = Ложь, ПересчитатьЦены = Ложь, ТекстПредупреждения = "")
	
	// 1. Формируем структуру параметров для заполнения формы "Цены и Валюта".
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВалютаДокумента",		  Объект.ВалютаДокумента);
	СтруктураПараметров.Вставить("Курс",				  Объект.Курс);
	СтруктураПараметров.Вставить("Кратность",			  Объект.Кратность);
	СтруктураПараметров.Вставить("НалогообложениеНДС",	  Объект.НалогообложениеНДС);
	СтруктураПараметров.Вставить("СуммаВключаетНДС",	  Объект.СуммаВключаетНДС);
	СтруктураПараметров.Вставить("НДСВключатьВСтоимость", Объект.НДСВключатьВСтоимость);
	СтруктураПараметров.Вставить("Контрагент",			  Объект.Контрагент);
	СтруктураПараметров.Вставить("Договор",				  Объект.Договор);
	СтруктураПараметров.Вставить("Организация",			  Компания);
	СтруктураПараметров.Вставить("ДатаДокумента",		  Объект.Дата);
	СтруктураПараметров.Вставить("ПерезаполнитьЦены",	  ПерезаполнитьЦены);
	СтруктураПараметров.Вставить("ПересчитатьЦены",		  ПересчитатьЦены);
	СтруктураПараметров.Вставить("БылиВнесеныИзменения",  Ложь);
	СтруктураПараметров.Вставить("ТекстПредупреждения",   ТекстПредупреждения);
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю")
	 ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию")
	 ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку")
	 ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение") Тогда
		СтруктураПараметров.Вставить("ВидЦен", Объект.ВидЦен);
		СтруктураПараметров.Вставить("ОсновнаяСтавкаНДС",   Объект.ОсновнаяСтавкаНДС);   
	КонецЕсли;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю") Тогда
		СтруктураПараметров.Вставить("ВидСкидки", Объект.ВидСкидкиНаценки);
		СтруктураПараметров.Вставить("ДисконтнаяКарта", Объект.ДисконтнаяКарта);
		//--------------------------------------------------------------------------
		// © Шишка В.В. [10 января 2022]  НАЧАЛО
		СтруктураПараметров.Вставить("ПерезаполнитьЦены",	  ЗначениеЗаполнено(Объект.ДисконтнаяКарта));	
		// © Шишка В.В. [10 января 2022]  КОНЕЦ
		//--------------------------------------------------------------------------
	КонецЕсли;
	
	//Открываем форму "Цены и Валюта".
	//Перезаполняем табличную часть "Затраты" если были внесены изменения в форме "Цены и Валюта".
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуЦеныИВалютаЗавершение", ЭтотОбъект, Новый Структура("ВалютаРасчетовПередИзменением", ВалютаРасчетовПередИзменением));
	ОткрытьФорму("ОбщаяФорма.ФормаЦеныИВалюта", СтруктураПараметров, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ОбработатьИзмененияПоКнопкеЦеныИВалюты()

&НаКлиенте
Процедура ОткрытьФормуЦеныИВалютаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	СтруктураЦеныИВалюта = РезультатЗакрытия;
	ВалютаРасчетовПередИзменением = ДополнительныеПараметры.ВалютаРасчетовПередИзменением;
	
	Если ТипЗнч(СтруктураЦеныИВалюта) = Тип("Структура") И СтруктураЦеныИВалюта.БылиВнесеныИзменения Тогда
		
		Объект.ВидЦен = СтруктураЦеныИВалюта.ВидЦен;
		Объект.ВидСкидкиНаценки = СтруктураЦеныИВалюта.ВидСкидки;
		// ДисконтныеКарты
		Если ЗначениеЗаполнено(РезультатЗакрытия.ДисконтнаяКарта) И ЗначениеЗаполнено(РезультатЗакрытия.Контрагент) И Не Объект.Контрагент.Пустая() Тогда
			Если РезультатЗакрытия.Контрагент = Объект.Контрагент Тогда
				Объект.ДисконтнаяКарта = РезультатЗакрытия.ДисконтнаяКарта;
				Объект.ПроцентСкидкиПоДисконтнойКарте = РезультатЗакрытия.ПроцентСкидкиПоДисконтнойКарте;
			Иначе // Выдадим сообщение и не будем менять данные о дисконтной карте.
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ka='დისკონტური ბარათი არ არის წაკითხული. დისკონტური ბარათის მფლობელი დოკუმენტში არსებულ კონტრაგენტს არ ემთხვევა.';ru='Дисконтная карта не считана. Владелец дисконтной карты не совпадает с контрагентом в документе.';en='The discount card is not read. The owner of a discount card does not coincide with the counterpart in the document.'"),
				,
				"Контрагент",
				"Объект");
			КонецЕсли;
		Иначе
			Объект.ДисконтнаяКарта = РезультатЗакрытия.ДисконтнаяКарта;
			Объект.ПроцентСкидкиПоДисконтнойКарте = РезультатЗакрытия.ПроцентСкидкиПоДисконтнойКарте;
		КонецЕсли;
		// Конец ДисконтныеКарты
		Объект.ВалютаДокумента = СтруктураЦеныИВалюта.ВалютаДокумента;
		Объект.Курс = СтруктураЦеныИВалюта.КурсРасчетов;
		Объект.Кратность = СтруктураЦеныИВалюта.КратностьРасчетов;
		Объект.НалогообложениеНДС = СтруктураЦеныИВалюта.НалогообложениеНДС;
		Объект.СуммаВключаетНДС = СтруктураЦеныИВалюта.СуммаВключаетНДС;
		Объект.НДСВключатьВСтоимость = СтруктураЦеныИВалюта.НДСВключатьВСтоимость;
		Объект.ОсновнаяСтавкаНДС = СтруктураЦеныИВалюта.ОсновнаяСтавкаНДС; //+++ Дмгг
		
		// Пересчитываем цены по виду цен.
		Если СтруктураЦеныИВалюта.ПерезаполнитьЦены Тогда
			УправлениеНебольшойФирмойКлиент.ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен(ЭтотОбъект, "Запасы", Истина);
		КонецЕсли;
		
		// Пересчитываем цены по валюте.
		Если НЕ СтруктураЦеныИВалюта.ПерезаполнитьЦены
			  И СтруктураЦеныИВалюта.ПересчитатьЦены Тогда	
			УправлениеНебольшойФирмойКлиент.ПересчитатьЦеныТабличнойЧастиПоВалюте(ЭтотОбъект, ВалютаРасчетовПередИзменением, "Запасы");
		КонецЕсли;
		
		// Пересчитываем сумму если изменился признак Налогообложение НДС.
		Если СтруктураЦеныИВалюта.НалогообложениеНДС <> СтруктураЦеныИВалюта.ПредНалогообложениеНДС Тогда
			ЗаполнитьСтавкуНДСПоНалогообложениеНДС();
		КонецЕсли;
		
		// Пересчитываем сумму если изменился признак Налогообложение НДС. Дмгг
		Если СтруктураЦеныИВалюта.ОсновнаяСтавкаНДС <> СтруктураЦеныИВалюта.ПредОсновнаяСтавкаНДС Тогда
			ЗаполнитьСтавкуНДСПоНалогообложениеНДС();
		КонецЕсли;
		
		// Пересчитываем сумму если изменился признак "Сумма включает НДС".
		Если НЕ СтруктураЦеныИВалюта.ПерезаполнитьЦены
			И НЕ СтруктураЦеныИВалюта.СуммаВключаетНДС = СтруктураЦеныИВалюта.ПредСуммаВключаетНДС Тогда
			УправлениеНебольшойФирмойКлиент.ПересчитаемСуммуТабличнойЧастиПоФлагуСуммаВключаетНДС(ЭтотОбъект, "Запасы");
			Если СтоимостьДоставкиСНДС<>0 Тогда
				ОбновитьСуммуНДСДоставкиПриРасчете();
			КонецЕсли; 
		КонецЕсли;
		
		Для каждого СтрокаТабличнойЧасти Из Объект.Предоплата Цикл
			СтрокаТабличнойЧасти.СуммаПлатежа = УправлениеНебольшойФирмойКлиент.ПересчитатьИзВалютыВВалюту(
				СтрокаТабличнойЧасти.СуммаРасчетов,
				СтрокаТабличнойЧасти.Курс,
				?(Объект.ВалютаДокумента = НациональнаяВалюта, КурсНациональнаяВалюта, Объект.Курс),
				СтрокаТабличнойЧасти.Кратность,
				?(Объект.ВалютаДокумента = НациональнаяВалюта, КратностьНациональнаяВалюта, Объект.Кратность));  
		КонецЦикла;
		
		// АвтоматическиеСкидки
		Если РезультатЗакрытия.ПерезаполнитьСкидки ИЛИ РезультатЗакрытия.ПерезаполнитьЦены ИЛИ РезультатЗакрытия.ПересчитатьЦены Тогда
			СброситьФлагСкидкиРассчитаныКлиент("ПерезаполнениеПоДаннымФормыЦеныИВалюта");
		КонецЕсли;
		
		//Ручная скидка - заполнение полей ввода на форме
		СкидкиНаценкиКлиентСервер.РассчитатьСуммуИПроцентСкидки(ЭтотОбъект);
		//Конец Ручная скидка	

		// 28.06.2022 Soniva 
		Если СтруктураЦеныИВалюта.ПерезаполнитьЦеныПоДиапазону Тогда 	
			 УправлениеНебольшойФирмойКлиент.ПересчитатьЦеныТабличнойЧастиПоДиапазонуКоличестваНоменклатуры(ЭтотОбъект, "Запасы", Истина);
		КонецЕсли;
		
		
		
	КонецЕсли;
	
	// Сформируем надпись цены и валюты.
	СтруктураНадписи = Новый Структура("ВидЦен, ВидСкидки, ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, НалогообложениеНДС, ДисконтнаяКарта, ПроцентСкидкиПоДисконтнойКарте, ОсновнаяСтавкаНДС", 
		Объект.ВидЦен, 
		Объект.ВидСкидкиНаценки, 
		Объект.ВалютаДокумента, 
		ВалютаРасчетов, 
		Объект.Курс, 
		КурсНациональнаяВалюта, 
		Объект.СуммаВключаетНДС, 
		УчетВалютныхОпераций, 
		Объект.НалогообложениеНДС,
		Объект.ДисконтнаяКарта,
		Объект.ПроцентСкидкиПоДисконтнойКарте,
		Объект.ОсновнаяСтавкаНДС);
		
	ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
	
КонецПроцедуры // ОткрытьФормуЦеныИВалютаЗавершение()

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьНадписьЦеныИВалюта(СтруктураНадписи)
	
	ТекстНадписи = "";
	
	// Валюта
	Если СтруктураНадписи.УчетВалютныхОпераций Тогда
		Если ЗначениеЗаполнено(СтруктураНадписи.ВалютаДокумента) Тогда
			ТекстНадписи = НСтр("ka='%Валюта%';ru='%Валюта%';en='%Currency%'");
			ТекстНадписи = СтрЗаменить(ТекстНадписи, "%Валюта%", СокрЛП(Строка(СтруктураНадписи.ВалютаДокумента)));
		КонецЕсли;
	КонецЕсли;
	
	// Вид цен
	Если ЗначениеЗаполнено(СтруктураНадписи.ВидЦен) Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ka='%ВидЦен%';ru='%ВидЦен%';en='% VidTsen%'");
		Иначе	
			ТекстНадписи = ТекстНадписи + НСтр("ka=' • %ВидЦен%';ru=' • %ВидЦен%'");
		КонецЕсли;
		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%ВидЦен%", СокрЛП(Строка(СтруктураНадписи.ВидЦен)));
	КонецЕсли;
	
	// Вид скидки наценки
	Если ЗначениеЗаполнено(СтруктураНадписи.ВидСкидки) Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ka='%ВидСкидкиНаценки%';ru='%ВидСкидкиНаценки%';en='% VidSkidkiNatsenki%'");
		Иначе
			ТекстНадписи = ТекстНадписи + НСтр("ka=' • %ВидСкидкиНаценки%';ru=' • %ВидСкидкиНаценки%'");
		КонецЕсли;
		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%ВидСкидкиНаценки%", СокрЛП(Строка(СтруктураНадписи.ВидСкидки)));
	КонецЕсли;
	
	// Дисконтная карта.
	Если ЗначениеЗаполнено(СтруктураНадписи.ДисконтнаяКарта) Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ka='%ДисконтнаяКарта%';ru='%ДисконтнаяКарта%';en='%Discount card%'");
		Иначе
			ТекстНадписи = ТекстНадписи + НСтр("ka='.%დიცკონტური რუკა%';ru=' • %ДисконтнаяКарта%'");
		КонецЕсли;
		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%ДисконтнаяКарта%", Строка(СтруктураНадписи.ПроцентСкидкиПоДисконтнойКарте)+"% по карте"); //СокрЛП(Строка(СтруктураНадписи.ДисконтнаяКарта)));
	КонецЕсли;	
	
	// Налогообложение НДС
	Если ЗначениеЗаполнено(СтруктураНадписи.НалогообложениеНДС) Тогда
		Если ПустаяСтрока(ТекстНадписи) Тогда
			ТекстНадписи = ТекстНадписи + НСтр("ka='%НалогообложениеНДС%';ru='%НалогообложениеНДС%';en='% NalogooblozhenieNDS%'");
		Иначе
			ТекстНадписи = ТекстНадписи + НСтр("ka=' • %НалогообложениеНДС%';ru=' • %НалогообложениеНДС%'");
		КонецЕсли;
		ТекстНадписи = СтрЗаменить(ТекстНадписи, "%НалогообложениеНДС%", РаботаСФормойДокументаКлиентСервер.КраткоеПредставлениеТипаНалогообложенияНДС(СтруктураНадписи.НалогообложениеНДС));
	КонецЕсли;
	
	// Флаг сумма включает НДС
	Если ПустаяСтрока(ТекстНадписи) Тогда	
		Если СтруктураНадписи.СуммаВключаетНДС Тогда
			ТекстНадписи = НСтр("en='Include VAT';ka='თანხა შეიცავს დღგ-ს';ru='Сумма включает НДС'");
		Иначе
			ТекстНадписи = НСтр("ka='თანხა არ შეიცავს დღგ-ს';ru='Сумма не включает НДС';en='The sum does not include VAT'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекстНадписи;
	
КонецФункции // СформироватьНадписьЦеныИВалюта()

// ПодключаемоеОборудование
&НаСервереБезКонтекста
Процедура ПолучитьДанныеПоШтрихКодам(СтруктураДанные)
	
	// Преобразование весовых штрихкодов.
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		
		РегистрыСведений.ШтрихкодыНоменклатуры.ПреобразоватьВесовойШтрихкод(ТекШтрихкод);
		
	КонецЦикла;
	
	ДанныеПоШтрихКодам = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьДанныеПоШтрихкодам(СтруктураДанные.МассивШтрихкодов);
	
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		
		ДанныеШтрихкода = ДанныеПоШтрихкодам[ТекШтрихкод.Штрихкод];
		
		Если ДанныеШтрихкода <> Неопределено
		   И ДанныеШтрихкода.Количество() <> 0 Тогда
			
			СтруктураДанныеНоменклатуры = Новый Структура();
			СтруктураДанныеНоменклатуры.Вставить("Организация", СтруктураДанные.Организация);
			СтруктураДанныеНоменклатуры.Вставить("Номенклатура", ДанныеШтрихкода.Номенклатура);
			СтруктураДанныеНоменклатуры.Вставить("ТипНоменклатуры", ДанныеШтрихкода.Номенклатура.ТипНоменклатуры);
			СтруктураДанныеНоменклатуры.Вставить("Характеристика", ДанныеШтрихкода.Характеристика);
			СтруктураДанныеНоменклатуры.Вставить("НалогообложениеНДС", СтруктураДанные.НалогообложениеНДС);
			Если ЗначениеЗаполнено(СтруктураДанные.ВидЦен) Тогда
				СтруктураДанныеНоменклатуры.Вставить("ДатаОбработки", СтруктураДанные.Дата);
				СтруктураДанныеНоменклатуры.Вставить("ВалютаДокумента", СтруктураДанные.ВалютаДокумента);
				СтруктураДанныеНоменклатуры.Вставить("СуммаВключаетНДС", СтруктураДанные.СуммаВключаетНДС);
				СтруктураДанныеНоменклатуры.Вставить("ВидЦен", СтруктураДанные.ВидЦен);
				Если ЗначениеЗаполнено(ДанныеШтрихкода.ЕдиницаИзмерения)
					И ТипЗнч(ДанныеШтрихкода.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
					СтруктураДанныеНоменклатуры.Вставить("Коэффициент", ДанныеШтрихкода.ЕдиницаИзмерения.Коэффициент);
				Иначе
					СтруктураДанныеНоменклатуры.Вставить("Коэффициент", 1);
				КонецЕсли;
				СтруктураДанныеНоменклатуры.Вставить("ВидСкидкиНаценки", СтруктураДанные.ВидСкидкиНаценки);
			КонецЕсли;
			
			// ДисконтныеКарты
			СтруктураДанныеНоменклатуры.Вставить("ПроцентСкидкиПоДисконтнойКарте", СтруктураДанные.ПроцентСкидкиПоДисконтнойКарте);
			СтруктураДанныеНоменклатуры.Вставить("ДисконтнаяКарта", СтруктураДанные.ДисконтнаяКарта);
			// Конец ДисконтныеКарты
			
			ДанныеШтрихкода.Вставить("СтруктураДанныеНоменклатуры", ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанныеНоменклатуры));
			
			Если Константы.ВариантРаспознованияШтрихкода.Получить() = Перечисления.ВариантыРаспознованияШтрихкодов.Цена Тогда
				
				Если ЗначениеЗаполнено(ДанныеШтрихкода.СтруктураДанныеНоменклатуры.Номенклатура) И ДанныеШтрихкода.СтруктураДанныеНоменклатуры.Номенклатура.ЕдиницаИзмерения.Код = "166" Тогда
				
					Цена = Число(Сред(ТекШтрихкод.Штрихкод, 8, 3)) + Число(Сред(ТекШтрихкод.Штрихкод, 11, 2)) / 100;
					ДанныеШтрихкода.СтруктураДанныеНоменклатуры.Цена = Цена;
				
				КонецЕсли; 
				
			КонецЕсли; 
			
			Если НЕ ЗначениеЗаполнено(ДанныеШтрихкода.ЕдиницаИзмерения) Тогда
				ДанныеШтрихкода.ЕдиницаИзмерения  = ДанныеШтрихкода.Номенклатура.ЕдиницаИзмерения;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДанные.Вставить("ДанныеПоШтрихКодам", ДанныеПоШтрихКодам);
	
	Для каждого парам Из Метаданные.Документы.РасходнаяНакладная.ТабличныеЧасти.Запасы.Реквизиты.Номенклатура.ПараметрыВыбора Цикл
		Если парам.Имя = "Отбор.ТипНоменклатуры" Тогда
			Если ТипЗнч(парам.Значение)=Тип("ФиксированныйМассив") Тогда
				СтруктураДанные.Вставить("ОтборТипНоменклатуры", парам.Значение);
			Иначе
			    МассивТипов = Новый Массив;
				МассивТипов.Добавить(парам.Значение);
				СтруктураДанные.Вставить("ОтборТипНоменклатуры", МассивТипов);
			КонецЕсли;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПолучитьДанныеПоШтрихКодам()

&НаКлиенте
Функция ЗаполнитьПоДаннымШтрихкодов(ДанныеШтрикодов)
	
	НеизвестныеШтрихкоды = Новый Массив;
	ШтрихкодыНекорректногоТипа = Новый Массив;
	
	Если ТипЗнч(ДанныеШтрикодов) = Тип("Массив") Тогда
		МассивШтрихкодов = ДанныеШтрикодов;
	Иначе
		МассивШтрихкодов = Новый Массив;
		МассивШтрихкодов.Добавить(ДанныеШтрикодов);
	КонецЕсли;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("МассивШтрихкодов", МассивШтрихкодов);
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("ВидЦен", Объект.ВидЦен);
	СтруктураДанные.Вставить("Дата", Объект.Дата);
	СтруктураДанные.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	СтруктураДанные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	СтруктураДанные.Вставить("ВидСкидкиНаценки", Объект.ВидСкидкиНаценки);
	СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	
	// ДисконтныеКарты
	СтруктураДанные.Вставить("ПроцентСкидкиПоДисконтнойКарте", Объект.ПроцентСкидкиПоДисконтнойКарте);
	СтруктураДанные.Вставить("ДисконтнаяКарта", Объект.ДисконтнаяКарта);
	// Конец ДисконтныеКарты
		
	ПолучитьДанныеПоШтрихКодам(СтруктураДанные);
	
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		ДанныеШтрихкода = СтруктураДанные.ДанныеПоШтрихкодам[ТекШтрихкод.Штрихкод];
		
		Если ДанныеШтрихкода <> Неопределено
		   И ДанныеШтрихкода.Количество() = 0 Тогда
			НеизвестныеШтрихкоды.Добавить(ТекШтрихкод);
		ИначеЕсли СтруктураДанные.ОтборТипНоменклатуры.Найти(ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ТипНоменклатуры) = Неопределено Тогда
			ШтрихкодыНекорректногоТипа.Добавить(Новый Структура("Штрихкод,Номенклатура,ТипНоменклатуры", ТекШтрихкод.Штрихкод, ДанныеШтрихкода.Номенклатура, ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ТипНоменклатуры));
		Иначе
			МассивСтрокТЧ = Объект.Запасы.НайтиСтроки(Новый Структура("Номенклатура,Характеристика,ЕдиницаИзмерения",ДанныеШтрихкода.Номенклатура,ДанныеШтрихкода.Характеристика,ДанныеШтрихкода.ЕдиницаИзмерения));
			Если МассивСтрокТЧ.Количество() = 0 Тогда
				НоваяСтрока = Объект.Запасы.Добавить();			
				НоваяСтрока.Номенклатура = ДанныеШтрихкода.Номенклатура;
				НоваяСтрока.Характеристика = ДанныеШтрихкода.Характеристика;
				НоваяСтрока.Партия = ДанныеШтрихкода.Партия;
				НоваяСтрока.Количество = ТекШтрихкод.Количество;
				
				Если ОбщегоНазначенияВызовСервера.ПолучитьВариантРаспознаванияШтрихкода() = ПредопределенноеЗначение("Перечисление.ВариантыРаспознованияШтрихкодов.Вес") Тогда
					
					Если ОбщегоНазначенияВызовСервера.ПолучитьКодЕдиницыИзмерения(ДанныеШтрихкода.Номенклатура) = "166" Тогда
						
						НоваяСтрока.Количество = ТекШтрихкод.КоличествоИзШтрихкода;
						
					КонецЕсли;
					
				КонецЕсли; 
				
				//Lazare_
				Если ПолучитьФункционалТипЦеныНоменклатурыПоКоличеству() Тогда 
					Количество  = 0 ;
					Количество  = Количество + НоваяСтрока.Количество ;
					СтруктураДанные.Вставить("Номенклатура", ДанныеШтрихкода.Номенклатура);
					СтруктураДанные.Вставить("Характеристика", ДанныеШтрихкода.Характеристика);
					ОптоваяЦена = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
					ВидЦен = УправлениеНебольшойФирмойСервер.ПолучитьВидЦеныПоДиапазонуКоличестваНоменклатуры(СтруктураДанные,Количество);
					Если ВидЦен <>  ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка")или ВидЦен <> Неопределено Тогда 
						СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
						СтруктураДанные.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
						СтруктураДанные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);	
						СтруктураДанные.Вставить("ВидЦен",?(ЗначениеЗаполнено(ВидЦен),ВидЦен,Объект.ВидЦен));
						СтруктураДанные.Вставить("Коэффициент", 1);
						СтруктураДанные.Вставить("ВидСкидкиНаценки", Объект.ВидСкидкиНаценки);
						СтруктураДанные  = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
						НоваяСтрока.Цена = СтруктураДанные.Цена;
						ОптоваяЦена = ВидЦен;
					КонецЕсли;				
				Иначе 
					НоваяСтрока.Цена = ДанныеШтрихкода.СтруктураДанныеНоменклатуры.Цена;  //++Lazare
				КонецЕсли;
				//Lazare_	
				
				НоваяСтрока.ЕдиницаИзмерения = ?(ЗначениеЗаполнено(ДанныеШтрихкода.ЕдиницаИзмерения), ДанныеШтрихкода.ЕдиницаИзмерения, ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ЕдиницаИзмерения);
				//НоваяСтрока.Цена = ДанныеШтрихкода.СтруктураДанныеНоменклатуры.Цена;  //++Lazare
				НоваяСтрока.ПроцентСкидкиНаценки = ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ПроцентСкидкиНаценки;
				НоваяСтрока.СтавкаНДС = ДанныеШтрихкода.СтруктураДанныеНоменклатуры.СтавкаНДС;
				
				НоваяСтрока.ТипНоменклатурыЗапас = ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ЭтоЗапас;
				
				РассчитатьСуммуВСтрокеТабличнойЧасти(НоваяСтрока);
				Элементы.Запасы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
			Иначе
				НоваяСтрока = МассивСтрокТЧ[0];
				НоваяСтрока.Количество = НоваяСтрока.Количество + ТекШтрихкод.Количество;
				
				//Lazare_
				Если ПолучитьФункционалТипЦеныНоменклатурыПоКоличеству() Тогда 
					//Количество  = 0 ;
					Количество  = НоваяСтрока.Количество ;
					СтруктураДанные.Вставить("Номенклатура", ДанныеШтрихкода.Номенклатура);
					СтруктураДанные.Вставить("Характеристика", ДанныеШтрихкода.Характеристика);
					ОптоваяЦена = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
					ВидЦен = УправлениеНебольшойФирмойСервер.ПолучитьВидЦеныПоДиапазонуКоличестваНоменклатуры(СтруктураДанные,Количество);
					Если ВидЦен <>  ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка")или ВидЦен <> Неопределено Тогда 
						СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
						СтруктураДанные.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
						СтруктураДанные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);	
						СтруктураДанные.Вставить("ВидЦен", ?(ЗначениеЗаполнено(ВидЦен),ВидЦен,Объект.ВидЦен));
						СтруктураДанные.Вставить("Коэффициент", 1);
						СтруктураДанные.Вставить("ВидСкидкиНаценки", Объект.ВидСкидкиНаценки);
						СтруктураДанные  = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
						НоваяСтрока.Цена = СтруктураДанные.Цена;
						ОптоваяЦена = ВидЦен;
					КонецЕсли;			
				КонецЕсли;
				//Lazare_
				
				РассчитатьСуммуВСтрокеТабличнойЧасти(НоваяСтрока);
				Элементы.Запасы.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
			
			Если ДанныеШтрихкода.Свойство("СерийныйНомер") И ЗначениеЗаполнено(ДанныеШтрихкода.СерийныйНомер) Тогда
				РаботаССерийнымиНомерамиКлиентСервер.ДобавитьСерийныйНомерВСтроку(НоваяСтрока, ДанныеШтрихкода.СерийныйНомер, Объект);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьПодвалФормы();
	
	Возврат Новый Структура("НеизвестныеШтрихкоды, ШтрихкодыНекорректногоТипа",НеизвестныеШтрихкоды, ШтрихкодыНекорректногоТипа);КонецФункции // ЗаполнитьПоДаннымШтрихкодов()

&НаКлиенте
Процедура ПолученыШтрихкоды(ДанныеШтрикодов) Экспорт
	
	Модифицированность = Истина;
	
	НедобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихкодов(ДанныеШтрикодов);
	НеизвестныеШтрихкоды		= НедобавленныеШтрихкоды.НеизвестныеШтрихкоды;
	ШтрихкодыНекорректногоТипа	= НедобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
	
	ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	
	Если НеизвестныеШтрихкоды.Количество() > 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПолученыШтрихкодыЗавершение", ЭтотОбъект, НеизвестныеШтрихкоды);
		
		ОткрытьФорму(
			"РегистрСведений.ШтрихкодыНоменклатуры.Форма.РегистрацияШтрихкодовНоменклатуры",
			Новый Структура("НеизвестныеШтрихкоды", НеизвестныеШтрихкоды), ЭтотОбъект,,,,Оповещение
		);
		
		Возврат;
		
	КонецЕсли;
	
	ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	
КонецПроцедуры // ПолученыШтрихкоды()

&НаКлиенте
Процедура ПолученыШтрихкодыЗавершение(ВозвращаемыеПараметры, Параметры) Экспорт
	
	НеизвестныеШтрихкоды = Параметры;
	
	Если ВозвращаемыеПараметры <> Неопределено Тогда
		
		МассивШтрихкодов = Новый Массив;
		
		Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ЗарегистрированныеШтрихкоды Цикл
			МассивШтрихкодов.Добавить(ЭлементМассива);
		КонецЦикла;
		
		Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ПолученыНовыеШтрихкоды Цикл
			МассивШтрихкодов.Добавить(ЭлементМассива);
		КонецЦикла;
		
		НедобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихкодов(МассивШтрихкодов);
		НеизвестныеШтрихкоды		= НедобавленныеШтрихкоды.НеизвестныеШтрихкоды;
		ШтрихкодыНекорректногоТипа	= НедобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
		ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	КонецЕсли;
	
	ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды) Экспорт
	
	Для каждого ТекНеизвестныйШтрихкод Из НеизвестныеШтрихкоды Цикл
		
		СтрокаСообщения = НСтр("ka='მონაცემები შტრიხკოდის მიხედვით ნაპოვნი არ არის: %1%; რაოდენობა: %2%';ru='Данные по штрихкоду не найдены: %1%; количество: %2%';en='Data on the barcode is not found:% 1%; amount% 2%'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНеизвестныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНеизвестныйШтрихкод.Количество);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа) Экспорт
	
	Для каждого ТекНекорректныйШтрихкод Из ШтрихкодыНекорректногоТипа Цикл
		
		СтрокаСообщения = НСтр("ka='შტრიხკოდ %1%-ით მოძებნილ ნომენკლატურას -%2%- აქვს ტიპი %3%, რომელიც ამ ცხრილის შესაფერი არ არის';ru='Найденная по штрихкоду %1% номенклатура -%2%- имеет тип %3%, который не подходит для этой табличной части';en='Found by barcode nomenclature% 1% -% 2% - 3% of type%, which is not suitable for this table part'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНекорректныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНекорректныйШтрихкод.Номенклатура);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%3%", ТекНекорректныйШтрихкод.ТипНоменклатуры);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения);
		
	КонецЦикла;
	
КонецПроцедуры
// Конец ПодключаемоеОборудование

&НаСервере
Процедура ЗаполнитьКолонкуРезервПоРезервамНаСервере()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.ЗаполнитьКолонкуРезервПоРезервам();
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
КонецПроцедуры // ЗаполнитьКолонкуРезервПоРезервамНаСервере()

&НаСервере
Процедура УстановитьВидимостьДоговора()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		ПараметрыРасчетовСКонтрагентом = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Контрагент, "ВестиРасчетыПоЗаказам, ВестиРасчетыПоДоговорам");
		
		КонтрагентВестиРасчетыПоЗаказам = ПараметрыРасчетовСКонтрагентом.ВестиРасчетыПоЗаказам;
		Элементы.Договор.Видимость = ПараметрыРасчетовСКонтрагентом.ВестиРасчетыПоДоговорам;
		
	Иначе
		
		КонтрагентВестиРасчетыПоЗаказам = Ложь;
		Элементы.Договор.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьДоговора()

//+++ Дмгг
&НаСервере
Процедура УстановитьВидимостьСотрудниковвТабЧастиЗапасы()

	ЗначениеВидимости = Объект.ВидОперации 				= Перечисления.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику;
	ЭтоПродажа = Объект.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику
					ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю;
	
	Элементы.ЗапасыГруппаБезвозмезднаяПродажа.Видимость = ЗначениеВидимости;
	Элементы.ГруппаКонтрагент.Видимость 				= НЕ ЗначениеВидимости;
	Элементы.ГруппаКонтрагент.Видимость 				= НЕ ЗначениеВидимости;
	Элементы.Договор.Видимость 							= НЕ ЗначениеВидимости;
	Элементы.ГруппаЗаказОснование.Видимость 			= НЕ ЗначениеВидимости;
	Элементы.ЗапасыСчетДоходовБП.Видимость 				= ЗначениеВидимости;
	Элементы.ЦенаВключаетНалоги.Видимость 				= ЗначениеВидимости;
	//Элементы.ВидНалогаНДФЛ.Видимость = ЗначениеВидимости;
	Элементы.СчетаБПКонтрагент.Видимость 				= НЕ ЗначениеВидимости;
	Элементы.СчетаБПСотрудник.Видимость 				= ЗначениеВидимости;
	Элементы.СчетУчетаСвободнаяпродажаСотрудник.Видимость = НЕ ЗначениеВидимости;
	//Элементы.ЗаполнитьСчетаУдержания.Видимость 			= ЗначениеВидимости;
	Элементы.ЗапасыЭтоПодарок.Видимость 				= ЭтоПродажа;
	Элементы.ЗапасыСуммаНДФЛ.Видимость 					= ЗначениеВидимости;
	Элементы.ЗапасыУдержаниеПенсии.Видимость 			= ЗначениеВидимости;
	Элементы.ГруппаБП.Видимость 						= ЗначениеВидимости;
	Элементы.ГруппаДоставка.Видимость					= НЕ ЗначениеВидимости;

	Элементы.ГруппаБезвозмезнаяПродажа.Видимость		= ЭтоПродажа;
	
	Элементы.Группа4.Видимость 				= ЭтоПродажа;
	
	Элементы.ЗаполнитьПоОстаткам.Видимость = ЗначениеВидимости;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьСоответствиеДоговораУсловиямДокумента(ТекстСообщения, Договор, Документ, Организация, Контрагент, ВидОперации, Отказ)
	
	Если Не УправлениеНебольшойФирмойПовтИсп.ТребуетсяКонтрольДоговоровКонтрагентов()
		ИЛИ Не Контрагент.ВестиРасчетыПоДоговорам Тогда
		
		Возврат;
	КонецЕсли;
	
	МенеджерСправочника = Справочники.ДоговорыКонтрагентов;
	СписокВидовДоговора = МенеджерСправочника.ПолучитьСписокВидовДоговораДляДокумента(Документ, ВидОперации);
	
	Если Не МенеджерСправочника.ДоговорСоответствуетУсловиямДокумента(ТекстСообщения, Договор, Организация, Контрагент, СписокВидовДоговора)
		И ПолучитьФункциональнуюОпцию("НеПроводитьДокументыСНекорректнымиДоговорами") Тогда
		
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыФормыВыбора(Документ, Организация, Контрагент, Договор, ВидОперации)
	
	СписокВидовДоговоров = Справочники.ДоговорыКонтрагентов.ПолучитьСписокВидовДоговораДляДокумента(Документ, ВидОперации);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КонтролироватьВыборДоговора", Контрагент.ВестиРасчетыПоДоговорам);
	ПараметрыФормы.Вставить("Контрагент", Контрагент);
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("ВидыДоговоров", СписокВидовДоговоров);
	ПараметрыФормы.Вставить("ТекущаяСтрока", Договор);
	ПараметрыФормы.Вставить("ВидОперацииДокумента", ВидОперации); //+++ Дмгг
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДоговорПоУмолчанию(Документ, Контрагент, Организация, ВидОперации)
	
	Если Контрагент.ВестиРасчетыПоДоговорам = Ложь Тогда
		Возврат Контрагент.ДоговорПоУмолчанию;
	КонецЕсли;
	
	МенеджерСправочника = Справочники.ДоговорыКонтрагентов;
	
	СписокВидовДоговоров = МенеджерСправочника.ПолучитьСписокВидовДоговораДляДокумента(Документ, ВидОперации);
	ДоговорПоУмолчанию = МенеджерСправочника.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(Контрагент, Организация, СписокВидовДоговоров);
	// Kuzmich, 19.08.2019, Использовать виды договоров, Доработка
	Если ЗначениеЗаполнено(ДоговорПоУмолчанию) И Константы.ИспользоватьВидыДоговоров.Получить() Тогда
		Если НЕ ДоговорПоУмолчанию.Покупатель Тогда
			ДоговорПоУмолчанию = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	// Kuzmich, 19.08.2019, Использовать виды договоров, Доработка
	
	Возврат ДоговорПоУмолчанию;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьДокументАвтоматическогоПроизводства()
	
	Элементы.ДокументАвтоматическогоПроизводства.Видимость = ЗначениеЗаполнено(Объект.ДокументАвтоматическогоПроизводства);
	
КонецПроцедуры // УстановитьВидимостьДоговора()
//--- Дмгг

&НаКлиенте
Процедура ОбработатьИзменениеДоговора()
	
	ДоговорПередИзменением = Договор;
	Договор = Объект.Договор;
	
	Если ДоговорПередИзменением <> Объект.Договор Тогда
		
		ДанныеДоговора = ПолучитьДанныеДоговорПриИзменении(Объект.Дата, Объект.ВалютаДокумента, Объект.Договор);
		ПечатьДокументовУНФКлиент.ПриИзмененииДоговораКонтрагента(Объект.Договор, Объект.ОснованиеПечатиСсылка, Объект.ОснованиеПечати);
		
		Если Объект.Предоплата.Количество() > 0
			И Объект.Договор <> ДоговорПередИзменением Тогда
			
			ПараметрыДокумента = Новый Структура;
			ПараметрыДокумента.Вставить("ДоговорПередИзменением", ДоговорПередИзменением);
			ПараметрыДокумента.Вставить("ДанныеДоговора", ДанныеДоговора);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ВопросОбОчисткеПредоплатыЗавершение", ЭтотОбъект, ПараметрыДокумента);
			ТекстВопроса = НСтр("ka='წინასწარი გადახდის ჩათვლა გაიწმინდება, გავაგრძელოთ?';ru='Зачет предоплаты будет очищен, продолжить?';en='Passed prepayment will be cleared to continue?'");
			
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			Возврат;
		КонецЕсли;
		
		ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС();
		
		ОбработатьИзменениеУсловийДоговора(ДанныеДоговора, ДоговорПередИзменением);
		
	Иначе
		
		Объект.Заказ = Элементы.Заказ.ОграничениеТипа.ПривестиЗначение(Заказ);
		
	КонецЕсли;
	
	Заказ = Объект.Заказ;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросОбОчисткеПредоплатыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДоговорПередИзменением = ДополнительныеПараметры.ДоговорПередИзменением;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Предоплата.Очистить();
		Объект.ФактурыАвансов.Очистить();//Паганини
	Иначе
		Если ДополнительныеПараметры.Свойство("ИзменениеКонтрагента") Тогда
			Объект.Контрагент = ДополнительныеПараметры.КонтрагентПередИзменением;
			Контрагент = ДополнительныеПараметры.КонтрагентПередИзменением;
			КонтрагентВестиРасчетыПоЗаказам = ДополнительныеПараметры.КонтрагентВестиРасчетыПоЗаказамПередИзменением;
			Элементы.Договор.Видимость = ДополнительныеПараметры.ВидимостьДоговораПередИзменением;
		КонецЕсли;
		Объект.Договор = ДоговорПередИзменением;
		Договор = ДоговорПередИзменением;
		Объект.Заказ = Элементы.Заказ.ОграничениеТипа.ПривестиЗначение(Заказ);
		Возврат;
	КонецЕсли;
	
	ОбработатьИзменениеУсловийДоговора(ДополнительныеПараметры.ДанныеДоговора, ДоговорПередИзменением);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеУсловийДоговора(ДанныеДоговора, ДоговорПередИзменением)
	
	Объект.ОснованиеПечати = Нстр("ka='Договор: ';ru='Договор: '") + Строка(Объект.Договор);
	
	ВалютаРасчетовПередИзменением = ВалютаРасчетов;
	ВалютаРасчетов = ДанныеДоговора.ВалютаРасчетов;
	
	Если Не ДанныеДоговора.СуммаВключаетНДС = Неопределено Тогда
		Объект.СуммаВключаетНДС = ДанныеДоговора.СуммаВключаетНДС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда 
		Объект.Курс      = ?(ДанныеДоговора.ВалютаРасчетовКурсКратность.Курс = 0, 1, ДанныеДоговора.ВалютаРасчетовКурсКратность.Курс);
		Объект.Кратность = ?(ДанныеДоговора.ВалютаРасчетовКурсКратность.Кратность = 0, 1, ДанныеДоговора.ВалютаРасчетовКурсКратность.Кратность);
	КонецЕсли;
	
	ИзменилсяВидЦен = Объект.ВидЦен <> ДанныеДоговора.ВидЦен 
		И ЗначениеЗаполнено(ДанныеДоговора.ВидЦен)
		И (НЕ УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ЗаполнениеТипаЦенИзНастроекСклада")); // Kuzmich, 14.05.2019, Заполнение типа цен из настроек склада Константы.ЗаполнениеТипаЦенИзНастроекСклада.Получить()
		
	ИзменилсяВидСкидки = Объект.ВидСкидкиНаценки <> ДанныеДоговора.ВидСкидкиНаценки 
		И ЗначениеЗаполнено(ДанныеДоговора.ВидСкидкиНаценки);
		
	Если ДанныеДоговора.Свойство("ВызовИзПроцедурыПриИзмененииКонтрагента") Тогда
		ОчиститьДисконтнуюКарту = ЗначениеЗаполнено(Объект.ДисконтнаяКарта); // В дальнейшем реквизит ДисконтнаяКрата будет очищен.
	Иначе
		ОчиститьДисконтнуюКарту = Ложь;
	КонецЕсли;
	
	Если ОчиститьДисконтнуюКарту Тогда
		Объект.ДисконтнаяКарта = ПредопределенноеЗначение("Справочник.ДисконтныеКарты.ПустаяСсылка");
		Объект.ПроцентСкидкиПоДисконтнойКарте = 0;
	КонецЕсли;
	ПечатьДокументовУНФКлиент.ПриИзмененииДоговораКонтрагента(Объект.Договор, Объект.ОснованиеПечатиСсылка, Объект.ОснованиеПечати);
	
	ВопросВидЦен = ЗначениеЗаполнено(Объект.Договор) И (ИзменилсяВидЦен ИЛИ ИзменилсяВидСкидки);
	Если ВопросВидЦен Тогда
		Если ИзменилсяВидЦен Тогда
			Объект.ВидЦен = ДанныеДоговора.ВидЦен;
		КонецЕсли; 
		Если ИзменилсяВидСкидки Тогда
			Объект.ВидСкидкиНаценки = ДанныеДоговора.ВидСкидкиНаценки;
		КонецЕсли; 
	КонецЕсли;
	
	ОткрытьФормуЦеныИВалюты = (ЗначениеЗаполнено(Объект.Договор) И ЗначениеЗаполнено(ВалютаРасчетов)
		И Объект.Договор <> ДоговорПередИзменением И ВалютаРасчетовПередИзменением <> ДанныеДоговора.ВалютаРасчетов)
		И Объект.ВалютаДокумента <> ДанныеДоговора.ВалютаРасчетов
		И Объект.Запасы.Количество() > 0;
	
	ПараметрыДокумента = Новый Структура;
	ПараметрыДокумента.Вставить("ДоговорПередИзменением", ДоговорПередИзменением);
	ПараметрыДокумента.Вставить("ВалютаРасчетовПередИзменением", ВалютаРасчетовПередИзменением);
	ПараметрыДокумента.Вставить("ДанныеДоговора", ДанныеДоговора);
	
	Объект.ВалютаДокумента = ВалютаРасчетов;
	Если ОткрытьФормуЦеныИВалюты Тогда
		
		ТекстПредупреждения = "";
		Если ВопросВидЦен Тогда
			ТекстПредупреждения = НСтр("ka='კონტრაგენტთან ხელშეკრულება ითვალისწინებს ფასების და ფასდაკლებების პირობებს, რომლებიც დოკუმენტში დაყენებული პირობებისგან განსხვავდება! "
"შეიძლება, საჭიროა ფასების გადავსება.';ru='Договор с контрагентом предусматривает условия цен и скидок, "
"отличные от установленных в документе! "
"Возможно, необходимо перезаполнить цены.'") + Символы.ПС + Символы.ПС;
		КонецЕсли;
		
		ТекстПредупреждения = ТекстПредупреждения + НСтр("ka='შეიცვალა კონტრაგენტთან ხელშეკრულებით გათვალისწინებული ანგარიშსწორების ვალუტა! აუცილებელია დოკუმენტის ვალუტის შემოწმება!';ru='Изменилась валюта расчетов по договору с контрагентом! "
"Необходимо проверить валюту документа!'");
		
		ОбработатьИзмененияПоКнопкеЦеныИВалюты(ВалютаРасчетовПередИзменением, ИзменилсяВидЦен, Истина, ТекстПредупреждения);
		
	ИначеЕсли ВопросВидЦен Тогда
		
		ПересчетНеобходим = (Объект.Запасы.Количество() > 0);
		
		СтруктураНадписи = 
			Новый Структура("ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, ВидЦен, ВидСкидки, НалогообложениеНДС, ДисконтнаяКарта, ПроцентСкидкиПоДисконтнойКарте", 
				Объект.ВалютаДокумента, 
				ВалютаРасчетов, 
				Объект.Курс, 
				КурсНациональнаяВалюта, 
				Объект.СуммаВключаетНДС, 
				УчетВалютныхОпераций, 
				Объект.ВидЦен, 
				Объект.ВидСкидкиНаценки, 
				Объект.НалогообложениеНДС,
				Объект.ДисконтнаяКарта,
				Объект.ПроцентСкидкиПоДисконтнойКарте);
		
		ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
		
		Если ПересчетНеобходим Тогда
			
			ТекстВопроса = НСтр("ka='კონტრაგენტთან ხელშეკრულება ითვალისწინებს დოკუმენტში დადგენილისგან განსხვავებულ ფასების და ფასდაკლების პირობებს! გადავთვალოთ დოკუმენტი ხელშეკრულების შესაბამისად?';ru='Договор с контрагентом предусматривает условия цен и скидок, отличные от установленных в документе! "
"Пересчитать документ в соответствии с договором?'");
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПересчетаПоВидуЦенЗавершение", ЭтотОбъект, ПараметрыДокумента);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли;
		
	Иначе
		
		СтруктураНадписи = 
			Новый Структура("ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, ВидЦен, ВидСкидки, НалогообложениеНДС, ДисконтнаяКарта, ПроцентСкидкиПоДисконтнойКарте", 
				Объект.ВалютаДокумента, 
				ВалютаРасчетов, 
				Объект.Курс, 
				КурсНациональнаяВалюта, 
				Объект.СуммаВключаетНДС, 
				УчетВалютныхОпераций, 
				Объект.ВидЦен, 
				Объект.ВидСкидкиНаценки, 
				Объект.НалогообложениеНДС,
				Объект.ДисконтнаяКарта,
				Объект.ПроцентСкидкиПоДисконтнойКарте);
		
		ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
		
		
	КонецЕсли;
	
	// Очистка заказа.
	Для каждого ТекСтрока Из Объект.Запасы Цикл
		ТекСтрока.Заказ = Неопределено;
	КонецЦикла;
	
////++lazare 19.07.2021	
//	СтруктураДанные = Новый Структура();
//	СтруктураДанные.Вставить("Организация", Объект.Организация);	
//	СтруктураДанные.Вставить("ДатаОбработки",	 Объект.Дата);
//	СтруктураДанные.Вставить("ВалютаДокумента",  Объект.ВалютаДокумента);
//	СтруктураДанные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
//	СтруктураДанные.Вставить("ВидЦен", Объект.ВидЦен);
//	СтруктураДанные.Вставить("Коэффициент", 1);		
//	Для каждого ТекСтрока Из Объект.Запасы Цикл
//		СтруктураДанные.Вставить("Номенклатура", ТекСтрока.Номенклатура);
//		СтруктураДанные.Вставить("Характеристика", ТекСтрока.Характеристика);
//		Цена = УправлениеНебольшойФирмойСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураДанные);	
//		ТекСтрока.Цена  = Цена;
//		//--------------------------------------------------------------------------
//		// © Шишка В.В. [26 января 2022]  НАЧАЛО
//			//Если не указать строку ТЧ, то пересчитывается всегда только текущая.
//		//РассчитатьСуммуВСтрокеТабличнойЧасти();
//		РассчитатьСуммуВСтрокеТабличнойЧасти(ТекСтрока);
//		// © Шишка В.В. [26 января 2022]  КОНЕЦ
//		//--------------------------------------------------------------------------
//	КонецЦикла;
//	//--lazare 19.07.2021
		
КонецПроцедуры // ОбработатьИзменениеУсловийДоговора()

&НаКлиенте
Процедура ВопросПересчетаПоВидуЦенЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		УправлениеНебольшойФирмойКлиент.ПерезаполнитьЦеныТабличнойЧастиПоВидуЦен(ЭтотОбъект, "Запасы", Истина);
		
	КонецЕсли;
	
КонецПроцедуры // ОпределитьНеобходимостьПересчетаДокументаПоУсловиямДоговора()

&НаСервере
Процедура ОбновитьВидимостьИОстаткиВзаиморасчетов()
	
	Элементы.ОстатокВзаиморасчетов.Видимость = НЕ ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.Контрагент);
	Элементы.Контрагент.АвтоМаксимальнаяШирина = НЕ Элементы.ОстатокВзаиморасчетов.Видимость;

	Если НЕ Элементы.ОстатокВзаиморасчетов.Видимость Тогда
		//Только для новых объектов
		возврат;
	КонецЕсли;
	
	Элементы.ОстатокВзаиморасчетов.Заголовок = РаботаСКонтрагентамиУНФ.ЗаголовокНадписиВзаиморасчетов(Объект.Контрагент);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредоплату(ТекущийОбъект)
	
	ТекущийОбъект.ЗаполнитьПредоплату();
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросОбИзмененииПодчиненнойСчетФактурыЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		
		УправлениеНебольшойФирмойСервер.ИзменитьПодчиненнуюСчетФактуру(Объект.Ссылка);
		Оповестить("ОбновитьДокументИБПослеЗаполнения");
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодвалФормы()
	
	СтоимостьДоставкиСНДС = Объект.СтоимостьДоставки + ?(Объект.СуммаВключаетНДС, 0, Объект.СуммаНДСДоставки);
	ИтогВсего = Объект.Запасы.Итог("Всего") + СтоимостьДоставкиСНДС;
	ИтогСуммаНДС = Объект.Запасы.Итог("СуммаНДС") + Объект.СуммаНДСДоставки;
	ИтогВсего = Окр(ИтогВсего, 2);
	
	//+++ Дмгг
	КолвоБалов = (Объект.Запасы.Итог("Сумма") - (Объект.Запасы.Итог("БалыРасход") * КоэффициентЛояльности)) * (Объект.ПроцентНакопленияБалов / 100); //+++ Дмгг
	Элементы.НакопленоБалов.Заголовок = НСтр("ru = 'Накопленные баллы: '; ka = 'აგროპებული ქულა: '; en = 'Accumulated points: '") + КолвоБалов; //+++ Дмгг
	ИтогДотупноБалов = ?(КоэффициентЛояльности = 0, 0, КолвоБалов * КоэффициентЛояльности);
	//--- Дмгг
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьОбъемИВесВДокументе()
	
	Если Объект.Запасы.Количество() = 0 Тогда
		Объект.Вес = 0;
		Объект.Объем = 0;
		Возврат;
	КонецЕсли;
	
	ВесИтог = Объект.Запасы.Итог("Вес");
	Если ЗначениеЗаполнено(ВесИтог) Тогда
		Объект.Вес = ВесИтог;
	КонецЕсли;
	
	ОбъемИтог = Объект.Запасы.Итог("Объем");
	Если ЗначениеЗаполнено(ОбъемИтог) Тогда
		Объект.Объем = ОбъемИтог;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьВидимостьНастроекУчетаВНалогообложении()
	
	Если РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Объект.Организация) Тогда
		Элементы.ЗапасыТоварыНеДляПродажи.Видимость = Ложь;
		Элементы.ГруппаУчетВНУ.Видимость = Ложь;
		
		Возврат;
	Иначе
		Элементы.ЗапасыТоварыНеДляПродажи.Видимость = Истина;
		Элементы.ГруппаУчетВНУ.Видимость = Истина;
	КонецЕсли;
	
	СистемаНалогообложенияСтруктура = РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(Объект.Организация, Объект.Дата);
	
	Если Не СистемаНалогообложенияСтруктура.ПлательщикУСН Тогда
		Элементы.ГруппаУчетВНУ.Видимость = Ложь;
	Иначе
		Элементы.ГруппаУчетВНУ.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ЗапасыТоварыНеДляПродажи.Видимость = Элементы.ГруппаУчетВНУ.Видимость;
	
	Если  Объект.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю Тогда
		Элементы.ЗапасыТоварыНеДляПродажи.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

//+++ Дмгг
&НаСервереБезКонтекста
Функция УстановитьКоличествоДоступныхБалов(КартаЛояльности, Контрагент, ДатаДпкумента, КоэффициентЛояльности)

	ДатаНачалаДействияКарты = КартаЛояльности.ДатаНачала;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БалыЛояльностиОбороты.КартаЛояльности КАК КартаЛояльности,
		|	БалыЛояльностиОбороты.Контрагент КАК Контрагент,
		|	СУММА(БалыЛояльностиОбороты.КоличествоОборот) КАК КоличествоОборот
		|ИЗ
		|	РегистрНакопления.БалыЛояльности.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			,
		|			КартаЛояльности = &КартаЛояльности
		|				И Контрагент = &Контрагент) КАК БалыЛояльностиОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	БалыЛояльностиОбороты.КартаЛояльности,
		|	БалыЛояльностиОбороты.Контрагент";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачалаДействияКарты);
	Запрос.УстановитьПараметр("ДатаОкончания", ?(ДатаДпкумента = НачалоДня(ТекущаяДата()), ТекущаяДата(), ДатаДпкумента));
	Запрос.УстановитьПараметр("КартаЛояльности", КартаЛояльности);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	                                
	КоэффициентЛояльности = КартаЛояльности.Владелец.КоэфициентПересчета;
	КолвоБалов = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КолвоБалов = ВыборкаДетальныеЗаписи.КоличествоОборот;
	КонецЦикла;
	
	Возврат КолвоБалов;

КонецФункции
//--- Дмгг

#КонецОбласти

#Область ПодсистемаЭлектронныеДокументы

&НаСервере
Процедура УстановитьВидЭД()
	
	Элементы.ВидЭД.СписокВыбора.Очистить();
	
	Элементы.ВидЭД.СписокВыбора.Добавить(Перечисления.ВидыЭД.ТОРГ12Продавец, "ТОРГ-12");
	Элементы.ВидЭД.СписокВыбора.Добавить(Перечисления.ВидыЭД.АктИсполнитель, "Акт выполненных работ");
	Элементы.ВидЭД.СписокВыбора.Добавить(Перечисления.ВидыЭД.АктНаПередачуПрав, "Акт на передачу прав");
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ВидЭлектронногоДокумента = Перечисления.ВидыЭД.ТОРГ12Продавец; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСПодбором

&НаКлиенте
Процедура Подбор(Команда)
	
	ИмяТабличнойЧасти  = "Запасы";
	
	Если НЕ ПустаяСтрока(ПараметрыОткрытияПодбора[ИмяТабличнойЧасти]) Тогда
		
		ПодборНоменклатурыВДокументахКлиент.ОткрытьПодбор(ЭтотОбъект, ИмяТабличнойЧасти, ПараметрыОткрытияПодбора[ИмяТабличнойЧасти]);
		Возврат;
		
	КонецЕсли;
	
	ПараметрыПодбора = Новый Структура;
	
	ПараметрыПодбора.Вставить("Период",					Объект.Дата);
	ПараметрыПодбора.Вставить("Организация",			Компания);
	ПараметрыПодбора.Вставить("СтруктурнаяЕдиница",		Объект.СтруктурнаяЕдиница);
	ПараметрыПодбора.Вставить("ВидСкидкиНаценки",		Объект.ВидСкидкиНаценки);
	ПараметрыПодбора.Вставить("ПроцентСкидкиПоДисконтнойКарте", Объект.ПроцентСкидкиПоДисконтнойКарте);
	ПараметрыПодбора.Вставить("ВидЦен",					Объект.ВидЦен);
	ПараметрыПодбора.Вставить("Валюта",					Объект.ВалютаДокумента);
	ПараметрыПодбора.Вставить("НалогообложениеНДС",		Объект.НалогообложениеНДС);
	ПараметрыПодбора.Вставить("СуммаВключаетНДС",		Объект.СуммаВключаетНДС);
	ПараметрыПодбора.Вставить("ОрганизацияДокумента",	Объект.Организация);
	ПараметрыПодбора.Вставить("ДоступноИзменениеЦены",	НЕ Элементы.ЗапасыЦена.ТолькоПросмотр);
	
	ПараметрыПодбора.Вставить("Ячейка", 				Объект.Ячейка);
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю")
	 ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию") Тогда
		ПараметрыПодбора.Вставить("ИспользуетсяРезервирование", Истина);
	КонецЕсли;
	
	ТипНоменклатуры = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Номенклатура"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.ТипНоменклатуры" Тогда
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					ТипНоменклатуры.Добавить(ЭлементФиксМассива);
				КонецЦикла; 
			Иначе
				ТипНоменклатуры.Добавить(ЭлементМассива.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ПараметрыПодбора.Вставить("ТипНоменклатуры", ТипНоменклатуры);
	
	СтатусПартии = Новый СписокЗначений;
	Для каждого ЭлементМассива Из Элементы[ИмяТабличнойЧасти + "Партия"].ПараметрыВыбора Цикл
		Если ЭлементМассива.Имя = "Отбор.Статус" Тогда
			Если ТипЗнч(ЭлементМассива.Значение) = Тип("ФиксированныйМассив") Тогда
				Для каждого ЭлементФиксМассива Из ЭлементМассива.Значение Цикл
					СтатусПартии.Добавить(ЭлементФиксМассива);
				КонецЦикла;
			Иначе
				СтатусПартии.Добавить(ЭлементМассива.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыПодбора.Вставить("СтатусПартии", СтатусПартии);
	
	ПараметрыПодбора.Вставить("УникальныйИдентификаторФормыВладельца", УникальныйИдентификатор);
	
	#Если ВебКлиент Тогда
		//Обход ошибки платформы передачи данных формы в веб-клиенте при изменении состава элементов формы
		ОткрытьФорму("ОбщаяФорма.ФормаПодбораОстаткиРезервыЦены", ПараметрыПодбора, ЭтотОбъект);
		
	#Иначе
		
		ОткрытьФорму("ОбщаяФорма.ФормаПодбора", ПараметрыПодбора, ЭтотОбъект);
		
	#КонецЕсли
	
КонецПроцедуры // ПодборВыполнить()

&НаСервере
Процедура ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, ИмяТабличнойЧасти, ЕстьХарактеристики, ЕстьПартии)
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресЗапасовВХранилище);
	
	Для каждого СтрокаЗагрузки Из ТаблицаДляЗагрузки Цикл
		
		НоваяСтрока = Объект[ИмяТабличнойЧасти].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗагрузки);
		Если НоваяСтрока.Свойство("Пометка") Тогда
			НоваяСтрока.Пометка = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаЗагрузки.Номенклатура) Тогда
			
			НоваяСтрока.ТипНоменклатурыЗапас = (СтрокаЗагрузки.Номенклатура.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас"));
			НоваяСтрока.ВесЕдиницыТовара = СтрокаЗагрузки.Номенклатура.Вес;
			НоваяСтрока.Вес = НоваяСтрока.ВесЕдиницыТовара * СтрокаЗагрузки.Количество;
			НоваяСтрока.ОбъемЕдиницыТовара = СтрокаЗагрузки.Номенклатура.Объем;
			НоваяСтрока.Объем = НоваяСтрока.ОбъемЕдиницыТовара * СтрокаЗагрузки.Количество;
			
		КонецЕсли;
		// Kuzmich, 22.11.2020, Реквизиты УдерживатьПенсию и СчетДоходовБП в табличной части Запасы для вида операции БезвозмезднаяПродажаСотруднику в документе РасходнаяНакладная
		Если ИмяТабличнойЧасти = "Запасы" и  Объект.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику Тогда
			ЗапасыСотрудникПриИзмененииНаСервере(НоваяСтрока.ПолучитьИдентификатор());
			НоваяСтрока.СчетДоходовБП = Объект.СчетДоходовБП;
		КонецЕсли;
		// Kuzmich, 22.11.2020, Реквизиты УдерживатьПенсию и СчетДоходовБП в табличной части Запасы для вида операции БезвозмезднаяПродажаСотруднику в документе РасходнаяНакладная
	КонецЦикла;
	
	// АвтоматическиеСкидки
	Если ТаблицаДляЗагрузки.Количество() > 0 Тогда
		СброситьФлагСкидкиРассчитаныСервер("ОбработкаПодбора");
	КонецЕсли;

КонецПроцедуры // ПолучитьЗапасыИзХранилища()

&НаСервере
Функция ПоместитьПредоплатаВХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(
		Объект.Предоплата.Выгрузить(,
			"Документ,
			|Заказ,
			|СуммаРасчетов,
			|Курс,
			|Кратность,
			|СуммаПлатежа"),
		УникальныйИдентификатор
	);
	
КонецФункции // ПоместитьПредоплатаВХранилище()

&НаСервере
Процедура ПолучитьПредоплатаИзХранилища(АдресПредоплатаВХранилище)
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресПредоплатаВХранилище);
	Объект.Предоплата.Загрузить(ТаблицаДляЗагрузки);
	
	Элементы.ГруппаПредоплата.Заголовок = РаботаСФормойДокументаКлиентСервер.ПолучитьЗаголовокПредоплаты(Объект.Предоплата, Объект.ВалютаДокумента);
	
КонецПроцедуры // ПолучитьПредоплатаИзХранилища()

#КонецОбласти

#Область УправлениеВнешнимВидомФормы

&НаСервере
Процедура УстановитьВидимостьИДоступность(ИзмененВидОперации = Ложь)
	
	Элементы.ЗапасыНаименованиеДляРС.Видимость      = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ФункционалНаименованияРС");
	
	// Доступность типов заказов.
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту") Тогда
		ДопустимыеТипы = Новый ОписаниеТипов("ДокументСсылка.ЗаказПоставщику");
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию") Тогда
		ДопустимыеТипы = Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя");
	Иначе
		МассивОтбора = Новый Массив;
		МассивОтбора.Добавить(Тип("ДокументСсылка.ЗаказПоставщику"));
		МассивОтбора.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
		ДопустимыеТипы = Новый ОписаниеТипов(МассивОтбора);
	КонецЕсли;
	
	Элементы.Заказ.ОграничениеТипа = ДопустимыеТипы;
	Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыЗаказ.ОграничениеТипа = ДопустимыеТипы;
	
	Элементы.ЦеныИВалюта.МаксимальнаяШирина = 34;
	
	// ГрупповоеИзменениеСтрок
	Если ИзмененВидОперации Тогда
		ЗаполнитьСписокДействий();
	КонецЕсли;
	
	Если ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЗаказПоставщикуЗаказПокупателя") Тогда
		Элементы.ЗапасыИзменениеСтрокЗначение.ОграничениеТипа = ДопустимыеТипы;
	КонецЕсли;
	// Конец ГрупповоеИзменениеСтрок
	
	// Сформируем надпись цены и валюты.
	
	// Виды цен.
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения") Тогда
		Объект.ВидЦен = Неопределено;
	КонецЕсли;
	
	// Скидки и дисконтные карты.
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю") Тогда
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыПроцентСкидкиНаценки.Видимость = Истина;
		Элементы.СчитатьДисконтнуюКарту.Видимость = Истина; // ДисконтныеКарты
		
		// АвтоматическиеСкидки
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыПроцентАвтоматическойСкидки.Видимость = Истина;
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыСуммаАвтоматическойСкидки.Видимость = Истина;
		Элементы.ЗапасыРассчитатьСкидкиНаценки.Видимость = Истина;
		// Конец АвтоматическиеСкидки
	Иначе
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыПроцентСкидкиНаценки.Видимость = Ложь;
		
		// АвтоматическиеСкидки
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыПроцентАвтоматическойСкидки.Видимость = Ложь;
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыСуммаАвтоматическойСкидки.Видимость = Ложь;
		Элементы.ЗапасыРассчитатьСкидкиНаценки.Видимость = Ложь;
		СброситьФлагСкидкиРассчитаныСервер("РассчитатьСуммуВСтрокеТабличнойЧасти");
		// Конец АвтоматическиеСкидки
		
		Объект.ВидСкидкиНаценки = Неопределено;
		Для каждого СтрокаЗапасы Из Объект.Запасы Цикл
			Если СтрокаЗапасы.ПроцентСкидкиНаценки <> 0 Тогда
				СтрокаЗапасы.ПроцентСкидкиНаценки = 0;
			КонецЕсли;
			
			// АвтоматическиеСкидки
			Если СтрокаЗапасы.СуммаАвтоматическойСкидки <> 0 Или СтрокаЗапасы.ПроцентАвтоматическойСкидки <> 0 Тогда
				СтрокаЗапасы.ПроцентАвтоматическойСкидки = 0;
				СтрокаЗапасы.СуммаАвтоматическойСкидки = 0;
			КонецЕсли;
			// Конец АвтоматическиеСкидки
		КонецЦикла;
		
		// ДисконтныеКарты
		Элементы.СчитатьДисконтнуюКарту.Видимость = Ложь;
		Если Не Объект.ДисконтнаяКарта.Пустая() Тогда
			Объект.ДисконтнаяКарта = ПредопределенноеЗначение("Справочник.ДисконтныеКарты.ПустаяСсылка");
			Объект.ПроцентСкидкиПоДисконтнойКарте = 0;
		КонецЕсли;
		// Конец ДисконтныеКарты
	КонецЕсли;
	
	СтруктураНадписи = Новый Структура("ВидЦен, ВидСкидки, ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, НалогообложениеНДС, ДисконтнаяКарта, ПроцентСкидкиПоДисконтнойКарте", Объект.ВидЦен, Объект.ВидСкидкиНаценки, Объект.ВалютаДокумента, ВалютаРасчетов, Объект.Курс, КурсНациональнаяВалюта, Объект.СуммаВключаетНДС, УчетВалютныхОпераций, Объект.НалогообложениеНДС, Объект.ДисконтнаяКарта, Объект.ПроцентСкидкиПоДисконтнойКарте);
	ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
	Элементы.СтруктурнаяЕдиница.АвтоМаксимальнаяШирина = НЕ УправлениеНебольшойФирмойПовтИсп.ВключеноИспользованиеЯчеек() ИЛИ НЕ Элементы.Ячейка.Видимость;
	
	// Номенклатура.
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю") Тогда
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас"));
		НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга"));
		МассивЗапасыИУслуги = Новый ФиксированныйМассив(НовыйМассив);
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипНоменклатуры", МассивЗапасыИУслуги);
		НовыйПараметр2 = Новый ПараметрВыбора("Дополнительно.ОграничениеТипа", МассивЗапасыИУслуги);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыйМассив.Добавить(НовыйПараметр2);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыНоменклатура.ПараметрыВыбора = НовыеПараметры;
	Иначе
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипНоменклатуры", ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас"));
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыНоменклатура.ПараметрыВыбора = НовыеПараметры;
		
		Для каждого СтрокаЗапасы Из Объект.Запасы Цикл
			Если СтрокаЗапасы.Номенклатура.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
				СтрокаЗапасы.Номенклатура = Неопределено;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Партии.
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту") Тогда
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Статус", ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварыНаКомиссии"));
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыПартия.ПараметрыВыбора = НовыеПараметры;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки") Тогда
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Статус", ПредопределенноеЗначение("Перечисление.СтатусыПартий.ДавальческоеСырье"));
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыПартия.ПараметрыВыбора = НовыеПараметры;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения") Тогда
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Статус", ПредопределенноеЗначение("Перечисление.СтатусыПартий.ОтветственноеХранение"));
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыПартия.ПараметрыВыбора = НовыеПараметры;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю") Тогда
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПартий.СобственныеЗапасы"));
		НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварыНаКомиссии"));
		НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПартий.ПустаяСсылка"));
		МассивСобственныеЗапасыИТоварыНаКомиссии = Новый ФиксированныйМассив(НовыйМассив);
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Статус", МассивСобственныеЗапасыИТоварыНаКомиссии);
		НовыйПараметр2 = Новый ПараметрВыбора("Дополнительно.ОграничениеСтатуса", МассивСобственныеЗапасыИТоварыНаКомиссии);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыйМассив.Добавить(НовыйПараметр2);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыПартия.ПараметрыВыбора = НовыеПараметры;
	Иначе
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Статус", ПредопределенноеЗначение("Перечисление.СтатусыПартий.СобственныеЗапасы"));
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыПартия.ПараметрыВыбора = НовыеПараметры;
	КонецЕсли;
	
	// Документ основание.
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту") Тогда
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию"));
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		ПараметрыВыбораДокументаОснования = НовыеПараметры;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки") Тогда
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПриемВПереработку"));
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		ПараметрыВыбораДокументаОснования = НовыеПараметры;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения") Тогда
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПриемНаОтветхранение"));
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		ПараметрыВыбораДокументаОснования = НовыеПараметры;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю") Тогда
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика"));
		НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию"));
		МассивОтПоставщикаИНаКомиссии = Новый ФиксированныйМассив(НовыйМассив);
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ВидОперации", МассивОтПоставщикаИНаКомиссии);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		ПараметрыВыбораДокументаОснования = НовыеПараметры;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение") Тогда
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика"));
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		ПараметрыВыбораДокументаОснования = НовыеПараметры;
	Иначе
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика"));
		НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию"));
		НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПриемВПереработку"));
		НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПриемНаОтветхранение"));
		МассивОприходование = Новый ФиксированныйМассив(НовыйМассив);
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ВидОперации", МассивОприходование);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		ПараметрыВыбораДокументаОснования = НовыеПараметры;
	КонецЕсли;
	
	// Зачет предоплаты.
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю")
	 ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику") Тогда
		Элементы.ГруппаПредоплата.Видимость = Истина;
	Иначе
		Элементы.ГруппаПредоплата.Видимость = Ложь;
	КонецЕсли;
	
	// Заказ при отв. хранение.
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение")
	 ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения") Тогда
		Элементы.Заказ.Видимость = Ложь;
		Элементы.ЗаполнитьПоЗаказу.Видимость = Ложь;
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыЗаказ.Видимость = Ложь;
	Иначе
		Элементы.Заказ.Видимость = ЗаказВШапке;
		Элементы.ЗаполнитьПоЗаказу.Видимость = ЗаказВШапке;
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыЗаказ.Видимость = НЕ ЗаказВШапке;
	КонецЕсли;
	
	// Резервы.
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку") Тогда
		Элементы.ЗапасыИзменитьРезерв.Видимость = Истина;
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыРезерв.Видимость = Истина;
	Иначе
		Элементы.ЗапасыИзменитьРезерв.Видимость = Ложь;
		Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыРезерв.Видимость = Ложь;
		Для каждого СтрокаЗапасы Из Объект.Запасы Цикл
			СтрокаЗапасы.Резерв = 0;
		КонецЦикла;
	КонецЕсли;
	
	// Подразделение.
	ЭтоПродажаПокупателю = (Объект.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю);
	Если ЭтоПродажаПокупателю Тогда
		
		Элементы.Подразделение.АвтоВыборНезаполненного = Истина;
		Элементы.Подразделение.АвтоОтметкаНезаполненного = Истина;
		
	КонецЕсли;
	
	// Ставка НДС, Сумма НДС, Всего.
	Если ИзмененВидОперации Тогда
		ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС();
	Иначе
		
		Если Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС") Тогда
			
			Элементы.ЗапасыСтавкаНДС.Видимость = Истина;
			Элементы.ЗапасыСуммаНДС.Видимость = Истина;
			Элементы.ЗапасыВсего.Видимость = Истина;
			Элементы.СчетФактураНадпись.Видимость = Истина;
			
		Иначе
			
			Элементы.ЗапасыСтавкаНДС.Видимость = Ложь;
			Элементы.ЗапасыСуммаНДС.Видимость = Ложь;
			Элементы.ЗапасыВсего.Видимость = Ложь;
			Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НаЭкспорт Тогда
				Элементы.СчетФактураНадпись.Видимость = Истина;
			Иначе
				Элементы.СчетФактураНадпись.Видимость = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтоВозвратПоставщику = (Объект.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику);
	Если ЭтоВозвратПоставщику Тогда
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Склад"));
		НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Розница"));
		
		МассивТипыСтруктурнойЕдиницы = Новый ФиксированныйМассив(НовыйМассив);
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСтруктурнойЕдиницы", МассивТипыСтруктурнойЕдиницы);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.СтруктурнаяЕдиница.ПараметрыВыбора = НовыеПараметры;
		
	Иначе
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСтруктурнойЕдиницы", ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Склад"));
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.СтруктурнаяЕдиница.ПараметрыВыбора = НовыеПараметры;
		
		Если Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы <> ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Склад") Тогда
			Объект.СтруктурнаяЕдиница = "";
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыНомерГТД", "Видимость", ЭтоПродажаПокупателю ИЛИ ЭтоВозвратПоставщику);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗапасыСтранаПроисхождения", "Видимость", ЭтоПродажаПокупателю ИЛИ ЭтоВозвратПоставщику);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РежимГТД", "Видимость", ЭтоПродажаПокупателю ИЛИ ЭтоВозвратПоставщику);
	Если НЕ (ЭтоПродажаПокупателю ИЛИ ЭтоВозвратПоставщику) Тогда
		
		Для каждого СтрокаЗапасы Из Объект.Запасы Цикл
			
			СтрокаЗапасы.НомерГТД = Неопределено;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Установка доступности цен для редактирования.
	РазрешеноРедактированиеЦенДокументов = УправлениеНебольшойФирмойУправлениеДоступомПовтИсп.РазрешеноРедактированиеЦенДокументов();
	
	Элементы.ЗапасыЦена.ТолькоПросмотр 				   = НЕ РазрешеноРедактированиеЦенДокументов;
	Элементы.ЗапасыПроцентСкидкиНаценки.ТолькоПросмотр = НЕ РазрешеноРедактированиеЦенДокументов;
	Элементы.ЗапасыСумма.ТолькоПросмотр 			   = НЕ РазрешеноРедактированиеЦенДокументов;
	Элементы.ЗапасыСуммаНДС.ТолькоПросмотр 			   = НЕ РазрешеноРедактированиеЦенДокументов;
	Элементы.Скидки.ТолькоПросмотр					   = НЕ РазрешеноРедактированиеЦенДокументов;
	
	// Установить заголовок Контрагента: Покупатель или Поставщик
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки")
		ИЛИ НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		Элементы.Контрагент.Заголовок = НСТР("en='Customer';ka='მყიდველი';ru='Покупатель'");
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение") Тогда
		Элементы.Контрагент.Заголовок = НСТР("en='Customer';ka='მყიდველი';ru='Покупатель'");
	Иначе	
		Элементы.Контрагент.Заголовок = НСТР("en='Supplier';ka='მომწოდებელი';ru='Поставщик'");
	КонецЕсли;
	
	УправлениеНебольшойФирмойСервер.НастроитьГруппуЦеныИВалюты(ЭтаФорма);
	
	// Установка видимости и доступности элементов ЕГАИС
	УстановитьДоступностьЭлементовЕГАИС();
	
	
	//Т
	Если Объект.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику Тогда
		//ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.Найти("ЗаполнитьВсеНаЭтоПодарок").Видимость = Ложь;
		Элементы.ЗаполнитьВсеНаЭтоПодарок.Видимость = Ложь;
	КонецЕсли;
	
	//Паганини_
	//Элементы.ГруппаRS.Видимость 					= ЭтоВозвратПоставщику;
	Элементы.ЭлектроннаяНакладнаяНадпись.Видимость	= НЕ ЭтоВозвратПоставщику;
	Элементы.ЭлектроннаяНакладнаяНадпись.Доступность= РС_ИнтеграцияСНалоговойСлужбойГрузииПовтИсп.ПодсистемаДоступна_ИнтеграцияСНалоговойСлужбойГрузии();//_Паганини
	Элементы.ГруппаФактурыАвансов.Видимость	= ЭтоПродажаПокупателю;//_Паганини
	
	Элементы.ЗапасыСчетУчетаВыручкиОтПродажРегл.Видимость = Константы.СчетВыручкиВТабличнойЧасти.Получить();// Kuzmich, 21.05.2019, Счет выручки в табличной части
	Элементы.ЦенаПоСебестоимости.Видимость = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику"));// Kuzmich, 16.02.2020, Цена по себестоимости при безвозмездной продаже сотруднику
КонецПроцедуры // УстановитьВидимостьИДоступность()

&НаСервере
Процедура УстановитьВидимостьОтПользовательскихНастроек()
	
	ЗначениеВидимости = (Объект.ПоложениеЗаказаПокупателя = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВШапке"));
	
	Элементы.Заказ.Видимость 		= ЗначениеВидимости;
	Элементы.ЗапасыЗаказ.Видимость	= НЕ ЗначениеВидимости;
	Элементы.ЗаполнитьПоЗаказу.Видимость = ЗначениеВидимости;
	ЗаказВШапке 					= ЗначениеВидимости;
	
	//Lazare_
	ЗначениеВидимостиСклада = (Объект.ПоложениеСклада = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти"));
	Элементы.СтруктурнаяЕдиницаЗапасы.Видимость = ЗначениеВидимостиСклада;
	//СтруктурнаяЕдиницаВШапке =  ЗначениеВидимостиСклада ;
	//_Lazare	
	
	
КонецПроцедуры // УстановитьВидимостьОтПользовательскихНастроек()

&НаСервере
Процедура УстановитьВидимостьЯчейки(ИмяЯчейки, Склад)
	
	Элементы[ИмяЯчейки].Видимость = НЕ Склад.ОрдерныйСклад;
		
КонецПроцедуры // УстановитьВидимостьЯчейки()	

&НаСервере
Процедура ПолучитьСтруктуруВидовОпераций()
	
	Если Параметры.Свойство("ВидОперацииВозврат") Тогда
		
		Элементы.ВидОперации.СписокВыбора.Очистить();
		
	Иначе
		
		Если ПолучитьФункциональнуюОпцию("ПередачаТоваровНаКомиссию") Тогда
			Элементы.ВидОперации.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию"));
		КонецЕсли;
		
		Если ПолучитьФункциональнуюОпцию("ПередачаСырьяВПереработку") Тогда
			Элементы.ВидОперации.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку"));
		КонецЕсли;
		
		Если ПолучитьФункциональнуюОпцию("ПередачаЗапасовНаОтветхранение") Тогда
			Элементы.ВидОперации.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение"));
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ВидОперации.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику"));
	
	Если ПолучитьФункциональнуюОпцию("ПриемТоваровНаКомиссию") Тогда
		Элементы.ВидОперации.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту"));
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ФункциональнаяОпцияИспользыватьБезвозмезднуюПродажуСотрудникам") Тогда
		Элементы.ВидОперации.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику"));
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ПереработкаДавальческогоСырья") Тогда
		Элементы.ВидОперации.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки"));
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ПриемЗапасовНаОтветхранение") Тогда
		Элементы.ВидОперации.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения"));
	КонецЕсли;
	
КонецПроцедуры // ПолучитьСтруктуруВидовОпераций()

//+++ Дмгг
&НаСервере
Процедура УстановитьВиимостИспользованияБалов()

	ВидноВидИспользования = ЛОЖЬ;
	
	Если ЗначениеЗаполнено(Объект.КартаЛояльности) Тогда 
		Элементы.ВидИспользоыванияБалов.Видимость = Истина;
		ВидноВидИспользования = Истина;
	Иначе
		Элементы.ВидИспользоыванияБалов.Видимость = Ложь;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Объект.КартаЛояльности) 
		И Объект.ВидИспользоыванияБалов = Перечисления.ВидыИспользованияБалов.Накопление Тогда 
			
		Элементы.НакопленоБалов.Видимость = Истина;
		Элементы.ДоступноБалов.Видимость = ЛОЖЬ;
		Элементы.ЗапасыБалыРасход.Видимость = ЛОЖЬ;
		
	ИначеЕсли ЗначениеЗаполнено(Объект.КартаЛояльности) 
		И Объект.ВидИспользоыванияБалов = Перечисления.ВидыИспользованияБалов.Расход Тогда 
			
		Элементы.НакопленоБалов.Видимость = ЛОЖЬ;
		Элементы.ДоступноБалов.Видимость = Истина;
		Элементы.ЗапасыБалыРасход.Видимость = Истина;
		
	ИначеЕсли ЗначениеЗаполнено(Объект.КартаЛояльности) 
		И Объект.ВидИспользоыванияБалов = Перечисления.ВидыИспользованияБалов.НакоплениеИРасход Тогда 
			
		Элементы.НакопленоБалов.Видимость = Истина;
		Элементы.ДоступноБалов.Видимость = Истина;
		Элементы.ЗапасыБалыРасход.Видимость = Истина;
		
	Иначе
		Элементы.НакопленоБалов.Видимость = Ложь;
		Элементы.ДоступноБалов.Видимость = ЛОЖЬ;
		Элементы.ЗапасыБалыРасход.Видимость = ЛОЖЬ;
	КонецЕсли;

КонецПроцедуры

//Lazare++ 26.10.2021
&Насервере
Процедура УстановитьВидимостьИсполнительовВТабЧастиЗапасы();
	
	ВидимостьИсполнительовВТабЧастиЗапасы = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИсполнительВТаблицеЗаказаПокупателяИрасходнойНакладной");
	
	Если не ВидимостьИсполнительовВТабЧастиЗапасы Тогда 
		Элементы.ЗапасыИсполнитель.Видимость = ВидимостьИсполнительовВТабЧастиЗапасы ;	
	КонецЕсли;
		
КонецПроцедуры
//--- Дмгг

#КонецОбласти

#Область АвтоматическиеСкидки

&НаКлиенте
Процедура РассчитатьСкидкиНаценки(Команда)
	
	ОбнулитьСкидкиЛояльностиКлиент();//+++ Дмгг
	
	Если НЕ ИспользоватьКартыЛояльности Тогда 
		Если Объект.Запасы.Количество() = 0 Тогда
			Если Объект.СкидкиНаценки.Количество() > 0 Тогда
				Объект.СкидкиНаценки.Очистить();
			КонецЕсли;
			Возврат;
		КонецЕсли;
		//Возврат; +//Lazare.  после возврата не рассчитывался автоматическиескидки
	КонецЕсли;
	
	РассчитатьСкидкиНаценкиКлиент();
	ОкруглениеСуммы();
	ОбновитьПодвалФормы();
		
	
КонецПроцедуры

//+++ Дмгг
&НаКлиенте
Процедура ОбнулитьСкидкиЛояльностиКлиент()

	Если НЕ ЗначениеЗаполнено(Объект.КартаЛояльности) Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого Строк Из Объект.Запасы Цикл 
		Строк.ПроцентСкидкаЛояльности = 0;
	КонецЦикла;

КонецПроцедуры
//--- Дмгг

&НаСервере
Процедура ОкруглениеСуммы()
	
	Если Объект.ВидЦен.ОкруглятьВБольшуюСторону и Объект.ВидЦен.ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр0_05 Тогда 
		Для Каждого стр из Объект.Запасы Цикл
			Если стр.Сумма >= Окр(стр.Сумма, 1 )+ 0.01  Тогда 
				Сумма = стр.Сумма + 0.05; 
				Если стр.Сумма <= Сумма  и Сумма <= Окр(стр.Сумма, 2 ) + 0.1 Тогда 
					стр.Сумма = Окр(стр.Сумма, 1 ) + 0.05; 
					стр.Всего = стр.Сумма;
					
				КонецЕсли;
				
			ИначеЕсли стр.Сумма <> Окр(стр.Сумма, 1, РежимОкругления.Окр15как10)+ 0.05  Тогда
				стр.Сумма = Окр(стр.Сумма, 1, РежимОкругления.Окр15как20);
				стр.Всего = стр.Сумма;
			КонецЕсли;	
		

				
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура РассчитатьСкидкиНаценкиПоЗаказуСервер()

	СкидкиНаценкиСервер.ЗаполнитьКлючиСвязиВТабличнойЧастиТовары(Объект, "Запасы");
	
	МассивЗаказов = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(Объект.ПоложениеЗаказаПокупателя) Тогда
		ПоложениеЗаказаПокупателя = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ПоложениеЗаказаПокупателяВДокументахОтгрузки");
		Если Не ЗначениеЗаполнено(Объект.ПоложениеЗаказаПокупателя) Тогда
			ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
		КонецЕсли;
	Иначе
		ПоложениеЗаказаПокупателя = Объект.ПоложениеЗаказаПокупателя;
	КонецЕсли;
	Если ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
		МассивЗаказов.Добавить(Объект.Заказ);
	Иначе
		ТЗЗаказов = Объект.Запасы.Выгрузить(, "Заказ");
		ТЗЗаказов.Свернуть("Заказ");
		МассивЗаказов = ТЗЗаказов.ВыгрузитьКолонку("Заказ");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СкидкиНаценки.Ссылка КАК Заказ,
	|	СкидкиНаценки.СкидкаНаценка КАК СкидкаНаценка,
	|	СУММА(СкидкиНаценки.Сумма) КАК СуммаАвтоматическойСкидки,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТипНоменклатурыЗапас,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА 1
	|		ИНАЧЕ ЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	ЗаказПокупателяЗапасы.Номенклатура,
	|	ЗаказПокупателяЗапасы.Характеристика,
	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения,
	|	СУММА(ЗаказПокупателяЗапасы.Количество) КАК Количество
	|ИЗ
	|	Документ.ЗаказПокупателя.СкидкиНаценки КАК СкидкиНаценки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаказПокупателяЗапасы КАК ЗаказПокупателяЗапасы
	|		ПО СкидкиНаценки.Ссылка = ЗаказПокупателяЗапасы.Ссылка
	|			И СкидкиНаценки.КлючСвязи = ЗаказПокупателяЗапасы.КлючСвязи
	|ГДЕ
	|	СкидкиНаценки.Ссылка В(&МассивЗаказов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателяЗапасы.Характеристика,
	|	СкидкиНаценки.СкидкаНаценка,
	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения,
	|	СкидкиНаценки.Ссылка,
	|	ЗаказПокупателяЗапасы.Номенклатура,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА 1
	|		ИНАЧЕ ЗаказПокупателяЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ";
	
	Документы.ЗаказПокупателя.ДобавитьТаблицуЗапасыВМенеджерВременныхТаблиц(МассивЗаказов, Запрос.МенеджерВременныхТаблиц, Ложь);
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СкидкиНаценкиЗаказа = МассивРезультатов[0].Выгрузить();
	
	Объект.СкидкиНаценки.Очистить();
	РезультатРасчетаСкидокНаценок = Объект.СкидкиНаценки.Выгрузить();
	
	ОбъектЗапасы = Объект.Запасы.Выгрузить();
	ОбъектЗапасы.Колонки.Добавить("ОсталосьРаспределить");
	Для Каждого ТекущаяСтрокаДокумента Из ОбъектЗапасы Цикл
		ТекущаяСтрокаДокумента.ОсталосьРаспределить = ТекущаяСтрокаДокумента.Количество *
			?(ТипЗнч(ТекущаяСтрокаДокумента.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения"), 1, ТекущаяСтрокаДокумента.ЕдиницаИзмерения.Коэффициент);
	КонецЦикла;
	
	Для Каждого ТекущаяСтрокаЗаказа Из СкидкиНаценкиЗаказа Цикл
		
		СтруктураДляПоиска = Новый Структура;
		СтруктураДляПоиска.Вставить("Заказ", ТекущаяСтрокаЗаказа.Заказ);
		СтруктураДляПоиска.Вставить("Номенклатура", ТекущаяСтрокаЗаказа.Номенклатура);
		СтруктураДляПоиска.Вставить("Характеристика", ТекущаяСтрокаЗаказа.Характеристика);
		
		МассивСтрокДокумента = ОбъектЗапасы.НайтиСтроки(СтруктураДляПоиска);
		Если МассивСтрокДокумента.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоВЗаказе = ТекущаяСтрокаЗаказа.Количество * ТекущаяСтрокаЗаказа.Коэффициент;
		Распределено = 0;
		Для Каждого ТекущаяСтрокаДокумента Из МассивСтрокДокумента Цикл
			
			КоличествоКСписанию = ТекущаяСтрокаДокумента.ОсталосьРаспределить;
			
			ПересчитатьСуммы = КоличествоВЗаказе <> КоличествоКСписанию;
			КоэффициентПересчетаСкидки = ?(ПересчитатьСуммы, КоличествоКСписанию / КоличествоВЗаказе, 1);
			Если КоэффициентПересчетаСкидки <> 1 Тогда
				ТекущаяСуммаАвтоматическойСкидки = ОКР(ТекущаяСтрокаЗаказа.СуммаАвтоматическойСкидки * КоэффициентПересчетаСкидки,2);
			Иначе
				ТекущаяСуммаАвтоматическойСкидки = ТекущаяСтрокаЗаказа.СуммаАвтоматическойСкидки;
			КонецЕсли;
			
			СтрокаСкидки = РезультатРасчетаСкидокНаценок.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСкидки, ТекущаяСтрокаЗаказа);
			СтрокаСкидки.Сумма = ТекущаяСуммаАвтоматическойСкидки;
			СтрокаСкидки.КлючСвязи = ТекущаяСтрокаДокумента.КлючСвязи;
			
			ТекущаяСтрокаЗаказа.СуммаАвтоматическойСкидки = ТекущаяСтрокаЗаказа.СуммаАвтоматическойСкидки - ТекущаяСуммаАвтоматическойСкидки;
			
			КоличествоВЗаказе = КоличествоВЗаказе - КоличествоКСписанию;
			Если КоличествоВЗаказе <=0 Или ТекущаяСтрокаЗаказа.СуммаАвтоматическойСкидки <=0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Объект.Запасы.Загрузить(ОбъектЗапасы);
	
	СкидкиНаценкиСервер.ПрименитьРезультатРасчетаСкидокКОбъекту(Объект, "Запасы", РезультатРасчетаСкидокНаценок);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСкидкиНаценкиКлиент()
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда // Проверка на определенность рабочего места ВО
		РабочееМесто = МенеджерОборудованияКлиентПовтИсп.ПолучитьРабочееМестоКлиента();
	Иначе
		РабочееМесто = ""
	КонецЕсли;
	
	СтруктураПараметры.Вставить("РабочееМесто", РабочееМесто);
	
	РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры);
		
КонецПроцедуры

// Функция сравнивает данные расчёта скидок на текущий момент времени с данными последнего расчёт скидок в документе.
// Если скидки изменились, то функция возвращает значение Истина.
//
&НаСервере
Функция СкидкиИзменились()
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Ложь);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	
	ПримененныеСкидки = СкидкиНаценкиСерверПереопределяемый.Рассчитать(Объект, СтруктураПараметры);
	
	СкидкиИзменились = Ложь;
	
	КоличествоСтрок = ПримененныеСкидки.ТаблицаСкидкиНаценки.Количество();
	Если КоличествоСтрок <> Объект.СкидкиНаценки.Количество() Тогда
		СкидкиИзменились = Истина;
	Иначе
		
		Если Объект.Запасы.Итог("СуммаАвтоматическойСкидки") <> Объект.СкидкиНаценки.Итог("Сумма") Тогда
			СкидкиИзменились = Истина;
		КонецЕсли;
		
		Если Не СкидкиИзменились Тогда
			Для НомерСтроки = 1 По КоличествоСтрок Цикл
				Если    Объект.СкидкиНаценки[НомерСтроки-1].Сумма <> ПримененныеСкидки.ТаблицаСкидкиНаценки[НомерСтроки-1].Сумма
					ИЛИ Объект.СкидкиНаценки[НомерСтроки-1].КлючСвязи <> ПримененныеСкидки.ТаблицаСкидкиНаценки[НомерСтроки-1].КлючСвязи
					ИЛИ Объект.СкидкиНаценки[НомерСтроки-1].СкидкаНаценка <> ПримененныеСкидки.ТаблицаСкидкиНаценки[НомерСтроки-1].СкидкаНаценка Тогда
					СкидкиИзменились = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Если СкидкиИзменились Тогда
		АдресПримененныхСкидокВоВременномХранилище = ПоместитьВоВременноеХранилище(ПримененныеСкидки, УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат СкидкиИзменились;
	
КонецФункции

&НаСервере
Функция ПолучитьСтрукутурПараметровРасчетаАвтоСкидокСервер()

	СтруктураПараметровЗаказа = Новый Структура("РеализацияПоЗаказам, РеализацияСверхЗаказа", Ложь, Ложь);
	
	Если НЕ ЗначениеЗаполнено(Объект.ПоложениеЗаказаПокупателя) Тогда
		ПоложениеЗаказаПокупателя = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ПоложениеЗаказаПокупателяВДокументахОтгрузки");
		Если НЕ ЗначениеЗаполнено(ПоложениеЗаказаПокупателя) Тогда
			ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
		КонецЕсли;
	Иначе
		ПоложениеЗаказаПокупателя = Объект.ПоложениеЗаказаПокупателя;
	КонецЕсли;
	Если ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
		Если ЗначениеЗаполнено(Объект.Заказ) Тогда
			СтруктураПараметровЗаказа.РеализацияПоЗаказам = Истина;
		Иначе
			СтруктураПараметровЗаказа.РеализацияПоЗаказам = Ложь;
		КонецЕсли;
		СтруктураПараметровЗаказа.РеализацияСверхЗаказа = Ложь;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасходнаяНакладнаяЗапасы.Заказ КАК Заказ
			|ПОМЕСТИТЬ ВТ_Запасы
			|ИЗ
			|	&Запасы КАК РасходнаяНакладнаяЗапасы
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Запасы.Заказ КАК Заказ
			|ИЗ
			|	ВТ_Запасы КАК ВТ_Запасы
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_Запасы.Заказ";
		
		Запрос.УстановитьПараметр("Запасы", Объект.Запасы.Выгрузить());
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.Заказ) Тогда
				СтруктураПараметровЗаказа.РеализацияПоЗаказам = Истина;
			Иначе
				СтруктураПараметровЗаказа.РеализацияСверхЗаказа = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтруктураПараметровЗаказа;
	
КонецФункции // ЕстьЗаказыВТЧ()

&НаСервере
Процедура РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры)
	
	СтруктураПараметровЗаказа = ПолучитьСтрукутурПараметровРасчетаАвтоСкидокСервер(); // Если в ТЧ "Товары" есть заказы, то нужно автоматическую скидку для таких строк рассчитывать по заказу.
	Если СтруктураПараметровЗаказа.РеализацияПоЗаказам Тогда
		РассчитатьСкидкиНаценкиПоЗаказуСервер();
		Если СтруктураПараметровЗаказа.РеализацияСверхЗаказа Тогда
			СтруктураПараметры.Вставить("РеализацияСверхЗаказа", Истина);
			ПримененныеСкидки = СкидкиНаценкиСерверПереопределяемый.Рассчитать(Объект, СтруктураПараметры);
		Иначе
			СтруктураПараметры.Вставить("ПрименятьКОбъекту", Ложь);
			ПримененныеСкидки = СкидкиНаценкиСерверПереопределяемый.Рассчитать(Объект, СтруктураПараметры);
		КонецЕсли;
	Иначе
		ПримененныеСкидки = СкидкиНаценкиСерверПереопределяемый.Рассчитать(Объект, СтруктураПараметры);
	КонецЕсли;
	
	АдресПримененныхСкидокВоВременномХранилище = ПоместитьВоВременноеХранилище(ПримененныеСкидки, УникальныйИдентификатор);
	
	Модифицированность = Истина;
	
	СкидкиНаценкиСерверПереопределяемый.ОбновитьОтображениеСкидки(Объект, "Запасы");
	
	Если НЕ Объект.СкидкиРассчитаны Тогда
	
		Объект.СкидкиРассчитаны = Истина;
	
	КонецЕсли;
	
	Элементы.ЗапасыРассчитатьСкидкиНаценки.Картинка = БиблиотекаКартинок.Обновить;
	
	ЕстьРучныеСкидки = Константы.ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи.Получить();
	Для Каждого ТекущаяСтрока Из Объект.Запасы Цикл
		ТекСуммаРучнойСкидки = ?(ЕстьРучныеСкидки, ТекущаяСтрока.Цена * ТекущаяСтрока.Количество * ТекущаяСтрока.ПроцентСкидкиНаценки / 100, 0);
		ТекСуммаСкидки = ТекСуммаРучнойСкидки + ТекущаяСтрока.СуммаАвтоматическойСкидки;
			
		Если ТекСуммаСкидки >= ТекущаяСтрока.Сумма И ТекущаяСтрока.Цена > 0 Тогда
			ТекущаяСтрока.ОбщаяСуммаСкидкиБольшеСуммы = Истина;
		Иначе
			ТекущаяСтрока.ОбщаяСуммаСкидкиБольшеСуммы = Ложь;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнформациюОСкидках(Команда)
	
	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьИнформациюОСкидкахКлиент()
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнформациюОСкидкахКлиент()
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	
	СтруктураПараметры.Вставить("ТолькоСообщенияПослеОформления",   Ложь);
	
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда // Проверка на определенность рабочего места ВО
		РабочееМесто = МенеджерОборудованияКлиентПовтИсп.ПолучитьРабочееМестоКлиента();
	Иначе
		РабочееМесто = ""
	КонецЕсли;
	
	СтруктураПараметры.Вставить("РабочееМесто", РабочееМесто);
	
	Если НЕ Объект.СкидкиРассчитаны Тогда
		ТекстВопроса = НСтр("ru='Скидки (наценки) не рассчитаны, рассчитать?';en='Discounts (markups) are not designed to calculate?'");
		
		ДополнительныеПараметры = Новый Структура; 
		ДополнительныеПараметры.Вставить("СтруктураПараметры", СтруктураПараметры);
		ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеВопросРассчитатьСкидки", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		РассчитатьСкидкиЗавершитьОбработкуВопроса(СтруктураПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВопросРассчитатьСкидки(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	СтруктураПараметры = ДополнительныеПараметры.СтруктураПараметры;
	РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры);
	РассчитатьСкидкиЗавершитьОбработкуВопроса(СтруктураПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСкидкиЗавершитьОбработкуВопроса(СтруктураПараметры)
	
	Если НЕ ЗначениеЗаполнено(АдресПримененныхСкидокВоВременномХранилище) Тогда
		РассчитатьСкидкиНаценкиКлиент();
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	СкидкиНаценкиКлиент.ОткрытьФормуПримененныеСкидки(ТекущиеДанные, Объект, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущийЭлемент = Элементы.ЗапасыПроцентАвтоматическойСкидки
		И НЕ ТолькоПросмотр Тогда
		
		СтандартнаяОбработка = Ложь;
		ОткрытьИнформациюОСкидкахКлиент()
		
	КонецЕсли;
	
	
	
	//+++ Lazare_21.12.2021		
	Если ПравоИзмененияЦен() Тогда 
		 ПравоИзмененияЦены =   ПравоИзмененияЦеныНоменклатурыВРасходнойНакл(Элемент.ТекущиеДанные.Номенклатура);
		Если ПравоИзмененияЦены  Тогда 
			Элемент.ТекущийЭлемент.ТолькоПросмотр = Не ПравоИзмененияЦены;
		Иначе 
			Элемент.ТекущийЭлемент.ТолькоПросмотр =  Истина;
		КонецЕсли;
	КонецЕсли;
	//--- Lazare_21.12.2021
	
КонецПроцедуры

&НаСервере
Функция ПравоИзмененияЦен()	
	    Возврат Не (РольДоступна("ПолныеПрава") Или Не Константы.ФункционалПраваРедактированияНоменклатуры.Получить());
КонецФункции
	

&НаКлиенте
Процедура ЗапасыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Усушка_ТекущееКоличество = Элемент.ТекущиеДанные.Количество; // Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
	
	// АвтоматическиеСкидки
	Если НоваяСтрока И Копирование И
		(Элемент.ТекущиеДанные.ПроцентАвтоматическойСкидки <> 0 ИЛИ Элемент.ТекущиеДанные.СуммаАвтоматическойСкидки <> 0) Тогда
		Элемент.ТекущиеДанные.ПроцентАвтоматическойСкидки = 0;
		Элемент.ТекущиеДанные.СуммаАвтоматическойСкидки = 0;
		РассчитатьСуммуВСтрокеТабличнойЧасти();
		//ЗаполнитьИтогКоличество(); //+++ Дмгг;
		
	ИначеЕсли ИспользоватьАвтоматическиеСкидки И НоваяСтрока И Копирование Тогда
		// Автоматические скидки стали неактуальны.
		СброситьФлагСкидкиРассчитаныКлиент("ПриНачалеРедактирования");
	КонецЕсли;
	// Конец АвтоматическиеСкидки
	
	Если НоваяСтрока И Копирование Тогда
		Элемент.ТекущиеДанные.КлючСвязи = 0;
		Элемент.ТекущиеДанные.СерийныеНомера = "";
		//ЗаполнитьИтогКоличество(); //+++ Дмгг;
	КонецЕсли;
	
	//ПодольскийАИ #УчетПроектов 05.10.2020 {
	Если УчетПоПроектам И НоваяСтрока И Не Копирование Тогда
		Элемент.ТекущиеДанные.Проект = Объект.Проект;
	КонецЕсли;	
	//ПодольскийАИ #УчетПроектов 05.10.2020 }
	
	// ГрупповоеИзменениеСтрок
	Элемент.ТекущиеДанные.Пометка = Истина;
	// Конец ГрупповоеИзменениеСтрок
	
	Если Элемент.ТекущийЭлемент.Имя = "ЗапасыСерийныеНомера" Тогда
		ОткрытьПодборСерийныеНомера();
	КонецЕсли;
	
	//+++ Дмгг
	Если НоваяСтрока И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику") Тогда
		Элемент.ТекущиеДанные.СчетДоходовБП = Объект.СчетДоходовБП;
	КонецЕсли;
	
	//Lazare_
	Если Объект.ПоложениеСклада =  ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти")Тогда 
		Если НоваяСтрока И Не Копирование Тогда 	
			Элемент.ТекущиеДанные.СтруктурнаяЕдиницаЗапасы = Объект.СтруктурнаяЕдиница ;
		КонецЕсли;
	КонецЕсли;
	//_Lazare
	
	
КонецПроцедуры

&НаСервере
Функция СброситьФлагСкидкиРассчитаныСервер(Действие, КолонокаТЧ = "")
	
	ТребуетсяПересчет = Ложь;
	Если Объект.ВидОперации = ВидОперацииПродажаПокупателю Тогда
		Если ИспользоватьАвтоматическиеСкидки И Объект.Запасы.Количество() > 0 И (Объект.СкидкиРассчитаны ИЛИ УстановленСерыйЦвет) Тогда
			ТребуетсяПересчет = СброситьФлагСкидкиРассчитаны(Действие, КолонокаТЧ);
		КонецЕсли;
	КонецЕсли;
	Возврат ТребуетсяПересчет;
	
КонецФункции

&НаКлиенте
Функция СброситьФлагСкидкиРассчитаныКлиент(Действие, КолонокаТЧ = "")
	
	ТребуетсяПересчет = Ложь;
	Если Объект.ВидОперации = ВидОперацииПродажаПокупателю Тогда
		Если ИспользоватьАвтоматическиеСкидки И Объект.Запасы.Количество() > 0 И (Объект.СкидкиРассчитаны ИЛИ УстановленСерыйЦвет) Тогда
			ТребуетсяПересчет = СброситьФлагСкидкиРассчитаны(Действие, КолонокаТЧ);
		КонецЕсли;
	КонецЕсли;
	Возврат ТребуетсяПересчет;
	
КонецФункции

&НаСервере
Функция СброситьФлагСкидкиРассчитаны(Действие, КолонокаТЧ = "")
	
	Возврат СкидкиНаценкиСервер.СброситьФлагСкидкиРассчитаны(ЭтотОбъект, Действие, КолонокаТЧ);
	
КонецФункции

&НаСервере
Процедура АвтоматическиеСкидкиПриСозданииНаСервере()
	
	УстановленСерыйЦвет = Ложь;
	ИспользоватьАвтоматическиеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки");
	Если ИспользоватьАвтоматическиеСкидки Тогда
		Если Объект.Запасы.Количество() = 0 Тогда
			Элементы.ЗапасыРассчитатьСкидкиНаценки.Картинка = БиблиотекаКартинок.ОбновитьСерый;
			УстановленСерыйЦвет = Истина;
		ИначеЕсли НЕ Объект.СкидкиРассчитаны Тогда
			Объект.СкидкиРассчитаны = Ложь;
			Элементы.ЗапасыРассчитатьСкидкиНаценки.Картинка = БиблиотекаКартинок.ОбновитьКрасный;
		Иначе
			Элементы.ЗапасыРассчитатьСкидкиНаценки.Картинка = БиблиотекаКартинок.Обновить;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПослеУдаления(Элемент)
	
	ОбновитьПодвалФормы();
	РассчитатьОбъемИВесВДокументе();
	
	// АвтоматическиеСкидки.
	СброситьФлагСкидкиРассчитаныКлиент("УдалениеСтроки");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыЗаказПриИзменении(Элемент)
	
	// АвтоматическиеСкидки
	Если СброситьФлагСкидкиРассчитаныКлиент("ЗапасыЗаказПриИзменении") Тогда
		РассчитатьСуммуВСтрокеТабличнойЧасти(Неопределено, Ложь);
		ОбновитьПодвалФормы();
	КонецЕсли;
	// Конец АвтоматическиеСкидки
	
КонецПроцедуры

#КонецОбласти

#Область ДисконтныеКарты

&НаКлиенте
Процедура ВыбранаДисконтнаяКарта(ДисконтнаяКарта)

	ВладелецДисконтнойКарты = ПолучитьВладельцаДисконтнойКарты(ДисконтнаяКарта);
	Если Объект.Контрагент.Пустая() И Не ВладелецДисконтнойКарты.Пустая() Тогда
		Объект.Контрагент = ВладелецДисконтнойКарты;
		КонтрагентПриИзменении(Элементы.Контрагент);
		
		ПоказатьОповещениеПользователя(
			НСтр("ka='შევსებულია კონტრაგენტი და წაკითხულია დისკონტური ბარათი';ru='Заполнен контрагент и считана дисконтная карта';en='Filled counterparty and read a discount card'"),
			ПолучитьНавигационнуюСсылку(ДисконтнаяКарта),
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='დოკუმენტში შევსებულია კონტრაგენტი და წაკითხულია დისკონტური ბარათი %1';ru='В документе заполнен контрагент и считана дисконтная карта %1';en='The document is filled with a counterparty and read a discount card 1%'"), ДисконтнаяКарта),
			БиблиотекаКартинок.Информация32);
	ИначеЕсли Объект.Контрагент <> ВладелецДисконтнойКарты И Не ВладелецДисконтнойКарты.Пустая() Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ka='დისკონტური ბარათი არ არის წაკითხული. დისკონტური ბარათის მფლობელი დოკუმენტში არსებულ კონტრაგენტს არ ემთხვევა.';ru='Дисконтная карта не считана. Владелец дисконтной карты не совпадает с контрагентом в документе.';en='The discount card is not read. The owner of a discount card does not coincide with the counterpart in the document.'"),
			,
			"Контрагент",
			"Объект");
		
		Возврат;
	Иначе
		ПоказатьОповещениеПользователя(
			НСтр("ka='Считана дисконтная карта';ru='Считана дисконтная карта';en='Считана дисконтная карта'"),
			ПолучитьНавигационнуюСсылку(ДисконтнаяКарта),
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Считана дисконтная карта %1';en='Read discount card 1%'"), ДисконтнаяКарта),
			БиблиотекаКартинок.Информация32);
	КонецЕсли;
	
	ВыбранаДисконтнаяКартаДополнительно(ДисконтнаяКарта);
		
КонецПроцедуры

&НаКлиенте
Процедура ВыбранаДисконтнаяКартаДополнительно(ДисконтнаяКарта)
	
	Если Не Модифицированность Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
	Объект.ДисконтнаяКарта = ДисконтнаяКарта;
	Объект.ПроцентСкидкиПоДисконтнойКарте = УправлениеНебольшойФирмойСервер.ВычислитьПроцентСкидкиПоДисконтнойКарте(Объект.Дата, ДисконтнаяКарта);
	
	СтруктураНадписи = Новый Структура("ВидЦен, ВидСкидки, ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, НалогообложениеНДС, ДисконтнаяКарта, ПроцентСкидкиПоДисконтнойКарте",
			Объект.ВидЦен,
			Объект.ВидСкидкиНаценки,
			Объект.ВалютаДокумента,
			ВалютаРасчетов,
			Объект.Курс,
			КурсНациональнаяВалюта,
			Объект.СуммаВключаетНДС,
			УчетВалютныхОпераций,
			Объект.НалогообложениеНДС,
			Объект.ДисконтнаяКарта,
			Объект.ПроцентСкидкиПоДисконтнойКарте);
			
	ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
		
	Если Объект.Запасы.Количество() > 0 Тогда
		Текст = НСтр("ru='Перезаполнить скидки во всех строках?';en='Refill discounts on all lines?'");
		Оповещение = Новый ОписаниеОповещения("ВыбранаДисконтнаяКартаДополнительноЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ВыбранаДисконтнаяКартаДополнительноЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

УстановитьПроцентСкидкиНаценки();	
//СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элементы.ФормаПровести, "Нажатие");
Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
	УправлениеНебольшойФирмойКлиент.ПерезаполнитьСкидкиТабличнойЧастиПослеСчитыванияДисконтнойКарты(ЭтотОбъект, "Запасы");
КонецЕсли;

// АвтоматическиеСкидки
СброситьФлагСкидкиРассчитаныКлиент("ПересчетСкидокПоДисконтнойКарте");

//Ручные скидки
	СкидкиНаценкиКлиентСервер.РассчитатьСуммуИПроцентСкидки(ЭтотОбъект);
	//Конец Ручные скидки
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВладельцаДисконтнойКарты(ДисконтнаяКарта)
	
	Возврат ДисконтнаяКарта.ВладелецКарты;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоДисконтнаяКартаСФиксированнойСкидкой(ДисконтнаяКарта)
	
	Возврат ДисконтнаяКарта.Владелец.ВидСкидкиВДисконтныхКартах = Перечисления.ВидыСкидокВДисконтныхКартах.ФиксированнаяСкидка;
	
КонецФункции

// Процедура выполняется только для НАКОПИТЕЛЬНЫХ дисконтных карт.
// Процедура пересчитывает скидки документа, после изменения даты документа. Пересчёт выполняется, если процент скидки
// по выбранной дисконтной карте, изменился. 
//
&НаКлиенте
Процедура ПересчитатьПроцентСкидкиПриИзмененииДатыДокумента()
	
	Если Объект.ДисконтнаяКарта.Пустая() ИЛИ ЭтоДисконтнаяКартаСФиксированнойСкидкой(Объект.ДисконтнаяКарта) Тогда
		Возврат;
	КонецЕсли;
	
	ПредПроцентСкидкиПоДисконтнойКарте = Объект.ПроцентСкидкиПоДисконтнойКарте;
	НовПроцентСкидкиПоДисконтнойКарте = УправлениеНебольшойФирмойСервер.ВычислитьПроцентСкидкиПоДисконтнойКарте(Объект.Дата, Объект.ДисконтнаяКарта);
	
	Если ПредПроцентСкидкиПоДисконтнойКарте <> НовПроцентСкидкиПоДисконтнойКарте Тогда
		
		Если Объект.Запасы.Количество() > 0 Тогда
			Текст = НСтр("ru = 'Изминть % скидки по накопительной дисконтной карте с "+ПредПроцентСкидкиПоДисконтнойКарте+"% на "+НовПроцентСкидкиПоДисконтнойКарте+"% и перезаполнить скидки во всех строках?'");
			
			ДополнительныеПараметры = Новый Структура("НовПроцентСкидкиПоДисконтнойКарте, ПересчитатьТЧ", НовПроцентСкидкиПоДисконтнойКарте, Истина);
			Оповещение = Новый ОписаниеОповещения("ПересчитатьПроцентСкидкиПриИзмененииДатыДокументаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		Иначе
			Текст = НСтр("ru = 'Изминть % скидки по накопительной дисконтной карте с "+ПредПроцентСкидкиПоДисконтнойКарте+"% на "+НовПроцентСкидкиПоДисконтнойКарте+"%?'");
			
			ДополнительныеПараметры = Новый Структура("НовПроцентСкидкиПоДисконтнойКарте, ПересчитатьТЧ", НовПроцентСкидкиПоДисконтнойКарте, Ложь);
			Оповещение = Новый ОписаниеОповещения("ПересчитатьПроцентСкидкиПриИзмененииДатыДокументаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		КонецЕсли;
		ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняется только для НАКОПИТЕЛЬНЫХ дисконтных карт.
// Процедура пересчитывает скидки документа, после изменения даты документа. Пересчёт выполняется, если процент скидки
// по выбранной дисконтной карте, изменился. 
//
&НаКлиенте
Процедура ПересчитатьПроцентСкидкиПриИзмененииДатыДокументаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.ПроцентСкидкиПоДисконтнойКарте = ДополнительныеПараметры.НовПроцентСкидкиПоДисконтнойКарте;
		
		СтруктураНадписи = Новый Структура("ВидЦен, ВидСкидки, ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, НалогообложениеНДС, ДисконтнаяКарта, ПроцентСкидкиПоДисконтнойКарте",
				Объект.ВидЦен,
				Объект.ВидСкидкиНаценки,
				Объект.ВалютаДокумента,
				ВалютаРасчетов,
				Объект.Курс,
				КурсНациональнаяВалюта,
				Объект.СуммаВключаетНДС,
				УчетВалютныхОпераций,
				Объект.НалогообложениеНДС,
				Объект.ДисконтнаяКарта,
				Объект.ПроцентСкидкиПоДисконтнойКарте);
				
		ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
		
		Если ДополнительныеПараметры.ПересчитатьТЧ Тогда
			УправлениеНебольшойФирмойКлиент.ПерезаполнитьСкидкиТабличнойЧастиПослеСчитыванияДисконтнойКарты(ЭтотОбъект, "Запасы");
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчитатьДисконтнуюКартуНажатие(Элемент)
	
	СтруктураПараметров = Новый Структура("Контрагент", Объект.Контрагент);
	ОписаниеОповещения = Новый ОписаниеОповещения("СчитатьДисконтнуюКартуНажатиеЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ДисконтныеКарты.Форма.СчитываниеДисконтнойКарты", СтруктураПараметров, ЭтотОбъект, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "Нажатие");
	
КонецПроцедуры

&НаКлиенте
Процедура СчитатьДисконтнуюКартуНажатиеЗавершение(ВозвращаемыеПараметры, Параметры) Экспорт

	Если ТипЗнч(ВозвращаемыеПараметры) = Тип("Структура") Тогда
		СчитанаДисконтнаяКарта = ВозвращаемыеПараметры.СчитанаДисконтнаяКарта;
		ВыбранаДисконтнаяКарта(ВозвращаемыеПараметры.ДисконтнаяКарта);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция  УстановитьПроцентСкидкиНаценки()
	//Для Каждого стр из объект.Запасы Цикл 
		тзЗапасы = объект.Запасы.Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(тзЗапасы.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	тзЗапасы.Партия КАК Партия,
		|	тзЗапасы.ТипНоменклатурыЗапас КАК ТипНоменклатурыЗапас,
		|	тзЗапасы.Резерв КАК Резерв,
		|	тзЗапасы.СерийныеНомера КАК СерийныеНомера,
		|	тзЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	тзЗапасы.Цена КАК Цена,
		|	тзЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
		|	тзЗапасы.Сумма КАК Сумма,
		|	тзЗапасы.СтавкаНДС КАК СтавкаНДС,
		|	тзЗапасы.СуммаНДС КАК СуммаНДС,
		|	тзЗапасы.Всего КАК Всего,
		|	тзЗапасы.Заказ КАК Заказ,
		|	ВЫРАЗИТЬ(тзЗапасы.Содержание КАК СТРОКА(200)) КАК Содержание,
		|	тзЗапасы.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
		|	тзЗапасы.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		|	тзЗапасы.КлючСвязи КАК КлючСвязи,
		|	тзЗапасы.Характеристика КАК Характеристика,
		|	тзЗапасы.СправкаБ КАК СправкаБ,
		|	тзЗапасы.Количество КАК Количество,
		|	тзЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
		|	тзЗапасы.НомерГТД КАК НомерГТД,
		|	тзЗапасы.ТоварыДляПроизводства КАК ТоварыДляПроизводства,
		|	тзЗапасы.Вес КАК Вес,
		|	тзЗапасы.Объем КАК Объем,
		|	тзЗапасы.ЭтоПодарок КАК ЭтоПодарок,
		|	тзЗапасы.СчетУчетаВыручкиОтПродажРегл КАК СчетУчетаВыручкиОтПродажРегл,
		|	тзЗапасы.НаименованиеДляРС КАК НаименованиеДляРС,
		|	тзЗапасы.Сотрудник КАК Сотрудник,
		|	тзЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	тзЗапасы.СуммаНДФЛ КАК СуммаНДФЛ,
		|	тзЗапасы.УдержаниеПенсии КАК УдержаниеПенсии,
		|	тзЗапасы.УдерживатьПенсию КАК УдерживатьПенсию,
		|	тзЗапасы.ВидНалогаНДФЛ КАК ВидНалогаНДФЛ,
		|	тзЗапасы.ВидУдержанияПФ КАК ВидУдержанияПФ,
		|	тзЗапасы.СчетДоходовБП КАК СчетДоходовБП,
		|	тзЗапасы.Себестоимость КАК Себестоимость,
		|	тзЗапасы.СуммаБезНалогов КАК СуммаБезНалогов,
		|	тзЗапасы.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	тзЗапасы.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ тзЗапасы
		|ИЗ
		|	&тзЗапасы КАК тзЗапасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыДисконтныхКартПорогиНакопительныхСкидок.Ссылка КАК Ссылка,
		|	ВидыДисконтныхКартПорогиНакопительныхСкидок.НомерСтроки КАК НомерСтроки,
		|	ВидыДисконтныхКартПорогиНакопительныхСкидок.НижняяГраница КАК НижняяГраница,
		|	ВидыДисконтныхКарт.Ссылка КАК Ссылка1,
		|	ВидыДисконтныхКартПорогиНакопительныхСкидок.Скидка КАК Скидка
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	Справочник.ВидыДисконтныхКарт.ПорогиНакопительныхСкидок КАК ВидыДисконтныхКартПорогиНакопительныхСкидок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыДисконтныхКарт КАК ВидыДисконтныхКарт
		|		ПО ВидыДисконтныхКартПорогиНакопительныхСкидок.Ссылка = ВидыДисконтныхКарт.Ссылка
		|ГДЕ
		|	ВидыДисконтныхКарт.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тзЗапасы.НомерСтроки КАК НомерСтроки,
		|	тзЗапасы.Номенклатура КАК Номенклатура,
		|	тзЗапасы.Партия КАК Партия,
		|	тзЗапасы.ТипНоменклатурыЗапас КАК ТипНоменклатурыЗапас,
		|	тзЗапасы.Резерв КАК Резерв,
		|	тзЗапасы.СерийныеНомера КАК СерийныеНомера,
		|	тзЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	тзЗапасы.Цена КАК Цена,
		|	тзЗапасы.Сумма КАК Сумма,
		|	тзЗапасы.СтавкаНДС КАК СтавкаНДС,
		|	тзЗапасы.СуммаНДС КАК СуммаНДС,
		|	тзЗапасы.Всего КАК Всего,
		|	тзЗапасы.Заказ КАК Заказ,
		|	тзЗапасы.Содержание КАК Содержание,
		|	тзЗапасы.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
		|	тзЗапасы.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		|	тзЗапасы.КлючСвязи КАК КлючСвязи,
		|	тзЗапасы.Характеристика КАК Характеристика,
		|	тзЗапасы.СправкаБ КАК СправкаБ,
		|	тзЗапасы.Количество КАК Количество,
		|	тзЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
		|	тзЗапасы.НомерГТД КАК НомерГТД,
		|	тзЗапасы.ТоварыДляПроизводства КАК ТоварыДляПроизводства,
		|	тзЗапасы.Вес КАК Вес,
		|	тзЗапасы.Объем КАК Объем,
		|	тзЗапасы.ЭтоПодарок КАК ЭтоПодарок,
		|	тзЗапасы.СчетУчетаВыручкиОтПродажРегл КАК СчетУчетаВыручкиОтПродажРегл,
		|	тзЗапасы.НаименованиеДляРС КАК НаименованиеДляРС,
		|	тзЗапасы.Сотрудник КАК Сотрудник,
		|	тзЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	тзЗапасы.СуммаНДФЛ КАК СуммаНДФЛ,
		|	тзЗапасы.УдержаниеПенсии КАК УдержаниеПенсии,
		|	тзЗапасы.УдерживатьПенсию КАК УдерживатьПенсию,
		|	тзЗапасы.ВидНалогаНДФЛ КАК ВидНалогаНДФЛ,
		|	тзЗапасы.ВидУдержанияПФ КАК ВидУдержанияПФ,
		|	тзЗапасы.СчетДоходовБП КАК СчетДоходовБП,
		|	тзЗапасы.Себестоимость КАК Себестоимость,
		|	тзЗапасы.СуммаБезНалогов КАК СуммаБезНалогов,
		|	тзЗапасы.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	СУММА(ВременнаяТаблица.НижняяГраница) КАК НижняяГраница,
		//--------------------------------------------------------------------------
		// © Шишка В.В. [11 января 2022]  НАЧАЛО
		//|	МАКСИМУМ(ВременнаяТаблица.Скидка) КАК ПроцентСкидкиНаценки
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА &ПроцентСкидкиПоДисконтнойКарте = 0
		|				ТОГДА ВременнаяТаблица.Скидка
		|			ИНАЧЕ &ПроцентСкидкиПоДисконтнойКарте
		|		КОНЕЦ) КАК ПроцентСкидкиНаценки
		// © Шишка В.В. [11 января 2022]  КОНЕЦ
		//--------------------------------------------------------------------------
		|ИЗ
		|	тзЗапасы КАК тзЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблица КАК ВременнаяТаблица
		|		ПО (ВЫБОР
		|				КОГДА тзЗапасы.Цена >= ВременнаяТаблица.НижняяГраница
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	тзЗапасы.НомерСтроки,
		|	тзЗапасы.Номенклатура,
		|	тзЗапасы.Партия,
		|	тзЗапасы.ТипНоменклатурыЗапас,
		|	тзЗапасы.Резерв,
		|	тзЗапасы.СерийныеНомера,
		|	тзЗапасы.ЕдиницаИзмерения,
		|	тзЗапасы.Цена,
		|	тзЗапасы.Сумма,
		|	тзЗапасы.СтавкаНДС,
		|	тзЗапасы.СуммаНДС,
		|	тзЗапасы.Всего,
		|	тзЗапасы.Заказ,
		|	тзЗапасы.Содержание,
		|	тзЗапасы.ПроцентАвтоматическойСкидки,
		|	тзЗапасы.СуммаАвтоматическойСкидки,
		|	тзЗапасы.КлючСвязи,
		|	тзЗапасы.Характеристика,
		|	тзЗапасы.СправкаБ,
		|	тзЗапасы.Количество,
		|	тзЗапасы.СтранаПроисхождения,
		|	тзЗапасы.НомерГТД,
		|	тзЗапасы.ТоварыДляПроизводства,
		|	тзЗапасы.Вес,
		|	тзЗапасы.Объем,
		|	тзЗапасы.ЭтоПодарок,
		|	тзЗапасы.СчетУчетаВыручкиОтПродажРегл,
		|	тзЗапасы.НаименованиеДляРС,
		|	тзЗапасы.Сотрудник,
		|	тзЗапасы.СтруктурнаяЕдиница,
		|	тзЗапасы.СуммаНДФЛ,
		|	тзЗапасы.УдержаниеПенсии,
		|	тзЗапасы.УдерживатьПенсию,
		|	тзЗапасы.ВидНалогаНДФЛ,
		|	тзЗапасы.ВидУдержанияПФ,
		|	тзЗапасы.СчетДоходовБП,
		|	тзЗапасы.Себестоимость,
		|	тзЗапасы.СуммаБезНалогов,
		|	тзЗапасы.НаправлениеДеятельности";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.ДисконтнаяКарта.Владелец);
		Запрос.УстановитьПараметр("тзЗапасы", тзЗапасы);
		//--------------------------------------------------------------------------
		// © Шишка В.В. [11 января 2022]  НАЧАЛО
		Запрос.УстановитьПараметр("ПроцентСкидкиПоДисконтнойКарте", Объект.ПроцентСкидкиПоДисконтнойКарте);
		// © Шишка В.В. [11 января 2022]  КОНЕЦ
		//--------------------------------------------------------------------------
		
		тзРезултат  = Запрос.Выполнить().Выгрузить();
		Объект.Запасы.Загрузить(тзРезултат);

КонецФункции	

#КонецОбласти

#Область ЗаполнениеОбъектов

&НаКлиенте
Процедура СохранитьДокументКакШаблон(Параметр) Экспорт
	
	ЗаполнениеОбъектовУНФКлиент.СохранитьДокументКакШаблон(Объект, ОтображаемыеРеквизиты(), Параметр);
	
КонецПроцедуры

&НаСервере
Функция ОтображаемыеРеквизиты()
	
	Возврат ЗаполнениеОбъектовУНФ.ОтображаемыеРеквизиты(ЭтотОбъект);
	
КонецФункции

#КонецОбласти

#Область КопированиеСтрокТабличныхЧастей

&НаКлиенте
Процедура ЗапасыКопироватьСтроки(Команда)
	
	КопироватьСтроки("Запасы");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыВставитьСтроки(Команда)
	
	ВставитьСтроки("Запасы");
	
КонецПроцедуры

&НаКлиенте
Процедура КопироватьСтроки(ИмяТЧ)
	
	Если КопированиеТабличнойЧастиКлиент.МожноКопироватьСтроки(Объект[ИмяТЧ], Элементы[ИмяТЧ].ТекущиеДанные) Тогда
		КоличествоСкопированных = 0;
		КопироватьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных);
		КопированиеТабличнойЧастиКлиент.ОповеститьПользователяОКопированииСтрок(КоличествоСкопированных);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьСтроки(ИмяТЧ)
	
	КоличествоСкопированных = 0;
	КоличествоВставленных = 0;
	ВставитьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных, КоличествоВставленных);
	ОбработатьВставленныеСтроки(ИмяТЧ, КоличествоВставленных);
	КопированиеТабличнойЧастиКлиент.ОповеститьПользователяОВставкеСтрок(КоличествоСкопированных, КоличествоВставленных);
	
КонецПроцедуры

&НаСервере
Процедура КопироватьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных)
	
	КопированиеТабличнойЧастиСервер.Копировать(Объект[ИмяТЧ], Элементы[ИмяТЧ].ВыделенныеСтроки, КоличествоСкопированных);
	
КонецПроцедуры

&НаСервере
Процедура ВставитьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных, КоличествоВставленных)
	
	КопированиеТабличнойЧастиСервер.Вставить(Объект, ИмяТЧ, Элементы, КоличествоСкопированных, КоличествоВставленных);
	ОбработатьВставленныеСтрокиНаСервере(ИмяТЧ, КоличествоВставленных);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВставленныеСтроки(ИмяТЧ, КоличествоВставленных)
	
	Количество = Объект[ИмяТЧ].Количество();
	
	Для Итератор = 1 По КоличествоВставленных Цикл
		
		Строка = Объект[ИмяТЧ][Количество - Итератор];
		РассчитатьСуммуВСтрокеТабличнойЧасти(Строка);
		
	КонецЦикла;
	
	ОбновитьПодвалФормы();
	РассчитатьОбъемИВесВДокументе();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВставленныеСтрокиНаСервере(ИмяТЧ, КоличествоВставленных)
	
	Количество = Объект[ИмяТЧ].Количество();
	
	Для Итератор = 1 По КоличествоВставленных Цикл
		
		Строка = Объект[ИмяТЧ][Количество - Итератор];
		
		СтруктураДанные = Новый Структура;
		СтруктураДанные.Вставить("Организация",        Объект.Организация);
		СтруктураДанные.Вставить("Номенклатура",       Строка.Номенклатура);
		СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
		
		СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
		Если НЕ ЗначениеЗаполнено(Строка.ЕдиницаИзмерения) Тогда
			Строка.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
		КонецЕсли;
		Строка.СтавкаНДС = СтруктураДанные.СтавкаНДС;
		Строка.ТипНоменклатурыЗапас = СтруктураДанные.ЭтоЗапас;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ГрупповоеИзменениеСтрок

&НаКлиенте
Процедура ЗапасыСнятьФлажки(Команда)
	УстановитьПометку(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыУстановитьФлажки(Команда)
	УстановитьПометку(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыИзменитьСтроки(Команда)
	
	ПоказатьСкрытьПанельРедактирования(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыВыполнитьДействие(Команда)
	
	ОбработатьТаблицу();
	НастроитьОформлениеПанелиРедактирования(4);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыОтменитьИзменения(Команда)
	
	ПоказатьСкрытьПанельРедактирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыИзменениеСтрокДействиеПриИзменении(Элемент)
	
	ОпределитьОбъектИзменений();
	НастроитьОформлениеПанелиРедактирования(2);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыИзменениеСтрокЗначениеПриИзменении(Элемент)
	
	НастроитьОформлениеПанелиРедактирования(3);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПометку(Пометка)
	
	Элементы.ЗапасыСнятьФлажки.Видимость = НЕ Элементы.ЗапасыСнятьФлажки.Видимость;
	Элементы.ЗапасыУстановитьФлажки.Видимость = НЕ Элементы.ЗапасыУстановитьФлажки.Видимость;
	
	Для каждого Строка Из Объект.Запасы Цикл
		Строка.Пометка = Пометка;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьСкрытьПанельРедактирования(ИзменяетДанные = Неопределено)
	
	Перем СостояниеПерехода;
	ГрупповоеИзменениеСтрокСервер.ПоказатьСкрытьПанельРедактирования(
		ЭтотОбъект,
		НаборЭлементовГрупповогоИзмененияСтрокСервер(),
		СостояниеПерехода,
		ИзменяетДанные
	);
	
	Элементы.Скидки.Доступность = (СостояниеПерехода=0);
	
	УправлениеРезервнымиКопиямиТаблицы(СостояниеПерехода, ИзменяетДанные);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеРезервнымиКопиямиТаблицы(СостояниеПерехода, ИзменяетДанные)
	
	ГрупповоеИзменениеСтрокСервер.УправлениеРезервнымиКопиями(
		ЭтотОбъект,
		Объект.Запасы,
		ЗапасыРезервнаяКопияТаблицыАдрес,
		СостояниеПерехода,
		ИзменяетДанные
	);
	
	ГрупповоеИзменениеСтрокСервер.УправлениеРезервнымиКопиями(
		ЭтотОбъект,
		Объект.СерийныеНомера,
		СерийныеНомераРезервнаяКопияТаблицыАдрес,
		СостояниеПерехода,
		ИзменяетДанные
	);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОформлениеПанелиРедактирования(Состояние, СохранитьИзменения = Неопределено)
	
	Результат = ГрупповоеИзменениеСтрокКлиент.НастроитьОформлениеПанелиРедактирования(
		ЭтотОбъект,
		НаборЭлементовГрупповогоИзмененияСтрокКлиент(),
		Состояние,
		ЗапасыИзменениеСтрокЗначение
	);
	
	Если Результат.Свойство("УстановитьСвязиПараметровВыбора") И Результат.УстановитьСвязиПараметровВыбора Тогда
		УстановитьСвязиПараметровВыбораДляЗначения();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязиПараметровВыбораДляЗначения()
	
	ГрупповоеИзменениеСтрокСервер.УстановитьСвязиПараметровВыбора(
		НаборЭлементовГрупповогоИзмененияСтрокСервер()
	);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьТекущееДействиеИзмененияСтрок()
	
	Если ЗапасыИзменениеСтрокДействие = ЗапасыИзменениеСтрокДействиеПриОткрытии Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьТекущееДействиеИзмененияСтрокСервер();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьТекущееДействиеИзмененияСтрокСервер()
	
	ГрупповоеИзменениеСтрокСервер.СохранитьНастройки(НаборЭлементовГрупповогоИзмененияСтрокСервер());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьТаблицу()
	
	ОбработатьТаблицуНаСервере();
	
	ИзменяемыеСтроки = Объект.Запасы.НайтиСтроки(Новый Структура("Пометка", Истина));
	Для каждого Строка Из ИзменяемыеСтроки Цикл
		
		Если ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент")
			ИЛИ ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ОкруглитьЦены")
			ИЛИ ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьПроцентСкидкиНаценки")
			ИЛИ ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЦеныПоВиду")
			ИЛИ ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента")
			ИЛИ ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ЗаполнитьПоФактическимОстаткамНомераГТД")
			Тогда
			
			РассчитатьСуммуВСтрокеТабличнойЧасти(Строка);
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСкидкуСуммой") Тогда
			
			РассчитатьСуммуНДС(Строка);
			Строка.Всего = Строка.Сумма + ?(Объект.СуммаВключаетНДС, 0, Строка.СуммаНДС);
			
			//Ручные скидки
			СкидкиНаценкиКлиентСервер.РассчитатьСуммуИПроцентСкидки(ЭтотОбъект);
			//Конец Ручные скидки
			
			// АвтоматическиеСкидки.
			ТребуетсяПересчетАвтоматическихСкидок = СброситьФлагСкидкиРассчитаныКлиент("РассчитатьСуммуВСтрокеТабличнойЧасти");
			
			Строка.ПроцентАвтоматическойСкидки = 0;
			Строка.СуммаАвтоматическойСкидки = 0;
			Строка.ОбщаяСуммаСкидкиБольшеСуммы = Ложь;
			// Конец АвтоматическиеСкидки
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ОкруглитьСуммы") Тогда
			
			// Цена.
			Если Строка.Количество <> 0 Тогда
				Строка.Цена = Строка.Сумма / Строка.Количество;
			КонецЕсли;
			
			// Скидка.
			Если Строка.ПроцентСкидкиНаценки = 100 Тогда
				Строка.Цена = 0;
			ИначеЕсли Строка.ПроцентСкидкиНаценки <> 0 И Строка.Количество <> 0 Тогда
				Строка.Цена = Строка.Сумма / ((1 - Строка.ПроцентСкидкиНаценки / 100) * Строка.Количество);
			КонецЕсли;
			
			РассчитатьСуммуНДС(Строка);
			Строка.Всего = Строка.Сумма + ?(Объект.СуммаВключаетНДС, 0, Строка.СуммаНДС);
				
			// АвтоматическиеСкидки.
			СброситьФлагСкидкиРассчитаныКлиент("РассчитатьСуммуВСтрокеТабличнойЧасти", "Сумма");
			
			Строка.ПроцентАвтоматическойСкидки = 0;
			Строка.СуммаАвтоматическойСкидки = 0;
			Строка.ОбщаяСуммаСкидкиБольшеСуммы = Ложь;
			// Конец АвтоматическиеСкидки
			
			//Ручная скидка - заполнение полей ввода на форме
			СкидкиНаценкиКлиентСервер.РассчитатьСуммуИПроцентСкидки(ЭтотОбъект);
			//Конец Ручная скидка
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСтавкуНДС") Тогда
			
			РассчитатьСуммуНДС(Строка);
			Строка.Всего = Строка.Сумма + ?(Объект.СуммаВключаетНДС, 0, Строка.СуммаНДС);
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству")
			ИЛИ ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам") Тогда
			
			Если Строка.Количество <> 0 Тогда
				Строка.Цена = Строка.Сумма / Строка.Количество;
			КонецЕсли;
			
			Если Строка.ПроцентСкидкиНаценки = 100 Тогда
				Строка.Сумма = 0;
			ИначеЕсли НЕ Строка.ПроцентСкидкиНаценки = 0
				И НЕ Строка.Количество = 0 Тогда
				Строка.Сумма = Строка.Сумма * (1 - Строка.ПроцентСкидкиНаценки / 100);
			КонецЕсли;
			
			РассчитатьСуммуНДС(Строка);
			Строка.Всего = Строка.Сумма + ?(Объект.СуммаВключаетНДС, 0, Строка.СуммаНДС);
			
			// АвтоматическиеСкидки.
			ТребуетсяПересчетАвтоматическихСкидок = СброситьФлагСкидкиРассчитаныКлиент("РассчитатьСуммуВСтрокеТабличнойЧасти");
			
			Строка.ПроцентАвтоматическойСкидки = 0;
			Строка.СуммаАвтоматическойСкидки = 0;
			Строка.ОбщаяСуммаСкидкиБольшеСуммы = Ложь;
			// Конец АвтоматическиеСкидки
			
		ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЗаказПоставщикуЗаказПокупателя") Тогда
			
			// АвтоматическиеСкидки
			Если СброситьФлагСкидкиРассчитаныКлиент("ЗапасыЗаказПриИзменении") Тогда
				РассчитатьСуммуВСтрокеТабличнойЧасти(Неопределено, Ложь);
			КонецЕсли;
			// Конец АвтоматическиеСкидки
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьПроцентСкидкиНаценки")
		ИЛИ ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСкидкуСуммой") Тогда
		
		ГрупповоеИзменениеСтрокКлиент.ОчиститьДействиеЗначение(ЗапасыИзменениеСтрокДействие, ЗапасыИзменениеСтрокЗначение);
	КонецЕсли;
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьТаблицуНаСервере()
	
	ГрупповоеИзменениеСтрокСервер.ОбработатьТаблицу(
		ЭтотОбъект,
		Объект.Запасы,
		ЗапасыИзменениеСтрокДействие,
		ЗапасыИзменениеСтрокОбъектИзмененийРеквизит,
		ЗапасыИзменениеСтрокЗначение,
		"ЗапасыНоменклатура"
	);
	
	Если ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
		
		ИзменяемыеСтроки = Объект.Запасы.НайтиСтроки(Новый Структура("Пометка", Истина));
		Для каждого Строка Из ИзменяемыеСтроки Цикл
			
			СтруктураДанные = Новый Структура();
			СтруктураДанные.Вставить("Организация", Объект.Организация);
			СтруктураДанные.Вставить("Номенклатура", Строка.Номенклатура);
			СтруктураДанные.Вставить("Характеристика", Строка.Характеристика);
			СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
			
			Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда
				
				СтруктураДанные.Вставить("ДатаОбработки",	 Объект.Дата);
				СтруктураДанные.Вставить("ВалютаДокумента",  Объект.ВалютаДокумента);
				СтруктураДанные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
				СтруктураДанные.Вставить("ВидЦен", Объект.ВидЦен);
				СтруктураДанные.Вставить("Коэффициент", 1);
				СтруктураДанные.Вставить("ВидСкидкиНаценки", Объект.ВидСкидкиНаценки);
			
			КонецЕсли;
			
			// ДисконтныеКарты
			СтруктураДанные.Вставить("ДисконтнаяКарта", Объект.ДисконтнаяКарта);
			СтруктураДанные.Вставить("ПроцентСкидкиПоДисконтнойКарте", Объект.ПроцентСкидкиПоДисконтнойКарте);
			// Конец ДисконтныеКарты
			
			СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
			
			Строка.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
			Если НЕ ЗначениеЗаполнено(Строка.Количество) Тогда
				Строка.Количество = 1;
			КонецЕсли;
			Строка.Цена = СтруктураДанные.Цена;
			Строка.ПроцентСкидкиНаценки = СтруктураДанные.ПроцентСкидкиНаценки;
			Строка.СтавкаНДС = СтруктураДанные.СтавкаНДС;
			Строка.Содержание = "";
			
			Строка.ТипНоменклатурыЗапас = СтруктураДанные.ЭтоЗапас;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗапасыИзменениеСтрокДействие = Перечисления.ДействияГрупповогоИзмененияСтрок.ЗаполнитьПоФактическимОстаткамНомераГТД Тогда
		
		ПараметрыПодбора = Новый Структура;
		ПараметрыПодбора.Вставить("ТаблицаЗапасы", Неопределено);
		ПараметрыПодбора.Вставить("ОстаткиПоГТД", Неопределено);
		ПараметрыПодбора.Вставить("Дата", Объект.Дата);
		ПараметрыПодбора.Вставить("Ссылка", Объект.Ссылка);
		ПараметрыПодбора.Вставить("Организация", Объект.Организация);
		ПараметрыПодбора.Вставить("ИндексТекущейСтроки", ?(ЗначениеЗаполнено(Элементы.Запасы.ТекущаяСтрока), Объект.Запасы.Индекс(Объект.Запасы.НайтиПоИдентификатору(Элементы.Запасы.ТекущаяСтрока)), 0));
		
		ГрузовыеТаможенныеДекларацииСервер.ПодготовитьТаблицуЗапасовИзТаблицыФормы(ПараметрыПодбора, Объект.Запасы);
		ГрузовыеТаможенныеДекларацииСервер.СформироватьОстаткиНомеровГТД(ПараметрыПодбора);
		ГрузовыеТаможенныеДекларацииСервер.ПеренестиОстаткиНомеровГТДВТаблицуФормы(Объект.Запасы, ПараметрыПодбора);
		
		Если ПараметрыПодбора.ИндексТекущейСтроки <> -1 Тогда
			
			СтрокаКоллекции = Объект.Запасы.Получить(ПараметрыПодбора.ИндексТекущейСтроки);
			Элементы.Запасы.ТекущаяСтрока = СтрокаКоллекции.ПолучитьИдентификатор();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗапасыИзменениеСтрокДействие = Перечисления.ДействияГрупповогоИзмененияСтрок.ПодобратьНомераГТД Тогда
		
		ПараметрыПодбора = Новый Структура;
		ПараметрыПодбора.Вставить("ТаблицаЗапасы", Неопределено);
		ПараметрыПодбора.Вставить("Организация", Объект.Организация);
		
		ГрузовыеТаможенныеДекларацииСервер.ПодготовитьТаблицуЗапасовИзТаблицыФормы(ПараметрыПодбора, Объект.Запасы);
		ГрузовыеТаможенныеДекларацииСервер.ПодобратьНомераГТДПоПредыдущимПоступлениям(ПараметрыПодбора);
		ГрузовыеТаможенныеДекларацииСервер.ПеренестиНомераГТДВТаблицуФормы(Объект.Запасы, ПараметрыПодбора);
		
	КонецЕсли;
	
	Если ЗапасыИзменениеСтрокДействие = Перечисления.ДействияГрупповогоИзмененияСтрок.ОчиститьНомераГТДИСтраныПроисхождения Тогда
		
		ГрузовыеТаможенныеДекларацииСервер.ОчиститьНомераГТДИСтраныПроисхождения(Объект.Запасы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьОбъектИзменений()
	
	Если ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент") Тогда
		
		ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Цена";
		ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыЦена";
		
	ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ОкруглитьЦены") Тогда
		
		ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Цена";
		ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыЦена";
		
	ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ОкруглитьСуммы") Тогда
		
		ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Сумма";
		ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыСумма";
		
	ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЦеныПоВиду") Тогда
		
		ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Цена";
		ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыЦена";
		
	ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьПроцентСкидкиНаценки") Тогда
		
		ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "ПроцентСкидкиНаценки";
		ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыПроцентСкидкиНаценки";
		
	ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству") Тогда
		
		ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Сумма";
		ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыСумма";
		
	ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам") Тогда
		
		ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Сумма";
		ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыСумма";
		
	ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьСтавкуНДС") Тогда
		
		ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "СтавкаНДС";
		ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыСтавкаНДС";
		
	ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УстановитьЗаказПоставщикуЗаказПокупателя") Тогда
		
		ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "Заказ";
		ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "ЗапасыЗаказ";
		
	ИначеЕсли ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.УдалитьСтроки")
		ИЛИ ЗапасыИзменениеСтрокДействие = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента") Тогда
		
		ЗапасыИзменениеСтрокОбъектИзмененийРеквизит = "";
		ЗапасыИзменениеСтрокОбъектИзмененийЭлемент = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция НаборЭлементовГрупповогоИзмененияСтрокКлиент()
	
	НаборЭлементов = Новый Структура();
	НаборЭлементов.Вставить("ИмяТЧ", "Запасы");
	НаборЭлементов.Вставить("ДокументСсылка", Объект.Ссылка);
	НаборЭлементов.Вставить("ПанельРедактирования", Элементы.ГруппаЗапасыИзменениеСтрок);
	НаборЭлементов.Вставить("КнопкаВыполнитьДействие", Элементы.ЗапасыВыполнитьДействие);
	НаборЭлементов.Вставить("КолонкаПометка", Элементы.ЗапасыПометка);
	НаборЭлементов.Вставить("КолонкаНомерСтроки", Элементы.ЗапасыНомерСтроки);
	НаборЭлементов.Вставить("Действие", ЭтотОбъект.ЗапасыИзменениеСтрокДействие);
	НаборЭлементов.Вставить("ДействиеЭлемент", Элементы.ЗапасыИзменениеСтрокДействие);
	НаборЭлементов.Вставить("Значение", ЭтотОбъект.ЗапасыИзменениеСтрокЗначение);
	НаборЭлементов.Вставить("ЗначениеЭлемент", Элементы.ЗапасыИзменениеСтрокЗначение);
	НаборЭлементов.Вставить("ОбъектИзменений", ЗапасыИзменениеСтрокОбъектИзмененийЭлемент);
	НаборЭлементов.Вставить("КолонкаОбъектИзменений", ?(ЗначениеЗаполнено(ЗапасыИзменениеСтрокОбъектИзмененийЭлемент), Элементы[ЗапасыИзменениеСтрокОбъектИзмененийЭлемент], Неопределено));
	Возврат НаборЭлементов;
	
КонецФункции

&НаСервере
Функция НаборЭлементовГрупповогоИзмененияСтрокСервер()
	
	НаборЭлементов = Новый Структура();
	НаборЭлементов.Вставить("ИмяТЧ", "Запасы");
	НаборЭлементов.Вставить("ДокументСсылка", Объект.Ссылка);
	НаборЭлементов.Вставить("ПанельРедактирования", Элементы.ГруппаЗапасыИзменениеСтрок);
	НаборЭлементов.Вставить("КнопкаВыполнитьДействие", Элементы.ЗапасыВыполнитьДействие);
	НаборЭлементов.Вставить("КолонкаПометка", Элементы.ЗапасыПометка);
	НаборЭлементов.Вставить("КолонкаНомерСтроки", Элементы.ЗапасыНомерСтроки);
	НаборЭлементов.Вставить("Действие", ЭтотОбъект.ЗапасыИзменениеСтрокДействие);
	НаборЭлементов.Вставить("ДействиеЭлемент", Элементы.ЗапасыИзменениеСтрокДействие);
	НаборЭлементов.Вставить("Значение", ЭтотОбъект.ЗапасыИзменениеСтрокЗначение);
	НаборЭлементов.Вставить("ЗначениеЭлемент", Элементы.ЗапасыИзменениеСтрокЗначение);
	НаборЭлементов.Вставить("ОбъектИзменений", ЗапасыИзменениеСтрокОбъектИзмененийЭлемент);
	НаборЭлементов.Вставить("КолонкаОбъектИзменений", ?(ЗначениеЗаполнено(ЗапасыИзменениеСтрокОбъектИзмененийЭлемент), Элементы[ЗапасыИзменениеСтрокОбъектИзмененийЭлемент], Неопределено));
	Возврат НаборЭлементов;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокДействий()
	
	РазрешеноРедактированиеЦенДокументов = УправлениеНебольшойФирмойУправлениеДоступомПовтИсп.РазрешеноРедактированиеЦенДокументов();
	
	Действия = Новый Массив;
	Если РазрешеноРедактированиеЦенДокументов Тогда
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ИзменитьЦеныНаПроцент);
	КонецЕсли;
	Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ОкруглитьЦены);
	Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ОкруглитьСуммы);
	Если РазрешеноРедактированиеЦенДокументов Тогда
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.УстановитьЦеныПоВиду);
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоКоличеству);
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.РаспределитьСуммуПоСуммам);
	КонецЕсли;
	Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.УстановитьСтавкуНДС);
	Если НЕ ЭтотОбъект.ЗаказВШапке
		И Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение")
		И Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения") Тогда
		
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.УстановитьЗаказПоставщикуЗаказПокупателя);
	КонецЕсли;
	Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ДобавитьИзДокумента);
	Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.УдалитьСтроки);
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю Тогда
		
		ГрузовыеТаможенныеДекларацииСервер.ЗаполнитьСписокДействий(Действия);
		
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСерийныеНомера") Тогда
		Действия.Добавить(Перечисления.ДействияГрупповогоИзмененияСтрок.ЗаполнитьСерийныеНомера);
	КонецЕсли;
	
	Элементы.ЗапасыИзменениеСтрокДействие.СписокВыбора.Очистить();
	Для каждого Действие Из Действия Цикл
		ДействиеОписание = ГрупповоеИзменениеСтрокСервер.ПредставлениеДействия(Действие);
		Элементы.ЗапасыИзменениеСтрокДействие.СписокВыбора.Добавить(Действие, ДействиеОписание);
	КонецЦикла;
	
	Если ЗапасыИзменениеСтрокДействие = Перечисления.ДействияГрупповогоИзмененияСтрок.УстановитьЗаказПоставщикуЗаказПокупателя
		И Действия.Найти(ЗапасыИзменениеСтрокДействие) = Неопределено Тогда
		
		ЗапасыИзменениеСтрокДействие = Неопределено;
		ГрупповоеИзменениеСтрокСервер.НастроитьИсходнуюПанельРедактирования(ЗапасыИзменениеСтрокЗначение, НаборЭлементовГрупповогоИзмененияСтрокСервер());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПометкаПриИзменении(Элемент)
	ГрупповоеИзменениеСтрокКлиент.СтрокаПометкаПриИзменении(Объект.Запасы, Элементы.ЗапасыУстановитьФлажки, Элементы.ЗапасыСнятьФлажки);
КонецПроцедуры

#КонецОбласти

#Область ОбменСGoogle

&НаКлиенте
Процедура Подключаемый_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбменСGoogleКлиент.Подключаемый_ОбработкаВыбора(
	ЭтотОбъект,
	Элемент,
	ВыбранноеЗначение,
	СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	ОбменСGoogleКлиент.Подключаемый_АвтоПодбор(
	ЭтотОбъект,
	Элемент,
	Текст,
	ДанныеВыбора,
	Параметры,
	Ожидание,
	СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ЕГАИС

&НаСервере
Процедура УстановитьДоступностьЭлементовЕГАИС()
	
	// Форма
	Если Не ЭтотОбъект.ТолькоПросмотр Тогда // проверка на доступность по дате запрета
		ЭтотОбъект.ТолькоПросмотр = Объект.ПереданВЕГАИС;
	КонецЕсли;
	
	// Шапка
	ДоступнаОтправкаЕГАИС = ПолучитьФункциональнуюОпцию("ВестиСведенияДляДекларацийПоАлкогольнойПродукции")
		И (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику"));
		
	Элементы.ФормаПередатьДанныеВЕГАИС.Видимость = ДоступнаОтправкаЕГАИС;
	Элементы.ЗапасыСправкаБ.Видимость = ДоступнаОтправкаЕГАИС;
	
	Элементы.ФормаПередатьДанныеВЕГАИС.Доступность = Объект.Проведен И НЕ Объект.ПереданВЕГАИС;
	
	Элементы.ГруппаЕГАИС.Видимость = ДоступнаОтправкаЕГАИС;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаССерийнымиНомерами

&НаКлиенте
Процедура ЗапасыСерийныеНомераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	ОткрытьПодборСерийныеНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборСерийныеНомера()
		
	ТекущиеДанныеИдентификатор = Элементы.Запасы.ТекущиеДанные.ПолучитьИдентификатор();
	ПараметрыСерийныхНомеров = ПараметрыПодбораСерийныхНомеров(ТекущиеДанныеИдентификатор);
	
	ОткрытьФорму("Обработка.ПодборСерийныхНомеров.Форма", ПараметрыСерийныхНомеров, ЭтотОбъект);

КонецПроцедуры

&НаСервере
Функция ПолучитьСерийныеНомераИзХранилища(АдресВоВременномХранилище, КлючСтроки)

	Модифицированность = Истина;
	Возврат РаботаСФормойДокумента.ПолучитьСерийныеНомераИзХранилища(Объект, АдресВоВременномХранилище, КлючСтроки);

КонецФункции

&НаСервере
Функция ПараметрыПодбораСерийныхНомеров(ТекущиеДанныеИдентификатор)
	
	Возврат РаботаСФормойДокумента.ПараметрыПодбораСерийныхНомеров(Объект, ЭтотОбъект.УникальныйИдентификатор, ТекущиеДанныеИдентификатор);
	
КонецФункции

#КонецОбласти

#Область Доставка

&НаСервере
Процедура ПрочитатьВесИОбъемЕдиницыТовара()
	
	Если Объект.Запасы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РасходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
	|	РасходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
	|	РасходнаяНакладнаяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ВТРасходнаяНакладнаяЗапасы
	|ИЗ
	|	&РасходнаяНакладнаяЗапасы КАК РасходнаяНакладнаяЗапасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТРасходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ВесИОбъемЕдиницТоваров.Вес, СпрНоменклатура.Вес * ЕСТЬNULL(СпрЕдиницыИзмерения.Коэффициент, 1)) КАК ВесЕдиницыТовара,
	|	ЕСТЬNULL(ВесИОбъемЕдиницТоваров.Объем, СпрНоменклатура.Объем * ЕСТЬNULL(СпрЕдиницыИзмерения.Коэффициент, 1)) КАК ОбъемЕдиницыТовара
	|ИЗ
	|	ВТРасходнаяНакладнаяЗапасы КАК ВТРасходнаяНакладнаяЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ВТРасходнаяНакладнаяЗапасы.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК СпрЕдиницыИзмерения
	|		ПО ВТРасходнаяНакладнаяЗапасы.ЕдиницаИзмерения = СпрЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВесИОбъемЕдиницТоваров КАК ВесИОбъемЕдиницТоваров
	|		ПО ВТРасходнаяНакладнаяЗапасы.Номенклатура = ВесИОбъемЕдиницТоваров.Номенклатура
	|			И ВТРасходнаяНакладнаяЗапасы.ЕдиницаИзмерения = ВесИОбъемЕдиницТоваров.ЕдиницаИзмерения");
	Запрос.УстановитьПараметр("РасходнаяНакладнаяЗапасы", Объект.Запасы.Выгрузить(Новый Структура("ТипНоменклатурыЗапас", Истина), "НомерСтроки, Номенклатура, ЕдиницаИзмерения"));
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВесИОбъемЕдиницыТовара = Новый Соответствие;
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ВесИОбъемЕдиницыТовара[Выборка.НомерСтроки] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ВесИОбъемЕдиницыТовара[Выборка.НомерСтроки] = Новый Структура;
		ВесИОбъемЕдиницыТовара[Выборка.НомерСтроки].Вставить("ВесЕдиницыТовара", Выборка.ВесЕдиницыТовара);
		ВесИОбъемЕдиницыТовара[Выборка.НомерСтроки].Вставить("ОбъемЕдиницыТовара", Выборка.ОбъемЕдиницыТовара);
		
	КонецЦикла;
	
	ТребуетсяРасчетВесаЗаказа = Ложь;
	ТребуетсяРасчетОбъемаЗаказа = Ложь;
	
	Для Каждого ТекСтрокаЗапасы Из Объект.Запасы Цикл
		
		Если ВесИОбъемЕдиницыТовара[ТекСтрокаЗапасы.НомерСтроки] = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТекСтрокаЗапасы.ВесЕдиницыТовара = ВесИОбъемЕдиницыТовара[ТекСтрокаЗапасы.НомерСтроки].ВесЕдиницыТовара;
		Если Не ЗначениеЗаполнено(ТекСтрокаЗапасы.Вес)
			И ЗначениеЗаполнено(ТекСтрокаЗапасы.ВесЕдиницыТовара * ТекСтрокаЗапасы.Количество) Тогда
			ТекСтрокаЗапасы.Вес = ТекСтрокаЗапасы.ВесЕдиницыТовара * ТекСтрокаЗапасы.Количество;
			ТребуетсяРасчетВесаЗаказа = Истина;
		КонецЕсли;
		
		ТекСтрокаЗапасы.ОбъемЕдиницыТовара = ВесИОбъемЕдиницыТовара[ТекСтрокаЗапасы.НомерСтроки].ОбъемЕдиницыТовара;
		Если Не ЗначениеЗаполнено(ТекСтрокаЗапасы.Объем)
			И ЗначениеЗаполнено(ТекСтрокаЗапасы.ВесЕдиницыТовара * ТекСтрокаЗапасы.Количество) Тогда
			ТекСтрокаЗапасы.Объем = ТекСтрокаЗапасы.ОбъемЕдиницыТовара * ТекСтрокаЗапасы.Количество;
			ТребуетсяРасчетОбъемаЗаказа = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТребуетсяРасчетВесаЗаказа И ЗначениеЗаполнено(Объект.Запасы.Итог("Вес")) Тогда
		Объект.Вес = Объект.Запасы.Итог("Вес");
	КонецЕсли;
	
	Если ТребуетсяРасчетОбъемаЗаказа И ЗначениеЗаполнено(Объект.Запасы.Итог("Объем")) Тогда
		Объект.Объем = Объект.Запасы.Итог("Объем");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиБиблиотек

// ЭДО
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	ЭлектронноеВзаимодействиеСлужебныйКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработчикОжиданияЭДО()
	
	ОбменСКонтрагентамиКлиент.ОбработчикОжиданияЭДО(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСостояниеЭДОНажатие(Элемент)
	
	СтандартнаяОбработка = Ложь;
	ОбменСКонтрагентамиКлиент.ОткрытьДеревоЭД(Объект.Ссылка);
	
КонецПроцедуры
// Конец ЭДО

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтотОбъект, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтотОбъект, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры

// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	
	ТоварыДобавлены = Ложь;
	Для каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл 
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаТовары = Объект.Запасы.Добавить();
		НоваяСтрокаТовары.Номенклатура = СтрокаТаблицы.Номенклатура;
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
			
			НоваяСтрокаТовары.Характеристика = СтрокаТаблицы.Характеристика;
			
		КонецЕсли;
		
		НоваяСтрокаТовары.Цена = СтрокаТаблицы.Цена;
		//Lazare_
		НоваяСтрокаТовары.Сумма = СтрокаТаблицы.Сумма;
		//_Lazare		
		НоваяСтрокаТовары.Количество = СтрокаТаблицы.Количество;
		
		Если ПолучитьФункциональнуюОпцию("УчетВРазличныхЕдиницахИзмерения") Тогда
			
			НоваяСтрокаТовары.ЕдиницаИзмерения = СтрокаТаблицы.ЕдиницаИзмерения;
			
		ИначеЕсли ЗначениеЗаполнено(НоваяСтрокаТовары.Номенклатура) Тогда
			
			НоваяСтрокаТовары.ЕдиницаИзмерения = СтрокаТаблицы.Номенклатура.ЕдиницаИзмерения;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.СтавкаНДС) Тогда
			НоваяСтрокаТовары.СтавкаНДС = СтрокаТаблицы.СтавкаНДС;
		Иначе
			НоваяСтрокаТовары.СтавкаНДС = СтрокаТаблицы.Номенклатура.СтавкаНДС;
		КонецЕсли;
		
		ТоварыДобавлены = Истина;
		
	КонецЦикла;
	
	Если ТоварыДобавлены Тогда
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(АдресЗагруженныхДанных) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных);
	
	Для каждого СтрокаТаблицы Из Объект.Запасы Цикл 
		РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТаблицы);
	КонецЦикла;
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаИзФайлаЗапасы(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
	
	НастройкиЗагрузкиДанных.Вставить("ПолноеИмяТабличнойЧасти", "РасходнаяНакладная.Запасы");
	НастройкиЗагрузкиДанных.Вставить("ИмяМакетаСШаблоном","ЗагрузкаИзФайлаЗапасы");
	НастройкиЗагрузкиДанных.Вставить("Заголовок", НСтр("ka='მარაგების ჩატვირთვა ფაილიდან';ru='Загрузка запасов из файла';en='Download the file from the reserves'"));
	НастройкиЗагрузкиДанных.Вставить("СодержаниеВидимо", Истина);
	НастройкиЗагрузкиДанных.Вставить("ПоложениеЗаказаВДокументе", Объект.ПоложениеЗаказаПокупателя);
	
	ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата(РезультатЗагрузки, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		
		Если РезультатЗагрузки.ОписаниеДействия = "ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника" Тогда
		
			ЗагрузкаДанныхИзВнешнегоИсточника.ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных.ИмяФормыЗагрузкиДанныхИзВнешнихИсточников);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, НастройкиЗагрузкиДанных);
			ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
			
		ИначеЕсли РезультатЗагрузки.ОписаниеДействия = "ОбработатьПодготовленныеДанные" Тогда
			
			ОбработатьПодготовленныеДанные(РезультатЗагрузки);
			
		КонецЕсли;
		
	Иначе
		
		ЗагрузитьИзФайлаЗавершение(РезультатЗагрузки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодготовленныеДанные(РезультатЗагрузки)
	
	Попытка
		
		НачатьТранзакцию();
		
		ТаблицаСопоставленияДанных = РезультатЗагрузки.ТаблицаСопоставленияДанных;
		Для каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
			
			ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
			Если ЗагрузкаВПриложениеВозможна Тогда
				
				НоваяСтрока = Объект.Запасы.Добавить();
				
				ИменаСвойств = "Номенклатура, Содержание, Количество, Резерв, ЕдиницаИзмерения, СтавкаНДС, Заказ,Сумма";
				Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
					
					ИменаСвойств = ИменаСвойств + ", Характеристика";
					
				КонецЕсли;
				
				Если ПолучитьФункциональнуюОпцию("ИспользоватьПартии") Тогда
					
					ИменаСвойств = ИменаСвойств + ", Партия";
					
				КонецЕсли;
				
				Если ПолучитьФункциональнуюОпцию("УчетГТД") Тогда
					
					ИменаСвойств = ИменаСвойств + ", СтранаПроисхождения, НомерГТД";
					
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы, ИменаСвойств);
				
				НоваяСтрока.ТипНоменклатурыЗапас = (НоваяСтрока.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас);
				//НоваяСтрока.Цена = СтрокаТаблицы.Цена;
				НоваяСтрока.Цена = ?( СтрокаТаблицы.Цена >0,СтрокаТаблицы.Цена,Окр(СтрокаТаблицы.Сумма/СтрокаТаблицы.Количество,2)); //+++Lazare
				ОбработатьТаблицуНаСервереВезИзм(НоваяСтрока);
				
				Если СтрокаТаблицы.Сумма = 0 Тогда //+++Lazare
				НоваяСтрока.Сумма = НоваяСтрока.Цена * СтрокаТаблицы.Количество;
				КонецЕсли; //+++Lazare
				Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
					
					Если НЕ ЗначениеЗаполнено(НоваяСтрока.СтавкаНДС) Тогда
						
						НоваяСтрока.СтавкаНДС = ?(ЗначениеЗаполнено(НоваяСтрока.Номенклатура.СтавкаНДС), НоваяСтрока.Номенклатура.СтавкаНДС, Объект.Организация.СтавкаНДСПоУмолчанию);
						
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтрокаТаблицы.СуммаНДС) Тогда
						
						НоваяСтрока.СуммаНДС = СтрокаТаблицы.СуммаНДС;
						
					Иначе
						
						СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(НоваяСтрока.СтавкаНДС);
						
						НоваяСтрока.СуммаНДС = ?(Объект.СуммаВключаетНДС, 
							НоваяСтрока.Сумма - (НоваяСтрока.Сумма) / ((СтавкаНДС + 100) / 100),
							НоваяСтрока.Сумма * СтавкаНДС / 100);
						
					КонецЕсли;
					
				Иначе
					
					НоваяСтрока.СтавкаНДС = ?(Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС,
						УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС(),
						УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль());
					
					НоваяСтрока.СуммаНДС = 0;
					
				КонецЕсли;
				
				НоваяСтрока.Всего = НоваяСтрока.Сумма + ?(Объект.СуммаВключаетНДС, 0, НоваяСтрока.СуммаНДС);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ЗаписьЖурналаРегистрации(Нстр("ka='მონაცემების ჩატვირთვა';ru='Загрузка данных';en='Loading data'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Номенклатура, , ОписаниеОшибки());
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
	// Конец УНФ
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств(Команда)
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры // Подключаемый_РедактироватьСоставСвойств()

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры // ОбновитьЭлементыДополнительныхРеквизитов()

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияГИСМ
&НаКлиенте
Процедура ТекстУведомленияОбОтгрузкеГИСМОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ИнтеграцияГИСМКлиентУНФ.ТекстУведомленияОбОтгрузкеГИСМОбработкаНавигационнойСсылки(ЭтаФорма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьТекстУведомлениеОбОтгрузкеМаркированнойПродукцииСервер()
	
	Если Объект.ЕстьМаркируемаяПродукцияГИСМ Тогда
		Элементы.ГруппаГИСМ.Видимость = Истина;
		Элементы.ТекстУведомленияОбОтгрузкеГИСМ.Видимость = Ложь;
		Элементы.СтатусГИСМ.Видимость = Ложь;
		
		Если ПустаяСтрока(Объект.СпособПродажиГИСМ) Тогда
			Элементы.ГруппаГИСМВыбор.ТекущаяСтраница = Элементы.ГруппаГИСМЭлементыВыбора;
		ИначеЕсли Объект.СпособПродажиГИСМ = "опт" Тогда
			Элементы.ГруппаГИСМВыбор.ТекущаяСтраница = Элементы.ГруппаГИСМСсылки;
			Элементы.ТекстУведомленияОбОтгрузкеГИСМ.Видимость = Истина;
			ИнтеграцияГИСМУНФ.СформироватьТекстУведомлениеОбОтгрузкеМаркированнойПродукции(ЭтаФорма);
		Иначе
			Элементы.ГруппаГИСМВыбор.ТекущаяСтраница = Элементы.ГруппаГИСМСсылки;
			Элементы.СтатусГИСМ.Видимость = Ложь;
			ОбновитьСтатусГИСМ();
		КонецЕсли;
	Иначе
		Элементы.ГруппаГИСМ.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СделатьОптовойПродажей(Команда)
	Объект.СпособПродажиГИСМ = "опт";
	СформироватьТекстУведомлениеОбОтгрузкеМаркированнойПродукцииСервер();
КонецПроцедуры

&НаКлиенте
Процедура СделатьРозничнойПродажей(Команда)
	Объект.СпособПродажиГИСМ = "роз";
	СформироватьТекстУведомлениеОбОтгрузкеМаркированнойПродукцииСервер();
КонецПроцедуры

&НаКлиенте
Процедура СтатусГИСМОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Модифицированность Тогда
		
		ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("СтатусОбработкаНавигационнойСсылкиЗавершение",
		                                                    ЭтотОбъект,
		                                                    Новый Структура("НавигационнаяСсылкаФорматированнойСтроки", НавигационнаяСсылкаФорматированнойСтроки));
		ТекстВопроса = НСтр("ka='Отчет о розничных продажах был изменен. Записать?';ru='Отчет о розничных продажах был изменен. Записать?';en='A report on retail sales has been changed. Record?'");
		ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("СтатусОбработкаНавигационнойСсылкиЗавершение",
		                                                    ЭтотОбъект,
		                                                    Новый Структура("НавигационнаяСсылкаФорматированнойСтроки", НавигационнаяСсылкаФорматированнойСтроки));
		ТекстВопроса = НСтр("ka='Отчет о розничных продажах не записан. Записать?';ru='Отчет о розничных продажах не записан. Записать?';en='A report on retail sales are not recorded. Record?'");
		ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ОбработатьНажатиеНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНажатиеНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПередатьДанные" Тогда
		
		СтандартнаяОбработка = Ложь;
		ИнтеграцияГИСМКлиент.ПодготовитьСообщениеКПередаче(
			Объект.Ссылка,
			ПредопределенноеЗначение("Перечисление.ОперацииОбменаГИСМ.ПередачаДанных"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОбработкаНавигационнойСсылкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВопроса = КодВозвратаДиалога.Да Тогда
		 Возврат;
	КонецЕсли;
	
	Если ПроверитьЗаполнение() Тогда
		Записать();
	КонецЕсли;
	
	Если Не Модифицированность И ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбработатьНажатиеНавигационнойСсылки(ДополнительныеПараметры.НавигационнаяСсылкаФорматированнойСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусГИСМ()
	
	Элементы.СтатусГИСМ.Видимость = Объект.ЕстьМаркируемаяПродукцияГИСМ;
	
	Если НЕ Объект.ЕстьМаркируемаяПродукцияГИСМ Тогда
		Возврат
	КонецЕсли;
	
	СтатусГИСМ         = Перечисления.СтатусыИнформированияГИСМ.Черновик;
	ДальнейшееДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюГИСМ.ПустаяСсылка();
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СтатусыИнформированияГИСМ.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияГИСМ.Черновик)) КАК СтатусИнформированияГИСМ,
		|	ВЫБОР
		|		КОГДА СтатусыИнформированияГИСМ.ДальнейшееДействие В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюГИСМ.ПустаяСсылка)
		|		ИНАЧЕ ЕСТЬNULL(СтатусыИнформированияГИСМ.ДальнейшееДействие, ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюГИСМ.ПередайтеДанные))
		|	КОНЕЦ КАК ДальнейшееДействие
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыИнформированияГИСМ КАК СтатусыИнформированияГИСМ
		|		ПО (СтатусыИнформированияГИСМ.Документ = РасходнаяНакладная.Ссылка)
		|ГДЕ
		|	РасходнаяНакладная.Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка",                   Объект.Ссылка);
		Запрос.УстановитьПараметр("МассивДальнейшиеДействия", ИнтеграцияГИСМ.НеотображаемыеВДокументахДальнейшиеДействия());
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			СтатусГИСМ         = Выборка.СтатусИнформированияГИСМ;
			ДальнейшееДействие = Выборка.ДальнейшееДействие;
			
		КонецЕсли;
		
	КонецЕсли;
	
	СтатусГИСМПредставление = ИнтеграцияГИСМ.ПредставлениеСтатусаГИСМ(
		СтатусГИСМ,
		ДальнейшееДействие,
		Перечисления.ДальнейшиеДействияПоВзаимодействиюГИСМ.ПередайтеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлектроннаяНакладнаяНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОчиститьСообщения();
	
	Если НЕ ПроверитьВозможностьСозданияЭЛНакладной() Тогда 
		Возврат;	
	КонецЕсли;
	
	
	ПараметрыФормы   = Новый Структура;
	массивДокументов = Новый Массив;
	массивДокументов.Добавить(Объект.Ссылка);
	ПараметрыФормы.Вставить("ДокументыОснования", массивДокументов);
	
	УправлениеНебольшойФирмойКлиент.ОткрытьЭлНакладную(ЭтотОбъект,ПараметрыФормы);
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ОбработкаНавигационнойСсылки");
КонецПроцедуры

&НаКлиенте
Функция ПроверитьВозможностьСозданияЭЛНакладной()
	
	Результат = Истина;
	Если Модифицированность Или НЕ ПроверитьЗаполнение() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ka='დოკუმენტი შეიცვალა. თავდაპირველად, საჭიროა დოკუმენტის ჩაწერა!';ru='Документ был изменен. Сначала следует записать документ!';en='The document has been changed. First, you must write the document!'");	
		Сообщение.Сообщить();
		Результат = Ложь;
	Иначе
		Результат = Истина;
	КонецЕсли;
	
	Если Результат Тогда	
		
		Если Не Объект.Проведен Тогда
			Режим = РежимДиалогаВопрос.ДаНетОтмена;			
			Ответ = Вопрос(НСтр("ka='დოკუმენტი გაუტარებელია. გნებავთ გაგრძელება?';ru='Документ не проведен. хотите продолжить?';en='The document is not posted.Do you whant to continue'"), Режим, 0);						
			Если Ответ <> КодВозвратаДиалога.Да Тогда				
				Результат = Ложь;							
			КонецЕсли; 		
		КонецЕсли;
		
	КонецЕсли;	

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВШаблонRS(Команда)
		
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Или Модифицированность Тогда
		ТекстСообщение = НСтр("ka='აუცილებელია დოკუმენტის ჩაწერა. ჩაიწეროს?';ru='Документ должен быть записан. Записать?';en='The document should be written. Record?'");
		Если Вопрос(ТекстСообщение, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Попытка
				Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
			Исключение
				Возврат;
			КонецПопытки;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	Текст = "ru = ""Таблица XLS""; en = ""XLS table""";
	Фильтр = НСтр(Текст)+"(*.xls)|*.xls";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.Заголовок = "Выберите путь для сохранения";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
	Иначе
		Текст = "Путь сохранения не выбран!";
		Предупреждение(Текст);
		Возврат;
	КонецЕсли;	
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ВыгрузитьВШаблонRS(Объект.Ссылка, ПутьКФайлу);
	
КонецПроцедуры




#КонецОбласти

#Область Штрихкоды

&НаСервереБезКонтекста
Функция ПолучитьВариантРаспознаванияШтрихкода()

	Возврат Константы.ВариантРаспознованияШтрихкода.Получить();

КонецФункции // ()

//&НаСервере
//Функция РазобратьШтрихкод(Штрихкод, ВариантРаспознаванияШтрихкода)

//	СтруктураРезультата = Неопределено;
//	Вес = 0;
//	Цена = 0;
//	
//	Если ВариантРаспознаванияШтрихкода = Перечисления.ВариантыРаспознованияШтрихкодов.Вес Тогда
//		
//		СтрокаЦелое = Сред(Штрихкод, 9, 1);
//		СтрокаДробное = Сред(Штрихкод, 10, 3);
//		
//		Попытка
//			
//			Вес = Число(СтрокаЦелое + "." + СтрокаДробное);
//			
//		Исключение
//			
//			Вес = 0;
//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
//			
//		КонецПопытки; 
//		
//		ШтрихкодДляПоиска = Сред(ШтрихКод,4,4);
//		
//	ИначеЕсли ВариантРаспознаванияШтрихкода = Перечисления.ВариантыРаспознованияШтрихкодов.Цена Тогда
//		
//		СтрокаЦелое = Сред(Штрихкод, 8, 3);
//		СтрокаДробное = Сред(Штрихкод, 11, 2);
//		
//		Попытка
//			
//			Цена = Число(СтрокаЦелое + "." + СтрокаДробное);
//			Вес = 1;
//			
//		Исключение
//			
//			Цена = 0;
//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
//			
//		КонецПопытки; 
//		
//		ШтрихкодДляПоиска = Сред(ШтрихКод,4,4);//Сред(Штрихкод,1,7) + "00000" + Сред(ШтрихКод,13,1);
//		
//	КонецЕсли; 
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	ШтрихкодыНоменклатуры.Номенклатура,
//	|	ШтрихкодыНоменклатуры.Характеристика,
//	|	ШтрихкодыНоменклатуры.ЕдиницаИзмерения,
//	|	ЕСТЬNULL(ШтрихкодыНоменклатуры.Номенклатура.ЕдиницаИзмерения.Весовая,ЛОЖЬ) КАК Весовая
//	|ИЗ
//	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
//	|ГДЕ
//	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
//	
//	Запрос.УстановитьПараметр("Штрихкод", ШтрихкодДляПоиска);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
//		
//		СтруктураРезультата = Новый Структура;
//		СтруктураРезультата.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
//		СтруктураРезультата.Вставить("Характеристика", ВыборкаДетальныеЗаписи.Характеристика);
//		СтруктураРезультата.Вставить("ЕдиницаИзмерения", ВыборкаДетальныеЗаписи.ЕдиницаИзмерения);
//		СтруктураРезультата.Вставить("Весовая", ВыборкаДетальныеЗаписи.Весовая);
//		СтруктураРезультата.Вставить("Вес", Вес);
//		СтруктураРезультата.Вставить("Цена", Цена);
//		
//	Иначе
//		
//		Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
//		
//		РезультатЗапроса = Запрос.Выполнить();
//		
//		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//		
//		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
//			
//			СтруктураРезультата = Новый Структура;
//			СтруктураРезультата.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
//			СтруктураРезультата.Вставить("Характеристика", ВыборкаДетальныеЗаписи.Характеристика);
//			СтруктураРезультата.Вставить("ЕдиницаИзмерения", ВыборкаДетальныеЗаписи.ЕдиницаИзмерения);
//			СтруктураРезультата.Вставить("Весовая", Ложь);
//			СтруктураРезультата.Вставить("Вес", 1);
//			//СтруктураРезультата.Вставить("Цена", Цена);
//			
//		КонецЕсли;		
//		
//	КонецЕсли;
//	
//	Возврат СтруктураРезультата;

//КонецФункции // ()

&НаСервере
Функция РазобратьШтрихкод(Штрихкод, ВариантРаспознаванияШтрихкода)

	СтруктураРезультата = Неопределено;
	Вес = 0;
	Цена = 0;
	
	Если ВариантРаспознаванияШтрихкода = Перечисления.ВариантыРаспознованияШтрихкодов.Вес Тогда
		
		СтрокаЦелое = Сред(Штрихкод, 9, 1);
		СтрокаДробное = Сред(Штрихкод, 10, 3);
		
		Попытка
			
			Вес = Число(СтрокаЦелое + "." + СтрокаДробное);
			
		Исключение
			
			Вес = 0;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			
		КонецПопытки; 
		
		ШтрихкодДляПоиска = Сред(ШтрихКод,4,5);//Паганини Сред(ШтрихКод,4,4)

	ИначеЕсли ВариантРаспознаванияШтрихкода = Перечисления.ВариантыРаспознованияШтрихкодов.Цена Тогда
		
		СтрокаЦелое = Сред(Штрихкод, 8, 3);
		СтрокаДробное = Сред(Штрихкод, 11, 2);
		
		Попытка
			
			Цена = Число(СтрокаЦелое + "." + СтрокаДробное);
			Вес = 1;
			
		Исключение
			
			Цена = 0;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			
		КонецПопытки; 
		
		ШтрихкодДляПоиска = Сред(ШтрихКод,4,4);//Сред(Штрихкод,1,7) + "00000" + Сред(ШтрихКод,13,1);
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика,
	|	ШтрихкодыНоменклатуры.ЕдиницаИзмерения,
	|	ЕСТЬNULL(ШтрихкодыНоменклатуры.Номенклатура.ЕдиницаИзмерения.Весовая,ЛОЖЬ) КАК Весовая
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", ШтрихкодДляПоиска);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		СтруктураРезультата = Новый Структура;
		СтруктураРезультата.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
		СтруктураРезультата.Вставить("Характеристика", ВыборкаДетальныеЗаписи.Характеристика);
		СтруктураРезультата.Вставить("ЕдиницаИзмерения", ВыборкаДетальныеЗаписи.ЕдиницаИзмерения);
		СтруктураРезультата.Вставить("Весовая", ВыборкаДетальныеЗаписи.Весовая);
		СтруктураРезультата.Вставить("Вес", Вес);
		СтруктураРезультата.Вставить("Цена", Цена);
		
	Иначе
		
		Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			СтруктураРезультата = Новый Структура;
			СтруктураРезультата.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
			СтруктураРезультата.Вставить("Характеристика", ВыборкаДетальныеЗаписи.Характеристика);
			СтруктураРезультата.Вставить("ЕдиницаИзмерения", ВыборкаДетальныеЗаписи.ЕдиницаИзмерения);
			СтруктураРезультата.Вставить("Весовая", Ложь);
			СтруктураРезультата.Вставить("Вес", 1);
			//СтруктураРезультата.Вставить("Цена", Цена);
			
		КонецЕсли;		
		
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьШтрихкодВТабличнуюЧасть(Штрихкод, ВариантРаспознаванияШтрихкода) Экспорт

	СтруктураРезультата = РазобратьШтрихкод(Штрихкод, ВариантРаспознаванияШтрихкода);
	Если СтруктураРезультата = Неопределено Тогда
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ka='Товар со штрихкодом %1 не найден!';ru='Товар со штрихкодом %1 не найден!';en='Product barcode% 1 can not be found!'"), Штрихкод);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли; 
	
	Если ВариантРаспознаванияШтрихкода = ПредопределенноеЗначение("Перечисление.ВариантыРаспознованияШтрихкодов.Вес") Тогда
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура", СтруктураРезультата.Номенклатура);
		СтруктураПоиска.Вставить("Характеристика", СтруктураРезультата.Характеристика);
		//СтруктураПоиска.Вставить("ЕдиницаИзмерения", СтруктураРезультата.ЕдиницаИзмерения);
		
		Строки = Объект.Запасы.НайтиСтроки(СтруктураПоиска);
		Если Строки.Количество() > 0 Тогда
			
			Строки[0].Количество = Строки[0].Количество + СтруктураРезультата.Вес;
			РассчитатьСуммуВСтрокеТабличнойЧасти(Строки[0]);
			
		Иначе
			
			НоваяСтрока = Объект.Запасы.Добавить();
			НоваяСтрока.Номенклатура = СтруктураРезультата.Номенклатура;
			НоваяСтрока.Характеристика = СтруктураРезультата.Характеристика;
			//НоваяСтрока.ЕдиницаИзмерения = СтруктураРезультата.ЕдиницаИзмерения;
			НоменклатураПриИзменении(НоваяСтрока);
			НоваяСтрока.Количество = СтруктураРезультата.Вес;
			РассчитатьСуммуВСтрокеТабличнойЧасти(НоваяСтрока);
			
		КонецЕсли; 
		
	ИначеЕсли ВариантРаспознаванияШтрихкода = ПредопределенноеЗначение("Перечисление.ВариантыРаспознованияШтрихкодов.Цена") Тогда
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура", СтруктураРезультата.Номенклатура);
		СтруктураПоиска.Вставить("Характеристика", СтруктураРезультата.Характеристика);
		//СтруктураПоиска.Вставить("ЕдиницаИзмерения", СтруктураРезультата.ЕдиницаИзмерения);
		
		Если СтруктураРезультата.Весовая Тогда
			
			НоваяСтрока = Объект.Запасы.Добавить();
			НоваяСтрока.Номенклатура = СтруктураРезультата.Номенклатура;
			НоваяСтрока.Характеристика = СтруктураРезультата.Характеристика;
			//НоваяСтрока.ЕдиницаИзмерения = СтруктураРезультата.ЕдиницаИзмерения;
			НоменклатураПриИзменении(НоваяСтрока);
			
			РассчитатьСуммуВСтрокеТабличнойЧасти(НоваяСтрока);
			НоваяСтрока.Сумма = СтруктураРезультата.Цена;
			НоваяСтрока.СуммаНДС = СтруктураРезультата.Цена * 0.18;
			НоваяСтрока.Количество = ?(НоваяСтрока.Цена = 0, 0, СтруктураРезультата.Цена / НоваяСтрока.Цена);
			НоваяСтрока.Всего = НоваяСтрока.Сумма;
			
		Иначе
			
			Строки = Объект.Запасы.НайтиСтроки(СтруктураПоиска);
			Если Строки.Количество() > 0 Тогда
				
				Строки[0].Количество = Строки[0].Количество + СтруктураРезультата.Вес;

				Строки[0].Цена = СтруктураРезультата.Цена;
				РассчитатьСуммуВСтрокеТабличнойЧасти(Строки[0]);
				
			Иначе
				
				НоваяСтрока = Объект.Запасы.Добавить();
				НоваяСтрока.Номенклатура = СтруктураРезультата.Номенклатура;
				НоваяСтрока.Характеристика = СтруктураРезультата.Характеристика;
				//НоваяСтрока.ЕдиницаИзмерения = СтруктураРезультата.ЕдиницаИзмерения;
				НоменклатураПриИзменении(НоваяСтрока);
				НоваяСтрока.Цена = СтруктураРезультата.Цена;
				РассчитатьСуммуВСтрокеТабличнойЧасти(НоваяСтрока);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(СтрокаТабличнойЧасти)

	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
	СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	
	Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда
		
		СтруктураДанные.Вставить("ДатаОбработки",	 Объект.Дата);
		СтруктураДанные.Вставить("ВалютаДокумента",  Объект.ВалютаДокумента);
		СтруктураДанные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
		СтруктураДанные.Вставить("ВидЦен", Объект.ВидЦен);
		СтруктураДанные.Вставить("Коэффициент", 1);
		СтруктураДанные.Вставить("ВидСкидкиНаценки", Объект.ВидСкидкиНаценки);
		
	КонецЕсли;
	
	// ДисконтныеКарты
	СтруктураДанные.Вставить("ДисконтнаяКарта", Объект.ДисконтнаяКарта);
	СтруктураДанные.Вставить("ПроцентСкидкиПоДисконтнойКарте", Объект.ПроцентСкидкиПоДисконтнойКарте);
	// Конец ДисконтныеКарты
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.СтранаПроисхождения = СтруктураДанные.СтранаПроисхождения;
	СтрокаТабличнойЧасти.НомерГТД = Неопределено;
	СтрокаТабличнойЧасти.Количество = 1;
	СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
	СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = СтруктураДанные.ПроцентСкидкиНаценки;
	СтрокаТабличнойЧасти.СтавкаНДС = СтруктураДанные.СтавкаНДС;
	СтрокаТабличнойЧасти.Содержание = "";
	
	СтрокаТабличнойЧасти.ТипНоменклатурыЗапас = СтруктураДанные.ЭтоЗапас;
	СтрокаТабличнойЧасти.НеобходимостьВводаСправкиНаАлкоголь = СтруктураДанные.ЭтоАлкогольнаяПродукция;
	
	СтрокаТабличнойЧасти.ВесЕдиницыТовара = СтруктураДанные.ВесЕдиницыТовара;
	СтрокаТабличнойЧасти.Вес = СтруктураДанные.ВесЕдиницыТовара * СтрокаТабличнойЧасти.Количество;
	СтрокаТабличнойЧасти.ОбъемЕдиницыТовара = СтруктураДанные.ОбъемЕдиницыТовара;
	СтрокаТабличнойЧасти.Объем = СтруктураДанные.ОбъемЕдиницыТовара * СтрокаТабличнойЧасти.Количество;
	
	//Серийные номера
	Для каждого ВыделеннаяСтрока Из Элементы.Запасы.ВыделенныеСтроки Цикл
		ТекущиеДанныеСтроки = Элементы.Запасы.ДанныеСтроки(ВыделеннаяСтрока);
		РаботаССерийнымиНомерамиКлиентСервер.УдалитьСерийныеНомераПоКлючуСвязи(Объект.СерийныеНомера, ТекущиеДанныеСтроки,,ИспользоватьСерийныеНомераОстатки);
	КонецЦикла;
	
	//РассчитатьСуммуВСтрокеТабличнойЧасти();
	ОбновитьПодвалФормы();
	РассчитатьОбъемИВесВДокументе();

КонецПроцедуры // ()
 

#КонецОбласти 


//Паганини
&НаКлиенте
Процедура ЗаполнитьФактуры(Команда)
	Если Объект.ФактурыАвансов.Количество() > 0 Тогда
		Ответ = Вопрос(НСТР("ka='გაგზავნილი ავანსების ა/ფ-ის ცხრილი არ არის ცარიელი. გასუფთავდეს და გაგრძელდეს?';ru='Таблица СФ Отправленных авансов не пустая. Очистить и продолжить?';en='Table SF Sent advances is not empty. Clear and continue?'"), РежимДиалогаВопрос.ОКОтмена);
		Если НЕ Ответ = КодВозвратаДиалога.ОК Тогда
			Возврат;
		КонецЕсли;
		Объект.ФактурыАвансов.Очистить();
	КонецЕсли;
	ЗаполнитьФактурыНаСервере();
	Модифицированность = Истина;
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьФактурыНаСервере()
	
	//СуммаОсталосьРаспределить = Объект.Запасы.Итог("СуммаНДС");
	
	тзПредоплаты = Объект.Предоплата.выгрузить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзПредоплата.СуммаРасчетов КАК СуммаРасчетов,
		|	тзПредоплата.Курс КАК Курс,
		|	тзПредоплата.Кратность КАК Кратность
		|ПОМЕСТИТЬ ВТ_Предоплата
		|ИЗ
		|	&тзПредоплата КАК тзПредоплата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
	 	|	ВЫБРАТЬ
		//|	ВТ_Предоплата.Ссылка КАК Ссылка,
		|	СУММА(ВТ_Предоплата.СуммаРасчетов) КАК СуммаРасчетов,
		|	СУММА(ВТ_Предоплата.СуммаРасчетов * ВТ_Предоплата.Курс / ВТ_Предоплата.Кратность) КАК СуммаРасчетовРеглПоКурсуПредоплаты
		|ПОМЕСТИТЬ ВременнаяТаблицаСуммаПредоплатыГрупп
		|ИЗ
		|	ВТ_Предоплата КАК ВТ_Предоплата
		//Документ.РасходнаяНакладная.Предоплата КАК РасходнаяНакладнаяПредоплата
		|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_Предоплата.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		//|	РасходнаяНакладная.Ссылка КАК Ссылка,
		//|	РасходнаяНакладная.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0) КАК СуммаНеОплаченаВал,
		|	&СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0) КАК СуммаНеОплаченаВал,
		//|	(РасходнаяНакладная.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0)) * РасходнаяНакладная.Курс / РасходнаяНакладная.Кратность КАК СуммаНеОплаченаРегл,
		|	(&СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0)) * &Курс / &Кратность КАК СуммаНеОплаченаРегл,
		|	ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0) КАК СуммаРасчетовВал,
		|	ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетовРеглПоКурсуПредоплаты КАК СуммаРасчетовРегл,
		//|	(РасходнаяНакладная.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0)) * РасходнаяНакладная.Курс / РасходнаяНакладная.Кратность + ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетовРеглПоКурсуПредоплаты, 0) КАК СуммаДокументаРеглПоВсемКурсам,
		|	(&СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0)) * &Курс / &Кратность + ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетовРеглПоКурсуПредоплаты, 0) КАК СуммаДокументаРеглПоВсемКурсам,
		|	ВЫБОР
		//|		КОГДА РасходнаяНакладная.СуммаДокумента = 0
		|		КОГДА &СуммаДокумента = 0
		|			ТОГДА 1
		//|		ИНАЧЕ ((РасходнаяНакладная.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0)) * РасходнаяНакладная.Курс / РасходнаяНакладная.Кратность + ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетовРеглПоКурсуПредоплаты, 0)) / РасходнаяНакладная.СуммаДокумента
		|		ИНАЧЕ ((&СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0)) * &Курс / &Кратность + ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетовРеглПоКурсуПредоплаты, 0)) / &СуммаДокумента
		|	КОНЕЦ КАК СреднийКурсДокумента,
		|	1 КАК Кратность
		|ПОМЕСТИТЬ ВременнаяТаблицаСреднегоКурсаПредоплаты
		|ИЗ
		//|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСуммаПредоплатыГрупп КАК ВременнаяТаблицаСуммаПредоплатыГрупп
		//|		ПО РасходнаяНакладная.Ссылка = ВременнаяТаблицаСуммаПредоплатыГрупп.Ссылка
		|	ВременнаяТаблицаСуммаПредоплатыГрупп КАК ВременнаяТаблицаСуммаПредоплатыГрупп
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		//|	ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка КАК Ссылка,
		|	ВременнаяТаблицаСреднегоКурсаПредоплаты.СреднийКурсДокумента КАК Курс,
		|	ВременнаяТаблицаСреднегоКурсаПредоплаты.Кратность КАК Кратность
		|ИЗ
		|	ВременнаяТаблицаСреднегоКурсаПредоплаты КАК ВременнаяТаблицаСреднегоКурсаПредоплаты";
	
	Запрос.УстановитьПараметр("тзПредоплата", 	тзПредоплаты);
	//Запрос.УстановитьПараметр("СуммаДокумента", Объект.СуммаДокумента);
	Запрос.УстановитьПараметр("СуммаДокумента", Объект.Запасы.Итог("Всего"));
	Запрос.УстановитьПараметр("Курс", 			Объект.Курс);
	Запрос.УстановитьПараметр("Кратность", 		Объект.Кратность);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	срКурс = 0;
	срКратность = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		срКурс = ВыборкаДетальныеЗаписи.Курс;
		срКратность = ВыборкаДетальныеЗаписи.Кратность;
	КонецЦикла;
	
	Если срКурс = 1 ИЛИ срКурс = 0 ИЛИ срКратность = 0 Тогда 
		СуммаОсталосьРаспределить = Объект.Запасы.Итог("СуммаНДС");
	Иначе
		
		СуммаОсталосьРаспределить = 0;
		Для Каждого Строки Из Объект.Запасы Цикл 
			
			СуммаОсталосьРаспределить = СуммаОсталосьРаспределить + ((Строки.Всего - (Строки.Всего / (1 + (Строки.СтавкаНДС.Ставка / 100)))) * срКурс / срКратность);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если СуммаОсталосьРаспределить = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаАвансов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьТаблицуАвансовФактур(Объект.Ссылка, "РасходнаяНакладная", Объект.Дата, Объект.Организация, Объект.Контрагент);
	Для Каждого Выборка ИЗ ТаблицаАвансов Цикл
		НоваяСтрока = Объект.ФактурыАвансов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Если СуммаОсталосьРаспределить <= Выборка.СуммаНДС Тогда
			НоваяСтрока.СуммаНДС = СуммаОсталосьРаспределить;
			Прервать;
		КонецЕсли;
		СуммаОсталосьРаспределить = СуммаОсталосьРаспределить - НоваяСтрока.СуммаНДС
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьФактуры(Команда)
	СтруктураАдреса = ПолучитьАдресТаблицыОстатков();
	Результат = ОткрытьФормуМодально("Документ.РасходнаяНакладная.Форма.ФормаОстаткиАвансовФактур", СтруктураАдреса);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьВыделенныеСтроки(Результат.АдресТаблицы);
	Модифицированность = Истина;
КонецПроцедуры

Процедура ЗаполнитьВыделенныеСтроки(АдресТаблицы)
	ВыделенныеСтроки = ПолучитьИзВременногоХранилища(АдресТаблицы);
	Для Каждого СтрокаТЧ ИЗ ВыделенныеСтроки Цикл
		НовСтрока = Объект.ФактурыАвансов.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТЧ);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресТаблицыОстатков()
	ТаблицаАвансов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьТаблицуАвансовФактур(Объект.Ссылка, "РасходнаяНакладная", Объект.Дата, Объект.Организация, Объект.Контрагент, Объект.ФактурыАвансов);
	Возврат Новый Структура("АдресТаблицы", ПоместитьВоВременноеХранилище(ТаблицаАвансов));
КонецФункции

//+++ Истоин
&НаСервере
Процедура ЗаполнитьСчетаБезвозмезднойПродажи()
	
	СтруктураСчетовКурсРазниц = РегистрыСведений.УчетнаяПолитикаРегл.СоздатьМенеджерЗаписи();
	СтруктураСчетовКурсРазниц.Организация = ?(НЕ ЗначениеЗаполнено(Объект.Организация), УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ПараметрыСеанса.ТекущийПользователь, "ОсновнаяОрганизация"), Объект.Организация);
	СтруктураСчетовКурсРазниц.Период = ?(НЕ ЗначениеЗаполнено(Объект.Дата), ТекущаяДата(),ОБъект.Дата);
	СтруктураСчетовКурсРазниц.Прочитать();
	
	Если СтруктураСчетовКурсРазниц.Выбран() Тогда
	
		Объект.СчетЗатратБезвозмезднойПродажи 			 = СтруктураСчетовКурсРазниц.СчетЗатратБезвозмезднойПродажи;
		Объект.СчетЗатратНДСБезвозмезднойПродажи   		 = СтруктураСчетовКурсРазниц.СчетЗатратНДСБезвозмезднойПродажи;
		Объект.СчетУчетаНалогаНаПрибыль     			 = СтруктураСчетовКурсРазниц.СчетУчетаНалогаНаПрибыль;
		Объект.СчетУчетаНалогаНаПрибыльПодлежащийОплате  = СтруктураСчетовКурсРазниц.СчетУчетаНалогаНаПрибыльПодлежащийОплате;
		Объект.СчетУчетаСвободнаяпродажа                 = СтруктураСчетовКурсРазниц.СчетУчетаСвободнаяпродажа;
		
		Объект.СчетЗатратБезвозмезднойПродажиСотрудник 	 = СтруктураСчетовКурсРазниц.СчетЗатратБезвозмезднойПродажиСотрудник;
		Объект.СчетЗатратНДСБезвозмезднойПродажиСотрудник= СтруктураСчетовКурсРазниц.СчетЗатратНДСБезвозмезднойПродажиСотрудник;
		Объект.СчетЗатратНДФЛСотрудник     				 = СтруктураСчетовКурсРазниц.СчетЗатратНДФЛСотрудник;
		Объект.СчетЗатратПФСотрудник					 = СтруктураСчетовКурсРазниц.СчетЗатратПФСотрудник;
		Объект.СчетУчетаСвободнаяпродажаСотрудник        = СтруктураСчетовКурсРазниц.СчетУчетаСвободнаяпродажаСотрудник;
		
	Иначе
		
		ПустойСчет = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПустаяСсылка");
		Объект.СчетЗатратБезвозмезднойПродажи 			= ПустойСчет;
		Объект.СчетЗатратНДСБезвозмезднойПродажи 		= ПустойСчет;
		Объект.СчетУчетаНалогаНаПрибыль 				= ПустойСчет;
		Объект.СчетУчетаНалогаНаПрибыльПодлежащийОплате = ПустойСчет;
		Объект.СчетУчетаСвободнаяпродажа                = ПустойСчет;
		
		Объект.СчетЗатратБезвозмезднойПродажиСотрудник 	 = ПустойСчет;
		Объект.СчетЗатратНДСБезвозмезднойПродажиСотрудник= ПустойСчет;
		Объект.СчетЗатратНДФЛСотрудник     				 = ПустойСчет;
		Объект.СчетЗатратПФСотрудник					 = ПустойСчет;
		
	КонецЕсли;
	
КонецПроцедуры
//--- Истгмин

&НаКлиенте
Процедура ТранпсортноеСедствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Объект.ТранпсортноеСедство = ВивестиФормуОтбораТС();
	
	ТранпсортноеСедствоПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Функция СписокТранспортныхСредств()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТранспортныеСредства.Ссылка
	               |ИЗ
	               |	Справочник.ТранспортныеСредства КАК ТранспортныеСредства
	               |ГДЕ
	               |	НЕ ТранспортныеСредства.Ссылка В(&Список)";
	
   Запрос.УстановитьПараметр("Список",ЭтотОбъект.Контрагент.ТранспортныеСредства.ВыгрузитьКолонку("ТранпсортноеСедство"));
   Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
    
КонецФункции

&НаКлиенте
Процедура ТранспортныеСредстваТранпсортноеСедствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Элементы.ТранспортныеСредства.ТекущаяСтрока.ТранпсортноеСедство = ВивестиФормуОтбораТС();
	
	ТранспортныеСредстваТранпсортноеСедствоПриИзмененииНаСервере(Элементы.ТранспортныеСредства.ТекущаяСтрока);
	
			
КонецПроцедуры

&НаКлиенте
Функция ВивестиФормуОтбораТС()
	
	СписокОтбора = СписокТранспортныхСредств();
	
	Форма = ПолучитьФорму("Справочник.ТранспортныеСредства.ФормаВыбора",,);
	
	ЭлементОтбора = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = СписокОтбора; 
	
	Возврат Форма.ОткрытьМодально();
	
КонецФункции	


&НаКлиенте
Процедура ТранспортныеСредства1ПриИзменении(Элемент)
	
	ОбновитьВидимостьТраспортныхСредств();		
		
КонецПроцедуры

Процедура ОбновитьВидимостьТраспортныхСредств()
	
	Если ПроверитьФункционалТранспортныхСредств() Тогда
		Если Объект.ПоказатьТранспортныеСредства Тогда
			Элементы.ТранпсортноеСедство.Видимость = Ложь;
			Элементы.ТранспортныеСредства.Видимость = Истина;
		Иначе
			Элементы.ТранпсортноеСедство.Видимость = Истина;
			Элементы.ТранспортныеСредства.Видимость = Ложь;
		КонецЕсли;
	Иначе 
		Элементы.ТранпсортноеСедство.Видимость = Ложь;
		Элементы.ТранспортныеСредства.Видимость = Ложь;
		Элементы.ТранспортныеСредства1.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры	

Функция ПроверитьФункционалТранспортныхСредств()
	
	Возврат Константы.ФункционалТранспортныхСредств.Получить();
	
КонецФункции	

&НаСервере
Процедура ТранпсортноеСедствоПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ТранпсортноеСедство) И  Объект.Контрагент.ТранспортныеСредства.Найти(Объект.ТранпсортноеСедство,"ТранпсортноеСедство") = Неопределено Тогда
		
		ИзмКонтрагент = Объект.Контрагент.ПолучитьОбъект();
		Стр = ИзмКонтрагент.ТранспортныеСредства.Добавить();
		Стр.ТранпсортноеСедство = Объект.ТранпсортноеСедство;
		ИзмКонтрагент.Записать();
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТранспортныеСредстваТранпсортноеСедствоПриИзмененииНаСервере(ТекСтрока)
	Если ЗначениеЗаполнено(ТекСтрока.ТранпсортноеСедство) И Контрагент.ТранспортныеСредства.Найти(ТекСтрока.ТранпсортноеСедство,"ТранпсортноеСедство") = Неопределено  Тогда
		
		ИзмКонтрагент = Объект.Контрагент.ПолучитьОбъект();
		Стр = ИзмКонтрагент.ТранспортныеСредства.Добавить();
		Стр.ТранпсортноеСедство = ТекСтрока.ТранпсортноеСедство;
		ИзмКонтрагент.Записать();
				
	КонецЕсли;
КонецПроцедуры

// Kuzmich, 12.05.2019, Заполнение типа цен из настроек склада
&НаСервере
Функция ПроверитьВидЦен()
	ПЕРЕМ РЕЗ;
	
	РЕЗ = НЕОПРЕДЕЛЕНО;
	Если Константы.ЗаполнениеТипаЦенИзНастроекСклада.Получить() Тогда
		Если ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
			Если НЕ ЗначениеЗаполнено(Объект.ВидЦен) Тогда
				Объект.ВидЦен = Объект.СтруктурнаяЕдиница.РозничныйВидЦен;
				
				СтруктураРеквизитовФормы = Новый Структура;
				
				СтруктураРеквизитовФормы.Вставить("БылиВнесеныИзменения", 			ИСТИНА);
				
				СтруктураРеквизитовФормы.Вставить("ВидЦен", 						Объект.ВидЦен);
				СтруктураРеквизитовФормы.Вставить("ВидЦенКонтрагента", 				Справочники.ВидыЦенКонтрагентов.ПустаяСсылка());
				СтруктураРеквизитовФормы.Вставить("РегистрироватьЦеныПоставщика", 	ЛОЖЬ);
				СтруктураРеквизитовФормы.Вставить("ВидСкидки",  					Объект.ВидСкидкиНаценки);
				
				СтруктураРеквизитовФормы.Вставить("ВалютаДокумента", 				Объект.ВалютаДокумента);
				СтруктураРеквизитовФормы.Вставить("НалогообложениеНДС",				Объект.НалогообложениеНДС);
				СтруктураРеквизитовФормы.Вставить("СуммаВключаетНДС", 				Объект.СуммаВключаетНДС);
				СтруктураРеквизитовФормы.Вставить("НДСВключатьВСтоимость", 			Объект.НДСВключатьВСтоимость);
				
				СтруктураРеквизитовФормы.Вставить("ВалютаРасчетов", 				ВалютаРасчетов);
				СтруктураРеквизитовФормы.Вставить("Курс", 							Объект.Курс);
				СтруктураРеквизитовФормы.Вставить("КурсРасчетов", 					Объект.Курс);
				СтруктураРеквизитовФормы.Вставить("Кратность", 						Объект.Кратность);
				СтруктураРеквизитовФормы.Вставить("КратностьРасчетов", 				Объект.Кратность);
				
				СтруктураРеквизитовФормы.Вставить("ПредВалютаДокумента", 			Объект.ВалютаДокумента);
				СтруктураРеквизитовФормы.Вставить("ПредНалогообложениеНДС", 		Объект.НалогообложениеНДС);
				СтруктураРеквизитовФормы.Вставить("ПредСуммаВключаетНДС", 			Объект.СуммаВключаетНДС);
				
				СтруктураРеквизитовФормы.Вставить("ПерезаполнитьЦены", 				ИСТИНА);
				СтруктураРеквизитовФормы.Вставить("ПересчитатьЦены", 				ИСТИНА);
				
				СтруктураРеквизитовФормы.Вставить("ПерезаполнитьСкидки",			ИСТИНА);
				СтруктураРеквизитовФормы.Вставить("ДисконтнаяКарта",  				Объект.ДисконтнаяКарта);
				СтруктураРеквизитовФормы.Вставить("ПроцентСкидкиПоДисконтнойКарте",	Объект.ПроцентСкидкиПоДисконтнойКарте);
				СтруктураРеквизитовФормы.Вставить("Контрагент",						Объект.Контрагент);
				
				РЕЗ = СтруктураРеквизитовФормы;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РЕЗ;
КонецФункции
// Kuzmich, 12.05.2019, Заполнение типа цен из настроек склада

// Kuzmich, 05.06.2019, Количество знаков после запятой в цене
Процедура УстановкаФорматовЦен()
	КонстантыКоличествоЗнаковПослеЗапятойВЦене = Константы.КоличествоЗнаковПослеЗапятойВЦене.Получить();
	СтрокаФормата = "ЧДЦ="+КонстантыКоличествоЗнаковПослеЗапятойВЦене;
	Если КонстантыКоличествоЗнаковПослеЗапятойВЦене=0 Тогда
		СтрокаФормата = "ЧДЦ=2";
	КонецЕсли;
	Элементы.ЗапасыЦена.Формат = НСтр("ru='"+СтрокаФормата+"';ka='"+СтрокаФормата+"'");
	Элементы.ЗапасыЦена.ФорматРедактирования = НСтр("ru='"+СтрокаФормата+"';ka='"+СтрокаФормата+"'");
КонецПроцедуры
// Kuzmich, 05.06.2019, Количество знаков после запятой в цене

//+++ Дмгг
&НаСервере
Процедура ЗапасыСотрудникПриИзмененииНаСервере(УИД)
	
	СтрокаЗапасов = Объект.Запасы.НайтиПоИдентификатору(УИД);
	тзДанныеСотрудника = РегистрыСведений.Сотрудники.СрезПоследних(?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата()),Новый Структура("Организация, Сотрудник", Объект.Организация, СтрокаЗапасов.Сотрудник));
	
	Если тзДанныеСотрудника.Количество() <> 0 Тогда 
		СтрокаЗапасов.СтруктурнаяЕдиница = тзДанныеСотрудника[0].СтруктурнаяЕдиница;
		СтрокаЗапасов.УдерживатьПенсию = тзДанныеСотрудника[0].УчастникПенсионногоФонда;
		СтрокаЗапасов.ВидУдержанияПФ = тзДанныеСотрудника[0].ВидУдержанияПФ;
		СтрокаЗапасов.ВидНалогаНДФЛ = тзДанныеСотрудника[0].ВидУдержанияНДФЛ;
		//СтрокаЗапасов.ВидНачисленияУдержания  = ВидНалогаНДФЛ[0].ВидНачисленияУдержания;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗапасыСотрудникПриИзменении(Элемент)  
	
	ТекСтрока = Элементы.Запасы.ТекущиеДанные;
	УИД = ТекСтрока.ПолучитьИдентификатор();
	ЗапасыСотрудникПриИзмененииНаСервере(УИД);
	// Kuzmich, 16.02.2020, Цена по себестоимости при безвозмездной продаже сотруднику
	Если (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику")) И Объект.ЦенаПоСебестоимости Тогда
		ТекСтрока.Цена = ПолучитьЦенуПоСебестоимости(ТекСтрока.ПолучитьИдентификатор());
	КонецЕсли;
	// Kuzmich, 16.02.2020, Цена по себестоимости при безвозмездной продаже сотруднику
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСчетаУдержания(Команда)
	
	ДатаФильтра = ?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата());
	ПараметрыОтрытия = Новый Структура;
	СтруктураОтбора  = Новый Структура();
	//СтруктураЗаполнения  = Новый Структура();
	
	ПараметрыОтрытия.Вставить("Отборы", СтруктураОтбора);
	
	
	АдресСтруктурыВХранилище = ПоместитьСтруктуруВХранилище();
	ПараметрыОтрытия.Вставить("АдресСтруктурыВХранилище", АдресСтруктурыВХранилище);
	
	ОткрытьФорму("Документ.РасходнаяНакладная.Форма.ФормаЗаполненияСчетовУдержаний", ПараметрыОтрытия, ЭтаФорма,,,, Новый ОписаниеОповещения("РедактироватьСчетаУдержанияЗапасовБП", ЭтотОбъект, Новый Структура("АдресСтруктурыВХранилище", АдресСтруктурыВХранилище)));
	
КонецПроцедуры
//+++ Дмгг

Функция ПоместитьСтруктуруВХранилище()
	
	Если Объект.Запасы.Количество() > 0 Тогда 
		
		ПерваяСтрокаЗапасы = Объект.Запасы[0];
		ВидНачисленияУдержания = ВидНачисленияУдержания;
		ВидНалогаНДФЛ = ПерваяСтрокаЗапасы.ВидНалогаНДФЛ;
		СчетДоходовБП = СчетДоходовБП;
		ВидУдержанияПФ = ПерваяСтрокаЗапасы.ВидУдержанияПФ;
		
	КонецЕсли;
	
	
	Возврат ПоместитьВоВременноеХранилище(
		Новый Структура("ВидНачисленияУдержания, ВидНалогаНДФЛ, СчетДоходовБП, ТолькоНеЗаполеные, ВидУдержанияПФ", ВидНачисленияУдержания, ВидНалогаНДФЛ, СчетДоходовБП, ЛОЖЬ, ВидУдержанияПФ),
		УникальныйИдентификатор
	);
	
КонецФункции

&НаКлиенте
Процедура РедактироватьСчетаУдержанияЗапасовБП(Результат, ДополнительныеПараметры) Экспорт

	АдресСтруктурыВХранилище = ДополнительныеПараметры.АдресСтруктурыВХранилище;
    
    КодВозврата = Результат;
    
    РедактироватьСчетаУдержанияЗапасовБПФрагмент(АдресСтруктурыВХранилище, КодВозврата);

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСчетаУдержанияЗапасовБПФрагмент(Знач АдресСтруктурыВХранилище, Знач КодВозврата)
    
    Если (КодВозврата = КодВозвратаДиалога.OK) Тогда
        ПолучитьСтруктуруИзХранилищаДляБП(АдресСтруктурыВХранилище);
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПолучитьСтруктуруИзХранилищаДляБП(АдресСтруктурыВХранилище)
	
	СтруктураЗаполнения = ПолучитьИзВременногоХранилища(АдресСтруктурыВХранилище);
	
	ВидНачисленияУдержания = СтруктураЗаполнения.ВидНачисленияУдержания;
	ВидНалогаНДФЛ = СтруктураЗаполнения.ВидНалогаНДФЛ;
	СчетДоходовБП = СтруктураЗаполнения.СчетДоходовБП;
	ВидУдержанияПФ = СтруктураЗаполнения.ВидУдержанияПФ;
	
	Если СтруктураЗаполнения.ТолькоНеЗаполеные Тогда 
		
		Для Каждого Строк Из Объект.Запасы Цикл 
			
			Если НЕ ЗначениеЗаполнено(ВидНачисленияУдержания) Тогда 
				ВидНачисленияУдержания = СтруктураЗаполнения.ВидНачисленияУдержания;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Строк.ВидНалогаНДФЛ) Тогда 
				Строк.ВидНалогаНДФЛ = СтруктураЗаполнения.ВидНалогаНДФЛ;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СчетДоходовБП) Тогда 
				СчетДоходовБП = СтруктураЗаполнения.СчетДоходовБП;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Строк.ВидУдержанияПФ) Тогда 
				Строк.ВидУдержанияПФ = СтруктураЗаполнения.ВидУдержанияПФ;
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого Строк Из Объект.Запасы Цикл 
			ЗаполнитьЗначенияСвойств(Строк, СтруктураЗаполнения);
		КонецЦикла;
		
		СчетДоходовБП = СтруктураЗаполнения.СчетДоходовБП;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаВключаетНалогиПриИзменении(Элемент)
	
	Для Каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл 
		
		Если Объект.ЦенаВключаетНалоги = ПредопределенноеЗначение("Перечисление.ВидВлключениеНалоговВЦену.ЦенаБезНалогов") Тогда 
			
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
			
			Если СтрокаТабличнойЧасти.Количество = 0 Тогда 
				Цена = 0;
			Иначе
				Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
			КонецЕсли;
			
			УдержаниеПенсии = ?(СтрокаТабличнойЧасти.УдерживатьПенсию ,СтрокаТабличнойЧасти.Сумма * 0.02, 0);
			СуммаНДФЛ = (СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.УдержаниеПенсии) * 0.2;
			СуммаНДС = (СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.УдержаниеПенсии - СтрокаТабличнойЧасти.СуммаНДФЛ)-(СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.УдержаниеПенсии - СтрокаТабличнойЧасти.СуммаНДФЛ)/(1 + (СтавкаНДС/100));
			
			Всего = СтрокаТабличнойЧасти.Сумма;
			
			Если СтрокаТабличнойЧасти.Количество = 0 Тогда 
				Цена = 0;
			Иначе
				СтрокаТабличнойЧасти.Цена = (СтрокаТабличнойЧасти.Сумма - УдержаниеПенсии - СуммаНДФЛ - СуммаНДС) / СтрокаТабличнойЧасти.Количество;
			КонецЕсли;
			
			//Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
			СтрокаТабличнойЧасти.СуммаНДС = СуммаНДС;//Сумма * (СтавкаНДС/100);
			
			//СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
			СтрокаТабличнойЧасти.СуммаНДФЛ = СуммаНДФЛ;//(Сумма + СтрокаТабличнойЧасти.СуммаНДС) * 1.25 - (Сумма + СтрокаТабличнойЧасти.СуммаНДС);
			
			СтрокаТабличнойЧасти.УдержаниеПенсии = УдержаниеПенсии;//(Сумма + СтрокаТабличнойЧасти.СуммаНДС + СтрокаТабличнойЧасти.СуммаНДС)/0.98*0.02;//?(СтрокаТабличнойЧасти.УдерживатьПенсию ,СтрокаТабличнойЧасти.Сумма * 0.02, 0);
			//СтрокаТабличнойЧасти.СуммаНДФЛ = (СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.УдержаниеПенсии) * 0.2;
			//СтрокаТабличнойЧасти.СуммаНДС = (СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.УдержаниеПенсии - СтрокаТабличнойЧасти.СуммаНДФЛ)-(СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.УдержаниеПенсии - СтрокаТабличнойЧасти.СуммаНДФЛ)/(1 + (СтавкаНДС/100));
			//СтрокаТабличнойЧасти.Сумма = Сумма + СтрокаТабличнойЧасти.СуммаНДС + СтрокаТабличнойЧасти.СуммаНДС + СтрокаТабличнойЧасти.УдержаниеПенсии;
			СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма;// + СтрокаТабличнойЧасти.СуммаНДС + СтрокаТабличнойЧасти.СуммаНДС + СтрокаТабличнойЧасти.УдержаниеПенсии;
			
			//СтрокаТабличнойЧасти.Цена = 
			
		ИначеЕсли Объект.ЦенаВключаетНалоги = ПредопределенноеЗначение("Перечисление.ВидВлключениеНалоговВЦену.ЦенаВключаетНалоги") Тогда 
			
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
			
			Если СтрокаТабличнойЧасти.Количество = 0 Тогда 
				СтрокаТабличнойЧасти.Цена = 0;
			Иначе
				СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
			КонецЕсли;
			
			СтрокаТабличнойЧасти.УдержаниеПенсии = ?(СтрокаТабличнойЧасти.УдерживатьПенсию ,СтрокаТабличнойЧасти.Сумма * 0.02, 0);
			СтрокаТабличнойЧасти.СуммаНДФЛ = (СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.УдержаниеПенсии) * 0.2;
			СтрокаТабличнойЧасти.СуммаНДС = (СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.УдержаниеПенсии - СтрокаТабличнойЧасти.СуммаНДФЛ)-(СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.УдержаниеПенсии - СтрокаТабличнойЧасти.СуммаНДФЛ)/(1 + (СтавкаНДС/100));
			СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыВидНалогаНДФЛПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыУдержаниеПенсииПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	ОбновитьПодвалФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыВидУдержанияПФПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	ОбновитьПодвалФормы();
	
КонецПроцедуры
// Kuzmich, 05.06.2019, Количество знаков после запятой в цене

&НаКлиенте
Процедура ОбновитьНаименованиеДляРС(СтрокаТабличнойЧасти)
	
	СтрокаТабличнойЧасти.НаименованиеДляРС = Строка(СтрокаТабличнойЧасти.Номенклатура) + " " + Строка(СтрокаТабличнойЧасти.Характеристика);	
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьТаблицуНаСервереВезИзм(Строка)
		
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Организация", Объект.Организация);
	СтруктураДанные.Вставить("Номенклатура", Строка.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", Строка.Характеристика);
	СтруктураДанные.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	
	Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда
		
		СтруктураДанные.Вставить("ДатаОбработки", Объект.Дата);
		СтруктураДанные.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
		СтруктураДанные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
		СтруктураДанные.Вставить("ВидЦен", Объект.ВидЦен);
		СтруктураДанные.Вставить("Коэффициент", 1);
		СтруктураДанные.Вставить("ВидСкидкиНаценки", Объект.ВидСкидкиНаценки);
		
	КонецЕсли;
	
	//+++ Lazare 01.10.2021
	Если ПолучитьФункционалТипЦеныНоменклатурыПоКоличеству() Тогда 						
		СтруктураДанные.Вставить ("Дата",Объект.Дата);
		ВидЦен = УправлениеНебольшойФирмойСервер.ПолучитьВидЦеныПоДиапазонуКоличестваНоменклатуры(СтруктураДанные,Строка.Количество);
		Если не ПустаяСтрока(ВидЦен) Тогда  		
			СтруктураДанные.Вставить("ВидЦен", ВидЦен);
		Иначе 
			СтруктураДанные.Вставить("ВидЦен", Объект.ВидЦен);
		КонецЕсли
	КонецЕсли;                    
	//--- Lazare_01.10.2021
	
	// ДисконтныеКарты
	СтруктураДанные.Вставить("ДисконтнаяКарта", Объект.ДисконтнаяКарта);
	СтруктураДанные.Вставить("ПроцентСкидкиПоДисконтнойКарте", Объект.ПроцентСкидкиПоДисконтнойКарте);		
	// Конец ДисконтныеКарты
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	Если Строка.Цена = 0 Тогда
		Строка.Цена = СтруктураДанные.Цена;
	КонецЕсли;
	
	Строка.НаименованиеДляРС = Строка(Строка.Номенклатура) + " " + Строка(Строка.Характеристика);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсеНаЭтоПодарок(Команда)
	    
	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	Если ТекущиеДанные.Этоподарок = Истина Тогда
		Для Каждого стр Из Объект.Запасы Цикл
			стр.ЭтоПодарок = ложь
		КонецЦикла;
		
	Иначе
		Для Каждого стр Из Объект.Запасы Цикл
			стр.ЭтоПодарок = Истина;
		КонецЦикла;		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПересчитатьКурсКратностьПриКопированииДокумента() //+++ Дмгг
	
	СтруктураКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекущаяДата(), Новый Структура("Валюта", Объект.ВалютаДокумента));
	КратностьНовый = СтруктураКурсКратность.Кратность;
	КурсНовый = СтруктураКурсКратность.Курс;
	
	Объект.Курс = КурсНовый;
	Объект.Кратность = КратностьНовый;
	
	Для каждого СтрокаТабличнойЧасти Из Объект.Предоплата Цикл
		
		КурсКон = ?(Объект.ВалютаДокумента = НациональнаяВалюта, КурсНациональнаяВалюта, Объект.Курс);
		КратностьКон = ?(Объект.ВалютаДокумента = НациональнаяВалюта, КратностьНациональнаяВалюта, Объект.Кратность);
		
		Если (СтрокаТабличнойЧасти.Курс = КурсКон) И (СтрокаТабличнойЧасти.Кратность = КратностьКон) Тогда
			СтрокаТабличнойЧасти.СуммаПлатежа = СтрокаТабличнойЧасти.СуммаРасчетов;
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТабличнойЧасти.Курс = 0 ИЛИ КурсКон = 0 ИЛИ СтрокаТабличнойЧасти.Кратность = 0 ИЛИ КратностьКон = 0 Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ka='აღმოჩენილია ვალუტის ნულოვანი კურსი. გადათვლა არ შესრულდა.';ru='Обнаружен нулевой курс валюты. Пересчет не выполнен.';en='Discovered a zero rate. Adjustment is not performed.'");
			Сообщение.Сообщить();
			СтрокаТабличнойЧасти.СуммаПлатежа = СтрокаТабличнойЧасти.СуммаРасчетов;
			Продолжить;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.СуммаПлатежа = Окр((СтрокаТабличнойЧасти.СуммаРасчетов * СтрокаТабличнойЧасти.Курс * КратностьКон) / (КурсКон * СтрокаТабличнойЧасти.Кратность), 2);
	КонецЦикла;
	
КонецПроцедуры
//N
//+++ Дмгг
//&НаКлиенте
//Процедура ЗаполнитьИтогКоличество()
//	
//	КолТоваров = 0;
//	для Каждого стр из Объект.Запасы цикл
//		КолТоваров = КолТоваров + стр.Количество;		
//	КонецЦикла;
//	Объект.КоличествоТоваров = КолТоваров;	
//	
//КонецПроцедуры
//--- Дмгг
&НаСервере
Процедура ЗаполнитьЦенуЗакупки()
	
	Для Каждого Стр Из Объект.Запасы Цикл 
		Стр.ЦенаЗакупки = ПолучитьЦенуЗакупки(Стр.Номенклатура,Стр.Характеристика);
	КонецЦикла;		
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуЗакупки(Номенклатура,Характеристика)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Закупки.Период КАК Период,
	               |	Закупки.Количество,
	               |	Закупки.Сумма
	               |ИЗ
	               |	РегистрНакопления.Закупки КАК Закупки
	               |ГДЕ
	               |	Закупки.Организация = &Организация
	               |	И Закупки.Номенклатура = &Номенклатура
	               |	И Закупки.Характеристика = &Характеристика
	               |	И Закупки.Количество <> 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",Характеристика);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сумма/Выборка.Количество;
	Иначе
		Возврат 0;
	КонецЕсли;	
	
КонецФункции	

//+++ Дмгг
&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)
	
	Если Объект.Запасы.Количество() > 0 Тогда 
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос(НСтр("ru = 'Табличная часть ""Запасы"" будет очищена. Продолжить?';"
		+ " ka = 'ცხრილური ნაწილი ""მარაგები"" გასუფთავდება ! გაგრძელდეს?'"), Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыПодбора = Новый Структура;
	
	ОткрытьФорму("Документ.РасходнаяНакладная.Форма.ФормаВыбораПодразделения", ПараметрыПодбора,,,,, Новый ОписаниеОповещения("ЗаполненияПоОстатком_БезвозмезнаяПродажаЗавершение", ЭтотОбъект, Новый Структура("ПараметрыПодбора", ПараметрыПодбора)));
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументАвтоматическогоПроизводстваПриИзменении(Элемент)
	УстановитьВидимостьДокументАвтоматическогоПроизводства();
КонецПроцедуры
//--- Дмгг

&НаКлиенте
Процедура ЗаполненияПоОстатком_БезвозмезнаяПродажаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда 
		Возврат;
	КонецЕсли;
	
	
    КодВозврата = Результат.Свойство("КодВозврата") И (Результат.КодВозврата = КодВозвратаДиалога.ОК);
	
	Если КодВозврата Тогда 
		Подразделение = Результат.Подразделение;
    	ЗаполненияПоОстатком_БезвозмезнаяПродажаФрагмент(Подразделение);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполненияПоОстатком_БезвозмезнаяПродажаФрагмент(Подразделение)

	СтавкаНДС = НЕОПРЕДЕЛЕНО;
	Если НЕ Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС") Тогда
		
		Если Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.НеОблагаетсяНДС") Тогда
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
		Иначе
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
		КонецЕсли;	
																
	Иначе
		СтавкаНДС = Объект.Организация.СтавкаНДСПоУмолчанию;
	КонецЕсли;
	
	ЗначениеСтавкиНДС = СтавкаНДС.Ставка;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиСрезПоследних.Сотрудник КАК Сотрудник,
		|	СотрудникиСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	СотрудникиСрезПоследних.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
		|	СотрудникиСрезПоследних.ВидУдержанияНДФЛ КАК ВидУдержанияНДФЛ,
		|	СотрудникиСрезПоследних.ВидУдержанияПФ КАК ВидУдержанияПФ,
		|	СотрудникиСрезПоследних.УчастникПенсионногоФонда КАК УдерживатьПенсию,
		|	1 КАК КоличествоСотрудников
		|ПОМЕСТИТЬ ВТ_Сотрудники
		|ИЗ
		|	РегистрСведений.Сотрудники.СрезПоследних(
		|			&НаДату,
		|			СтруктурнаяЕдиница В (&Подразделение)
		|				И Организация = &Организация) КАК СотрудникиСрезПоследних
		|ГДЕ
		|	СотрудникиСрезПоследних.ЗанимаемыхСтавок <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_Сотрудники.КоличествоСотрудников) КАК КоличествоСотрудников
		|ПОМЕСТИТЬ ВТ_КоличествоСотрудников
		|ИЗ
		|	ВТ_Сотрудники КАК ВТ_Сотрудники
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапасыНаСкладахОстатки.Номенклатура,
		|	ЗапасыНаСкладахОстатки.Характеристика,
		|	ЗапасыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ВТ_КоличествоСотрудников.КоличествоСотрудников
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.ЗапасыНаСкладах.Остатки(
		|			&НаДату,
		|			СтруктурнаяЕдиница = &Склад
		|				И Организация = &Организация) КАК ЗапасыНаСкладахОстатки,
		|	ВТ_КоличествоСотрудников КАК ВТ_КоличествоСотрудников
		|ГДЕ ЗапасыНаСкладахОстатки.КоличествоОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Характеристика,
		|	ЦеныНоменклатурыСрезПоследних.Цена
		|ПОМЕСТИТЬ ВТ_Цены
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&НаДату,
		|			ВидЦен = &ВидЦен
		|				И (Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						а.Номенклатура,
		|						а.Характеристика
		|					ИЗ
		|						ВТ_Остатки КАК а)) КАК ЦеныНоменклатурыСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Остатки.Номенклатура,
		|	ВТ_Остатки.Характеристика,
		|	ВТ_Остатки.КоличествоСотрудников,
		|	ВТ_Остатки.КоличествоОстаток,
		|	ВТ_Остатки.КоличествоОстаток / ВТ_Остатки.КоличествоСотрудников КАК Количество
		|ПОМЕСТИТЬ ВТ_КоличествоЗаполнения
		|ИЗ
		|	ВТ_Остатки КАК ВТ_Остатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КоличествоЗаполнения.Номенклатура,
		|	ВТ_КоличествоЗаполнения.Характеристика,
		|	ВТ_КоличествоЗаполнения.КоличествоСотрудников,
		|	ВТ_КоличествоЗаполнения.КоличествоОстаток,
		|	ВТ_КоличествоЗаполнения.Количество,
		|	ВТ_Сотрудники.Сотрудник,
		|	ВТ_Сотрудники.СтруктурнаяЕдиница,
		|	ВТ_Сотрудники.ВидУдержанияНДФЛ,
		|	ВТ_Сотрудники.ВидУдержанияПФ,
		|	ВТ_Сотрудники.УдерживатьПенсию
		|ПОМЕСТИТЬ ВТ_НомСотрудники
		|ИЗ
		|	ВТ_КоличествоЗаполнения КАК ВТ_КоличествоЗаполнения,
		|	ВТ_Сотрудники КАК ВТ_Сотрудники
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НомСотрудники.Номенклатура,
		|	ВТ_НомСотрудники.Характеристика,
		|	ВТ_НомСотрудники.КоличествоСотрудников,
		|	ВТ_НомСотрудники.КоличествоОстаток,
		|	ВТ_НомСотрудники.Количество,
		|	ВТ_НомСотрудники.Сотрудник,
		|	ВТ_НомСотрудники.СтруктурнаяЕдиница,
		|	ВТ_НомСотрудники.ВидУдержанияНДФЛ,
		|	ВТ_НомСотрудники.ВидУдержанияПФ,
		|	ВТ_Цены.Цена,
		|	ВТ_НомСотрудники.УдерживатьПенсию
		|ПОМЕСТИТЬ ВТ_ПлюсЦена
		|ИЗ
		|	ВТ_НомСотрудники КАК ВТ_НомСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
		|		ПО ВТ_НомСотрудники.Номенклатура = ВТ_Цены.Номенклатура
		|			И ВТ_НомСотрудники.Характеристика = ВТ_Цены.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПлюсЦена.Номенклатура,
		|	ВТ_ПлюсЦена.Характеристика,
		|	ВТ_ПлюсЦена.КоличествоСотрудников,
		|	ВТ_ПлюсЦена.КоличествоОстаток,
		|	ВТ_ПлюсЦена.Количество,
		|	ВТ_ПлюсЦена.Сотрудник,
		|	ВТ_ПлюсЦена.СтруктурнаяЕдиница,
		|	ВТ_ПлюсЦена.ВидУдержанияНДФЛ КАК ВидНалогаНДФЛ,
		|	ВТ_ПлюсЦена.ВидУдержанияПФ,
		|	ВТ_ПлюсЦена.Цена,
		|	ВЫБОР
		|		КОГДА &ЦенаВключаетНалоги = ЗНАЧЕНИЕ(Перечисление.ВидВлключениеНалоговВЦену.ЦенаВключаетНалоги)
		|			ТОГДА ВТ_ПлюсЦена.Количество * ВТ_ПлюсЦена.Цена - ВЫБОР
		|					КОГДА ВТ_ПлюсЦена.УдерживатьПенсию
		|						ТОГДА ВТ_ПлюсЦена.Количество * ВТ_ПлюсЦена.Цена * 0.02
		|					ИНАЧЕ 0
		|				КОНЕЦ - (ВТ_ПлюсЦена.Количество * ВТ_ПлюсЦена.Цена - ВЫБОР
		|					КОГДА ВТ_ПлюсЦена.УдерживатьПенсию
		|						ТОГДА ВТ_ПлюсЦена.Количество * ВТ_ПлюсЦена.Цена * 0.02
		|					ИНАЧЕ 0
		|				КОНЕЦ) * 0.2 - (ВТ_ПлюсЦена.Количество * ВТ_ПлюсЦена.Цена - ВЫБОР
		|					КОГДА ВТ_ПлюсЦена.УдерживатьПенсию
		|						ТОГДА ВТ_ПлюсЦена.Количество * ВТ_ПлюсЦена.Цена * 0.02
		|					ИНАЧЕ 0
		|				КОНЕЦ - (ВТ_ПлюсЦена.Количество * ВТ_ПлюсЦена.Цена - ВЫБОР
		|					КОГДА ВТ_ПлюсЦена.УдерживатьПенсию
		|						ТОГДА ВТ_ПлюсЦена.Количество * ВТ_ПлюсЦена.Цена * 0.02
		|					ИНАЧЕ 0
		|				КОНЕЦ) * 0.2) / (1 + &СтавкаНДСЗначение / 100)
		|		ИНАЧЕ ВТ_ПлюсЦена.Количество * ВТ_ПлюсЦена.Цена * &СтавкаНДСЗначение / 100
		|	КОНЕЦ КАК СуммаНДС,
		|	ВТ_ПлюсЦена.Количество * ВТ_ПлюсЦена.Цена КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВТ_ПлюсЦена.УдерживатьПенсию
		|			ТОГДА ВТ_ПлюсЦена.Количество * ВТ_ПлюсЦена.Цена * 0.02
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК УдержаниеПенсии,
		|	(ВТ_ПлюсЦена.Количество * ВТ_ПлюсЦена.Цена - ВЫБОР
		|		КОГДА ВТ_ПлюсЦена.УдерживатьПенсию
		|			ТОГДА ВТ_ПлюсЦена.Количество * ВТ_ПлюсЦена.Цена * 0.02
		|		ИНАЧЕ 0
		|	КОНЕЦ) * 0.2 КАК СуммаНДФЛ,
		|	ВТ_ПлюсЦена.Количество * ВТ_ПлюсЦена.Цена КАК Всего,
		|	&СчетДоходоаБП,
		|	ВТ_ПлюсЦена.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	&СтавкаНДС КАК СтавкаНДС
		// Kuzmich, 22.11.2020, Реквизиты УдерживатьПенсию и СчетДоходовБП в табличной части Запасы для вида операции БезвозмезднаяПродажаСотруднику в документе РасходнаяНакладная
		|	,ВТ_ПлюсЦена.УдерживатьПенсию КАК УдерживатьПенсию
		|	,&СчетДоходовБП КАК СчетДоходовБП
		// Kuzmich, 22.11.2020, Реквизиты УдерживатьПенсию и СчетДоходовБП в табличной части Запасы для вида операции БезвозмезднаяПродажаСотруднику в документе РасходнаяНакладная
		|ИЗ
		|	ВТ_ПлюсЦена КАК ВТ_ПлюсЦена";
	
	Запрос.УстановитьПараметр("ВидЦен", Объект.ВидЦен);
	Запрос.УстановитьПараметр("НаДату", ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата-1, ТекущаяДата()));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Склад", Объект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("СтавкаНДСЗначение", ЗначениеСтавкиНДС);
	Запрос.УстановитьПараметр("ЦенаВключаетНалоги", Объект.ЦенаВключаетНалоги);
	Запрос.УстановитьПараметр("СчетДоходоаБП", Объект.СчетДоходовБП);
	Запрос.УстановитьПараметр("СтавкаНДС", СтавкаНДС);
	// Kuzmich, 22.11.2020, Реквизиты УдерживатьПенсию и СчетДоходовБП в табличной части Запасы для вида операции БезвозмезднаяПродажаСотруднику в документе РасходнаяНакладная
	Запрос.УстановитьПараметр("СчетДоходовБП", Объект.СчетДоходовБП);
	// Kuzmich, 22.11.2020, Реквизиты УдерживатьПенсию и СчетДоходовБП в табличной части Запасы для вида операции БезвозмезднаяПродажаСотруднику в документе РасходнаяНакладная
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Объект.Запасы.Загрузить(РезультатЗапроса);	

КонецПроцедуры

&НаСервере
Функция ЗапасыНаправлениеДеятельностиПриИзмененииНаСервере(НаправлениеДеятельности)
	
	СчетУчетаВыручкиОтПродажРегл = НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл;
	Если НЕ ЗначениеЗаполнено(СчетУчетаВыручкиОтПродажРегл) Тогда
		СчетУчетаВыручкиОтПродажРегл = Справочники.НаправленияДеятельности.ОсновноеНаправление.СчетУчетаВыручкиОтПродажРегл;
	КонецЕсли;
	
	Возврат СчетУчетаВыручкиОтПродажРегл;
	
КонецФункции

&НаКлиенте
Процедура ЗапасыНаправлениеДеятельностиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Запасы.ТекущиеДанные;
	
	ТекущаяСтрока.СчетУчетаВыручкиОтПродажРегл = ЗапасыНаправлениеДеятельностиПриИзмененииНаСервере(ТекущаяСтрока.НаправлениеДеятельности);
	
КонецПроцедуры

// Kuzmich, 16.02.2020, Цена по себестоимости при безвозмездной продаже сотруднику
&НаСервере
Функция ПолучитьЦенуПоСебестоимости(Идентификатор)
	
	ПЕРЕМ РЕЗ;
	
	СтрокаТабличнойЧасти = Объект.Запасы.НайтиПоИдентификатору(Идентификатор);

	РЕЗ = 0;
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Характеристика) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	ЗапасыОстатки.Номенклатура,
		|	ЗапасыОстатки.Характеристика
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			,
		|			Номенклатура = &Номенклатура
		|				И Характеристика = &Характеристика
		|				И СчетУчетаРегл = &СчетУчета) КАК ЗапасыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыОстатки.Номенклатура,
		|	ЗапасыОстатки.Характеристика";
		
		Запрос.УстановитьПараметр("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
		Запрос.УстановитьПараметр("СчетУчета", СтрокаТабличнойЧасти.Номенклатура.СчетУчетаЗапасовРегл);
		Запрос.УстановитьПараметр("Характеристика", СтрокаТабличнойЧасти.Характеристика);
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	ЗапасыОстатки.Номенклатура
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			,
		|			Номенклатура = &Номенклатура
		|				И СчетУчетаРегл = &СчетУчета) КАК ЗапасыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыОстатки.Номенклатура";
		
		Запрос.УстановитьПараметр("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
		Запрос.УстановитьПараметр("СчетУчета", СтрокаТабличнойЧасти.Номенклатура.СчетУчетаЗапасовРегл);
	КонецЕсли;
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		РЕЗ =  ВыборкаДетальныеЗаписи.СуммаОстаток/ВыборкаДетальныеЗаписи.КоличествоОстаток;
		
	КонецЦикла;
	
	Возврат РЕЗ;

КонецФункции // ()

&НаКлиенте
Процедура ЦенаПоСебестоимостиПриИзменении(Элемент)
	
	Если НЕ ((Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.БезвозмезднаяПродажаСотруднику")) ИЛИ Объект.ЦенаПоСебестоимости) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
		
		СтрокаТабличнойЧасти.Цена = ПолучитьЦенуПоСебестоимости(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
		
		РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НалоговыйДокументНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОчиститьСообщения();
	
	Если НЕ ПроверитьВозможностьСозданияЭЛНакладной() Тогда 
		Возврат;	
	КонецЕсли;
	
	
	ПараметрыФормы   = Новый Структура;
	массивДокументов = Новый Массив;
	массивДокументов.Добавить(Объект.Ссылка);
	ПараметрыФормы.Вставить("ДокументыОснования", массивДокументов);
	
	УправлениеНебольшойФирмойКлиент.ОткрытьНалоговыйДокумент(ЭтотОбъект,ПараметрыФормы);
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ОбработкаНавигационнойСсылки");
КонецПроцедуры

Процедура ЗаполнитьИтогКоличество()
	
	КолТоваров = 0;
	для Каждого стр из Объект.Запасы цикл
		КолТоваров = КолТоваров + стр.Количество;		
	КонецЦикла;
	Объект.КоличествоТоваров = КолТоваров;	
	
КонецПроцедуры


&НаКлиенте
Процедура ВключитьЭтоПодарок(Команда)
	
	Для Каждого Строк Из Объект.Запасы Цикл 
		Строк.ЭтоПодарок = Истина;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ВыключитьЭтоПодарок(Команда)
	
	Для Каждого Строк Из Объект.Запасы Цикл 
		Строк.ЭтоПодарок = Ложь;
	КонецЦикла;
	
КонецПроцедуры
// Kuzmich, 16.02.2020, Цена по себестоимости при безвозмездной продаже сотруднику

//Lazare_
Функция ПолучитьФункционалТипЦеныНоменклатурыПоКоличеству()
	Возврат Константы.ТипЦеныНоменклатурыПоКоличеству.Получить();
КонецФункции

&НаКлиенте
Процедура ЗапасыСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Пар	= Новый Структура("ДатаДок" ,Объект.Дата); 
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора",Пар);
КонецПроцедуры
//_Lazare

//ПодольскийАИ #УчетПроектов 10.10.2020 {

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	ЗаполнитьПроектПоДокументу(Объект.Проект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПроектПоДокументу(ПроектЗначение = Неопределено)
	
	Если ПроектЗначение = Неопределено Тогда
		Объект.Проект = ПредопределенноеЗначение("Справочник.Проекты.БезПроекта");
	КонецЕсли;
	
	Для Каждого СтрокаЗапасы Из Объект.Запасы Цикл
		СтрокаЗапасы.Проект = Объект.Проект;
	КонецЦикла;
	
КонецПроцедуры

//ПодольскийАИ #УчетПроектов 10.10.2020 }

// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010
#Область Потери_при_сушке_GermanButcher

&НаСервере
Функция СтрокаТабличнойЧасти_Номенклатура_Усушка_СписаниеНаПотери(ИдентификаторСтроки)

	СтрокаТабличнойЧасти = Объект.Запасы.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Возврат СтрокаТабличнойЧасти.Номенклатура.Усушка_СписаниеНаПотери;

КонецФункции // ()

&НаКлиенте
Процедура КартаЛояльностиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДатаНачала = ?(Объект.Дата = НачалоДня(ТекущаяДата()), ТекущаяДата(), Объект.Дата);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуВыбораКартыЛояльностиЗавершение", ЭтотОбъект); //, Новый Структура("Отбор", СтруктураОтбора));
	ОткрытьФорму("Справочник.КартыЛояльности.ФормаВыбора", Новый Структура("Контрагент, ОтборПоКонтрагенту, ДатаНачала, ОтборПоДатеНачала, ОтборПоДатеОкончания", Контрагент, Истина, ДатаНачала, Истина, Истина), Элемент, ЭтаФорма.УникальныйИдентификатор, , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораКартыЛояльностиЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда 
		Объект.КартаЛояльности = РезультатЗакрытия;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010

//lazare -12.10.2021
Функция ОбъектМодифицирован() 
    
    Ссылка = Объект.Ссылка;
    Метаданное = Ссылка.Метаданные();
    
		    Для каждого ТЧ из Метаданное.ТабличныеЧасти Цикл
	        
	        Если Объект[ТЧ.Имя].Количество() <> Ссылка[ТЧ.Имя].Количество() Тогда
	            Возврат Истина;
	        КонецЕсли;	                    
	        Для Индекс = 0 по Объект[ТЧ.Имя].Количество()-1 Цикл
	            ОбъектСтрокаТЧ = Объект[ТЧ.Имя][Индекс];
	            СсылкаСтрокаТЧ = Ссылка[ТЧ.Имя][Индекс];
	            Для каждого РеквизитТЧ из ТЧ.Реквизиты Цикл
	                Если ОбъектСтрокаТЧ[РеквизитТЧ.Имя] <> СсылкаСтрокаТЧ[РеквизитТЧ.Имя] Тогда
	                    Возврат Истина;
	                КонецЕсли;
	            КонецЦикла;
	        КонецЦикла;
	        
	    КонецЦикла;        

	Возврат Ложь;
    
КонецФункции
//lazare -12.10.2021

&НаСервере
Процедура ПересчитатьПолеКоличествоЗапасовНаСкладеВТчЗапасы(СтруктурнаяЕдиница);
	
	Для Каждого Ст Из Объект.Запасы Цикл 	
		  Ст.КоличествоНаСкладе = УправлениеНебольшойФирмойСервер.ПолучитьКоличествоЗапасовНаСкладе(Объект.Дата,Ст.Номенклатура,Объект.Организация,СтруктурнаяЕдиница)
	КонецЦикла;
		
КонецПроцедуры
// Kuzmich, 24.09.2021, Потери при сушке, GermanButcher 2010

//+++ Lazare_21.12.2021
&НаСервере
Функция ПравоИзмененияЦеныНоменклатурыВРасходнойНакл(Номенклатура)
		
	ПравоИзмененияЦены =  ПравоИзмененияЦены(Номенклатура,Пользователи.ТекущийПользователь()) ;
	
	Если ПравоИзмененияЦены Тогда 
		Возврат Истина
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&наСервере
Функция  ПравоИзмененияЦены (Номенклатура,Пользовател)
	
	ПравоИзмененияЦены = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	 "ВЫБРАТЬ
	 |	ПравоИзмененияЦеныНоменклатурыВРасходнойНаклТабличнаяЧасть.Номенклатура КАК Номенклатура
	 |ИЗ
	 |	Справочник.ПравоИзмененияЦеныНоменклатурыВРасходнойНакл.ТабличнаяЧасть КАК ПравоИзмененияЦеныНоменклатурыВРасходнойНаклТабличнаяЧасть
	 |ГДЕ
	 |	ПравоИзмененияЦеныНоменклатурыВРасходнойНаклТабличнаяЧасть.Ссылка.Пользовател = &Пользовател
	 |	И ПравоИзмененияЦеныНоменклатурыВРасходнойНаклТабличнаяЧасть.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Пользовател",Пользовател);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура); 
	
	Резултат = Запрос.Выполнить().Выгрузить();
	
	Если  Резултат.Количество()>0 Тогда  
		 ПравоИзмененияЦены = Истина; 
	КонецЕсли;
	
	Возврат   ПравоИзмененияЦены ;
	
КонецФункции


//--- Lazare_21.12.2021
