
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ПодольскийАИ #УчетПроектов 15.12.2020 {
	ФОУчетПоПроектам = ПолучитьФункциональнуюОпцию("УчетПоПроектам");
	//ПодольскийАИ #УчетПроектов 15.12.2020 }
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
	
		Объект.ДатаНачала = НачалоМесяца(ТекущаяДата());
		Объект.ДатаОкончания = КонецМесяца(ТекущаяДата());
		//Период
		Период.ДатаНачала = Объект.ДатаНачала;
		Период.ДатаОкончания = Объект.ДатаОкончания;
		
		Объект.ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары;
		
	Иначе
		
		Период.ДатаНачала = Объект.ДатаНачала;
		Период.ДатаОкончания = Объект.ДатаОкончания;
		
	КонецЕсли;
	
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Объект.ДатаНачала); //+++ Дмгг
	
	ПредыдущаяКонечнаяДатаПериода = Период.ДатаОкончания;
	
	ЭтоРаспределениеНаТовары = Объект.ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары;
	
	//ПодольскиАИ #УчетПроектов 15.12.2020 {
	ЭтоРаспределениеПоПроектам = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам"); 
	ПрошлыйВидОперации = Объект.ВидОперации;
	//ПодольскиАИ #УчетПроектов 15.12.2020 }
	
	ИнициализироватьКомпоновщикНастроек();
	УстановитьВидимость();
		
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	//ПодольскийАИ #УчетПроектов 15.12.2020 {
	//Было---
	//Элементы.ГруппаОстаткиОтваровНаСкладе.Видимость = ЭтоРаспределениеНаТовары;
	//Элементы.ГруппаИмущество.Видимость = НЕ ЭтоРаспределениеНаТовары;
	//Стало+++
	Элементы.ГруппаОстаткиОтваровНаСкладе.Видимость = ЭтоРаспределениеНаТовары ИЛИ ЭтоРаспределениеПоПроектам;
	Элементы.ГруппаИмущество.Видимость = НЕ ЭтоРаспределениеНаТовары И НЕ ЭтоРаспределениеПоПроектам;
	////
	
	Элементы.Подразделение.Видимость = ЭтоРаспределениеНаТовары;
	Элементы.ОстаткиПоСчетамСтруктурнаяЕдиница.Видимость = ЭтоРаспределениеНаТовары;
	Элементы.Проект.Видимость = ЭтоРаспределениеПоПроектам;
	Элементы.ОстаткиПоСчетамПроект.Видимость = ЭтоРаспределениеПоПроектам;
	
	Если ФОУчетПоПроектам Тогда
		Элементы.ВидОперации.РежимВыбораИзСписка = Истина;
		
		СписокОпераций = Новый Массив;
		СписокОпераций.Добавить(Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары);
		СписокОпераций.Добавить(Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.НаИмущество);
		СписокОпераций.Добавить(Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам);
		
		Элементы.ВидОперации.СписокВыбора.ЗагрузитьЗначения(СписокОпераций);
	КонецЕсли;
	//ПодольскийАИ #УчетПроектов 15.12.2020 }
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщикНастроек()

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	// ОстаткиТоваров
	НаборыДанныхОстаткиТоваров = Новый Структура;
	
	СКД_Остатки = ДокументОбъект.ПолучитьМакет("СКД_ОстаткиТоваровНаСкладе");
	//ПодольскийАИ #УчетПроектов 16.12.2020 {
	Если Объект.ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам Тогда
		СКД_Остатки = ДокументОбъект.ПолучитьМакет("СКД_ОстаткиТоваровНаСкладеПоПроекту");
	КонецЕсли;
	//ПодольскийАИ #УчетПроектов 16.12.2020 }
	
	НастройкиОстатки = СКД_Остатки.НастройкиПоУмолчанию;
	
	АдресВоВременномХранилищеОстатки = ПоместитьВоВременноеХранилище(СКД_Остатки, УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВоВременномХранилищеОстатки);
	КомпоновщикНастроекОстаткиТовары.Инициализировать(ИсточникНастроек);	
	КомпоновщикНастроекОстаткиТовары.ЗагрузитьНастройки(СКД_Остатки.НастройкиПоУмолчанию);
	
	// ОборотыСчетов
	НаборыДанныхОборотыСчетов = Новый Структура;
	
	СКД_Обороты = ДокументОбъект.ПолучитьМакет("СКД_ОборотыПоСчетам");
	//ПодольскийАИ #УчетПроектов 15.12.2020 {
	Если Объект.ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам Тогда
		СКД_Обороты = ДокументОбъект.ПолучитьМакет("СКД_ОборотыПоСчетамПроектов");
	КонецЕсли;
	//ПодольскийАИ #УчетПроектов 15.12.2020 }
	
	НастройкиОбороты = СКД_Обороты.НастройкиПоУмолчанию;
	
	АдресВоВременномХранилищеОбороты = ПоместитьВоВременноеХранилище(СКД_Обороты, УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВоВременномХранилищеОбороты);
	КомпоновщикНастроекОборотыПоСчетам.Инициализировать(ИсточникНастроек);	
	КомпоновщикНастроекОборотыПоСчетам.ЗагрузитьНастройки(СКД_Обороты.НастройкиПоУмолчанию);

КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "НачалоВыбора");
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Объект.ДатаНачала = Период.ДатаНачала;
	Объект.ДатаОкончания = Период.ДатаОкончания;
	
	Если НЕ Объект.Проведен Тогда 
		ПредыдущаяКонечнаяДатаПериода = Период.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткиПоТоварамНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	//Получаем схему из макета
		
	НаборыДанных = Новый Структура;
		
	СхемаКомпоновкиДанных = ДокументОбъект.ПолучитьМакет("СКД_ОстаткиТоваровНаСкладе");
	//ПодольскийАИ #УчетПроектов 16.12.2020 {
	Если Объект.ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам Тогда
		СхемаКомпоновкиДанных = ДокументОбъект.ПолучитьМакет("СКД_ОстаткиТоваровНаСкладеПоПроекту");
	КонецЕсли;
	//ПодольскийАИ #УчетПроектов 16.12.2020 }
	
	Настройки = КомпоновщикНастроекОстаткиТовары.ПолучитьНастройки();//Настройки;
	
	//установка параметров отчета, без КомпоновщикНастроекКомпоновкиДанных делать это гораздо сложнее
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаДату", Объект.ДатаОкончания);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", Объект.Организация);
	
	//ПодольскийАИ #УчетПроектов 22.12.2020 {
	Если Объект.ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам Тогда
		ТаблицаПосчетам = Объект.ОстаткиПоСчетам.Выгрузить( , "Проект");
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СписокПроектов", ТаблицаПосчетам.ВыгрузитьКолонку("Проект"));
	КонецЕсли;
	//ПодольскийАИ #УчетПроектов 22.12.2020 }
	
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	
	ЕстьНоменклатураОтбора = ЛОЖЬ;
	МассивНоменклатур = Номенклатура.ВыгрузитьЗначения();
	ЕстьНоменклатураОтбора = МассивНоменклатур.Количество() > 0; 
	
	ЕстьСкладыОтбора = ЛОЖЬ;
	МассивСкладов = Склад.ВыгрузитьЗначения();
	ЕстьСкладыОтбора = МассивСкладов.Количество() > 0;
	
	Для Каждого ЭлемОтбора Из Настройки.Отбор.Элементы Цикл 
		
		Если ЭлемОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура") Тогда 
			Если ЕстьНоменклатураОтбора Тогда 
				ЭлемОтбора.Использование = Истина;
				ЭлемОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				ЭлемОтбора.ПравоеЗначение = МассивНоменклатур;
			Иначе
				ЭлемОтбора.Использование = Ложь;
				ЭлемОтбора.ПравоеЗначение = Справочники.Номенклатура.ПустаяСсылка();
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Если ЭлемОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтруктурнаяЕдиница") Тогда 
			Если ЕстьСкладыОтбора Тогда 
				ЭлемОтбора.Использование = Истина;
				ЭлемОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				ЭлемОтбора.ПравоеЗначение = МассивСкладов;
			Иначе
				ЭлемОтбора.Использование = Ложь;
				ЭлемОтбора.ПравоеЗначение = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	//Помещаем в переменную данные о расшифровке данных - здесь ненужный пункт, но пусть будет.
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки, ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);

	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТаблицаИзСКД = ТаблицаИзСКДОстатки.Выгрузить();
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаИзСКД);

	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Объект.ОстаткиТоваровНаСкладе.Очистить();
	Для Каждого Строк Из ТаблицаИзСКД Цикл
		
		НовСтрокОстатокТоваров = Объект.ОстаткиТоваровНаСкладе.Добавить();
		
		НовСтрокОстатокТоваров.Отметка 				= Истина;
		НовСтрокОстатокТоваров.СтруктурнаяЕдиница 	= Строк.СтруктурнаяЕдиница;
		НовСтрокОстатокТоваров.Номенклатура 		= Строк.Номенклатура;
		НовСтрокОстатокТоваров.Характеристика 		= Строк.Характеристика;
		НовСтрокОстатокТоваров.Количество 			= Строк.Количество;
		НовСтрокОстатокТоваров.СуммаРасходов 		= 0;
		НовСтрокОстатокТоваров.Себистоимость 		= Строк.Себистоимость;
		
		//ПодольскийАИ #УчетПроектов 24.12.2020 {
		Если ЭтоРаспределениеПоПроектам Тогда
			НовСтрокОстатокТоваров.Проект	= Строк.Проект;
		КонецЕсли;
		//ПодольскийАИ #УчетПроектов 24.12.2020 }
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстаткиПоТоварам(Команда)
	
	Если Объект.Проведен И ПредыдущаяКонечнаяДатаПериода < Период.ДатаОкончания Тогда 
		Режим = РежимДиалогаВопрос.ДаНет;
		
		Ответ = Вопрос(НСтр("ru='Перед заполнением ""таблица остатков"" требуется распровести документ. Продолжить?';"
							+ " ka = 'შევსების შემდეგ ცხრილური ნაწილი ""მარაგები"" გასუფთავდება. გაგრძელდეს ?'"), Режим, 0);
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			РаспровестиДокумент();
		КонецЕсли;
		
	КонецЕсли;

	Режим = РежимДиалогаВопрос.ДаНет;
	Если Объект.ОстаткиТоваровНаСкладе.Количество() <> 0 Тогда 
		
		Ответ = Вопрос(НСтр("ru='Перед заполнением ""таблица остатков"" будет очищена. Продолжить?';"
		+ " ka = 'შევსების შემდეგ ცხრილური ნაწილი ""მარაგები"" გასუფთავდება. გაგრძელდეს ?'"), Режим, 0);
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			ЗаполнитьОстаткиПоТоварамНаСервере();
		КонецЕсли;
		
	Иначе
		ЗаполнитьОстаткиПоТоварамНаСервере();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура РаспровестиДокумент()

	Попытка
		
		ДокОбъект = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.РасспределениеЗатратНаТовары"));
		
		ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
		ЗначениеВданныеФормы(ДокОбъект,Объект);
		
		ПредыдущаяКонечнаяДатаПериода = Период.ДатаОкончания;
		
	Исключение
		
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткиПоСчетамНаСервере()

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	//Получаем схему из макета
		
	НаборыДанных = Новый Структура;
	
	СхемаКомпоновкиДанных = ДокументОбъект.ПолучитьМакет("СКД_ОборотыПоСчетам");
	//ПодольскийАИ #УчетПроектов 15.12.2020 {
	Если Объект.ВидОперации = Перечисления.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам Тогда
		СхемаКомпоновкиДанных = ДокументОбъект.ПолучитьМакет("СКД_ОборотыПоСчетамПроектов");
	КонецЕсли;
	//ПодольскийАИ #УчетПроектов 15.12.2020 }
	
	Настройки = КомпоновщикНастроекОборотыПоСчетам.ПолучитьНастройки();//Настройки;
	
	//установка параметров отчета, без КомпоновщикНастроекКомпоновкиДанных делать это гораздо сложнее
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала", ?(ЗначениеЗаполнено(Период.ДатаНачала), Период.ДатаНачала, Дата('00010101')));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", ?(ЗначениеЗаполнено(Период.ДатаОкончания), Период.ДатаОкончания, Дата('39990101')));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", Объект.Организация);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	
	ЕстьСчетаОтбора = ЛОЖЬ;
	МассивСчетов = СчетаУчетаРегл.ВыгрузитьЗначения();
	ЕстьСчетаОтбора = МассивСчетов.Количество() > 0; 
	
	ЕстьПодразделениеОтбора = ЛОЖЬ;
	МассивПодразделений = Подразделение.ВыгрузитьЗначения();
	ЕстьПодразделениеОтбора = МассивПодразделений.Количество() > 0;
	
	//ПодольскийАИ #УчетПроектов 15.12.2020 {
	ЕстьПроектОтбора = ЛОЖЬ;
	МассивПроектов = Проект.ВыгрузитьЗначения();
	ЕстьПроектОтбора = МассивПроектов.Количество() > 0;
	//ПодольскийАИ #УчетПроектов 15.12.2020 }
	
	Для Каждого ЭлемОтбора Из Настройки.Отбор.Элементы Цикл 
		
		//ПодольскийАИ #УчетПроектов 15.12.2020 {
		Если ЭтоРаспределениеПоПроектам Тогда
			Если ЭлемОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Проект") Тогда 
				Если ЕстьПроектОтбора Тогда 
					ЭлемОтбора.Использование = Истина;
					ЭлемОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					ЭлемОтбора.ПравоеЗначение = МассивПроектов;
				Иначе
					ЭлемОтбора.Использование = Ложь;
					ЭлемОтбора.ПравоеЗначение = Справочники.Проекты.ПустаяСсылка();
				КонецЕсли;
				Продолжить;
			КонецЕсли;
		//ПодольскийАИ #УчетПроектов 15.12.2020 }
		
		ИначеЕсли ЭлемОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение") Тогда 
			Если ЕстьПодразделениеОтбора Тогда 
				ЭлемОтбора.Использование = Истина;
				ЭлемОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				ЭлемОтбора.ПравоеЗначение = МассивПодразделений;
			Иначе
				ЭлемОтбора.Использование = Ложь;
				ЭлемОтбора.ПравоеЗначение = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Если ЭлемОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СчетУчета") Тогда 
			Если ЕстьСчетаОтбора Тогда 
				ЭлемОтбора.Использование = Истина;
				ЭлемОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				ЭлемОтбора.ПравоеЗначение = МассивСчетов;
			Иначе
				ЭлемОтбора.Использование = Ложь;
				ЭлемОтбора.ПравоеЗначение = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	//Помещаем в переменную данные о расшифровке данных - здесь ненужный пункт, но пусть будет.
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки, ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);

	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТаблицаИзСКД = ТаблицаИзСКДОбороты.Выгрузить();
	ТаблицаИзСКД.Очистить();
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаИзСКД);

	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	объект.ОстаткиПоСчетам.Очистить();
	объект.ОстаткиТоваровНаСкладе.Очистить();
	Для Каждого Строк Из ТаблицаИзСКД Цикл
		
		НовСтрокОстатокТоваров = Объект.ОстаткиПоСчетам.Добавить();
		
		НовСтрокОстатокТоваров.СчетУчета			= Строк.СчетУчета;
		НовСтрокОстатокТоваров.Сумма				= Строк.Сумма;
		
		//ПодольскийАИ #учетПроектов 15.12.2020 {
		//Было---
		//НовСтрокОстатокТоваров.СтруктурнаяЕдиница	= Строк.Подразделение;
		//Стало+++
		Если ЭтоРаспределениеПоПроектам Тогда
			НовСтрокОстатокТоваров.Проект = Строк.Проект;
		Иначе
			НовСтрокОстатокТоваров.СтруктурнаяЕдиница	= Строк.Подразделение;
		КонецЕсли;
		//ПодольскийАИ #учетПроектов 15.12.2020 }
		
		НовСтрокОстатокТоваров.ВидСубконто1			= Строк.ВидСубконто1;
		НовСтрокОстатокТоваров.ВидСубконто2			= Строк.ВидСубконто2;
		НовСтрокОстатокТоваров.ВидСубконто3			= Строк.ВидСубконто3;
		НовСтрокОстатокТоваров.СуммаКотроль			= Строк.Сумма;
		
	КонецЦикла;
	
	//ПодольскийАИ #учетПроектов 18.12.2020 {
	//Было---
	//Если НЕ ЭтоРаспределениеНаТовары И ЗначениеЗаполнено(Объект.ВнеоборотныйАктив) Тогда 
	//Стало+++
	Если НЕ ЭтоРаспределениеНаТовары И НЕ ЭтоРаспределениеПоПроектам И ЗначениеЗаполнено(Объект.ВнеоборотныйАктив) Тогда 
	//ПодольскийАИ #учетПроектов 18.12.2020 }
		Объект.СтоимостьДляВычисленияАмортизацииНов = Объект.СтоимостьДляВычисленияАмортизацииТек + Объект.ОстаткиПоСчетам.Итог("Сумма");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстаткиПоСчетам(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Если Объект.ОстаткиПоСчетам.Количество() <> 0 Тогда 
		
		Ответ = Вопрос(НСтр("ru='Перед заполнением ""Таблица оборотов"" будет очищена. Продолжить?';"
		+ " ka = 'შევსების შემდეგ ცხრილური ნაწილი ""დანახარჯები"" გასუფთავდება. გაგრძელდეს ?'"), Режим, 0);
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьОстаткиПоСчетамНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьПоСуммеНаСервере()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.РаспределитьСуммуСчетовНаТоварыПоСумме();
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоСумме(Команда)
	
	Если Объект.ОстаткиПоСчетам.Количество() = 0 Тогда
		УправлениеНебольшойФирмойКлиент.СообщитьОбОшибке(Объект, НСтр("ka='ცხრილ ""ანგარიშები""-ში ჩანაწერები არ არის!';ru='В табличной части ""Счета"" нет записей!'"));
		Возврат;
	КонецЕсли;
	
	Если Объект.ОстаткиТоваровНаСкладе.Количество() = 0 Тогда
		УправлениеНебольшойФирмойКлиент.СообщитьОбОшибке(Объект, НСтр("ka='ცხრილ ""ნარჩენები""-ში ჩანაწერები არ არის!';ru='В табличной части ""Остатки"" нет записей!'"));
		Возврат;
	КонецЕсли;
	
	РаспределитьПоСуммеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьПоКоличествуНаСервере()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.РаспределитьСуммуСчетовНаТоварыПоКоличеству();
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоКоличеству(Команда)
	
	Если Объект.ОстаткиПоСчетам.Количество() = 0 Тогда
		УправлениеНебольшойФирмойКлиент.СообщитьОбОшибке(Объект, НСтр("ka='ცხრილ ""ანგარიშები""-ში ჩანაწერები არ არის!';ru='В табличной части ""Счета"" нет записей!'"));
		Возврат;
	КонецЕсли;
	
	Если Объект.ОстаткиТоваровНаСкладе.Количество() = 0 Тогда
		УправлениеНебольшойФирмойКлиент.СообщитьОбОшибке(Объект, НСтр("ka='ცხრილ ""ნარჩენები""-ში ჩანაწერები არ არის!';ru='В табличной части ""Остатки"" нет записей!'"));
		Возврат;
	КонецЕсли;
	
	РаспределитьПоКоличествуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ЭтоРаспределениеНаТовары = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары");
	
	//ПодольскиАИ #УчетПроектов 15.12.2020 {
	ЭтоРаспределениеПоПроектам = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасспределениеЗатратНаТовары.ПоПроектам");
	Если ПрошлыйВидОперации <> Объект.ВидОперации Тогда
		
		Объект.ОстаткиПоСчетам.Очистить();
		Объект.ОстаткиТоваровНаСкладе.Очистить();
		
		ИнициализироватьКомпоновщикНастроек();
		
	КонецЕсли;
	ПрошлыйВидОперации = Объект.ВидОперации;
	//ПодольскиАИ #УчетПроектов 15.12.2020 }
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ВнеоборотныйАктивПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыАмортизацииСрезПоследних.ВнеоборотныйАктив КАК ВнеоборотныйАктивТек,
	|	ПараметрыАмортизацииСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаТек,
	|	ПараметрыАмортизацииСрезПоследних.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизацииТек,
	|	ПараметрыАмортизацииСрезПоследних.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизацииТек,
	|	ПараметрыАмортизацииСрезПоследних.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизацииТек,
	|	ПараметрыАмортизацииСрезПоследних.СчетЗатрат КАК СчетЗатратТек,
	|	ПараметрыАмортизацииСрезПоследних.СчетЗатратРегл КАК СчетЗатратРеглТек,
	|	ПараметрыАмортизацииСрезПоследних.НаправлениеДеятельности КАК НаправлениеДеятельностиТек,
	|	ПараметрыАмортизацииСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаНов,
	|	ПараметрыАмортизацииСрезПоследних.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизацииНов,
	|	ПараметрыАмортизацииСрезПоследних.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизацииНов,
	|	ПараметрыАмортизацииСрезПоследних.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизацииНов,
	|	ПараметрыАмортизацииСрезПоследних.СчетЗатрат КАК СчетЗатратНов,
	|	ПараметрыАмортизацииСрезПоследних.СчетЗатратРегл КАК СчетЗатратРеглНов,
	|	ПараметрыАмортизацииСрезПоследних.НаправлениеДеятельности КАК НаправлениеДеятельностиНов
	|ИЗ
	|	РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(
	|			&ДатаДокумента,
	|			Организация = &Организация
	|				И ВнеоборотныйАктив = &ВнеоборотныйАктив) КАК ПараметрыАмортизацииСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаДокумента", ?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата - 1,ТекущаяДата()));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ВнеоборотныйАктив", Объект.ВнеоборотныйАктив);
	
	ВыборкаРезультат = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаРезультат.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(объект,ВыборкаРезультат);
	КонецЦикла;
	
	Объект.СчетПереоценкиНов = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПрочиеДоходы");
	Объект.СтоимостьДляВычисленияАмортизацииНов = Объект.СтоимостьДляВычисленияАмортизацииНов + Объект.ОстаткиПоСчетам.Итог("Сумма");
	//Объект.СчетПереоценкиРеглНов =
	
КонецПроцедуры

&НаКлиенте
Процедура ВнеоборотныйАктивПриИзменении(Элемент)
	
	ВнеоборотныйАктивПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СчетЗатратРеглНовПриИзмененииНаСервере()
	
	Объект.СчетЗатратНов = Объект.СчетЗатратРеглНов.СчетАналогУУ;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетЗатратРеглНовПриИзменении(Элемент)
	
	СчетЗатратРеглНовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СчетПереоценкиРеглНовПриИзмененииНаСервере()
	
	Объект.СчетПереоценкиНов = Объект.СчетПереоценкиРеглНов.СчетАналогУУ;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетПереоценкиРеглНовПриИзменении(Элемент)
	
	СчетПереоценкиРеглНовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммуВА(Команда)
	Объект.СтоимостьДляВычисленияАмортизацииНов = Объект.СтоимостьДляВычисленияАмортизацииТек + Объект.ОстаткиПоСчетам.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПоСчетамСуммаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ОстаткиПоСчетам.ТекущиеДанные;
	
	Если ТекущаяСтрока.Сумма > ТекущаяСтрока.СуммаКотроль Тогда 
		
		Сообщить(НСтр("ru = 'Сумма по счету не может привышать оборот "+ТекущаяСтрока.СуммаКотроль+"'; ka = 'დანახარჯის ანგარიშზე არარის საკმარისი ნაშთი "+ТекущаяСтрока.СуммаКотроль+"'"));
		ТекущаяСтрока.Сумма = ТекущаяСтрока.СуммаКотроль;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПредыдущаяКонечнаяДатаПериода = Период.ДатаОкончания;
КонецПроцедуры

&НаКлиенте
Процедура СчетаУчетаРеглНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	МассивТиповСчетов = Новый Массив;
	МассивТиповСчетов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыСчетов.НезавершенноеПроизводство"));
	МассивТиповСчетов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыСчетов.КосвенныеЗатраты"));
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСчетаУУ", МассивТиповСчетов);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.СчетаУчетаРегл.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Объект.Дата); //+++ Дмгг
	
КонецПроцедуры
