////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем ТЗАктивныхСотрудников;
Перем ВыдНачислений;
Перем МассивНачисленииИУдержаний;
Перем СтатусОбработки Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Создание документа начислений
Функция СозданиеОбновлениеДокументаНачислений(ДатаОбновления, Организация, Подразделение, МассивНачисленииИУдержаний, ПараметрыДокументов, НачисляетьсяОтделныйДокумент, ТЗ, Коментарий, ВидНачисленияУдержания, ТТТ) Экспорт 
	                          	                                                             		
	Если ТабличнаяЧастьСотрудники.Количество() = 0 Тогда                                       	
		ВызватьИсключение "ორგანიზაცია : " + Организация.Наименование + ".  დარიცხვის თვე : " + Формат(ДатаОбновления, "Л=ka_GE; ДФ='MMMM yyyy'") + " - არ არის აღმოჩენილი დარიცხვა დაკავებები " + Формат(ДатаОбновления, "Л=ka_GE; ДФ=MMMM") + "ს თვით ";
	КонецЕсли;	
	
	// 1) Заполняем документ начисления и удержания
	
	// Ищем и удаляем старые документы
	//ПойскДокументаИПометкаУдаления(ПараметрыДокументов, Организация, Подразделение, Перечисления.AzRyТипЗаписыАвтоматизацияНачисленийЗарплаты.НачислениеЗарплаты);
	
	//ОбработкаТЗДляДжира = Обработки.AzRy_ОбновлениеДокументаНачислениеЗарплаты.Создать();
	
	//НД = Документы.НачислениеЗарплаты.СоздатьДокумент();
	//НД.AzRyТипСозданияДокумента = ?(ПараметрыДокументов.ТипНачисленияJiraТариф = "jira", Перечисления.AzRyТипСозданияДокумента.Jira, Перечисления.AzRyТипСозданияДокумента.Пользователь);
	//НД.Дата = ПараметрыДокументов.ДатаДокумента;
	//НД.ВалютаДокумента    = Константы.НациональнаяВалюта.Получить();
	//НД.Организация        = Организация;
	//НД.ПериодРегистрации  = ПараметрыДокументов.ПериодРегистраций;
	//НД.СтруктурнаяЕдиница = Подразделение;
	//НД.УстановитьНовыйНомер();
	//НД.НачисленияУдержания.Очистить();
	//НД.НалогиНаДоходы.Очистить();
	//НД.Комментарий = Коментарий;
	//НД.Автор = Пользователи.ТекущийПользователь();
	
	//Для каждого СтрокаТаблицы Из ТЗ Цикл
	//	
	//	Если Не СтрокаТаблицы.ВидНачисленияУдержания = ВидНачисленияУдержания Тогда
	//		Продолжить;		
	//	КонецЕсли;
	//	
	//	Если СтрокаТаблицы.Jira = "Jira" Тогда
	//		М = Новый Массив; М.Добавить(СтрокаТаблицы.Сотрудник);
	СП = ОбновлениетаблицыДокументыНачисленияCC_2(ТТТ);
	//ОбновлениетаблицыДокументыНачисленияCC(НД.НачисленияУдержания, ДатаОбновления, ПараметрыДокументов, ВидНачисленияУдержания, ТТТ);
	//	Иначе
	//		Если СтрокаТаблицы.Сумма > 0 Тогда
	//			ЗаполнениетаблицыДокумента(НД.НачисленияУдержания.Добавить(), СтрокаТаблицы, ПараметрыДокументов);			
	//		КонецЕсли; 
	//	КонецЕсли; 
	//			
	//КонецЦикла;
	
	//// Свертка таблицы сотрудников	
	//ТЗДляСвертки = СверткаТаблицыСотрудников(ТЗ);
	//
	//Если Не НачисляетьсяОтделныйДокумент Тогда 
	//	
	//	// ТЗ  НалогиНаДоходы
	//	Для каждого ТекСтрока Из ТЗДляСвертки Цикл	
	//		
	//		НайденнаяСтрока = ТабличнаяЧастьСотрудникиНалог.Найти(ТекСтрока.Сотрудник, "Сотрудник");
	//		Если Не НайденнаяСтрока = Неопределено Тогда
	//			
	//			НоваяСтрока = НД.НалогиНаДоходы.Добавить();
	//			НоваяСтрока.Сотрудник              = НайденнаяСтрока.Сотрудник;
	//			НоваяСтрока.ВидНачисленияУдержания = НайденнаяСтрока.Налог;
	//			НоваяСтрока.Сумма                  = НайденнаяСтрока.Сумма;
	//			НоваяСтрока.AzRyЗаказПокупателя    = ПараметрыДокументов.ЗаказПокупателя;
	//			
	//		КонецЕсли; 
	//		
	//	КонецЦикла;
	//	
	//КонецЕсли;
	//
	//Если НД.НалогиНаДоходы.Количество() > 0 Или НД.НачисленияУдержания.Количество() > 0 Тогда
	//	НД.Записать(РежимЗаписиДокумента.Проведение);
	//	
	//	МассивДокументов = Новый Массив;
	//	МассивДокументов.Добавить(НД.Ссылка);	
	//КонецЕсли;
	
	//Возврат НД;
	Возврат СП;
	
КонецФункции

Функция СозданиеОбновлениеДокументаНачислений2(ДатаОбновления, Организация, Подразделение, МассивНачисленииИУдержаний, ПараметрыДокументов, НачисляетьсяОтделныйДокумент, ТЗ, Коментарий, ВидНачисленияУдержания) Экспорт 
	                          	                                                             		
	Если ТабличнаяЧастьСотрудники.Количество() = 0 Тогда                                       	
		ВызватьИсключение "ორგანიზაცია : " + Организация.Наименование + ".  დარიცხვის თვე : " + Формат(ДатаОбновления, "Л=ka_GE; ДФ='MMMM yyyy'") + " - არ არის აღმოჩენილი დარიცხვა დაკავებები " + Формат(ДатаОбновления, "Л=ka_GE; ДФ=MMMM") + "ს თვით ";
	КонецЕсли;	
	
	// 1) Заполняем документ начисления и удержания
	
	// Ищем и удаляем старые документы
	//ПойскДокументаИПометкаУдаления(ПараметрыДокументов, Организация, Подразделение, Перечисления.AzRyТипЗаписыАвтоматизацияНачисленийЗарплаты.НачислениеЗарплаты);
	
	ОбработкаТЗДляДжира = Обработки.AzRy_ОбновлениеДокументаНачислениеЗарплаты.Создать();                                 	
	
	НД = Документы.НачислениеЗарплаты.СоздатьДокумент();
	НД.AzRyТипСозданияДокумента = Перечисления.AzRyТипСозданияДокумента.Пользователь;
	НД.Дата = ПараметрыДокументов.ДатаДокумента;
	НД.ВалютаДокумента    = Константы.НациональнаяВалюта.Получить();
	НД.Организация        = Организация;                                                                                                                    	
	НД.ПериодРегистрации  = ПараметрыДокументов.ПериодРегистраций;
	НД.СтруктурнаяЕдиница = Подразделение;
	НД.УстановитьНовыйНомер();	
	НД.НачисленияУдержания.Очистить();
	НД.НалогиНаДоходы.Очистить();
	НД.Комментарий = Коментарий;
	НД.Автор = Пользователи.ТекущийПользователь();
	
	Для каждого СтрокаТаблицы Из ТЗ Цикл
		
		Если СтрокаТаблицы.Jira = "Jira" Тогда
			М = Новый Массив; М.Добавить(СтрокаТаблицы.Сотрудник);
			ОбработкаТЗДляДжира.ОбновлениетаблицыДокументыНачисления(НД.НачисленияУдержания, ДатаОбновления, М, ПараметрыДокументов, ВидНачисленияУдержания);
		Иначе
		    ЗаполнениетаблицыДокумента(НД.НачисленияУдержания.Добавить(), СтрокаТаблицы, ПараметрыДокументов);
		КонецЕсли; 
				
	КонецЦикла;
	
    // Свертка таблицы сотрудников	
	ТЗДляСвертки = СверткаТаблицыСотрудников(ТЗ);
	
	Если Не НачисляетьсяОтделныйДокумент Тогда 
		
		// ТЗ  НалогиНаДоходы
		Для каждого ТекСтрока Из ТЗДляСвертки Цикл	
			
			НайденнаяСтрока = ТабличнаяЧастьСотрудникиНалог.Найти(ТекСтрока.Сотрудник, "Сотрудник");
			Если Не НайденнаяСтрока = Неопределено Тогда
				
				НоваяСтрока = НД.НалогиНаДоходы.Добавить();
				НоваяСтрока.Сотрудник              = НайденнаяСтрока.Сотрудник;
				НоваяСтрока.ВидНачисленияУдержания = НайденнаяСтрока.Налог;
				НоваяСтрока.Сумма                  = НайденнаяСтрока.Сумма;
				НоваяСтрока.AzRyЗаказПокупателя    = ПараметрыДокументов.ЗаказПокупателя;
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли;
	
	НД.Записать(РежимЗаписиДокумента.Проведение);
	
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(НД.Ссылка);
	//ДобавитьЗаписВРегСведений(ПараметрыДокументов.ПериодРегистраций ,Организация, Подразделение, Перечисления.AzRyТипЗаписыАвтоматизацияНачисленийЗарплаты.НачислениеЗарплаты, МассивДокументов);
	
	//Сообщить("'დარიცხვა დაკავების' დოკუმენტის დაგენერირება დასრულდა წარმატებით!");
	
	Возврат НД;
	
КонецФункции

Процедура ЗаполнениетаблицыДокумента(НоваяСтрока, Выборка3, ПараметрыДокументов)
	
	НоваяСтрока.AzRyDivision               = Выборка3.AzRyDivision;
	НоваяСтрока.Сотрудник                  = Выборка3.Сотрудник;
	НоваяСтрока.ВидНачисленияУдержания     = Выборка3.ВидНачисленияУдержания;
	НоваяСтрока.СчетЗатратРегл             = Выборка3.СчетЗатратРегл;
	НоваяСтрока.Размер                     = Выборка3.Сумма;
	НоваяСтрока.ДатаНачала                 = НачалоМесяца(ПараметрыДокументов.ПериодРегистраций);
	НоваяСтрока.ДатаОкончания              = КонецМесяца(ПараметрыДокументов.ПериодРегистраций);
	НоваяСтрока.НаправлениеДеятельности    = ПараметрыДокументов.НаправленияДеятельности;
	НоваяСтрока.AzRyНоменклатура           = ПараметрыДокументов.СчетЗатратНоменклатура;
	НоваяСтрока.ЗаказПокупателя            = ПараметрыДокументов.ЗаказПокупателя;
	// 1. Поиск всех параметров-идентификаторов формулы
	СтруктураПараметров = Новый Структура;
	УправлениеНебольшойФирмойСервер.ДобавитьПараметрыВСтруктуру(НоваяСтрока.ВидНачисленияУдержания.Формула, СтруктураПараметров);
	
	// 2. Добавление показателя
	Счетчик = 0;
	Для каждого ПараметрСтруктуры Из СтруктураПараметров Цикл
		
		Если ПараметрСтруктуры.Ключ = "ОтработаноДней"
			ИЛИ ПараметрСтруктуры.Ключ = "ОтработаноЧасов"
			ИЛИ ПараметрСтруктуры.Ключ = "ТарифнаяСтавка" Тогда
			Продолжить;
		КонецЕсли; 
		
		ПараметрРасчета = Справочники.ПараметрыРасчетов.НайтиПоРеквизиту("Идентификатор", ПараметрСтруктуры.Ключ);
		//Если НЕ ЗначениеЗаполнено(ПараметрРасчета) Тогда		
		//	Сообщение = Новый СообщениеПользователю();
		//	Сообщение.Текст = НСтр("ru='Не найден параметр ';ka='Не найден параметр '") + ПараметрРасчета + НСтр("ru=' для сотрудника в строке № ';ka=' для сотрудника в строке № '") + (Объект.НачисленияУдержания.Индекс(СтрокаТабличнойЧасти) + 1);
		//	Сообщение.Сообщить();			
		//КонецЕсли; 
		
		Счетчик = Счетчик + 1;
		
		Если Счетчик > 3 Тогда
			Прервать;
		КонецЕсли; 
		
		НоваяСтрока["Показатель" + Счетчик]    = ПараметрСтруктуры.Ключ;
		НоваяСтрока["Представление" + Счетчик] = ПараметрРасчета;
		//НоваяСтрока["Значение" + Счетчик] = Выборка3.ЗагрузкаПлан;
		
	КонецЦикла;
	
	
	Если НоваяСтрока.РучнаяКорректировка ИЛИ НЕ ЗначениеЗаполнено(НоваяСтрока.ВидНачисленияУдержания.Формула) Тогда
		Возврат;
	КонецЕсли; 
	
	// расчет размера начисления или удержания по формуле
	// 1. Добавляем параметры и значения в структуру			
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТарифнаяСтавка",  НоваяСтрока.Размер);
	СтруктураПараметров.Вставить("ОтработаноДней",  НоваяСтрока.ОтработаноДней);
	СтруктураПараметров.Вставить("ОтработаноЧасов", НоваяСтрока.ОтработаноЧасов);
	
	Для Счетчик = 1 По 3 Цикл
		Если ЗначениеЗаполнено(НоваяСтрока["Представление" + Счетчик]) Тогда
			СтруктураПараметров.Вставить(НоваяСтрока["Показатель" + Счетчик], НоваяСтрока["Значение" + Счетчик]);
		КонецЕсли; 
	КонецЦикла; 
	
	
	// 2. Рассчитываем по формулам		
	Формула = НоваяСтрока.ВидНачисленияУдержания.Формула;
	Для каждого Параметр Из СтруктураПараметров Цикл
		Формула = СтрЗаменить(Формула, "[" + Параметр.Ключ + "]", Формат(Параметр.Значение, "ЧРД=.; ЧН=0; ЧГ=0"));
	КонецЦикла;
	Попытка
		РассчитаннаяСумма = Вычислить(Формула);
	Исключение
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Не удалось рассчитать сумму начисления  в строке №%НомерСтроки%. Возможно, формула содержит ошибку или не заполнены показатели.';ka='Не удалось рассчитать сумму начисления  в строке №%НомерСтроки%. Возможно, формула содержит ошибку или не заполнены показатели.'");
		//Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%НомерСтроки%", (Объект.НачисленияУдержания.Индекс(СтрокаНачислений) + 1));
		//Сообщение.Поле = "Объект.НачисленияУдержания[" + Объект.НачисленияУдержания.Индекс(СтрокаНачислений) + "].ВидНачисленияУдержания";
		//Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();
		РассчитаннаяСумма = 0;
	КонецПопытки;
	
	НоваяСтрока.Сумма = Окр(РассчитаннаяСумма, 2);

КонецПроцедуры
 
// Создание документа ПлатежнаяВедомость
Функция СозданиеДокументаПлатежнаяВедомость(Организация, ДокументОснование, ПараметрыДокументов) Экспорт 
	
	ПроцентНДФЛ = ПараметрыДокументов.ПроцентНДФЛ/100;	
	МассивДокументовПлатежнаяВедомость = Новый Массив;
	
	// Ищем и удаляем старые документы --------------------------------------------------------
	//ПойскДокументаИПометкаУдаления(ПараметрыДокументов, Организация, Подразделение, Перечисления.AzRyТипЗаписыАвтоматизацияНачисленийЗарплаты.ПлатежнаяВедомость);
	
	// Свертка таблицы сотрудников	
	ТЗДляСвертки = СверткаТаблицыСотрудников(ДокументОснование.НачисленияУдержания);
	
	Для каждого ТекСотрудник Из ТЗДляСвертки Цикл
		
		ПВ = Документы.ПлатежнаяВедомость.СоздатьДокумент();
		//ПВ.УстановитьНовыйНомер();
		ПВ.AzRyДокументОснование = ДокументОснование.Ссылка;
		ПВ.ВалютаДокумента   = ДокументОснование.ВалютаДокумента;
		ПВ.ВалютаРасчетов    = ДокументОснование.ВалютаДокумента;	
		КурсВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокументОснование.ВалютаДокумента, ТекущаяДата());
		ПВ.Курс      = КурсВалюты.Курс;                                                                                            	
		ПВ.Кратность = КурсВалюты.Кратность;
		ПВ.Организация = Организация;
		ПВ.СтруктурнаяЕдиница = ДокументОснование.СтруктурнаяЕдиница; 		
		ПВ.ПериодРегистрации = НачалоМесяца(ПараметрыДокументов.ПериодРегистраций);
		ПВ.Дата              = ПараметрыДокументов.ДатаДокументаПлВед;
		ПВ.ВидОперации       = Перечисления.ВидыОперацийПлатежнаяВедомость.Зарплата;
		ПВ.Комментарий       = ПараметрыДокументов.Коментарий + ": " + ТекСотрудник.Сотрудник;
		ПВ.Автор = Пользователи.ТекущийПользователь();
		 
		Отбор = Новый Структура();
		Отбор.Вставить("Сотрудник", ТекСотрудник.Сотрудник);
		Отбор.Вставить("НачисляемЗарплату", Истина);
		//Строки = ДокументОснование.НачисленияУдержания.НайтиСтроки(Отбор);
		//Строки = ТЗДляОбработки.НачисленияУдержания.НайтиСтроки(Отбор);
		Строки = ПараметрыДокументов.НачислениеИНалог.НачисленияУдержания.НайтиСтроки(Отбор); 
		//Строки = ТЗ.НайтиСтроки(Отбор);
		
		СуммаНачислений = 0;
		СуммаУдержаний = 0;
		СуммаПенсияНач = 0;
		СуммаПенсияУдр = 0;
		Для каждого ТекСтрока Из Строки Цикл
			
			Если ТекСтрока.ВидНачисленияУдержания.Тип = Перечисления.ТипыНачисленийИУдержаний.Начисление Тогда 								
				Если Справочники.AzRyНастройки.НачислениеПенсия.Значение <> ТекСтрока.ВидНачисленияУдержания Тогда
					СуммаНачислений  = СуммаНачислений + ТекСтрока.Сумма;
				Иначе 
					СуммаПенсияНач = СуммаПенсияНач + ТекСтрока.Сумма;
				КонецЕсли; 
			ИначеЕсли ТекСтрока.ВидНачисленияУдержания.Тип = Перечисления.ТипыНачисленийИУдержаний.Удержание Тогда 				
				Если Справочники.AzRyНастройки.УдержаниеПенсия.Значение <> ТекСтрока.ВидНачисленияУдержания Тогда
					СуммаУдержаний  = СуммаУдержаний + ТекСтрока.Сумма;
				Иначе 
					СуммаПенсияУдр = СуммаПенсияУдр + ТекСтрока.Сумма; 
				КонецЕсли;				
			КонецЕсли;
			
		КонецЦикла;
		
		НоваяСтрока = ПВ.Сотрудники.Добавить();
		НоваяСтрока.Сотрудник     = ТекСтрока.Сотрудник;
		НДФЛ = (СуммаНачислений - СуммаПенсияНач) * ПроцентНДФЛ;
		НоваяСтрока.СуммаПлатежа  = (СуммаНачислений - СуммаПенсияУдр - НДФЛ) - СуммаУдержаний;
		НоваяСтрока.СуммаРасчетов = НоваяСтрока.СуммаПлатежа;
		
		ПВ.Записать(РежимЗаписиДокумента.Запись);
		
		МассивДокументовПлатежнаяВедомость.Добавить(ПВ.Ссылка);
		
	КонецЦикла;
	
	//ДобавитьЗаписВРегСведений(ПараметрыДокументов.ПериодРегистраций ,Организация, Подразделение, Перечисления.AzRyТипЗаписыАвтоматизацияНачисленийЗарплаты.ПлатежнаяВедомость, МассивДокументовПлатежнаяВедомость);
	//Сообщить("'გადახდის განცხადებების' დოკუმენტების დაგენერირება დასრულდა წარმატებით!");
	Возврат МассивДокументовПлатежнаяВедомость;
	
КонецФункции	

// Создание документа расход со счета
Функция СозданиеДокументаРасходСоСчета(МассивДокОбектПлатежнаяВедомость, ПараметрыДокументов)  Экспорт
	
	МассивДокументов = Новый Массив;	
	Для каждого ТекДокумент Из МассивДокОбектПлатежнаяВедомость Цикл
		
		РС = Документы.РасходСоСчета.СоздатьДокумент();
		РС.ДокументОснование = ТекДокумент.Ссылка;
		РС.Дата = ПараметрыДокументов.ДатаДокументаРасСоСчета;
		РС.Организация = ТекДокумент.Организация;		
		РС.Статья = ПараметрыДокументов.СтатьиДвиженияДенежныхСредств;
		РС.Заполнить(ТекДокумент.Ссылка);	
		РС.Комментарий = ПараметрыДокументов.Коментарий + ": " + ТекДокумент.Сотрудники[0].Сотрудник;
		РС.Автор = Пользователи.ТекущийПользователь();
		Если ЗначениеЗаполнено(ПараметрыДокументов.БанкНомерСчета) Тогда
			РС.БанковскийСчет = ПараметрыДокументов.БанкНомерСчета;		
		КонецЕсли; 
		РС.Записать(РежимЗаписиДокумента.Проведение);
		
		МассивДокументов.Добавить(РС.Ссылка);
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции	

Функция ФильтрацияДанных(ТЗ, КолонкаТЗ, ЗначениеФильтраций) Экспорт

	ТЗАктивныхСотрудников = ФилтрТаблицыСотрудников(ТЗ, КолонкаТЗ, ЗначениеФильтраций);

	Возврат ТЗАктивныхСотрудников;
	
КонецФункции

Процедура ЗаполнитьПоОстаткамЗарплаты(ПараметрыДокументов) Экспорт	
	
	//Если ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.Зарплата Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	РасчетыСПерсоналомОстатки.Сотрудник,
		               |	СУММА(ВЫБОР
		               |			КОГДА &ВалютаРасчетов = &ВалютаДокумента
		               |				ТОГДА РасчетыСПерсоналомОстатки.СуммаВалОстаток
		               |			ИНАЧЕ ВЫРАЗИТЬ(РасчетыСПерсоналомОстатки.СуммаВалОстаток * &Курс / &Кратность КАК ЧИСЛО(15, 2))
		               |		КОНЕЦ) КАК СуммаПлатежа,
		               |	СУММА(РасчетыСПерсоналомОстатки.СуммаВалОстаток) КАК СуммаРасчетов
		               |ИЗ
		               |	РегистрНакопления.РасчетыСПерсоналом.Остатки(,
		               |			Организация = &Организация
		               |				И ПериодРегистрации = &ПериодРегистрации
		               |				И Валюта = &ВалютаРасчетов
		               |				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК РасчетыСПерсоналомОстатки
		               |ГДЕ
		               |	РасчетыСПерсоналомОстатки.СуммаВалОстаток > 0
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РасчетыСПерсоналомОстатки.Сотрудник
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	РасчетыСПерсоналомОстатки.Сотрудник.Наименование";
		
		Запрос.УстановитьПараметр("ПериодРегистрации", 	ПараметрыДокументов.ПериодРегистрации);
		Запрос.УстановитьПараметр("Организация", 		ПараметрыДокументов.Организация);
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ПараметрыДокументов.СтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("ВалютаРасчетов",		ПараметрыДокументов.ВалютаРасчетов);
		Запрос.УстановитьПараметр("ВалютаДокумента",	ПараметрыДокументов.ВалютаДокумента);
		Запрос.УстановитьПараметр("Курс",				ПараметрыДокументов.Курс);
		Запрос.УстановитьПараметр("Кратность",			ПараметрыДокументов.Кратность);
		
		//Сотрудники.Загрузить(Запрос.Выполнить().Выгрузить());

	//ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.Аванс Тогда	
	//	
	//	Сообщение = Новый СообщениеПользователю();
	//	Сообщение.Текст = НСтр("ru='При выплате аванса заполнение по остаткам не предусмотрено!';ka='При выплате аванса заполнение по остаткам не предусмотрено!'");
	// 	Сообщение.Сообщить();
	//	
	//КонецЕсли;
	
КонецПроцедуры

Функция ТаблицыПоПодразделениям(ТЗ) Экспорт

	Ответ = Новый Соответствие;
	
	ТЗПодраздления = ТЗ.Скопировать();
	ТЗПодраздления.Свернуть("СтруктурнаяЕдиница");
	
	Для каждого ТекСтрока Из ТЗПодраздления Цикл
		
		Отбор = Новый Структура();
		Отбор.Вставить("СтруктурнаяЕдиница", ТекСтрока.СтруктурнаяЕдиница);
		Строки = ТЗ.НайтиСтроки(Отбор);
		
		ПустаяТаблица = ТЗ.СкопироватьКолонки();
		Для каждого ТекМассив Из Строки Цикл
			НоваяСтрока = ПустаяТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекМассив); 
		КонецЦикла;
		
		Ответ.Вставить(ТекСтрока.СтруктурнаяЕдиница, ПустаяТаблица);	
	КонецЦикла;
	
	Возврат Ответ;

КонецФункции
 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ВычислитьЗарплатуПоНачислениям(Организация, ТЗАктивныеСотрудники, ДатаДокумента, МассивНачисленииИУдержаний, МассивНалог, ТЗНДФЛ = Неопределено) Экспорт
	
	ТаблицаНачисленияИУдержания = ПустаяТаблицаНачисленияУдержания();
	ТЗДляОбработкиНалог         = ПустаяТаблицаНалог();
	
	СотрудникиМассив = СотрудникиМассивПоОтбору(ТЗАктивныеСотрудники.ВыгрузитьКолонку("Сотрудник"), ПараметрыДокументов);
	ТЗНачисленийИУдержаний = ТаблицаНачисленийИУдержаний(МассивНачисленииИУдержаний, ПараметрыДокументов, СотрудникиМассив, Организация, ТЗАктивныеСотрудники); // Таблица начислений и удержаний
	ТЗНДФЛ = ТаблицаНалогов(МассивНалог, Организация, ПараметрыДокументов, СотрудникиМассив); // Таблица налогов	
	// ხელფასების გამოთვლა დინამიურად იმ შემთხვევაში თუ მოხდა შუათვეში მიღება, გადაადგილება ან განთავისუფლება
	ДинамическиВычисляемыеЗарплаты = ДинамическоеВычислениеЗарплат(ТЗНачисленийИУдержаний, МассивНачисленииИУдержаний, Организация, ПараметрыДокументов);
	
	// Соответствие: Сотрудник - Тариф
	ТарифПоСотруднику = СоответствиеТарифнаяСтавка(ТЗНачисленийИУдержаний, ПараметрыДокументов.ОбъектНачисленияЗарплаты);
	
	// საპენსიოს გამოთვლა
	Для каждого ТекСтрока Из ТЗНачисленийИУдержаний Цикл
		Если ТарифПоСотруднику[ТекСтрока.Сотрудник] = Неопределено Тогда
			Продолжить;		
		КонецЕсли;
		// დაგროვებითი საპენსიოს გამოთვლა - СуммаПФ - ის ველის შევსება
		ПенсияВычислить(ТекСтрока, ТекСтрока.ВидНачисленияУдержания, ТарифПоСотруднику[ТекСтрока.Сотрудник]);
	КонецЦикла;	
	
	// დარიცხვა/დაკავებების ცხრილის შევსება
	Для каждого ТекСтрока Из ТЗНачисленийИУдержаний Цикл		
		Если ТарифПоСотруднику[ТекСтрока.Сотрудник] = Неопределено Тогда
			Продолжить;		
		КонецЕсли; 
		
		НоваяСтрока = ТаблицаНачисленияИУдержания.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		
		// დაგროვებითი საპენსიოს გამოთვლა
		//ПенсияЗначение = ПенсияВычислить(ТекСтрока, ТекСтрока.ВидНачисленияУдержания, ТарифПоСотруднику[ТекСтрока.Сотрудник]);
		//НоваяСтрока.Сумма   = ?(ПенсияЗначение = 0, НоваяСтрока.Сумма, ПенсияЗначение);
		//НоваяСтрока.Сумма   = ?(ТекСтрока.СуммаПФ = 0, НоваяСтрока.Сумма, ТекСтрока.СуммаПФ);	
		
		//Если ПараметрыДокументов.ВидНачисления = "I_Половина" Или ПараметрыДокументов.ВидНачисления = "II_Половина" Тогда			                           
		//	НоваяСтрокаНачисленияУдержания.Сумма = НоваяСтрокаНачисленияУдержания.Сумма / 2;
		//КонецЕсли;
		
		// საპენსიოს ჩანაწერების გადავსება
		Если ТекСтрока.ВидНачисленияУдержания = Справочники.AzRyНастройки.НачислениеПенсия.Значение Или ТекСтрока.ВидНачисленияУдержания = Справочники.AzRyНастройки.УдержаниеПенсия.Значение Тогда
			Если ТекСтрока.Актуальность Тогда
				ТекСтрока.Сумма     = ТарифПоСотруднику[ТекСтрока.Сотрудник].СуммаПФ;
				НоваяСтрока.Сумма   = ТарифПоСотруднику[ТекСтрока.Сотрудник].СуммаПФ;
			КонецЕсли; 
		КонецЕсли;		
		
		Если ДинамическиВычисляемыеЗарплаты <> Неопределено И ДинамическиВычисляемыеЗарплаты.Получить(ТекСтрока.Сотрудник) = Неопределено Тогда
			Если ПараметрыДокументов.ВидНачисления = "I_Половина" Или ПараметрыДокументов.ВидНачисления = "II_Половина" Тогда			                           
				НоваяСтрока.Сумма   = НоваяСтрока.Сумма / 2;
				НоваяСтрока.СуммаПФ = НоваяСтрока.СуммаПФ / 2;
			КонецЕсли;	
		КонецЕсли;
		
		НоваяСтрока.НаправлениеДеятельности = ПараметрыДокументов.НаправленияДеятельности;
		НоваяСтрока.ЗаказПокупателя         = ПараметрыДокументов.ЗаказПокупателя;
		НоваяСтрока.Проект                  = ПараметрыДокументов.Проект;
		//НоваяСтрока.СуммаПФ                 = ТекСтрока.СуммаПФ;
	КонецЦикла;
	
	// საშემოსავლოს ცხრილის შევსება
	Для каждого ТекСтрока2 Из ТаблицаНачисленияИУдержания Цикл
		
		Если ТекСтрока2.ВидНачисленияУдержания.Тип = Перечисления.ТипыНачисленийИУдержаний.Удержание Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура();
		Отбор.Вставить("Сотрудник", ТекСтрока2.Сотрудник);
		Строки = ТЗНДФЛ.НайтиСтроки(Отбор);
		
		Если Не Строки.Количество() = 0 Тогда 
			
			Для каждого ТекСтроки Из Строки Цикл
				
				СуммаПенсия = 0;
				Если ТекСтрока2.ВидНачисленияУдержания = ПараметрыДокументов.ОбъектНачисленияЗарплаты Тогда
					СуммаПенсия = СуммаПенсия(ТекСтрока2.Сотрудник, ТаблицаНачисленияИУдержания);
					//ТекСтрока2.СуммаПФ = ТарифПоСотруднику[ТекСтрока.Сотрудник].СуммаПФ;
				КонецЕсли;
				
				НоваяСтрокаНалог = ТЗДляОбработкиНалог.Добавить();
				НоваяСтрокаНалог.Сотрудник = ТекСтроки.Сотрудник;
				НоваяСтрокаНалог.Налог     = ТекСтроки.ВидНачисленияУдержания;
				НоваяСтрокаНалог.Тип       = ТекСтроки.Тип;
				Если ТекСтрока2.ВидНачисленияУдержания = Справочники.AzRyНастройки.НачислениеПенсия.Значение Тогда 
					НоваяСтрокаНалог.Сумма = 0;
				Иначе 
					НоваяСтрокаНалог.Сумма = (ТекСтрока2.Сумма - СуммаПенсия) * ТекСтроки.ВидНачисленияУдержания.СтавкаНДФЛ/100;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
							 
	//Возврат СтруктураТЗ;
	Возврат ТаблицыВСтруктуру(ТаблицаНачисленияИУдержания, ФилтрТаблицыСотрудников2(ТЗДляОбработкиНалог, "Сумма", 0), ЭтотОбъект.ИсторияСотрудника.Выгрузить());
	                                                                                                  
КонецФункции

Функция ТаблицыВСтруктуру(НачисленияУдержания, Налог, ИсторияЗарплаты) Экспорт
	
	Стр = Новый Структура;
	Стр.Вставить("НачисленияУдержания", НачисленияУдержания); 
	Стр.Вставить("Налог", Налог);
	Стр.Вставить("ИсторияЗарплаты", ИсторияЗарплаты); 
	
	Возврат Стр;	
	
КонецФункции
 
// Пойск документа начислений
Процедура ПойскДокументаИПометкаУдаления(Параметры, Организация, Подразделение, ТипЗаписи)
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	AzRyАвтоматизацияНачисленийЗарплаты.Период,
	               |	AzRyАвтоматизацияНачисленийЗарплаты.Организация,
	               |	AzRyАвтоматизацияНачисленийЗарплаты.СтруктурныеЕдиница,
	               |	AzRyАвтоматизацияНачисленийЗарплаты.Документы,
	               |	AzRyАвтоматизацияНачисленийЗарплаты.AzRyТипЗаписыАвтоматизацияНачисленийЗарплаты
	               |ИЗ
	               |	РегистрСведений.AzRyАвтоматизацияНачисленийЗарплаты КАК AzRyАвтоматизацияНачисленийЗарплаты
	               |ГДЕ
	               |	AzRyАвтоматизацияНачисленийЗарплаты.Период = &Период
	               |	И AzRyАвтоматизацияНачисленийЗарплаты.Организация = &Организация
	               |	И AzRyАвтоматизацияНачисленийЗарплаты.СтруктурныеЕдиница = &СтруктурныеЕдиница
	               |	И AzRyАвтоматизацияНачисленийЗарплаты.AzRyТипЗаписыАвтоматизацияНачисленийЗарплаты = &AzRyТипЗаписыАвтоматизацияНачисленийЗарплаты";
	
	Запрос.УстановитьПараметр("Период", Параметры.ПериодРегистраций);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтруктурныеЕдиница", Подразделение);
	Запрос.УстановитьПараметр("AzRyТипЗаписыАвтоматизацияНачисленийЗарплаты", ТипЗаписи);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Не Результат.Количество() = 0 Тогда  
		Для каждого ТекДок Из Результат Цикл
			НДО = ТекДок.Документы.ПолучитьОбъект();
			НДО.УстановитьПометкуУдаления(Истина);
			НДО.Записать();
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

Функция ФилтрТаблицыСотрудников(ТЗ, КолонкаТЗ, ЗначениеФильтраций)

	МассивУдаления = Новый Массив;
	
	Для каждого ТекСтрока Из ТЗ Цикл
		Если Не ТекСтрока[КолонкаТЗ] = ЗначениеФильтраций Тогда 
			МассивУдаления.Добавить(ТекСтрока);
		КонецЕсли;	
	КонецЦикла;
	
	Для каждого ТекСТрокаУдаления Из МассивУдаления Цикл
		ТЗ.Удалить(ТекСТрокаУдаления);	
	КонецЦикла;
	
	Возврат ТЗ;

КонецФункции // ФилтрТаблицыСотрудников()

Функция ФилтрТаблицыСотрудников2(ТЗ, КолонкаТЗ, ЗначениеФильтраций)

	МассивУдаления = Новый Массив;
	
	Для каждого ТекСтрока Из ТЗ Цикл
		Если ТекСтрока[КолонкаТЗ] = ЗначениеФильтраций Тогда 
			МассивУдаления.Добавить(ТекСтрока);
		КонецЕсли;	
	КонецЦикла;
	
	Для каждого ТекСТрокаУдаления Из МассивУдаления Цикл
		ТЗ.Удалить(ТекСТрокаУдаления);	
	КонецЦикла;
	
	Возврат ТЗ;

КонецФункции // ФилтрТаблицыСотрудников()

Функция СверткаТаблицыСотрудников(ТЗ)
	
	Если Тип("ТаблицаЗначений") = ТипЗнч(ТЗ) Тогда
		ТЗ2 = ТЗ.Скопировать();
	Иначе 
		ТЗ2 = ТЗ.Выгрузить().Скопировать();
	КонецЕсли; 
	ТЗ2.Свернуть("Сотрудник");
	
	Возврат ТЗ2;
	
КонецФункции	

Функция СотрудникиМассивПоОтбору(МассивСотрудников, Параметры)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановыеНачисленияИУдержанияСрезПоследних.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.ПлановыеНачисленияИУдержания.СрезПоследних(&Дата, ) КАК ПлановыеНачисленияИУдержанияСрезПоследних
		|ГДЕ
		|	ПлановыеНачисленияИУдержанияСрезПоследних.Сотрудник В(&Сотрудник)
		|	И ПлановыеНачисленияИУдержанияСрезПоследних.Организация = &Организация
		|	И ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания = &ВидНачисленияУдержания
		|	И ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания.Тип <> &Тип
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПлановыеНачисленияИУдержанияСрезПоследних.Сумма УБЫВ";

	Запрос.УстановитьПараметр("ВидНачисленияУдержания", Параметры.ОбъектНачисленияЗарплаты);
	Запрос.УстановитьПараметр("Дата", КонецДня(Параметры.ПериодРегистраций));
	Запрос.УстановитьПараметр("Организация", Организация);
	//Запрос.УстановитьПараметр("ПериодРегистрации", Параметры.ПериодРегистраций);
	Запрос.УстановитьПараметр("Сотрудник", МассивСотрудников);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыНачисленийИУдержаний.Налог);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");

КонецФункции

Функция ТарифСотрудниковJira(ДатаОбновления, РезультатТЗ)
	
	НДФЛ = Справочники.AzRyНастройки.УдержаниеНДФЛ.Значение.СтавкаНДФЛ/100;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаданияНаРаботу.Организация КАК Организация,
	               |	ЗаданияНаРаботу.ЗаказПокупателя.Проект КАК ЗаказПокупателяПроект,
	               |	ЗаданияНаРаботу.ЗаказПокупателя.Проект.AzRy_ЗаказПокупателя,
	               |	ЗаданияНаРаботу.Сотрудник КАК Сотрудник,
	               |	ЗаданияНаРаботу.ЗагрузкаПлан КАК ЗагрузкаПлан,
	               |	ЗаданияНаРаботу.ЗагрузкаПлан * ПлановыеНачисленияИУдержанияСрезПоследних.Сумма - ЗаданияНаРаботу.ЗагрузкаПлан * ПлановыеНачисленияИУдержанияСрезПоследних.Сумма * " + НДФЛ + " КАК СуммаБезНалога,
	               |	ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	               |	ПлановыеНачисленияИУдержанияСрезПоследних.СчетЗатратРегл КАК СотрудникСчетРасчетовСПерсоналом,
	               |	ПлановыеНачисленияИУдержанияСрезПоследних.Валюта КАК Валюта,
	               |	ПлановыеНачисленияИУдержанияСрезПоследних.Сумма КАК Сумма,
	               |	&Налог
	               |ИЗ
	               |	РегистрНакопления.ЗаданияНаРаботу КАК ЗаданияНаРаботу
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания.СрезПоследних(
	               |				&Дата,
	               |				ВидНачисленияУдержания = &ВидНачисленияУдержания
	               |					И Сумма <> 0) КАК ПлановыеНачисленияИУдержанияСрезПоследних
	               |		ПО ЗаданияНаРаботу.Сотрудник = ПлановыеНачисленияИУдержанияСрезПоследних.Сотрудник
	               |			И ЗаданияНаРаботу.Организация = ПлановыеНачисленияИУдержанияСрезПоследних.Организация
	               |ГДЕ
	               |	ЗаданияНаРаботу.Период МЕЖДУ &Период1 И &Период2
	               |	И НЕ ПлановыеНачисленияИУдержанияСрезПоследних.Сумма = 0";
	
	Запрос.УстановитьПараметр("Период1", НачалоМесяца(ДатаОбновления));
	Запрос.УстановитьПараметр("Период2", КонецМесяца(ДатаОбновления));
	Запрос.УстановитьПараметр("Сотрудник", РезультатТЗ.ВыгрузитьКолонку("Сотрудник"));
	Запрос.УстановитьПараметр("Дата", НачалоМесяца(ДатаОбновления));
	Запрос.УстановитьПараметр("ВидНачисленияУдержания", Справочники.AzRyНастройки.НачислениеТарифнаяСтавка.Значение); 
	Запрос.УстановитьПараметр("Налог", Справочники.AzRyНастройки.УдержаниеНДФЛ.Значение);    
	
	ТЗСотрудникиСоотв = Запрос.Выполнить().Выгрузить();
	ТЗСотрудникиСоотв.Свернуть("Сотрудник, Сумма", "ЗагрузкаПлан");
	
	Возврат ТЗСотрудникиСоотв;

КонецФункции // ТарифСотрудниковJira()
 
Функция СтавкаПоРабочимЧисам(ДатаОбновления, СуммаWorklogs, Ставка)
	
	КРДВ = AzRyFunctions.КоличествоРабочихДнейВМесяце(Год(ДатаОбновления), НачалоМесяца(ДатаОбновления), КонецМесяца(ДатаОбновления));
	КЧР  = Справочники.AzRyНастройки.КоличествоРабочихЧасов.Значение;
	
	Зарплата = (Ставка / КРДВ / КЧР) * СуммаWorklogs;         
	
	К = 0;
	Если Зарплата > Ставка Тогда 
		К = Зарплата - Ставка;
	КонецЕсли;	
	
	Возврат Зарплата - К;
	
КонецФункции	

Функция СоответствиеТарифнаяСтавка(ТЗ, ТарифнаяСтавка) Экспорт

	Соответствие = Новый Соответствие;
	Отбор = Новый Структура;
	Отбор.Вставить("ВидНачисленияУдержания", ТарифнаяСтавка);
	Строки = ТЗ.НайтиСтроки(Отбор);
	Если Строки.Количество() > 0 Тогда		
		Для каждого ТекМассив Из Строки Цикл
			Соответствие.Вставить(ТекМассив.Сотрудник, ТекМассив);	
		КонецЦикла;			
	КонецЕсли; 
		
	Возврат Соответствие;

КонецФункции 

Функция СуммаПенсия(Сотрудник, ТЗ)

	СуммаПенсия = 0;
	Отбор = Новый Структура();
	Отбор.Вставить("ВидНачисленияУдержания", Справочники.AzRyНастройки.НачислениеПенсия.Значение);
	Отбор.Вставить("Сотрудник", Сотрудник);
	Строки = ТЗ.НайтиСтроки(Отбор);
	Если Строки.Количество() > 0 Тогда
		СуммаПенсия = Строки[0].Сумма;
	КонецЕсли;
	
	Возврат СуммаПенсия;
	
КонецФункции

Функция ПенсияВычислить(ТекСтрока, ВидНачисленияУдержания, ЗначениеНачисленияЗарплаты) Экспорт

	Сумма = 0;
	Если ВидНачисленияУдержания = Справочники.AzRyНастройки.НачислениеПенсия.Значение Или ВидНачисленияУдержания = Справочники.AzRyНастройки.УдержаниеПенсия.Значение Тогда
		Если ТекСтрока.Актуальность Тогда
			Сумма = ЗначениеНачисленияЗарплаты.Сумма * 0.02;
			ЗначениеНачисленияЗарплаты.СуммаПФ = Сумма;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат	Сумма;
	
КонецФункции

Функция ПустаяТаблицаНачисленияУдержания()

	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Jira", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТЗ.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТЗ.Колонки.Добавить("СчетЗатратРегл", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ТЗ.Колонки.Добавить("Должность");  
	ТЗ.Колонки.Добавить("ЗанимаемыхСтавок"); 
	ТЗ.Колонки.Добавить("СтруктурнаяЕдиница", Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы"));
	ТЗ.Колонки.Добавить("AzRyDivision", Новый ОписаниеТипов("СправочникСсылка.AzRyDivision"));
	ТЗ.Колонки.Добавить("ГрафикРаботы");
	ТЗ.Колонки.Добавить("Тип");
	ТЗ.Колонки.Добавить("ВыплаченнаяСумма");
	ТЗ.Колонки.Добавить("Актуальность");
	
	ТЗ.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТЗ.Колонки.Добавить("ВидНачисленияУдержания", Новый ОписаниеТипов("СправочникСсылка.ВидыНачисленийИУдержаний"));
	ТЗ.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("СуммаПФ", Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("НаправлениеДеятельности", Новый ОписаниеТипов("СправочникСсылка.НаправленияДеятельности"));
	ТЗ.Колонки.Добавить("ЗаказПокупателя", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
	ТЗ.Колонки.Добавить("Проект", Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	ТЗ.Колонки.Добавить("НачисляемЗарплату", Новый ОписаниеТипов("Булево"));
	
	Возврат ТЗ;

КонецФункции

Функция ПустаяТаблицаНалог()

	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Сотрудник");
	ТЗ.Колонки.Добавить("Налог");
	ТЗ.Колонки.Добавить("Тип");
	ТЗ.Колонки.Добавить("Сумма");
	
	Возврат ТЗ;

КонецФункции
 
Функция ДинамическоеВычислениеЗарплат(ТЗДанные, МассивНачисленииИУдержаний, Организация, Параметры)
	
	ИсторияСотрудника.Очистить();
	
	Если Параметры.ВидНачисления = "I_Половина" Тогда	
		Период1 = НачалоМесяца(Параметры.ПериодРегистраций);
		Период2 = КонецДня(Дата(Год(Параметры.ПериодРегистраций), Месяц(Параметры.ПериодРегистраций), 15));
	ИначеЕсли Параметры.ВидНачисления = "II_Половина" Тогда
		Период1 = НачалоДня(Дата(Год(Параметры.ПериодРегистраций), Месяц(Параметры.ПериодРегистраций), 16));
		Период2 = КонецМесяца(Параметры.ПериодРегистраций);		
	ИначеЕсли Параметры.ВидНачисления = "Зарплата" Тогда	
		Период1 = НачалоМесяца(Параметры.ПериодРегистраций);
		Период2 = КонецМесяца(Параметры.ПериодРегистраций);
	КонецЕсли;
	
	Параметры.Вставить("Период1", Период1);
	Параметры.Вставить("Период2", Период2);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.Период,
		|	ВложенныйЗапрос.Регистратор,
		|	ВложенныйЗапрос.НомерСтроки,
		|	ВложенныйЗапрос.Активность,
		|	ВложенныйЗапрос.Организация,
		|	ВложенныйЗапрос.Сотрудник,
		|	ВложенныйЗапрос.ВидНачисленияУдержания,
		|	ВложенныйЗапрос.Валюта,
		|	ВложенныйЗапрос.Сумма,
		|	ВложенныйЗапрос.СчетЗатратРегл,
		|	ВложенныйЗапрос.Актуальность
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПлановыеНачисленияИУдержанияСрезПоследних.Период КАК Период,
		|		ПлановыеНачисленияИУдержанияСрезПоследних.Регистратор КАК Регистратор,
		|		ПлановыеНачисленияИУдержанияСрезПоследних.НомерСтроки КАК НомерСтроки,
		|		ПлановыеНачисленияИУдержанияСрезПоследних.Активность КАК Активность,
		|		ПлановыеНачисленияИУдержанияСрезПоследних.Организация КАК Организация,
		|		ПлановыеНачисленияИУдержанияСрезПоследних.Сотрудник КАК Сотрудник,
		|		ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
		|		ПлановыеНачисленияИУдержанияСрезПоследних.Валюта КАК Валюта,
		|		ПлановыеНачисленияИУдержанияСрезПоследних.Сумма КАК Сумма,
		|		ПлановыеНачисленияИУдержанияСрезПоследних.СчетЗатратРегл КАК СчетЗатратРегл,
		|		ПлановыеНачисленияИУдержанияСрезПоследних.Актуальность КАК Актуальность
		|	ИЗ
		|		РегистрСведений.ПлановыеНачисленияИУдержания.СрезПоследних(&Период1, ) КАК ПлановыеНачисленияИУдержанияСрезПоследних
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПлановыеНачисленияИУдержания.Период,
		|		ПлановыеНачисленияИУдержания.Регистратор,
		|		ПлановыеНачисленияИУдержания.НомерСтроки,
		|		ПлановыеНачисленияИУдержания.Активность,
		|		ПлановыеНачисленияИУдержания.Организация,
		|		ПлановыеНачисленияИУдержания.Сотрудник,
		|		ПлановыеНачисленияИУдержания.ВидНачисленияУдержания,
		|		ПлановыеНачисленияИУдержания.Валюта,
		|		ПлановыеНачисленияИУдержания.Сумма,
		|		ПлановыеНачисленияИУдержания.СчетЗатратРегл,
		|		ПлановыеНачисленияИУдержания.Актуальность
		|	ИЗ
		|		РегистрСведений.ПлановыеНачисленияИУдержания КАК ПлановыеНачисленияИУдержания
		|	ГДЕ
		|		ПлановыеНачисленияИУдержания.Период МЕЖДУ &Период1 И &Период2) КАК ВложенныйЗапрос
		|ГДЕ
		|	ВложенныйЗапрос.Организация = &Организация
		|	И ВложенныйЗапрос.ВидНачисленияУдержания В(&ВидНачисленияУдержания)
		|	И ВложенныйЗапрос.ВидНачисленияУдержания.Тип <> &Тип
		|	И ВложенныйЗапрос.Сотрудник В(&Сотрудник)";
	
	Запрос.УстановитьПараметр("ВидНачисленияУдержания", Параметры.ОбъектНачисленияЗарплаты);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период1", Период1);
	Запрос.УстановитьПараметр("Период2", Период2);
	Запрос.УстановитьПараметр("Сотрудник", ТЗДанные.ВыгрузитьКолонку("Сотрудник"));
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыНачисленийИУдержаний.Налог);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();		

	ТЗСотрудники = ТЗДанные.Скопировать();
	ТЗСотрудники.Свернуть("Сотрудник");
	
	Соот = Новый Соответствие;
	Для каждого ТекСтрока Из ТЗСотрудники Цикл		
		Отбор = Новый Структура("Сотрудник", ТекСтрока.Сотрудник);
		Строки = РезультатЗапроса.НайтиСтроки(Отбор);	
		
		Если Строки.Количество() = 1 И ТипЗнч(Строки[0].Регистратор) = Тип("ДокументСсылка.ПриемНаРаботу") И Строки[0].Период > НачалоМесяца(Параметры.ПериодРегистраций) Тогда
			ЗарплатаСотрудника = РасчетЗарплаты(Строки, Параметры);
			Соот.Вставить(ТекСтрока.Сотрудник, ЗарплатаСотрудника);			
		ИначеЕсли Строки.Количество() > 1 Тогда				
			ЗарплатаСотрудника = РасчетЗарплаты(Строки, Параметры);
			Соот.Вставить(ТекСтрока.Сотрудник, ЗарплатаСотрудника); 	
		КонецЕсли; 
	КонецЦикла;
	
	// დინამიურად გამოთვლილი თანხების ჩანაცვლება ძირითად ცხრილში
	Для каждого ТекЗначение Из Соот Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Сотрудник", ТекЗначение.Ключ);
		//Отбор.Вставить("ВидНачисленияУдержания", Справочники.AzRyНастройки.НачислениеТарифнаяСтавка.Значение);
		Отбор.Вставить("ВидНачисленияУдержания", Параметры.ОбъектНачисленияЗарплаты);
		//тз = Новый ТаблицаЗначений;
		Строки = ТЗДанные.НайтиСтроки(Отбор);
		Если Строки.Количество() > 0 Тогда
			Строки[0].Сумма = ТекЗначение.Значение;		
		КонецЕсли; 
	КонецЦикла;
	
	Возврат Соот;
	
КонецФункции

Функция ТаблицаНалогов(МассивНалог, Организация, Параметры, СотрудникиМассив)

	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПлановыеНачисленияИУдержанияСрезПоследних.Сотрудник КАК Сотрудник,
	               |	ПлановыеНачисленияИУдержанияСрезПоследних.Организация,
	               |	ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания,
	               |	ПлановыеНачисленияИУдержанияСрезПоследних.Валюта,
	               |	ПлановыеНачисленияИУдержанияСрезПоследних.Сумма,
	               |	ПлановыеНачисленияИУдержанияСрезПоследних.СчетЗатратРегл,
	               |	ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания.Тип КАК Тип
	               |ИЗ
	               |	РегистрСведений.ПлановыеНачисленияИУдержания.СрезПоследних(&Дата, ) КАК ПлановыеНачисленияИУдержанияСрезПоследних
	               |ГДЕ
	               |	ПлановыеНачисленияИУдержанияСрезПоследних.Сотрудник В(&Сотрудник)
	               |	И ПлановыеНачисленияИУдержанияСрезПоследних.Организация = &Организация
	               |	И ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания.Тип = &Тип
	               |	И ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания В(&ВидНачисленияУдержания)";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудник", СотрудникиМассив);
	Запрос.УстановитьПараметр("Дата", КонецДня(Параметры.ПериодРегистраций));
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыНачисленийИУдержаний.Налог);
	Запрос.УстановитьПараметр("ВидНачисленияУдержания", МассивНалог);
	
	Возврат Запрос.Выполнить().Выгрузить();	

КонецФункции

Функция ТаблицаНачисленийИУдержаний(МассивНачисленииИУдержаний, Параметры, СотрудникиМассив, Организация, ТЗАктивныеСотрудники)

	спНачИУдержJira = Новый СписокЗначений;
	спНачИУдержJira.Добавить(Справочники.AzRyНастройки.НачислениеПенсия.Значение);
	спНачИУдержJira.Добавить(Справочники.AzRyНастройки.УдержаниеПенсия.Значение);
	//спНачИУдержJira.Добавить(Справочники.AzRyНастройки.НачислениеТарифнаяСтавка.Значение);
	спНачИУдержJira.Добавить(Параметры.ОбъектНачисленияЗарплаты);
	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗСотрудники.Активность,
	               |	ТЗСотрудники.ГрафикРаботы,
	               |	ТЗСотрудники.Должность,
	               |	ТЗСотрудники.ЗанимаемыхСтавок,
	               |	ТЗСотрудники.Организация,
	               |	ТЗСотрудники.Период,
				   //|	ТЗСотрудники.Регистратор,
	               |	ТЗСотрудники.Сотрудник,
	               |	ТЗСотрудники.СтруктурнаяЕдиница,
	               |	ТЗСотрудники.Jira
	               |ПОМЕСТИТЬ ТЗСотрудникиД
	               |ИЗ
	               |	&ТЗСотрудники КАК ТЗСотрудники
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПлановыеНачисленияИУдержанияСрезПоследних.Сотрудник КАК Сотрудник,
	               |	ПлановыеНачисленияИУдержанияСрезПоследних.Организация,
	               |	ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания,
	               |	ПлановыеНачисленияИУдержанияСрезПоследних.Валюта,
	               |	ПлановыеНачисленияИУдержанияСрезПоследних.Сумма КАК Сумма,
	               |	ВЫБОР
	               |		КОГДА ПлановыеНачисленияИУдержанияСрезПоследних.СчетЗатратРегл = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	               |			ТОГДА ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания.СчетЗатратРегл
	               |		ИНАЧЕ ПлановыеНачисленияИУдержанияСрезПоследних.СчетЗатратРегл
	               |	КОНЕЦ КАК СчетЗатратРегл,
	               |	ТЗСотрудникиД.Должность,
	               |	ТЗСотрудникиД.ЗанимаемыхСтавок,
	               |	ТЗСотрудникиД.СтруктурнаяЕдиница,
	               |	ТЗСотрудникиД.ГрафикРаботы,
	               |	ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания.Тип КАК Тип,
	               |	РасчетыСПерсоналомОстаткиИОбороты.СуммаРасход КАК ВыплаченнаяСумма,
	               |	ПлановыеНачисленияИУдержанияСрезПоследних.Актуальность,
	               |	СотрудникиСрезПоследних.AzRyDivision,
	               |	ВЫБОР
	               |		КОГДА ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания В (&НачИУдержJira)
	               |			ТОГДА ТЗСотрудникиД.Jira
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК Jira,
				   |	0 КАК СуммаПФ
	               |ИЗ
	               |	ТЗСотрудникиД КАК ТЗСотрудникиД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПерсоналом.ОстаткиИОбороты(
	               |				,
	               |				,
	               |				,
	               |				,
	               |				Организация = &Организация
	               |					И ПериодРегистрации = &ПериодРегистрации) КАК РасчетыСПерсоналомОстаткиИОбороты
	               |		ПО ТЗСотрудникиД.Сотрудник = РасчетыСПерсоналомОстаткиИОбороты.Сотрудник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания.СрезПоследних(&Дата, НЕ Регистратор ССЫЛКА Документ.Увольнение) КАК ПлановыеНачисленияИУдержанияСрезПоследних
	               |		ПО (ПлановыеНачисленияИУдержанияСрезПоследних.Сотрудник = ТЗСотрудникиД.Сотрудник)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники.СрезПоследних(&Дата, AzRyDivision <> &AzRyDivision) КАК СотрудникиСрезПоследних
	               |		ПО ТЗСотрудникиД.Сотрудник = СотрудникиСрезПоследних.Сотрудник
	               |			И ТЗСотрудникиД.Организация = СотрудникиСрезПоследних.Организация
	               |ГДЕ
	               |	ПлановыеНачисленияИУдержанияСрезПоследних.Организация = &Организация
	               |	И ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания В(&ВидНачисленияУдержания)
	               |	И ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания.Тип <> &Тип
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Сумма УБЫВ";
	
	Запрос.УстановитьПараметр("Организация", Организация);    
	Запрос.УстановитьПараметр("Сотрудник", СотрудникиМассив);
	Запрос.УстановитьПараметр("Дата", КонецДня(Параметры.ПериодРегистраций));
	Запрос.УстановитьПараметр("ВидНачисленияУдержания", МассивНачисленииИУдержаний);
	Запрос.УстановитьПараметр("ПериодРегистрации", Параметры.ПериодРегистраций);
	Запрос.УстановитьПараметр("ТЗСотрудники", ТЗАктивныеСотрудники);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыНачисленийИУдержаний.Налог);
	Запрос.УстановитьПараметр("AzRyDivision", Справочники.AzRyDivision.ПустаяСсылка());
	//Запрос.УстановитьПараметр("ОснвВидНач", Справочники.AzRyНастройки.НачислениеТарифнаяСтавка.Значение);
	Запрос.УстановитьПараметр("НачИУдержJira", спНачИУдержJira);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции
 
Функция РасчетЗарплаты(Массив, Параметры)

	Если Не Массив[Массив.Количество()-1].Период = КонецДня(Параметры.ПериодРегистраций) Тогда
		СтрДата = Новый Структура;
		Для каждого ТекКолонка Из Массив[Массив.Количество()-1].Владелец().Колонки Цикл
			СтрДата.Вставить(ТекКолонка.Заголовок, "");			
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(СтрДата, Массив[Массив.Количество()-1]);
		
		//Если Параметры.ВидНачисления = "I_Половина" Тогда	
		//	СтрДата.Период = КонецДня(Параметры.ПериодРегистраций);	
		//ИначеЕсли Параметры.ВидНачисления = "II_Половина" Тогда
		//	СтрДата.Период = КонецМесяца(Параметры.ПериодРегистраций);	
		//ИначеЕсли Параметры.ВидНачисления = "Зарплата" Тогда	
		//	СтрДата.Период = КонецДня(Параметры.ПериодРегистраций);	
		//КонецЕсли;
		
		СтрДата.Период = КонецДня(Параметры.ПериодРегистраций);
		СтрДата.Сумма = 0;
		
		Массив.Добавить(СтрДата);
	КонецЕсли;
	
	Ответ = ДанныеРабочихЧасов(Параметры.ПериодРегистраций);
	
	Н = 0;
	Сумма = 0;
	ПериодНачало = Неопределено;
	СтрЗарплата = 0;
	Для каждого ТекСтрока Из Массив Цикл
		
		// თუ ხელფასი ერთი და იგივეა ესეიგი ხელფასი არ გაიზარდა, მხოლოდ საკადრო გადაადგილება მოხდა ან განთავისუფლება
		Если СтрЗарплата = ТекСтрока.Сумма Тогда Продолжить; КонецЕсли;
		
		Если Н <> 0 Тогда
			
			Если Н = Массив.Количество()-1 Тогда
				Часов = 0;
			Иначе 
				Часов = (60*60*24);
			КонецЕсли; 
			
			КРД = AzRyFunctions.КоличествоРабочихДнейВМесяце(Год(Параметры.ПериодРегистраций), НачалоДня(ПериодНачало), КонецДня(ТекСтрока.Период - Часов));
			Сумма = Сумма + СтрЗарплата / Ответ.КРДВ * КРД;
			
			НоваяСтрока = ЭтотОбъект.ИсторияСотрудника.Добавить();
			НоваяСтрока.Сотрудник = ТекСтрока.Сотрудник;
			НоваяСтрока.Дата1 = НачалоДня(ПериодНачало);
			НоваяСтрока.Дата2 =  КонецДня(ТекСтрока.Период - Часов);
			НоваяСтрока.КоличествоРабДнейМесяца = Ответ.КРДВ;
			НоваяСтрока.КоличествоРабДней       = КРД;
			НоваяСтрока.Зарплата     = СтрЗарплата;
			НоваяСтрока.Зарплата2    = СтрЗарплата / Ответ.КРДВ * КРД;
			НоваяСтрока.ЗарплатаЗаОдинДень      = ?(НоваяСтрока.Зарплата2 = 0, 0, НоваяСтрока.Зарплата2 / КРД);
			НоваяСтрока.ЗарплатаИтог = Сумма;
		КонецЕсли; 
				
		СтрЗарплата = ТекСтрока.Сумма;
		
		Если Параметры.ВидНачисления = "I_Половина" Тогда	
			ПериодНачало   = ?(ТекСтрока.Период < НачалоМесяца(Параметры.ПериодРегистраций), НачалоМесяца(Параметры.ПериодРегистраций), ТекСтрока.Период);
		ИначеЕсли Параметры.ВидНачисления = "II_Половина" Тогда
			ПериодНачало   = ?(ТекСтрока.Период <= НачалоДня(Параметры.Период1), НачалоДня(Параметры.Период1), ТекСтрока.Период);		
		ИначеЕсли Параметры.ВидНачисления = "Зарплата" Тогда	
			ПериодНачало   = ?(ТекСтрока.Период < НачалоМесяца(Параметры.ПериодРегистраций), НачалоМесяца(Параметры.ПериодРегистраций), ТекСтрока.Период);
		КонецЕсли;
		
	    Н = Н +1;
	КонецЦикла;	

	Возврат Сумма;
	
КонецФункции
 
Функция ДанныеРабочихЧасов(ПериодРегистраций) Экспорт

	КРДВ = AzRyFunctions.КоличествоРабочихДнейВМесяце(Год(ПериодРегистраций), НачалоМесяца(ПериодРегистраций), КонецМесяца(ПериодРегистраций));
	
	Структура = Новый Структура;
	Структура.Вставить("КРДВ", КРДВ);
	
	Возврат Структура;

КонецФункции

Функция ОбработкаДокументовНачисленияЗаПериод(Период1, Период2) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачислениеЗарплатыНачисленияУдержания.Ссылка,
		|	НачислениеЗарплатыНачисленияУдержания.НомерСтроки,
		|	НачислениеЗарплатыНачисленияУдержания.Сотрудник,
		|	НачислениеЗарплатыНачисленияУдержания.Должность,
		|	НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания,
		|	НачислениеЗарплатыНачисленияУдержания.ДатаНачала,
		|	НачислениеЗарплатыНачисленияУдержания.ДатаОкончания,
		|	НачислениеЗарплатыНачисленияУдержания.ОтработаноДней,
		|	НачислениеЗарплатыНачисленияУдержания.ОтработаноЧасов,
		|	НачислениеЗарплатыНачисленияУдержания.Размер,
		|	НачислениеЗарплатыНачисленияУдержания.Сумма,
		|	НачислениеЗарплатыНачисленияУдержания.СчетЗатратРегл,
		|	НачислениеЗарплатыНачисленияУдержания.НаправлениеДеятельности,
		|	НачислениеЗарплатыНачисленияУдержания.ЗаказПокупателя,
		|	НачислениеЗарплатыНачисленияУдержания.РучнаяКорректировка,
		|	НачислениеЗарплатыНачисленияУдержания.Показатель1,
		|	НачислениеЗарплатыНачисленияУдержания.Представление1,
		|	НачислениеЗарплатыНачисленияУдержания.Значение1,
		|	НачислениеЗарплатыНачисленияУдержания.Показатель2,
		|	НачислениеЗарплатыНачисленияУдержания.Представление2,
		|	НачислениеЗарплатыНачисленияУдержания.Значение2,
		|	НачислениеЗарплатыНачисленияУдержания.Показатель3,
		|	НачислениеЗарплатыНачисленияУдержания.Представление3,
		|	НачислениеЗарплатыНачисленияУдержания.Значение3,
		|	НачислениеЗарплатыНачисленияУдержания.AzRyНоменклатура,
		|	НачислениеЗарплатыНачисленияУдержания.AzRyDivision
		|ПОМЕСТИТЬ ТЗ
		|ИЗ
		|	Документ.НачислениеЗарплаты.НачисленияУдержания КАК НачислениеЗарплатыНачисленияУдержания
		|ГДЕ
		|	НачислениеЗарплатыНачисленияУдержания.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
		|	И НачислениеЗарплатыНачисленияУдержания.Ссылка.Проведен
		|	И НачислениеЗарплатыНачисленияУдержания.Ссылка.AzRyТипСозданияДокумента = &AzRyТипСозданияДокумента
		|	И НачислениеЗарплатыНачисленияУдержания.Сотрудник В(&Сотрудник)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НачислениеЗарплатыНалогиНаДоходы.Сотрудник,
		|	НачислениеЗарплатыНалогиНаДоходы.ВидНачисленияУдержания
		|ПОМЕСТИТЬ ТЗ_Налог
		|ИЗ
		|	Документ.НачислениеЗарплаты.НалогиНаДоходы КАК НачислениеЗарплатыНалогиНаДоходы
		|ГДЕ
		|	НачислениеЗарплатыНалогиНаДоходы.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
		|	И НачислениеЗарплатыНалогиНаДоходы.Ссылка.Проведен
		|	И НачислениеЗарплатыНалогиНаДоходы.Ссылка.AzRyТипСозданияДокумента = &AzRyТипСозданияДокумента
		|	И НачислениеЗарплатыНалогиНаДоходы.Сотрудник В(&Сотрудник)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗ.Ссылка.Организация КАК Организация
		|ИЗ
		|	ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗ.Ссылка.Организация КАК Организация,
		|	ТЗ.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		|ИЗ
		|	ТЗ КАК ТЗ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗ.Сотрудник,
		|	ТЗ.Ссылка.Организация,
		|	ТЗ.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
		|	СУММА(ТЗ.Сумма) КАК Сумма,
		|	ТЗ.AzRyDivision,
		|	ТЗ.СчетЗатратРегл,
		|	ТЗ.Должность,
		|	ТЗ.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТЗ.ВидНачисленияУдержания.Тип,
		|	ИСТИНА КАК Актуальность,
		|	"""""""" КАК Jira
		|ИЗ
		|	ТЗ КАК ТЗ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЗ.Сотрудник,
		|	ТЗ.ВидНачисленияУдержания,
		|	ТЗ.AzRyDivision,
		|	ТЗ.Ссылка.Организация,
		|	ТЗ.СчетЗатратРегл,
		|	ТЗ.Должность,
		|	ТЗ.Ссылка.СтруктурнаяЕдиница,
		|	ТЗ.ВидНачисленияУдержания.Тип
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Активность,
		|	ВложенныйЗапрос.Организация,
		|	ВложенныйЗапрос.Сотрудник,
		|	ВложенныйЗапрос.СтруктурнаяЕдиница,
		|	ВложенныйЗапрос.AzRyDivision,
		|	ВложенныйЗапрос.Должность,
		|	ВложенныйЗапрос.ЗанимаемыхСтавок,
		|	ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка) КАК ГрафикРаботы,
		|	&Дата2 КАК Период,
		|	""Jira"" КАК Jira
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ИСТИНА КАК Активность,
		|		ТЗ.Ссылка.Организация КАК Организация,
		|		ТЗ.Сотрудник КАК Сотрудник,
		|		ТЗ.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|		ТЗ.AzRyDivision КАК AzRyDivision,
		|		ТЗ.Должность КАК Должность,
		|		1 КАК ЗанимаемыхСтавок
		|	ИЗ
		|		ТЗ КАК ТЗ) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗ_Налог.Сотрудник,
		|	ТЗ_Налог.ВидНачисленияУдержания,
		|	ТЗ_Налог.ВидНачисленияУдержания.Тип КАК Тип
		|ИЗ
		|	ТЗ_Налог КАК ТЗ_Налог";
	
	Запрос.УстановитьПараметр("Дата1", Период1);
	Запрос.УстановитьПараметр("Дата2", Период2);
	
	м = Новый Массив;
	м.Добавить(Справочники.Сотрудники.НайтиПоКоду("000000025"));
	//м.Добавить(Справочники.Сотрудники.НайтиПоКоду("000000045"));
	
	Запрос.УстановитьПараметр("Сотрудник", м);
	Запрос.УстановитьПараметр("AzRyТипСозданияДокумента", Перечисления.AzRyТипСозданияДокумента.Jira);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТЗОрганизаций   = РезультатЗапроса[2].Выгрузить();
	ТЗПодразделения = РезультатЗапроса[3].Выгрузить();
	ТЗВидНачисления = РезультатЗапроса[4].Выгрузить();
	ТЗСотрудники    = РезультатЗапроса[5].Выгрузить();
	ТЗСотрудникиНалог = РезультатЗапроса[6].Выгрузить();
	                                           
	Соот = Новый Соответствие;
	Для каждого ТекСтрока Из ТЗОрганизаций Цикл
		
		Массив = Новый Массив;
		Отбор = Новый Структура();
		Отбор.Вставить("Организация", ТекСтрока.Организация);
		Строки = ТЗПодразделения.НайтиСтроки(Отбор);
		Для каждого ТекСтрока2 Из Строки Цикл
			Массив.Добавить(ТекСтрока2.СтруктурнаяЕдиница);	 			
		КонецЦикла;
			
		Соот.Вставить(ТекСтрока.Организация, Массив);
	КонецЦикла;
	
	//Для каждого ТекСоот Из Соот Цикл
	//	ОчиститьНачисленияСотрудникам(Период1, Период2, ТекСоот.Ключ, ТекСоот.Значение, ТЗВидНачисления);
	//КонецЦикла;

	Стр = Новый Структура;
	Стр.Вставить("ТЗОрганизаций",   ТЗОрганизаций);
	Стр.Вставить("ТЗПодразделения", ТЗПодразделения);
	Стр.Вставить("ТЗВидНачисления", ТЗВидНачисления);
	Стр.Вставить("ТЗСотрудники", ТЗСотрудники);
	Стр.Вставить("ТЗСотрудникиНалог", ТЗСотрудникиНалог);
	Стр.Вставить("Соот", Соот);
	
	Возврат Стр;
	
КонецФункции

Функция ОбработкаДокументовНачисленияЗаПериод2(Период1, Период2) Экспорт
	
	
	//|	ТЗ.Сотрудник,
	//|	ТЗ.ВидНачисленияУдержания,
	//|	ТЗ.Организация,
	//|	ТЗ.СтруктурнаяЕдиница,
	//|	ТЗ.AzRyDivision,
	//|	ТЗ.СчетЗатратРегл,
	//|	ТЗ.Валюта,
	//|	ТЗ.Сумма,
	//|	ТЗ.Jira,
	//|	ТЗ.НаправлениеДеятельности,
	//|	ТЗ.ЗаказПокупателя
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	//	|	ВложенныйЗапрос.Сотрудник,
	//	|	ВложенныйЗапрос.ВидНачисленияУдержания,
	//	|	ВложенныйЗапрос.Организация,
	//	|	ВложенныйЗапрос.СтруктурнаяЕдиница,
	//	|	ВложенныйЗапрос.AzRyDivision,
	//	|	ВложенныйЗапрос.СчетЗатратРегл,
	//	|	ВложенныйЗапрос.Валюта,
	//	|	ВложенныйЗапрос.Сумма КАК Сумма,
	//	|	JiraStatus.Jira КАК Jira
	//	|ИЗ
	//	|	(ВЫБРАТЬ
	//	|		НачислениеЗарплатыНачисленияУдержания.Ссылка КАК Ссылка,
	//	|		НачислениеЗарплатыНачисленияУдержания.Сотрудник КАК Сотрудник,
	//	|		НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	//	|		НачислениеЗарплатыНачисленияУдержания.Ссылка.Организация КАК Организация,
	//	|		НачислениеЗарплатыНачисленияУдержания.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//	|		НачислениеЗарплатыНачисленияУдержания.AzRyDivision КАК AzRyDivision,
	//	|		НачислениеЗарплатыНачисленияУдержания.СчетЗатратРегл КАК СчетЗатратРегл,
	//	|		&Валюта КАК Валюта,
	//	|		СУММА(НачислениеЗарплатыНачисленияУдержания.Сумма) КАК Сумма,
	//	|		""Jira"" КАК Jira
	//	|	ИЗ
	//	|		Документ.НачислениеЗарплаты.НачисленияУдержания КАК НачислениеЗарплатыНачисленияУдержания
	//	|	ГДЕ
	//	|		НачислениеЗарплатыНачисленияУдержания.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	//	|		И НачислениеЗарплатыНачисленияУдержания.Ссылка.Проведен
	//	|		И НачислениеЗарплатыНачисленияУдержания.Ссылка.AzRyТипСозданияДокумента = &AzRyТипСозданияДокумента
	//	// Debug --
	//	//|		И НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания В(&ВидНачисленияУдержания)
	//	// Debug --
	//	|	
	//	|	СГРУППИРОВАТЬ ПО
	//	|		НачислениеЗарплатыНачисленияУдержания.Ссылка,
	//	|		НачислениеЗарплатыНачисленияУдержания.Сотрудник,
	//	|		НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания,
	//	|		НачислениеЗарплатыНачисленияУдержания.Ссылка.Организация,
	//	|		НачислениеЗарплатыНачисленияУдержания.Ссылка.СтруктурнаяЕдиница,
	//	|		НачислениеЗарплатыНачисленияУдержания.AzRyDivision,
	//	|		НачислениеЗарплатыНачисленияУдержания.СчетЗатратРегл) КАК ВложенныйЗапрос
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//	|			All.Сотрудник КАК Сотрудник,
	//	|			JiraLogs.Сотрудник КАК Сотрудник1,
	//	|			ВЫБОР
	//	|				КОГДА JiraLogs.Сотрудник ЕСТЬ NULL 
	//	|					ТОГДА """"
	//	|				ИНАЧЕ ""Jira""
	//	|			КОНЕЦ КАК Jira
	//	|		ИЗ
	//	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|				НачислениеЗарплатыНачисленияУдержания.Сотрудник КАК Сотрудник
	//	|			ИЗ
	//	|				Документ.НачислениеЗарплаты.НачисленияУдержания КАК НачислениеЗарплатыНачисленияУдержания
	//	|			ГДЕ
	//	|				НачислениеЗарплатыНачисленияУдержания.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	//	|				И НачислениеЗарплатыНачисленияУдержания.Ссылка.Проведен) КАК All
	//	|				ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|					ЗаданиеНаРаботу.Сотрудник КАК Сотрудник
	//	|				ИЗ
	//	|					Документ.ЗаданиеНаРаботу КАК ЗаданиеНаРаботу
	//	|				ГДЕ
	//	|					ЗаданиеНаРаботу.Дата МЕЖДУ &Дата1 И &Дата2
	//	|					И ЗаданиеНаРаботу.Проведен) КАК JiraLogs
	//	|				ПО All.Сотрудник = JiraLogs.Сотрудник) КАК JiraStatus
	//	|		ПО ВложенныйЗапрос.Сотрудник = JiraStatus.Сотрудник
	//	// Debug -- 
	//	//|	ГДЕ
	//	//|		ВложенныйЗапрос.Сотрудник = &Сотрудник		
	//	// Debug -- 
	//	|ИТОГИ
	//	|	СУММА(Сумма)
	//	|ПО
	//	|	Ссылка";
		
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Ссылка КАК Ссылка,
		|	ВложенныйЗапрос.Сотрудник,
		|	ВложенныйЗапрос.ВидНачисленияУдержания,
		|	ВложенныйЗапрос.Организация,
		|	ВложенныйЗапрос.СтруктурнаяЕдиница,
		|	ВложенныйЗапрос.AzRyDivision,
		|	ВложенныйЗапрос.СчетЗатратРегл,
		|	ВложенныйЗапрос.Валюта,
		|	ВложенныйЗапрос.Сумма КАК Сумма,
		|	ВложенныйЗапрос.Jira,
		|	ВложенныйЗапрос.НаправлениеДеятельности,
		|	ВложенныйЗапрос.ЗаказПокупателя
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Ссылка КАК Ссылка,
		|		ВложенныйЗапрос.Сотрудник КАК Сотрудник,
		|		ВложенныйЗапрос.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
		|		ВложенныйЗапрос.Организация КАК Организация,
		|		ВложенныйЗапрос.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|		ВложенныйЗапрос.AzRyDivision КАК AzRyDivision,
		|		ВложенныйЗапрос.СчетЗатратРегл КАК СчетЗатратРегл,
		|		ВложенныйЗапрос.Валюта КАК Валюта,
		|		СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
		|		ВложенныйЗапрос.Jira КАК Jira,
		|		ВложенныйЗапрос.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|		ВложенныйЗапрос.ЗаказПокупателя КАК ЗаказПокупателя
		|	ИЗ
		|		(ВЫБРАТЬ
		|			НачислениеЗарплатыНачисленияУдержания.Ссылка КАК Ссылка,
		|			НачислениеЗарплатыНачисленияУдержания.Сотрудник КАК Сотрудник,
		|			НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
		|			НачислениеЗарплатыНачисленияУдержания.Ссылка.Организация КАК Организация,
		|			НачислениеЗарплатыНачисленияУдержания.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|			НачислениеЗарплатыНачисленияУдержания.AzRyDivision КАК AzRyDivision,
		|			НачислениеЗарплатыНачисленияУдержания.СчетЗатратРегл КАК СчетЗатратРегл,
		|			&Валюта КАК Валюта,
		|			НачислениеЗарплатыНачисленияУдержания.Сумма КАК Сумма,
		|			JiraStatus.Jira КАК Jira,
		|			ВЫБОР
		|				КОГДА JiraStatus.Jira = """"
		|					ТОГДА НачислениеЗарплатыНачисленияУдержания.НаправлениеДеятельности
		|				ИНАЧЕ NULL
		|			КОНЕЦ КАК НаправлениеДеятельности,
		|			ВЫБОР
		|				КОГДА JiraStatus.Jira = """"
		|					ТОГДА НачислениеЗарплатыНачисленияУдержания.ЗаказПокупателя
		|				ИНАЧЕ NULL
		|			КОНЕЦ КАК ЗаказПокупателя
		|		ИЗ
		|			Документ.НачислениеЗарплаты.НачисленияУдержания КАК НачислениеЗарплатыНачисленияУдержания
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					All.Сотрудник КАК Сотрудник,
		|					JiraLogs.Сотрудник КАК Сотрудник1,
		|					ВЫБОР
		|						КОГДА JiraLogs.Сотрудник ЕСТЬ NULL 
		|							ТОГДА """"
		|						ИНАЧЕ ""Jira""
		|					КОНЕЦ КАК Jira
		|				ИЗ
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						НачислениеЗарплатыНачисленияУдержания.Сотрудник КАК Сотрудник
		|					ИЗ
		|						Документ.НачислениеЗарплаты.НачисленияУдержания КАК НачислениеЗарплатыНачисленияУдержания
		|					ГДЕ
		|						НачислениеЗарплатыНачисленияУдержания.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
		|						И НачислениеЗарплатыНачисленияУдержания.Ссылка.Проведен) КАК All
		|						ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							ЗаданиеНаРаботу.Сотрудник КАК Сотрудник
		|						ИЗ
		|							Документ.ЗаданиеНаРаботу КАК ЗаданиеНаРаботу
		|						ГДЕ
		|							ЗаданиеНаРаботу.Дата МЕЖДУ &Дата1 И &Дата2
		|							И ЗаданиеНаРаботу.Проведен) КАК JiraLogs
		|						ПО All.Сотрудник = JiraLogs.Сотрудник) КАК JiraStatus
		|				ПО НачислениеЗарплатыНачисленияУдержания.Сотрудник = JiraStatus.Сотрудник
		|		ГДЕ
		|			НачислениеЗарплатыНачисленияУдержания.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
		|			И НачислениеЗарплатыНачисленияУдержания.Ссылка.Проведен
		|			И НачислениеЗарплатыНачисленияУдержания.Ссылка.AzRyТипСозданияДокумента = &AzRyТипСозданияДокумента) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Ссылка,
		|		ВложенныйЗапрос.Сотрудник,
		|		ВложенныйЗапрос.ВидНачисленияУдержания,
		|		ВложенныйЗапрос.Организация,
		|		ВложенныйЗапрос.СтруктурнаяЕдиница,
		|		ВложенныйЗапрос.AzRyDivision,
		|		ВложенныйЗапрос.СчетЗатратРегл,
		|		ВложенныйЗапрос.Валюта,
		|		ВложенныйЗапрос.Jira,
		|		ВложенныйЗапрос.НаправлениеДеятельности,
		|		ВложенныйЗапрос.ЗаказПокупателя) КАК ВложенныйЗапрос
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	Ссылка";		
	
	Запрос.УстановитьПараметр("Дата1", Период1);
	Запрос.УстановитьПараметр("Дата2", Период2);
	Запрос.УстановитьПараметр("Валюта", Константы.НациональнаяВалюта.Получить());
	
	// Debug 
	//Запрос.УстановитьПараметр("Сотрудник", Справочники.Сотрудники.НайтиПоКоду("000000160"));
	//Запрос.УстановитьПараметр("ВидНачисленияУдержания", Справочники.ВидыНачисленийИУдержаний.НайтиПоКоду("00-000006"));
	// Debug
	
	//м = Новый Массив;
	//м.Добавить(Справочники.Сотрудники.НайтиПоКоду("000000025"));
	//м.Добавить(Справочники.Сотрудники.НайтиПоКоду("000000045"));
	
	//Запрос.УстановитьПараметр("Сотрудник", м);
	Запрос.УстановитьПараметр("AzRyТипСозданияДокумента", Перечисления.AzRyТипСозданияДокумента.Jira);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		ТаблицаНачисленияИУдержания = ПустаяТаблицаНачисленияУдержания();
		
		Выборка0 = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборка0.Следующий() Цикл
			НоваяСтрока = ТаблицаНачисленияИУдержания.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка0);
			НоваяСтрока.НачисляемЗарплату = Истина;
		КонецЦикла;		
		
		ТТТ = ПолуФабрикать(Выборка.Ссылка.Организация, Период1, ТаблицаНачисленияИУдержания, "Jira");
		
		Об = Выборка.Ссылка.ПолучитьОбъект();
		Об.НачисленияУдержания.Очистить();
		Для каждого ТекСтрока Из ТТТ Цикл
			НовСтрока = Об.НачисленияУдержания.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока); 
		КонецЦикла;
		Об.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
	//ТЗОрганизаций   = РезультатЗапроса[2].Выгрузить();
	//ТЗПодразделения = РезультатЗапроса[3].Выгрузить();
	//ТЗВидНачисления = РезультатЗапроса[4].Выгрузить();
	//ТЗСотрудники    = РезультатЗапроса[5].Выгрузить();
	//ТЗСотрудникиНалог = РезультатЗапроса[6].Выгрузить();
	//                                           
	//Соот = Новый Соответствие;
	//Для каждого ТекСтрока Из ТЗОрганизаций Цикл
	//	
	//	Массив = Новый Массив;
	//	Отбор = Новый Структура();
	//	Отбор.Вставить("Организация", ТекСтрока.Организация);
	//	Строки = ТЗПодразделения.НайтиСтроки(Отбор);
	//	Для каждого ТекСтрока2 Из Строки Цикл
	//		Массив.Добавить(ТекСтрока2.СтруктурнаяЕдиница);	 			
	//	КонецЦикла;
	//		
	//	Соот.Вставить(ТекСтрока.Организация, Массив);
	//КонецЦикла;
	//
	////Для каждого ТекСоот Из Соот Цикл
	////	ОчиститьНачисленияСотрудникам(Период1, Период2, ТекСоот.Ключ, ТекСоот.Значение, ТЗВидНачисления);
	////КонецЦикла;

	Стр = Новый Структура;
	//Стр.Вставить("ТЗОрганизаций",   ТЗОрганизаций);
	//Стр.Вставить("ТЗПодразделения", ТЗПодразделения);
	//Стр.Вставить("ТЗВидНачисления", ТЗВидНачисления);
	//Стр.Вставить("ТЗСотрудники", ТЗСотрудники);
	//Стр.Вставить("ТЗСотрудникиНалог", ТЗСотрудникиНалог);
	//Стр.Вставить("Соот", Соот);
	
	Возврат Стр;
	
КонецФункции

Процедура ОчиститьНачисленияСотрудникам(Дата1, Дата2, Организация, СтруктурнаяЕдиница, ВидНачисленияУдержания) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачислениеЗарплатыНачисленияУдержания.Ссылка,
		|	НачислениеЗарплатыНачисленияУдержания.Сотрудник,
		|	НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания
		|ПОМЕСТИТЬ ТЗ
		|ИЗ
		|	Документ.НачислениеЗарплаты.НачисленияУдержания КАК НачислениеЗарплатыНачисленияУдержания
		|ГДЕ
		|	НачислениеЗарплатыНачисленияУдержания.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
		|	И НачислениеЗарплатыНачисленияУдержания.Ссылка.Организация = &Организация
		|	И НачислениеЗарплатыНачисленияУдержания.Ссылка.СтруктурнаяЕдиница В(&СтруктурнаяЕдиница)
		|	И НачислениеЗарплатыНачисленияУдержания.ВидНачисленияУдержания В(&ВидНачисленияУдержания)
		|	И НачислениеЗарплатыНачисленияУдержания.Сотрудник В(&Сотрудник)
		|	И НачислениеЗарплатыНачисленияУдержания.Ссылка.Проведен
		|	И НачислениеЗарплатыНачисленияУдержания.Ссылка.AzRyТипСозданияДокумента = &AzRyТипСозданияДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлатежнаяВедомость.Ссылка
		|ПОМЕСТИТЬ ПлатежнаяВедомость_Темп
		|ИЗ
		|	Документ.ПлатежнаяВедомость КАК ПлатежнаяВедомость
		|ГДЕ
		|	ПлатежнаяВедомость.Ссылка В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ТЗ.Ссылка
		|			ИЗ
		|				ТЗ КАК ТЗ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗ.Ссылка,
		|	ТЗ.Сотрудник,
		|	ТЗ.ВидНачисленияУдержания
		|ИЗ
		|	ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлатежнаяВедомость_Темп.Ссылка
		|ИЗ
		|	ПлатежнаяВедомость_Темп КАК ПлатежнаяВедомость_Темп
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасходСоСчета.Ссылка
		|ИЗ
		|	Документ.РасходСоСчета КАК РасходСоСчета
		|ГДЕ
		|	РасходСоСчета.Ссылка В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ТЗ.Ссылка
		|			ИЗ
		|				ПлатежнаяВедомость_Темп КАК ТЗ)";
	
	Запрос.УстановитьПараметр("ВидНачисленияУдержания", ВидНачисленияУдержания.ВыгрузитьКолонку("ВидНачисленияУдержания"));
	Запрос.УстановитьПараметр("Дата1", Дата1);
	Запрос.УстановитьПараметр("Дата2", Дата2);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Сотрудник", ВидНачисленияУдержания.ВыгрузитьКолонку("Сотрудник"));
	Запрос.УстановитьПараметр("AzRyТипСозданияДокумента", Перечисления.AzRyТипСозданияДокумента.Jira);
	
	ТЗПакет = Запрос.ВыполнитьПакет();
	ТЗ  = ТЗПакет[2].Выгрузить();
	ТЗ2 = ТЗПакет[3].Выгрузить();
	ТЗ3 = ТЗПакет[4].Выгрузить();
	
	ТЗДокументы      = ТЗ.Скопировать();
	ТЗСотрудники     = ТЗ.Скопировать();
	ТЗВидыНачисления = ТЗ.Скопировать();

	ТЗДокументы.Свернуть("Ссылка");
	ТЗСотрудники.Свернуть("Сотрудник");
	ТЗВидыНачисления.Свернуть("ВидНачисленияУдержания");
	МассивВидНачисленияУдержания = ТЗВидыНачисления.ВыгрузитьКолонку("ВидНачисленияУдержания");
	
	Для каждого ТекДок Из ТЗДокументы Цикл
		УдНачисление = Новый Массив;
		УдНалог      = Новый Массив;
		Док = ТекДок.Ссылка.ПолучитьОбъект();
		
		Для каждого ТекСотрудник Из ТЗСотрудники Цикл
			
			Отбор = Новый Структура();
			Отбор.Вставить("Сотрудник", ТекСотрудник.Сотрудник);
			
			СтрокиНачисления = Док.НачисленияУдержания.НайтиСтроки(Отбор);
			СтрокиНалог      = Док.НалогиНаДоходы.НайтиСтроки(Отбор);
			
			Для каждого ТекСтрока Из СтрокиНачисления Цикл
				Если Не МассивВидНачисленияУдержания.Найти(ТекСтрока.ВидНачисленияУдержания) = Неопределено Тогда
					УдНачисление.Добавить(ТекСтрока);	
				КонецЕсли; 			
			КонецЦикла;
			
			Для каждого ТекСтрока Из СтрокиНалог Цикл
				УдНалог.Добавить(ТекСтрока);	
			КонецЦикла;
		КонецЦикла;
		
		Для каждого УдНач Из УдНачисление Цикл
			Док.НачисленияУдержания.Удалить(УдНач);	
		КонецЦикла;
		
		Для каждого УдНалг Из УдНалог Цикл
			Док.НалогиНаДоходы.Удалить(УдНалг);	
		КонецЦикла;
		
		Док.Записать(РежимЗаписиДокумента.Проведение);
		
		Если Док.НачисленияУдержания.Количество() = 0 Тогда
			Док.УстановитьПометкуУдаления(Истина);
		КонецЕсли; 		
	КонецЦикла;
	
	//Для каждого ТекСтрока Из ТЗ2 Цикл
	//	Объ = ТекСтрока.Ссылка.ПолучитьОбъект();
	//	Объ.УстановитьПометкуУдаления(Истина);
	//	Объ.Записать(РежимЗаписиДокумента.Запись);
	//КонецЦикла;
	//
	//Для каждого ТекСтрока Из ТЗ3 Цикл
	//	Объ = ТекСтрока.Ссылка.ПолучитьОбъект();
	//	Объ.УстановитьПометкуУдаления(Истина);
	//	Объ.Записать(РежимЗаписиДокумента.Запись);
	//КонецЦикла;
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функций из модуля формы 

Функция ГенерацияТаблицНачисленийИНалоговСС() Экспорт
	
	МассивСотрудники = Неопределено;
	//Элементы.СотрудникиОтчет.Доступность = Ложь;
	ТЗСотрудникиJira = Новый СписокЗначений;	
	СотрудникиИзДжираИНеИзДжира = Новый Структура;
	СотрудникиИзДжираИНеИзДжира.Вставить("спДжира", Новый СписокЗначений);
	СотрудникиИзДжираИНеИзДжира.Вставить("спНеДжира", Новый СписокЗначений);  
	
	ТЗСотрудники = AzRyFunctions.АктивныеСотрудники(КонецДня(ПараметрыДокументов.ДатаДокумента), ПараметрыДокументов.Организация, ПараметрыДокументов.Подразделение, МассивСотрудники);
	ТЗСотрудники.Колонки.Добавить("Jira", Новый ОписаниеТипов("Строка"));
	
	Если ПараметрыДокументов.ТипНачисленияJiraТариф = "jira" Тогда 
				
		МассивСотрудники = AzRyFunctions.АктивныеСотрудникиДжира(ПараметрыДокументов.ДатаДокумента).ВыгрузитьКолонку("Сотрудник");
		ТЗСотрудникиJira = AzRyFunctions.АктивныеСотрудники(КонецДня(ПараметрыДокументов.ДатаДокумента), ПараметрыДокументов.Организация, ПараметрыДокументов.Подразделение, МассивСотрудники);
		
		// Джира
		Для каждого ТекСтрока Из ТЗСотрудникиJira Цикл
			НайденнаяСтрока = ТЗСотрудники.Найти(ТекСтрока.Сотрудник, "Сотрудник");
			Если НайденнаяСтрока = Неопределено Тогда
				НоваяСтрока = ТЗСотрудники.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
				НоваяСтрока.Jira = "Jira";
			Иначе 
				НайденнаяСтрока.Jira = "Jira";
			КонецЕсли;
		КонецЦикла;
				
		спДжира   = Новый СписокЗначений;
		спНеДжира = Новый СписокЗначений;
		
		//Для каждого ТекСтрока Из ТЗСотрудникиJira Цикл
		//	спДжира.Добавить(ТекСтрока.Сотрудник);				
		//КонецЦикла;
		Для каждого ТекСтрока Из ТЗСотрудники Цикл
			Если спДжира.НайтиПоЗначению(ТекСтрока.Сотрудник) = Неопределено Тогда
				спНеДжира.Добавить(ТекСтрока.Сотрудник);		
			КонецЕсли; 
		КонецЦикла;	
		
		спДжира.ЗагрузитьЗначения(ТЗСотрудникиJira.ВыгрузитьКолонку("Сотрудник"));
		
		СотрудникиИзДжираИНеИзДжира = Новый Структура;
		СотрудникиИзДжираИНеИзДжира.Вставить("спДжира", спДжира);
		СотрудникиИзДжираИНеИзДжира.Вставить("спНеДжира", спНеДжира);
		
		//Элементы.СотрудникиОтчет.Доступность = Истина;
		
	Иначе 	
		
	КонецЕсли;
	
	// ყველა აქტიური თანამშრომლები და თანამშრომლები რომლებსაც დალოგილი აქვთ ჯირაში
	КоличествоВсехСотрудников    = ТЗСотрудники.Количество();
	КоличествоСотрудниковИзДжира = ТЗСотрудникиJira.Количество();
	
	//// 1) 
	//Если ТипНачисленияJiraТариф = "jira" Тогда 
	//	МассивСотрудники = AzRyFunctions.АктивныеСотрудникиДжира(ПараметрыДокументов.ДатаДокумента).ВыгрузитьКолонку("Сотрудник");	
	//КонецЕсли;
	//ТЗАктивныеСотрудники = AzRyFunctions.АктивныеСотрудники(КонецДня(ПараметрыДокументов.ДатаДокумента), Организация, Подразделение, МассивСотрудники);
	
	//// debug test
	//МассивУД = Новый Массив;
	//Для каждого ТекСтрока Из ТЗСотрудники Цикл
	//	Если 			
	//		//ТекСтрока.Сотрудник <> Справочники.Сотрудники.НайтиПоКоду("000000045")
	//		//И ТекСтрока.Сотрудник <> Справочники.Сотрудники.НайтиПоКоду("000000465") 
	//		// ТекСтрока.Сотрудник <> Справочники.Сотрудники.НайтиПоКоду("000000025") 
	//		ТекСтрока.Сотрудник <> Справочники.Сотрудники.НайтиПоКоду("000000160") 
	//		Тогда
	//		
	//		МассивУД.Добавить(ТекСтрока);			
	//	КонецЕсли; 
	//КонецЦикла;
	//
	//Для каждого ТекМассив Из МассивУД Цикл
	//	ТЗСотрудники.Удалить(ТекМассив);	
	//КонецЦикла;	
	//// debug test 
	
	// 2)
	Возврат ВычислитьЗарплатуПоНачислениям(ПараметрыДокументов.Организация, ТЗСотрудники, ПараметрыДокументов.ДатаДокумента, ПараметрыДокументов.МассивНачисленииИУдержаний, ПараметрыДокументов.МассивНалога);
	
КонецФункции

Функция ГенерацияТаблицНачисленийИНалогов_ТаблицыВСтруктуру() Экспорт
	                                                                            
	Возврат ТаблицыВСтруктуру(ТабличнаяЧастьСотрудники.Выгрузить(), ТабличнаяЧастьСотрудникиНалог.Выгрузить(), ИсторияСотрудника.Выгрузить());	
	
КонецФункции

Процедура ПеренестиДанныеВТаблицахФормСС(ТаблицыНачисленийИНалогов) Экспорт
	
	// Переносим данные в таблицу объекта "ТабличнаяЧастьСотрудники"
	ТаблицыНачисленийИНалогов.НачисленияУдержания.Сортировать("jira Убыв, Сотрудник Убыв");
	Для каждого ТекСтрока Из ТаблицыНачисленийИНалогов.НачисленияУдержания Цикл	
		НоваяСтрока = ТабличнаяЧастьСотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);	
	КонецЦикла;
	
	// Переносим данные в таблицу объекта "ТабличнаяЧастьСотрудникиНалог"
	ТаблицыНачисленийИНалогов.Налог.Сортировать("Сотрудник Убыв");
	Для каждого ТекСтрока2 Из ТаблицыНачисленийИНалогов.Налог Цикл	
		НоваяСтрока = ТабличнаяЧастьСотрудникиНалог.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока2);	
	КонецЦикла;
	
	// Переносим данные в таблицу объекта "ИсторияСотрудника"
	ТаблицыНачисленийИНалогов.ИсторияЗарплаты.Сортировать("Сотрудник Убыв");
	ИсторияСотрудника.Очистить();
	Для каждого ТекСтрока2 Из ТаблицыНачисленийИНалогов.ИсторияЗарплаты Цикл	
		НоваяСтрока = ИсторияСотрудника.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока2);	
	КонецЦикла;
	
КонецПроцедуры

Функция ПараметрыЗапускаCC() Экспорт

	//ВидОпераций = Элементы.ГруппаТипНачисления.ТекущаяСтраница.Имя;
	
	ПараметрыДокументов = Новый Структура;
	МассивНачисленииИУдержаний = Новый Массив;
	МассивНалога = Новый Массив;
	
	//Если ВидОпераций = "Зарплата" Тогда 
		ПараметрыДокументов.Вставить("ПроцентНДФЛ", ОбъектНДФЛЗапрлаты.СтавкаНДФЛ);
		МассивНачисленииИУдержаний.Добавить(ОбъектНачисленияЗарплаты);
		МассивНачисленииИУдержаний.Добавить(ОбъектНачисленияПенсия);
		МассивНачисленииИУдержаний.Добавить(ОбъектУдержаниеСтраховка);
		МассивНачисленииИУдержаний.Добавить(ОбъектУдержаниеПитание);
		МассивНачисленииИУдержаний.Добавить(ОбъектУдержаниеПенсия);
		МассивНалога.Добавить(ОбъектНДФЛЗапрлаты);
	//ИначеЕсли ВидОпераций = "Дивиденд" Тогда 
	//	ПараметрыДокументов.Вставить("ПроцентНДФЛ", Объект.ОбъектНДФЛДивиденд.СтавкаНДФЛ);
	//	МассивНачисленииИУдержаний.Добавить(Объект.ОбъектНачисленияДивиденд);
	//	МассивНалога.Добавить(Объект.ОбъектНДФЛДивиденд);
	//КонецЕсли;
	
	ПараметрыДокументов.Вставить("Организация", Организация);
	ПараметрыДокументов.Вставить("ОбъектНачисленияЗарплаты", ОбъектНачисленияЗарплаты);
	ПараметрыДокументов.Вставить("Коментарий", Коментарий);
	ПараметрыДокументов.Вставить("КоментарийДляСтраховки", КоментарийНачисленийСтраховки);
	ПараметрыДокументов.Вставить("КоментарийДляПенсии", КоментарийНачисленийПенсии);
	ПараметрыДокументов.Вставить("КоментарийДляПитания", КоментарийНачисленийПитания);
	ПараметрыДокументов.Вставить("ДатаДокумента", ДатаДокумента);
	ПараметрыДокументов.Вставить("ДатаДокументаПлВед", ДатаДокументаПлВед);
	ПараметрыДокументов.Вставить("ДатаДокументаРасСоСчета", ДатаДокументаРасхСоСчета);
	ПараметрыДокументов.Вставить("ПериодРегистраций", КонецДня(ПериодРегистраций));
	ПараметрыДокументов.Вставить("СтатьиДвиженияДенежныхСредств", СтатьиДвиженияДенежныхСредств);
	ПараметрыДокументов.Вставить("ВидНачисления", ВидНачисления);
	ПараметрыДокументов.Вставить("НаправленияДеятельности", НаправленияДеятельности);
	ПараметрыДокументов.Вставить("ЗаказПокупателя", ЗаказПокупателя);
	ПараметрыДокументов.Вставить("Проект", Проект);
	ПараметрыДокументов.Вставить("БанкНомерСчета", БанкНомерСчета);
	ПараметрыДокументов.Вставить("СчетЗатратНоменклатура", СчетЗатратНоменклатура);
	ПараметрыДокументов.Вставить("ТипНачисленияJiraТариф", ТипНачисленияJiraТариф);
	ПараметрыДокументов.Вставить("Подразделение", Подразделение);
	ПараметрыДокументов.Вставить("МассивНачисленииИУдержаний", МассивНачисленииИУдержаний);
	ПараметрыДокументов.Вставить("МассивНалога", МассивНалога);
	
	Возврат ПараметрыДокументов;
	
КонецФункции

Процедура ЗаполнитьТЗСотрудникамиСерверCC(ОчиститьТаблицы) Экспорт
		
	Если ОчиститьТаблицы Тогда 		
		ТабличнаяЧастьСотрудники.Очистить();
		ТабличнаяЧастьСотрудникиНалог.Очистить();	
	КонецЕсли;
	
	ПараметрыЗапускаCC();
	
	ТаблицыНачисленийИНалогов = ГенерацияТаблицНачисленийИНалоговСС();
	ПеренестиДанныеВТаблицахФормСС(ТаблицыНачисленийИНалогов);
	
КонецПроцедуры

Функция ВыполнитьКомандуНаСервереСС(ТЗ) Экспорт
		
	ПараметрыДокументов = ПараметрыЗапускаCC();
	
	// შეუცვლელი მონაცემები. ხელმეორედ ივსება ცხრილები ფომრზე. ეს შეიძლება გასათიში გვქონდეს
	//ТаблицыНачисленийИНалогов = ГенерацияТаблицНачисленийИНалогов(ОбработкаОбъект);
	ТаблицыНачисленийИНалогов = ГенерацияТаблицНачисленийИНалогов_ТаблицыВСтруктуру();

	СписокДокНачислениеЗарплаты      = Новый СписокЗначений;
	СписокДокНачисление              = Новый СписокЗначений;
	МассивДокОбектПлатежнаяВедомость = Новый Массив;
	МассивДокОбектРасходСоСчета      = Новый Массив;
	
	МассивНачисления = Новый Массив;
	МассивНачисления.Добавить(ОбъектНачисленияПенсия);
	МассивНачисления.Добавить(ОбъектУдержаниеПенсия);
	МассивНачисления.Добавить(ОбъектУдержаниеСтраховка);
	МассивНачисления.Добавить(ОбъектУдержаниеПитание);
	
	Соотв = Новый Соответствие;
	
	ПараметрыДокументов.Вставить("НачислениеИНалог", ТаблицыНачисленийИНалогов);
			
	ФильтрацияДанных(ТЗ, "НачисляемЗарплату", Истина);
	//ТЗОснНачислений = ТЗ.Скопировать();
	
	//ОчиститьНачисленияСотрудникам(НачалоМесяца(ПараметрыДокументов.ПериодРегистраций), КонецМесяца(ПараметрыДокументов.ПериодРегистраций), 
	//ПараметрыДокументов.Организация, ПараметрыДокументов.Подразделение, ТЗОснНачислений);
	
	// 1) Создание документа начислений
	//ТаблицаПоПодразделениям = ТаблицыПоПодразделениям(ТЗОснНачислений);
	
	ТТТ = ПолуФабрикать(Организация, ПериодРегистраций, ПараметрыДокументов.НачислениеИНалог.НачисленияУдержания, ПараметрыДокументов.ТипНачисленияJiraТариф);
	
	Если СоздатьДокументНачислениеЗарплаты = "Да" Тогда 			
		//Для каждого ТекПодразделение Из ТаблицаПоПодразделениям Цикл
			//Коментарий = ПараметрыДокументов.Коментарий + " ორგანიზაცია: " + Организация + " გამყოფილება: " + ТекПодразделение.Ключ;
			ДокОбектНачислений = ОбновлениетаблицыДокументыНачисленияCC_2(ТТТ, ПараметрыДокументов.НачислениеИНалог.Налог);
			//СписокДокНачислениеЗарплаты.Добавить(ДокОбектНачислений);
			СписокДокНачислениеЗарплаты.ЗагрузитьЗначения(ДокОбектНачислений.ВыгрузитьЗначения());
			СписокДокНачисление.ЗагрузитьЗначения(ДокОбектНачислений.ВыгрузитьЗначения());
			
			//Для каждого ТекЗначение Из МассивНачисления Цикл
			//	Если ТекЗначение = Справочники.ВидыНачисленийИУдержаний.ПустаяСсылка() Тогда Продолжить; КонецЕсли; 
			//	ТЗ = ФильтрацияДанных(ТЗ, "ВидНачисленияУдержания", ТекЗначение);
			//	СписокДокНачисление.Добавить(СозданиеОбновлениеДокументаНачислений(ПериодРегистраций, Организация, "", МассивНачисленииИУдержаний, ПараметрыДокументов, Истина, "", ПараметрыДокументов.КоментарийДляПенсии, ТекЗначение, ТТТ));
			//КонецЦикла;					
		//КонецЦикла;				
	КонецЕсли;	
	
	// 2) Создание массива документов платежная ведомость
	Если СоздатьДокументПлатежнаяВедомость = "Да" И СтатусОбработки = "Создание" Тогда 
		Для каждого ТекДокумент Из СписокДокНачислениеЗарплаты Цикл
			Ответ = СозданиеДокументаПлатежнаяВедомость(ТекДокумент.Значение.Организация, ТекДокумент.Значение, ПараметрыДокументов);
			Для каждого ТекДок Из Ответ Цикл
				МассивДокОбектПлатежнаяВедомость.Добавить(ТекДок);	
			КонецЦикла;
		КонецЦикла;
		
		// 3) Создание массива документов расход со счета
		Если СоздатьДокументРасходСоСчета = "Да" И СтатусОбработки = "Создание" Тогда 
			Ответ = СозданиеДокументаРасходСоСчета(МассивДокОбектПлатежнаяВедомость, ПараметрыДокументов);
			Для каждого ТекДок Из Ответ Цикл
				МассивДокОбектРасходСоСчета.Добавить(ТекДок);	
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Ответ = Новый Структура;
	Ответ.Вставить("СписокДокНачисление", СписокДокНачисление);
	Ответ.Вставить("МассивДокОбектПлатежнаяВедомость", МассивДокОбектПлатежнаяВедомость);
	Ответ.Вставить("МассивДокОбектРасходСоСчета", МассивДокОбектРасходСоСчета);
	
	Возврат Ответ;
	
КонецФункции

Процедура ПерезаполнитьТаблицыФорм(Парам) Экспорт

	ТабличнаяЧастьСотрудники.Очистить();
	ТабличнаяЧастьСотрудникиНалог.Очистить();
	ИсторияСотрудника.Очистить();
	
	Для каждого ТекСтрока Из Парам.НачисленияУдержания Цикл
		НоваяСтрока = ТабличнаяЧастьСотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	КонецЦикла;
	
	Для каждого ТекСтрока Из Парам.Налог Цикл
		НоваяСтрока = ТабличнаяЧастьСотрудникиНалог.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	КонецЦикла;
	
	Для каждого ТекСтрока Из Парам.ИсторияЗарплаты Цикл
		НоваяСтрока = ИсторияСотрудника.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	КонецЦикла;	

КонецПроцедуры

Функция ПолуФабрикать(Организация, ДатаОбновления, НачисленияУдержания, JiraТариф)

	// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------	
	//спПенсия = Новый СписокЗначений;
	//спПенсия.Добавить(Справочники.AzRyНастройки.НачислениеПенсия.Значение);
	//спПенсия.Добавить(Справочники.AzRyНастройки.УдержаниеПенсия.Значение);
	
	//ЭтоПенсия = спПенсия.НайтиПоЗначению(ВидНачисленияУдержания) <> Неопределено;
	
	спНачислениеЗарплаты = Новый СписокЗначений;
	
	//НачатьТранзакцию();
	//Организация = Организация;
	//НачислениеИНалог = Парам.НачислениеИНалог;
	//НД = Документы.НачислениеЗарплаты.ПустаяСсылка();
	
	КРДВ = AzRyFunctions.КоличествоРабочихДнейВМесяце(Год(ДатаОбновления), НачалоМесяца(ДатаОбновления), КонецМесяца(ДатаОбновления));
	КЧР  = Справочники.AzRyНастройки.КоличествоРабочихЧасов.Значение;
	
	//Попытка
	
	НДФЛ = Справочники.AzRyНастройки.УдержаниеНДФЛ.Значение.СтавкаНДФЛ/100;
	
	// 2) 
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Сотрудник,
	               |	ТЗ.ВидНачисленияУдержания,
	               |	ТЗ.Организация,
	               |	ТЗ.СтруктурнаяЕдиница,
	               |	ТЗ.AzRyDivision,
	               |	ТЗ.СчетЗатратРегл,
	               |	ТЗ.Валюта,
	               |	ТЗ.Сумма,
				   |	ТЗ.СуммаПФ,
	               |	ВЫРАЗИТЬ(ТЗ.Jira КАК СТРОКА(4)) КАК Jira,
	               |	ТЗ.НаправлениеДеятельности,
	               |	ТЗ.ЗаказПокупателя,
				   |	ТЗ.Проект
	               |ПОМЕСТИТЬ ТЗЗарплата
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |ГДЕ
	               |	ТЗ.НачисляемЗарплату
	               |	И (ВЫРАЗИТЬ(ТЗ.Jira КАК СТРОКА(4))) = ""Jira""
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗ.Сотрудник,
	               |	ТЗ.ВидНачисленияУдержания,
	               |	ТЗ.Организация,
	               |	ТЗ.СтруктурнаяЕдиница,
	               |	ТЗ.AzRyDivision,
	               |	ТЗ.СчетЗатратРегл,
	               |	ТЗ.Валюта,
	               |	ТЗ.Сумма,
				   |	ТЗ.СуммаПФ,
	               |	ВЫРАЗИТЬ(ТЗ.Jira КАК СТРОКА(4)) КАК Jira,
	               |	ТЗ.НаправлениеДеятельности,
	               |	ТЗ.ЗаказПокупателя,
				   |	ТЗ.Проект
	               |ПОМЕСТИТЬ ТЗЗарплатаNotJira
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |ГДЕ
	               |	ТЗ.НачисляемЗарплату
	               |	И (ВЫРАЗИТЬ(ТЗ.Jira КАК СТРОКА(4))) <> ""Jira""
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаданияНаРаботу.Сотрудник,
	               |	СУММА(ЗаданияНаРаботу.ЗагрузкаПлан) КАК ЗагрузкаПланИтог
	               |ПОМЕСТИТЬ ЗаданияНаРаботу_ЗагрузкаПлан
	               |ИЗ
	               |	РегистрНакопления.ЗаданияНаРаботу КАК ЗаданияНаРаботу
	               |ГДЕ
	               |	ЗаданияНаРаботу.Период МЕЖДУ &Период1 И &Период2
	               |	И ЗаданияНаРаботу.Сотрудник В(&Сотрудник)
	               |	И ЗаданияНаРаботу.Организация = &Организация
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаданияНаРаботу.Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗЗарплата.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	               |	ЗаданияНаРаботу.Организация КАК Организация,
	               |	ЗаданияНаРаботу.Сотрудник КАК Сотрудник,
	               |	ТЗЗарплата.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	               |	&Период1 КАК ДатаНачала,
	               |	&Период2 КАК ДатаОкончания,
	               |	0 КАК ОтработаноДней,
	               |	ЗаданияНаРаботу.ЗагрузкаПлан КАК ЗагрузкаПлан,
	               |	ЗаданияНаРаботу.ЗагрузкаПлан КАК ОтработаноЧасов,
	               |	ВЫРАЗИТЬ(ТЗЗарплата.Сумма / ЗаданияНаРаботу_ЗагрузкаПлан.ЗагрузкаПланИтог КАК ЧИСЛО(15, 2)) КАК Размер,
	               |	ВЫРАЗИТЬ(ТЗЗарплата.Сумма / ЗаданияНаРаботу_ЗагрузкаПлан.ЗагрузкаПланИтог * ЗаданияНаРаботу.ЗагрузкаПлан КАК ЧИСЛО(15, 2)) КАК Сумма,
	               |	ТЗЗарплата.СчетЗатратРегл КАК СчетЗатратРегл,
	               |	ЗаданияНаРаботу.ЗаказПокупателя.Проект.AzRy_ЗаказПокупателя.Проект.AzRyНаправленияДеятельности КАК НаправлениеДеятельности,
	               |	ЗаданияНаРаботу.ЗаказПокупателя.Проект.AzRy_ЗаказПокупателя КАК ЗаказПокупателя,
	               |	ЛОЖЬ КАК РучнаяКорректировка,
	               |	"""" КАК Показатель1,
	               |	ЗНАЧЕНИЕ(Справочник.ПараметрыРасчетов.ПустаяСсылка) КАК Представление1,
	               |	0 КАК Значение1,
	               |	"""" КАК Показатель2,
	               |	ЗНАЧЕНИЕ(Справочник.ПараметрыРасчетов.ПустаяСсылка) КАК Представление2,
	               |	0 КАК Значение2,
	               |	"""" КАК Показатель3,
	               |	ЗНАЧЕНИЕ(Справочник.ПараметрыРасчетов.ПустаяСсылка) КАК Представление3,
	               |	0 КАК Значение3,
	               |	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК AzRyНоменклатура,
	               |	ТЗЗарплата.AzRyDivision КАК AzRyDivision,
	               |	ТЗЗарплата.Валюта КАК Валюта,
	               |	ТЗЗарплата.Сумма КАК Начисление,
				   |	ТЗЗарплата.СуммаПФ КАК НачислениеПФ,
				   |	ВЫРАЗИТЬ(ТЗЗарплата.СуммаПФ / ЗаданияНаРаботу_ЗагрузкаПлан.ЗагрузкаПланИтог * ЗаданияНаРаботу.ЗагрузкаПлан КАК ЧИСЛО(15, 2)) КАК СуммаПФ,
	               |	ЗаданияНаРаботу_ЗагрузкаПлан.ЗагрузкаПланИтог,
	               |	&AzRyТипСозданияДокумента КАК AzRyТипСозданияДокумента,
	               |	ТЗЗарплата.СчетЗатратРегл КАК СотрудникСчетРасчетовСПерсоналом_DELETEME,
	               |	ЗаданияНаРаботу.ЗаказПокупателя.Проект КАК ЗаказПокупателяПроект_DELETEME,
	               |	ЗаданияНаРаботу.ЗаказПокупателя.Проект.AzRy_ЗаказПокупателя КАК ПроектЗаказПокупателя_DELETEME,
	               |	0 КАК СуммаБезНалога_DELETEME,
	               |	&Налог,
				   |	ЗаданияНаРаботу.AzRyПроект КАК Проект
	               |ИЗ
	               |	ТЗЗарплата КАК ТЗЗарплата
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаданияНаРаботу КАК ЗаданияНаРаботу
	               |		ПО ТЗЗарплата.Сотрудник = ЗаданияНаРаботу.Сотрудник
	               |			И ТЗЗарплата.Организация = ЗаданияНаРаботу.Организация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗаданияНаРаботу_ЗагрузкаПлан КАК ЗаданияНаРаботу_ЗагрузкаПлан
	               |		ПО ТЗЗарплата.Сотрудник = ЗаданияНаРаботу_ЗагрузкаПлан.Сотрудник
	               |ГДЕ
	               |	ЗаданияНаРаботу.Период МЕЖДУ &Период1 И &Период2
	               |	И ЗаданияНаРаботу.Сотрудник В(&Сотрудник)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТЗЗарплатаNotJira.СтруктурнаяЕдиница,
	               |	ТЗЗарплатаNotJira.Организация,
	               |	ТЗЗарплатаNotJira.Сотрудник,
	               |	ТЗЗарплатаNotJira.ВидНачисленияУдержания,
	               |	&Период1,
	               |	&Период2,
	               |	0,
	               |	0,
	               |	0,
	               |	1,
	               |	ТЗЗарплатаNotJira.Сумма,
	               |	ТЗЗарплатаNotJira.СчетЗатратРегл,
	               |	ТЗЗарплатаNotJira.НаправлениеДеятельности,
	               |	ТЗЗарплатаNotJira.ЗаказПокупателя,
	               |	ЛОЖЬ,
	               |	"""",
	               |	ЗНАЧЕНИЕ(Справочник.ПараметрыРасчетов.ПустаяСсылка),
	               |	0,
	               |	"""",
	               |	ЗНАЧЕНИЕ(Справочник.ПараметрыРасчетов.ПустаяСсылка),
	               |	0,
	               |	"""",
	               |	ЗНАЧЕНИЕ(Справочник.ПараметрыРасчетов.ПустаяСсылка),
	               |	0,
	               |	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	               |	ТЗЗарплатаNotJira.AzRyDivision,
	               |	ТЗЗарплатаNotJira.Валюта,
	               |	ТЗЗарплатаNotJira.Сумма,
				   |	ТЗЗарплатаNotJira.СуммаПФ,
				   |	ТЗЗарплатаNotJira.СуммаПФ,
	               |	0,
	               |	&AzRyТипСозданияДокумента,
	               |	ТЗЗарплатаNotJira.СчетЗатратРегл,
	               |	ТЗЗарплатаNotJira.ЗаказПокупателя,
	               |	ТЗЗарплатаNotJira.ЗаказПокупателя,
	               |	0,
	               |	&Налог,
				   |	ТЗЗарплатаNotJira.Проект
	               |ИЗ
	               |	ТЗЗарплатаNotJira КАК ТЗЗарплатаNotJira
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Сотрудник,
	               |	ВидНачисленияУдержания,
	               |	ЗагрузкаПлан";
	
	Запрос.УстановитьПараметр("ТЗ", НачисленияУдержания);		   
	Запрос.УстановитьПараметр("Период1", НачалоМесяца(ДатаОбновления));
	Запрос.УстановитьПараметр("Период2", КонецМесяца(ДатаОбновления));
	Запрос.УстановитьПараметр("Сотрудник", НачисленияУдержания.ВыгрузитьКолонку("Сотрудник"));                        
	//Запрос.УстановитьПараметр("ВидНачисленияУдержания", Парам.НачислениеИНалог.НачисленияУдержания.ВыгрузитьКолонку("ВидНачисленияУдержания")); 
	Запрос.УстановитьПараметр("Налог", Справочники.AzRyНастройки.УдержаниеНДФЛ.Значение);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("AzRyТипСозданияДокумента", ?(JiraТариф = "jira", Перечисления.AzRyТипСозданияДокумента.Jira, Перечисления.AzRyТипСозданияДокумента.Пользователь));
	//Запрос.УстановитьПараметр("НаправлениеДеятельности", Парам.НаправленияДеятельности);
	//Запрос.УстановитьПараметр("ЗаказПокупателя", Парам.ЗаказПокупателя);
	
	ТЗ = Запрос.Выполнить().Выгрузить();	
	
	// TODO ეს ნაწილი მოსაფიქრებელია
	Для каждого ТекСтрока Из ТЗ Цикл
		ТекСтрока.AzRyНоменклатура = AzRyFunctions.НаправленияДеятельностиНоменклатура(ТекСтрока.СчетЗатратРегл.Наименование);
		// TODO სელექტშია გსასწორებელი
		Если ТекСтрока.Проект = Справочники.Проекты.ПустаяСсылка() Тогда
			ТекСтрока.Проект = ТекСтрока.ЗаказПокупателя.Проект; 
		КонецЕсли;  	
	КонецЦикла;
	
	ТЗ2 = ТЗ.Скопировать();
	ТЗ2.Свернуть("Организация, СтруктурнаяЕдиница, Сотрудник, ВидНачисленияУдержания, Начисление", "Сумма, СуммаПФ");
	
	Для каждого ТекСтрока Из ТЗ2 Цикл		
		Если ТекСтрока.Начисление <> ТекСтрока.Сумма Тогда
			
			Отбор = Новый Структура();
			Отбор.Вставить("Организация", ТекСтрока.Организация);
			Отбор.Вставить("СтруктурнаяЕдиница", ТекСтрока.СтруктурнаяЕдиница);
			Отбор.Вставить("Сотрудник", ТекСтрока.Сотрудник);
			Отбор.Вставить("ВидНачисленияУдержания", ТекСтрока.ВидНачисленияУдержания);
			Строки = ТЗ.НайтиСтроки(Отбор);
			Если Строки.Количество() > 0 Тогда				
				НовСтрока = ТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрока, Строки[0]);
			    НовСтрока.Сумма = ТекСтрока.Начисление - ТекСтрока.Сумма;		
			КонецЕсли;	
		КонецЕсли;			
	КонецЦикла;
	
	Возврат ТЗ;

КонецФункции

Функция ОбновлениетаблицыДокументыНачисленияCC(НачисленияУдержания, ДатаОбновления, Парам, ВидНачисленияУдержания = Неопределено, ТЗ) Экспорт
	
	
	//// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
	//
	//спПенсия = Новый СписокЗначений;
	//спПенсия.Добавить(Справочники.AzRyНастройки.НачислениеПенсия.Значение);
	//спПенсия.Добавить(Справочники.AzRyНастройки.УдержаниеПенсия.Значение);
	//
	//ЭтоПенсия = спПенсия.НайтиПоЗначению(ВидНачисленияУдержания) <> Неопределено;
	//
	//спНачислениеЗарплаты = Новый СписокЗначений;
	//
	////НачатьТранзакцию();
	//Организация = Парам.Организация;
	//НачислениеИНалог = Парам.НачислениеИНалог;
	////НД = Документы.НачислениеЗарплаты.ПустаяСсылка();
	//
	//КРДВ = AzRyFunctions.КоличествоРабочихДнейВМесяце(Год(ДатаОбновления), НачалоМесяца(ДатаОбновления), КонецМесяца(ДатаОбновления));
	//КЧР  = Справочники.AzRyНастройки.КоличествоРабочихЧасов.Значение;
	//
	////Попытка
	//	
	//	НДФЛ = Справочники.AzRyНастройки.УдержаниеНДФЛ.Значение.СтавкаНДФЛ;
	//	
	//	// 2) 
	//	Запрос = Новый Запрос;
	//	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	ТЗ.Сотрудник,
	//	               |	ТЗ.ВидНачисленияУдержания,
	//	               |	ТЗ.Организация,
	//	               |	ТЗ.СтруктурнаяЕдиница,
	//	               |	ТЗ.AzRyDivision,
	//	               |	ТЗ.Сумма
	//	               |ПОМЕСТИТЬ ТЗЗарплата
	//	               |ИЗ
	//	               |	&ТЗ КАК ТЗ
	//	               |ГДЕ
	//	               |	ТЗ.ВидНачисленияУдержания = &ВидНачисленияУдержания
	//	               |	И ТЗ.Сотрудник В(&Сотрудник)
	//	               |;
	//	               |
	//	               |////////////////////////////////////////////////////////////////////////////////
	//	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	               |	ЗаданияНаРаботу.Организация КАК Организация,
	//	               |	ЗаданияНаРаботу.Сотрудник КАК Сотрудник,
	//	               |	ПлановыеНачисленияИУдержанияСрезПоследних.Сумма КАК Сумма_old,
	//	               |	ЕСТЬNULL(ТЗЗарплата.Сумма, ПлановыеНачисленияИУдержанияСрезПоследних.Сумма) КАК Сумма,
	//	               |	ТЗЗарплата.AzRyDivision
	//	               |ПОМЕСТИТЬ ТаблицаЗарплатыПоОгранизациям
	//	               |ИЗ
	//	               |	РегистрНакопления.ЗаданияНаРаботу КАК ЗаданияНаРаботу
	//	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания.СрезПоследних(
	//	               |				&Дата,
	//	               |				ВидНачисленияУдержания = &ВидНачисленияУдержания
	//	               |					И (&ЭтоПенсия
	//	               |						ИЛИ Сумма <> 0)
	//	               |					И Сотрудник В (&Сотрудник)) КАК ПлановыеНачисленияИУдержанияСрезПоследних
	//	               |		ПО ЗаданияНаРаботу.Сотрудник = ПлановыеНачисленияИУдержанияСрезПоследних.Сотрудник
	//	               |			И ЗаданияНаРаботу.Организация = ПлановыеНачисленияИУдержанияСрезПоследних.Организация
	//	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗЗарплата КАК ТЗЗарплата
	//	               |		ПО ЗаданияНаРаботу.Сотрудник = ТЗЗарплата.Сотрудник
	//	               |			И ЗаданияНаРаботу.Организация = ТЗЗарплата.Организация
	//	               |ГДЕ
	//	               |	ЗаданияНаРаботу.Период МЕЖДУ &Период1 И &Период2
	//	               |	И ЗаданияНаРаботу.Сотрудник В(&Сотрудник)
	//	               |;
	//	               |
	//	               |////////////////////////////////////////////////////////////////////////////////
	//	               |ВЫБРАТЬ
	//	               |	ЗаданияНаРаботу.Организация КАК Организация,
	//	               |	ЗаданияНаРаботу.ЗаказПокупателя.Проект КАК ЗаказПокупателяПроект,
	//	               |	ЗаданияНаРаботу.ЗаказПокупателя.Проект.AzRy_ЗаказПокупателя,
	//	               |	ЗаданияНаРаботу.Сотрудник КАК Сотрудник,
	//	               |	ЗаданияНаРаботу.ЗагрузкаПлан КАК ЗагрузкаПлан,
	//	               |	ЗаданияНаРаботу.ЗагрузкаПлан * ПлановыеНачисленияИУдержанияСрезПоследних.Сумма - ЗаданияНаРаботу.ЗагрузкаПлан * ПлановыеНачисленияИУдержанияСрезПоследних.Сумма * 0 КАК СуммаБезНалога,
	//	               |	ПлановыеНачисленияИУдержанияСрезПоследних.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	//	               |	ПлановыеНачисленияИУдержанияСрезПоследних.СчетЗатратРегл КАК СотрудникСчетРасчетовСПерсоналом,
	//	               |	ПлановыеНачисленияИУдержанияСрезПоследних.Валюта КАК Валюта,
	//	               |	ПлановыеНачисленияИУдержанияСрезПоследних.Сумма КАК Сумма_old,
	//	               |	&Налог,
	//	               |	ТЗЗарплата.Сумма,
	//	               |	ТЗЗарплата.СтруктурнаяЕдиница,
	//	               |	ТЗЗарплата.AzRyDivision,
	//	               |	ЗаданияНаРаботу.ЗаказПокупателя.Проект.AzRy_ЗаказПокупателя.Проект.AzRyНаправленияДеятельности КАК НаправленияДеятельности
	//	               |ИЗ
	//	               |	РегистрНакопления.ЗаданияНаРаботу КАК ЗаданияНаРаботу
	//	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания.СрезПоследних(
	//	               |				&Дата,
	//	               |				ВидНачисленияУдержания = &ВидНачисленияУдержания
	//	               |					И (&ЭтоПенсия
	//	               |						ИЛИ Сумма <> 0)
	//	               |					И Сотрудник В (&Сотрудник)
	//	               |					И НЕ Регистратор ССЫЛКА Документ.Увольнение) КАК ПлановыеНачисленияИУдержанияСрезПоследних
	//	               |		ПО ЗаданияНаРаботу.Сотрудник = ПлановыеНачисленияИУдержанияСрезПоследних.Сотрудник
	//	               |			И ЗаданияНаРаботу.Организация = ПлановыеНачисленияИУдержанияСрезПоследних.Организация
	//	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	               |			ВложенныйЗапрос.Сотрудник КАК Сотрудник
	//	               |		ИЗ
	//	               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	               |				ЗаданияНаРаботу.Организация КАК Организация,
	//	               |				ЗаданияНаРаботу.Сотрудник КАК Сотрудник
	//	               |			ИЗ
	//	               |				ТаблицаЗарплатыПоОгранизациям КАК ЗаданияНаРаботу) КАК ВложенныйЗапрос
	//	               |		
	//	               |		СГРУППИРОВАТЬ ПО
	//	               |			ВложенныйЗапрос.Сотрудник) КАК ВложенныйЗапрос
	//	               |		ПО ЗаданияНаРаботу.Сотрудник = ВложенныйЗапрос.Сотрудник
	//	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗЗарплата КАК ТЗЗарплата
	//	               |		ПО ЗаданияНаРаботу.Сотрудник = ТЗЗарплата.Сотрудник
	//	               |ГДЕ
	//	               |	ЗаданияНаРаботу.Период МЕЖДУ &Период1 И &Период2
	//	               |	И ЗаданияНаРаботу.Сотрудник В(&Сотрудник)
	//	               |	И ЗаданияНаРаботу.Организация = &Организация";
	//	                                                                           
	//	Запрос.УстановитьПараметр("Период1", НачалоМесяца(ДатаОбновления));
	//	Запрос.УстановитьПараметр("Период2", КонецМесяца(ДатаОбновления));
	//	Запрос.УстановитьПараметр("Сотрудник", МассивСотрудников);
	//	Запрос.УстановитьПараметр("Дата", КонецМесяца(ДатаОбновления));
	//	Запрос.УстановитьПараметр("ВидНачисленияУдержания", ?(ВидНачисленияУдержания = Неопределено, Справочники.AzRyНастройки.НачислениеТарифнаяСтавка.Значение, ВидНачисленияУдержания)); 
	//	Запрос.УстановитьПараметр("Налог", Справочники.AzRyНастройки.УдержаниеНДФЛ.Значение);
	//	Запрос.УстановитьПараметр("Организация", Организация);
	//	Запрос.УстановитьПараметр("ТЗ", Парам.НачислениеИНалог.НачисленияУдержания);
	//	Запрос.УстановитьПараметр("ЭтоПенсия", ЭтоПенсия);
	//	
	//	ТЗ = Запрос.Выполнить().Выгрузить();		
	//	// ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
		
		ТЗКопия = ТЗ.Скопировать();
		ТЗКопия.Колонки.Добавить("Н");
		ТЗКопия.ЗаполнитьЗначения(1, "Н");
		ТЗКопия.Свернуть("Сотрудник, Организация" , "Н");
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТЗ1.Валюта,
		               |	ТЗ1.ВидНачисленияУдержания,
		               |	ТЗ1.ЗагрузкаПлан,
		               |	ТЗ1.ЗаказПокупателяПроект,
		               |	ТЗ1.ЗаказПокупателяПроектAzRy_ЗаказПокупателя,
		               |	ТЗ1.НаправленияДеятельности,
		               |	ТЗ1.Налог,
		               |	ТЗ1.Организация,
		               |	ТЗ1.Сотрудник,
		               |	ТЗ1.СотрудникСчетРасчетовСПерсоналом,
		               |	ТЗ1.Сумма,
		               |	ТЗ1.СуммаБезНалога,
		               |	ТЗ1.СтруктурнаяЕдиница,
		               |	ТЗ1.AzRyDivision
		               |ПОМЕСТИТЬ ТЗ2
		               |ИЗ
		               |	&ТЗ КАК ТЗ1
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТЗ2.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		               |	ТЗ2.Организация КАК Организация,
		               |	ТЗ2.Сотрудник КАК Сотрудник,
					   |	ТЗ2.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
					   |	ТЗ2.ЗаказПокупателяПроект КАК ЗаказПокупателяПроект,
		               |	ТЗ2.Валюта,
		               |	ТЗ2.ЗагрузкаПлан КАК ЗагрузкаПлан,
		               |	ТЗ2.ЗаказПокупателяПроектAzRy_ЗаказПокупателя,
		               |	ТЗ2.НаправленияДеятельности,
		               |	ТЗ2.Налог,
		               |	ТЗ2.СотрудникСчетРасчетовСПерсоналом,
		               |	ТЗ2.Сумма,
		               |	ТЗ2.СуммаБезНалога КАК СуммаБезНалога,
		               |	ТЗ2.AzRyDivision
		               |ИЗ
		               |	ТЗ2 КАК ТЗ2
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ВидНачисленияУдержания
		               |ИТОГИ
		               |	СУММА(ЗагрузкаПлан),
		               |	СУММА(СуммаБезНалога)
		               |ПО
		               |	СтруктурнаяЕдиница,
		               |	Организация,
		               |	Сотрудник,
		               |	ВидНачисленияУдержания";
					   
		Запрос.УстановитьПараметр("ТЗ", ТЗ);			   
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ТЗСотрудникиСоотв = Запрос.Выполнить().Выгрузить();
		СоответствиеПарам = СоздатьСоответствиеПарам(ТЗСотрудникиСоотв);
		
		Пока Выборка.Следующий() Цикл
			
			//НД = Документы.НачислениеЗарплаты.СоздатьДокумент();			
			//спНачислениеЗарплаты.Добавить(НД);
			//
			//НД.СтруктурнаяЕдиница = Выборка.СтруктурнаяЕдиница;
			//НД.AzRyТипСозданияДокумента = Перечисления.AzRyТипСозданияДокумента.Jira;
			//НД.Дата = КонецМесяца(ДатаОбновления);
			//НД.ВалютаДокумента = Константы.НациональнаяВалюта.Получить();			
			//НД.ПериодРегистрации = ДатаОбновления;
			//НД.УстановитьНовыйНомер("JR");
			//НД.НачисленияУдержания.Очистить();
			//НД.НалогиНаДоходы.Очистить();	
			
			Выборка0 = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выборка0.Следующий() Цикл
				
				спСотрудники = Новый СписокЗначений;
				//НД.Организация     = Выборка0.Организация;
				
				ТарифСотрудника = 0;
				Выборка1 = Выборка0.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока Выборка1.Следующий() Цикл
					Если спСотрудники.НайтиПоЗначению(Выборка1.Сотрудник) = Неопределено Тогда
						спСотрудники.Добавить(Выборка1.Сотрудник);
					КонецЕсли; 

					Выборка2 = Выборка1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Н = 0;
					Пока Выборка2.Следующий() Цикл
						ИтогСумма = 0;
						Выборка3 = Выборка2.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
						Пока Выборка3.Следующий() Цикл	
							Н = Н + 1;
							СоответствиеПарамЗнач = СоответствиеПарам.Получить(Выборка3.Сотрудник);
							
							Если СоответствиеПарамЗнач = Неопределено Или СоответствиеПарамЗнач.Сумма = Выборка3.Сумма Тогда 
								Продолжить;
							КонецЕсли;
							
							НоваяСтрока = НачисленияУдержания.Добавить();
							НоваяСтрока.AzRyDivision           = Выборка3.AzRyDivision;
							НоваяСтрока.Сотрудник              = Выборка3.Сотрудник;
							НоваяСтрока.ЗаказПокупателя        = Выборка3.ЗаказПокупателяПроектAzRy_ЗаказПокупателя;
							//НоваяСтрока.Показатель1 = "";
							//НоваяСтрока.Значение1              = Выборка3.ЗагрузкаПлан;
							//НоваяСтрока.НаправлениеДеятельности= Выборка3.ЗаказПокупателяПроектAzRy_ЗаказПокупателя.Проект.AzRyНаправленияДеятельности;
							НоваяСтрока.НаправлениеДеятельности= Выборка3.НаправленияДеятельности;
							НоваяСтрока.ОтработаноЧасов        = Выборка3.ЗагрузкаПлан;
							НоваяСтрока.ВидНачисленияУдержания = Выборка3.ВидНачисленияУдержания;
							НоваяСтрока.СчетЗатратРегл         = Выборка3.СотрудникСчетРасчетовСПерсоналом;
							НоваяСтрока.Размер                 = Выборка3.Сумма / Выборка2.ЗагрузкаПлан;
							НоваяСтрока.ДатаНачала             = НачалоМесяца(ДатаОбновления);
							НоваяСтрока.ДатаОкончания          = КонецМесяца(ДатаОбновления);
							НоваяСтрока.AzRyНоменклатура       = AzRyFunctions.НаправленияДеятельностиНоменклатура(НоваяСтрока.СчетЗатратРегл.Наименование);
							
							// 1. Поиск всех параметров-идентификаторов формулы
							СтруктураПараметров = Новый Структура;
							УправлениеНебольшойФирмойСервер.ДобавитьПараметрыВСтруктуру(НоваяСтрока.ВидНачисленияУдержания.Формула, СтруктураПараметров);
							
							// 2. Добавление показателя
							Счетчик = 0;
							Для каждого ПараметрСтруктуры Из СтруктураПараметров Цикл
								
								Если ПараметрСтруктуры.Ключ = "ОтработаноДней"
									ИЛИ ПараметрСтруктуры.Ключ = "ОтработаноЧасов"
									ИЛИ ПараметрСтруктуры.Ключ = "ТарифнаяСтавка" Тогда
									Продолжить;
								КонецЕсли; 
								
								ПараметрРасчета = Справочники.ПараметрыРасчетов.НайтиПоРеквизиту("Идентификатор", ПараметрСтруктуры.Ключ);
								//Если НЕ ЗначениеЗаполнено(ПараметрРасчета) Тогда		
								//	Сообщение = Новый СообщениеПользователю();
								//	Сообщение.Текст = НСтр("ru='Не найден параметр ';ka='Не найден параметр '") + ПараметрРасчета + НСтр("ru=' для сотрудника в строке № ';ka=' для сотрудника в строке № '") + (Объект.НачисленияУдержания.Индекс(СтрокаТабличнойЧасти) + 1);
								//	Сообщение.Сообщить();			
								//КонецЕсли; 
								
								Счетчик = Счетчик + 1;
								
								Если Счетчик > 3 Тогда
									Прервать;
								КонецЕсли; 
								
								НоваяСтрока["Показатель" + Счетчик] = ПараметрСтруктуры.Ключ;
								НоваяСтрока["Представление" + Счетчик] = ПараметрРасчета;
								НоваяСтрока["Значение" + Счетчик] = Выборка3.ЗагрузкаПлан;
								
							КонецЦикла;
							
							
							Если НоваяСтрока.РучнаяКорректировка ИЛИ НЕ ЗначениеЗаполнено(НоваяСтрока.ВидНачисленияУдержания.Формула) Тогда
								Продолжить;
							КонецЕсли; 
							
							// расчет размера начисления или удержания по формуле
							// 1. Добавляем параметры и значения в структуру
							СтруктураПараметров = Новый Структура;
							СтруктураПараметров.Вставить("ТарифнаяСтавка", НоваяСтрока.Размер);
							СтруктураПараметров.Вставить("ОтработаноДней", НоваяСтрока.ОтработаноДней);
							СтруктураПараметров.Вставить("ОтработаноЧасов", НоваяСтрока.ОтработаноЧасов);
							
							Для Счетчик = 1 По 3 Цикл
								Если ЗначениеЗаполнено(НоваяСтрока["Представление" + Счетчик]) Тогда
									СтруктураПараметров.Вставить(НоваяСтрока["Показатель" + Счетчик], НоваяСтрока["Значение" + Счетчик]);
								КонецЕсли; 
							КонецЦикла; 
							
							
							// 2. Рассчитываем по формулам					
							Формула = НоваяСтрока.ВидНачисленияУдержания.Формула;
							Для каждого Параметр Из СтруктураПараметров Цикл
								Формула = СтрЗаменить(Формула, "[" + Параметр.Ключ + "]", Формат(Параметр.Значение, "ЧРД=.; ЧН=0; ЧГ=0"));
							КонецЦикла;
							Попытка
								РассчитаннаяСумма = Вычислить(Формула);
							Исключение
								Сообщение = Новый СообщениеПользователю();
								Сообщение.Текст = НСтр("ru='Не удалось рассчитать сумму начисления  в строке №%НомерСтроки%. Возможно, формула содержит ошибку или не заполнены показатели.';ka='Не удалось рассчитать сумму начисления  в строке №%НомерСтроки%. Возможно, формула содержит ошибку или не заполнены показатели.'");
								//Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%НомерСтроки%", (Объект.НачисленияУдержания.Индекс(СтрокаНачислений) + 1));
								//Сообщение.Поле = "Объект.НачисленияУдержания[" + Объект.НачисленияУдержания.Индекс(СтрокаНачислений) + "].ВидНачисленияУдержания";
								//Сообщение.УстановитьДанные(Объект);
								Сообщение.Сообщить();
								РассчитаннаяСумма = 0;
							КонецПопытки;
							
							НоваяСтрока.Сумма = Окр(Выборка3.ЗагрузкаПлан * РассчитаннаяСумма, 2);
							
							СоответствиеПарамЗнач.Сумма = СоответствиеПарамЗнач.Сумма + НоваяСтрока.Сумма;
							
							//Если Н = ОтборCC(ТЗКопия, Выборка3.Организация, Выборка3.Сотрудник).Н Тогда
							//	НоваяСтрока.Сумма = НоваяСтрока.Сумма  + (Выборка3.Сумма - СоответствиеПарамЗнач.Сумма);
							//	СоответствиеПарамЗнач.Сумма = СоответствиеПарамЗнач.Сумма + (Выборка3.Сумма - СоответствиеПарамЗнач.Сумма);
							//	Продолжить;
							//КонецЕсли;	
							
							//Если СоответствиеПарамЗнач.Сумма > Выборка3.Сумма Тогда
							//	НоваяСтрока.Сумма = НоваяСтрока.Сумма  + (Выборка3.Сумма - СоответствиеПарамЗнач.Сумма);
							//	СоответствиеПарамЗнач.Сумма = СоответствиеПарамЗнач.Сумма + (Выборка3.Сумма - СоответствиеПарамЗнач.Сумма);
							//	Продолжить;
							//КонецЕсли;
							
						КонецЦикла;	
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;				
		КонецЦикла;
			
	Возврат "";
	
КонецФункции

Функция ОбновлениетаблицыДокументыНачисленияCC_2(ТЗ, ТЗНалоги = Неопределено) Экспорт
	
	ТЗСотрудники = ТЗ.Скопировать();
	ТЗСотрудники.Свернуть("Сотрудник");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ1.Организация,
	               |	ТЗ1.СтруктурнаяЕдиница,
	               |	ТЗ1.AzRyТипСозданияДокумента,
	               |	ТЗ1.Сотрудник,
	               |	ТЗ1.ВидНачисленияУдержания,
	               |	ТЗ1.ДатаНачала,
	               |	ТЗ1.ДатаОкончания,
	               |	ТЗ1.ОтработаноДней,
	               |	ТЗ1.ЗагрузкаПлан,
	               |	ТЗ1.ОтработаноЧасов,
	               |	ТЗ1.Размер,
	               |	ТЗ1.Сумма,
				   |	ТЗ1.СуммаПФ,
	               |	ТЗ1.СчетЗатратРегл,
	               |	ТЗ1.НаправлениеДеятельности,
	               |	ТЗ1.ЗаказПокупателя,
	               |	ТЗ1.РучнаяКорректировка,
	               |	ТЗ1.Показатель1,
	               |	ТЗ1.Представление1,
	               |	ТЗ1.Значение1,
	               |	ТЗ1.Показатель2,
	               |	ТЗ1.Представление2,
	               |	ТЗ1.Значение2,
	               |	ТЗ1.Показатель3,
	               |	ТЗ1.Представление3,
	               |	ТЗ1.Значение3,
	               |	ТЗ1.AzRyНоменклатура,
	               |	ТЗ1.AzRyDivision,
	               |	ТЗ1.Валюта,
	               |	ТЗ1.Начисление,
	               |	ТЗ1.ЗагрузкаПланИтог,
				   |	&ВидУдержанияПФ КАК ВидУдержанияПФ,
				   |	ТЗ1.Проект КАК Проект
	               |ПОМЕСТИТЬ ТЗ2
	               |ИЗ
	               |	&ТЗ КАК ТЗ1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗ2.Организация КАК Организация,
	               |	ТЗ2.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	               |	ТЗ2.AzRyТипСозданияДокумента,
	               |	ТЗ2.Сотрудник,
	               |	ТЗ2.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	               |	ТЗ2.ДатаНачала,
	               |	ТЗ2.ДатаОкончания,
	               |	ТЗ2.ОтработаноДней,
	               |	ТЗ2.ЗагрузкаПлан,
	               |	ТЗ2.ОтработаноЧасов,
	               |	ТЗ2.Размер,
	               |	ТЗ2.Сумма КАК Сумма,
				   |	ТЗ2.СуммаПФ КАК СуммаПФ,
	               |	ТЗ2.СчетЗатратРегл,
	               |	ТЗ2.НаправлениеДеятельности,
	               |	ТЗ2.ЗаказПокупателя,
	               |	ТЗ2.РучнаяКорректировка,
	               |	ТЗ2.Показатель1,
	               |	ТЗ2.Представление1,
	               |	ТЗ2.Значение1,
	               |	ТЗ2.Показатель2,
	               |	ТЗ2.Представление2,
	               |	ТЗ2.Значение2,
	               |	ТЗ2.Показатель3,
	               |	ТЗ2.Представление3,
	               |	ТЗ2.Значение3,
	               |	ТЗ2.AzRyНоменклатура,
	               |	ТЗ2.AzRyDivision,
	               |	ТЗ2.Валюта,
	               |	ТЗ2.Начисление КАК Начисление,
	               |	ТЗ2.ЗагрузкаПланИтог КАК ЗагрузкаПланИтог,
				   |	&ВидУдержанияПФ КАК ВидУдержанияПФ,
				   |	ТЗ2.Проект КАК Проект
	               |ИЗ
	               |	ТЗ2 КАК ТЗ2
	               |ИТОГИ ПО
	               |	Организация,
	               |	СтруктурнаяЕдиница";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("ВидУдержанияПФ", Справочники.AzRyНастройки.Пенсия.Значение);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СП = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл		
		Выборка1 = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
		Пока Выборка1.Следующий() Цикл			
			
			НЗ = Документы.НачислениеЗарплаты.СоздатьДокумент();	
			НЗ.Дата = ПараметрыДокументов.ДатаДокумента;
			НЗ.ВалютаДокумента    = Константы.НациональнаяВалюта.Получить();
			НЗ.Организация        = Выборка1.Организация;
			НЗ.ПериодРегистрации  = ПараметрыДокументов.ПериодРегистраций;
			НЗ.СтруктурнаяЕдиница = Выборка1.СтруктурнаяЕдиница;
			НЗ.УстановитьНовыйНомер();
			НЗ.НачисленияУдержания.Очистить();
			НЗ.НалогиНаДоходы.Очистить();
			НЗ.Комментарий = " ორგანიზაცია: " + Выборка1.Организация + " გამყოფილება: " + Выборка1.СтруктурнаяЕдиница;
			НЗ.Автор = Пользователи.ТекущийПользователь();
			
			Выборка2 = Выборка1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выборка2.Следующий() Цикл
				Если Выборка2.ВидНачисленияУдержания = Справочники.AzRyНастройки.НачислениеПенсия.Значение Или Выборка2.ВидНачисленияУдержания = Справочники.AzRyНастройки.УдержаниеПенсия.Значение Тогда
					Продолжить;				
				КонецЕсли; 
				НЗ.AzRyТипСозданияДокумента = Выборка2.AzRyТипСозданияДокумента;
				
				// ТабЧасть - НачисленияУдержания
				НоваяСтрока = НЗ.НачисленияУдержания.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка2);
				НоваяСтрока.СчетЗатрат = НоваяСтрока.ВидНачисленияУдержания.СчетЗатрат;
			КонецЦикла;
			
			МассивСотрудникиДляТЗНалога = СотрудникиИзТаблицыНачисленияУдержания(НЗ.НачисленияУдержания);
			
			// ТабЧасть - НалогиНаДоходы
			Если Не ТЗНалоги = Неопределено Тогда
				Для каждого ТекЭлемент Из МассивСотрудникиДляТЗНалога Цикл
					НайденнаяСтрока = ТЗНалоги.Найти(ТекЭлемент, "Сотрудник");	
					
					НоваяСтрокаНалог = НЗ.НалогиНаДоходы.Добавить();
					НоваяСтрокаНалог.Сотрудник              = НайденнаяСтрока.Сотрудник;
					НоваяСтрокаНалог.ВидНачисленияУдержания = НайденнаяСтрока.Налог;
					НоваяСтрокаНалог.Сумма                  = НайденнаяСтрока.Сумма;
					НоваяСтрокаНалог.AzRyЗаказПокупателя    = ПараметрыДокументов.ЗаказПокупателя;				
				КонецЦикла;
			КонецЕсли; 
			
			НЗ.Записать(РежимЗаписиДокумента.Проведение);
			СП.Добавить(НЗ);			
		КонецЦикла;
	КонецЦикла;
	
	Возврат СП;
		
КонецФункции

Функция СоздатьСоответствиеПарам(ТЗ) Экспорт 

    ТЗ.Свернуть("Сотрудник, Сумма");

	МассивУдаления = Новый  Массив;
	Для каждого ТекСтрока Из ТЗ Цикл	
		Если ТекСтрока.Сумма = Null Тогда 
			МассивУдаления.Добавить(ТекСтрока);
		КонецЕсли;		
	КонецЦикла;
	
	Для каждого ТекМассив Из МассивУдаления Цикл
		ТЗ.Удалить(ТекМассив);
	КонецЦикла;
	
	СоответствиеПарам = Новый Соответствие;	
	Для каждого ТекС Из ТЗ Цикл
	
		СтруктураПарам = Новый Структура;
		СтруктураПарам.Вставить("Зарплата", ТекС.Сумма);
		СтруктураПарам.Вставить("Сумма", 0);
		
		СоответствиеПарам.Вставить(ТекС.Сотрудник, СтруктураПарам);
			
	КонецЦикла;
	
	Возврат СоответствиеПарам;

КонецФункции

Функция СотрудникиИзТаблицыНачисленияУдержания(ТЗ_НачисленияУдержания)

	МС = Новый Массив;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Сотрудники.Сотрудник
		|ПОМЕСТИТЬ врСотрудники
		|ИЗ
		|	&ТЗ_НачисленияУдержания КАК Сотрудники
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	врСотрудники.Сотрудник
		|ИЗ
		|	врСотрудники КАК врСотрудники";
		
	Запрос.Параметры.Вставить("ТЗ_НачисленияУдержания", ТЗ_НачисленияУдержания.Выгрузить());
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ.ВыгрузитьКолонку("Сотрудник");

КонецФункции
 

//Функция ОтборCC(Т, Организация, Сотрудник)
//	
//	Отбор = Новый Структура();
//	Отбор.Вставить("Организация", Организация);
//	Отбор.Вставить("Сотрудник", Сотрудник);
//	Строки = Т.НайтиСтроки(Отбор);

//	Возврат Строки[0]; //test
//	
//КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ




