
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗначениеСкидкиНаценки") Тогда
		Элементы.ЗначениеСкидкиНаценки.Видимость = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство КАК Свойство,
		|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство.Заголовок КАК Заголовок
		|ИЗ
		|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
		|ГДЕ
		|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка.Родитель = ЗНАЧЕНИЕ(Справочник.НаборыДополнительныхРеквизитовИСведений.Справочник_ХарактеристикиНоменклатуры)
		|	И НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка.Используется
		|ИТОГИ ПО
		|	Заголовок";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗаголовок = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЗаголовок.Следующий() Цикл
		НовСтрока = ДополнительныеРеквизиты.Добавить();
		НовСтрока.Свойство = ВыборкаЗаголовок.Заголовок;
		СписокСвоиств = Новый Массив;
		ВыборкаДЗ = ВыборкаЗаголовок.Выбрать();
		Пока ВыборкаДЗ.Следующий() Цикл
			СписокСвоиств.Добавить(ВыборкаДЗ.Свойство);
		КонецЦикла;
		НовСтрока.СписокСвоиств.ЗагрузитьЗначения(СписокСвоиств);
	КонецЦикла;

КонецПроцедуры
&НаКлиенте
Процедура ДополнительныеРеквизитыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ОК(Команда)
	Если ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо отметить хотябы одиного свойства'; ka = 'აუცილებელია ერთი თვისების არჩევა მაინც!'; en = 'აუცილებელია ერთი თვისების არჩევა მაინც!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ЦеновыеГруппы");
	Иначе
		АдресВременногоХранилища = ЗаписатьВХранилищеДанныеТабличнойЧасти();
		Закрыть(Новый Структура("ВыборПроизведен, АдресВременногоХранилища", Истина, АдресВременногоХранилища));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаписатьВХранилищеДанныеТабличнойЧасти()
	
	//ТаблицаНоменклатуры
	ТаблицаНоменклатуры = Новый ТаблицаЗначений;
	ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура", 			Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНоменклатуры.Колонки.Добавить("ЕдиницаИзмерения", 		Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаНоменклатуры.Колонки.Добавить("КлючСвязи", 				Новый ОписаниеТипов("Число"));
	ТаблицаНоменклатуры.Колонки.Добавить("ЕдиницаИзмеренияШаблон", 	Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения, СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаНоменклатуры.Колонки.Добавить("ЦенаНоваяШаблон", 		Новый ОписаниеТипов("Число"));
	ТаблицаНоменклатуры.Колонки.Добавить("Характеристика", 			Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	
	//ТаблицаХарактеристик
	ТаблицаХарактеристик = Новый ТаблицаЗначений;
	ТаблицаХарактеристик.Колонки.Добавить("Номенклатура", 			Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаХарактеристик.Колонки.Добавить("ЕдиницаИзмерения", 		Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаХарактеристик.Колонки.Добавить("КлючСвязи", 				Новый ОписаниеТипов("Число"));
	ТаблицаХарактеристик.Колонки.Добавить("ЕдиницаИзмеренияШаблон", Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения, СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаХарактеристик.Колонки.Добавить("ЦенаНоваяШаблон", 		Новый ОписаниеТипов("Число"));
	ТаблицаХарактеристик.Колонки.Добавить("Характеристика", 		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаХарактеристик.Колонки.Добавить("ХарактеристикиИспользуются",	Новый ОписаниеТипов("Булево"));
	ТаблицаХарактеристик.Колонки.Добавить("ЭтоГруппа", 					Новый ОписаниеТипов("Булево"));
	ТаблицаХарактеристик.Колонки.Добавить("ЗначениеСкидкиНаценки",		Новый ОписаниеТипов("Число"));

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗначениеСкидкиНаценки", ЗначениеСкидкиНаценки);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец КАК Справочник.Номенклатура).ИспользоватьХарактеристики КАК ХарактеристикиИспользуются,
		|	ВЫРАЗИТЬ(ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец КАК Справочник.Номенклатура).ЭтоГруппа КАК ЭтоГруппа,
		|	&ЗначениеСкидкиНаценки,
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка КАК Характеристика,
		|	ВЫРАЗИТЬ(ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец КАК Справочник.Номенклатура).ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
		|ГДЕ
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец ССЫЛКА Справочник.Номенклатура
		|	И &УсловиеЗапроса
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура
		|ИТОГИ
		|	МАКСИМУМ(ЕдиницаИзмерения)
		|ПО
		|	Номенклатура";
	УсловиеЗапроса = "";
	Итератор	   = 0;
	Для Каждого СтрокаТЧ ИЗ ДополнительныеРеквизиты Цикл
		Если СтрокаТЧ.Пометка Тогда
			Итератор 		= Итератор + 1;
			ИтераторСтрокой = Формат(Итератор, "ЧРГ=; ЧГ=0");
			УсловиеСтроки  = " И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство В(&Свойство"+ИтераторСтрокой+") И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение В(&Значение"+ИтераторСтрокой+") ";
			УсловиеЗапроса = УсловиеЗапроса + УсловиеСтроки;
			Запрос.УстановитьПараметр("Свойство" + ИтераторСтрокой, СтрокаТЧ.СписокСвоиств);
			Запрос.УстановитьПараметр("Значение" + ИтераторСтрокой, СтрокаТЧ.Список_Значении);
		КонецЕсли;
	КонецЦикла;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеЗапроса", УсловиеЗапроса);
	ЛокальныйКлючСвязи = 1;
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНоменклатура.Следующий() Цикл
		НоваяСтрокаНоменклатура = ТаблицаНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаНоменклатура, ВыборкаНоменклатура);
		НоваяСтрокаНоменклатура.КлючСвязи = ЛокальныйКлючСвязи;
		ВыборкаДЗ = ВыборкаНоменклатура.Выбрать();
		Пока ВыборкаДЗ.Следующий() Цикл
			НоваяСтрокаХарактеристика = ТаблицаХарактеристик.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаХарактеристика, ВыборкаДЗ);
			НоваяСтрокаХарактеристика.КлючСвязи = ЛокальныйКлючСвязи;
		КонецЦикла;
		ЛокальныйКлючСвязи = ЛокальныйКлючСвязи + 1;
	КонецЦикла;

	СтруктураРезультата = Новый Структура("ТаблицаНоменклатуры, ТаблицаХарактеристик", ТаблицаНоменклатуры, ТаблицаХарактеристик);
	Возврат ПоместитьВоВременноеХранилище(СтруктураРезультата);

КонецФункции

&НаКлиенте
Процедура ДополнительныеРеквизитыСписок_ЗначенииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗначенияВКолонтуСписокЗначенииТекСтроки(Команда)
	
	ТекущиеДанные = Элементы.ДополнительныеРеквизиты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("МножественныйВыбор", Истина);
	ПараметрыВыбора.Вставить("Заголовок", 		   Элементы.ДополнительныеРеквизиты.ТекущиеДанные.Свойство);
	РезультатВыбора = ОткрытьФормуМодально("Обработка.Ценообразование.Форма.ФормаВыбораХарактеристик", ПараметрыВыбора);//Обработка.Ценообразование.Форма.ЗначенияДопРеквизитов

	Если НЕ РезультатВыбора = Неопределено Тогда
		//ТекущиеДанные.Список_Значении.ЗагрузитьЗначения(РезультатВыбора);
		Для Каждого ЗнСписка Из РезультатВыбора Цикл
			ТекущиеДанные.Список_Значении.Добавить(ЗнСписка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры




