
&После("ПередЗаписью")
Процедура РасшAzRy_ПередЗаписью(Отказ, РежимЗаписи)
	
	Документ = ЭтотОбъект.Отбор.Регистратор.Значение;	
	ВалютаUSD = Справочники.Валюты.НайтиПоКоду("840");
	ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Документ.Дата, Новый Структура("Валюта", ВалютаUSD));
		
	Для каждого ТекЗапись Из ЭтотОбъект Цикл
		
		НаборЗаписей = РегистрыБухгалтерии.AzRyХозрасчетныйUSD.СоздатьНаборЗаписей();	
		НаборЗаписей.Отбор.Регистратор.Установить(Документ.Ссылка);
		
		Движение = НаборЗаписей.Добавить(); 	
		ЗаполнитьЗначенияСвойств(Движение, ТекЗапись);
		
		Движение.Сумма = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(ТекЗапись.Сумма, 1, ВалютаРасчетовКурсКратность.Курс, 1, ВалютаРасчетовКурсКратность.Кратность);
		
		Для каждого ТекСубконто Из ТекЗапись.СубконтоДт Цикл
			Движение.СубконтоДт.Вставить(ТекСубконто.Ключ, ТекСубконто.Значение);
		КонецЦикла;
		
		Для каждого ТекСубконто Из ТекЗапись.СубконтоКт Цикл
			Движение.СубконтоКт.Вставить(ТекСубконто.Ключ, ТекСубконто.Значение);
		КонецЦикла;
		
		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей.Записать();	
		КонецЕсли;
	
	КонецЦикла; 
	
КонецПроцедуры
