
&После("ПередЗаписью")
Процедура РасшAzRy_ПередЗаписью(Отказ, РежимЗаписи)
	
	Документ = ЭтотОбъект.Отбор.Регистратор.Значение;	
	ВалютаUSD = Справочники.Валюты.НайтиПоКоду("840");
	Если ТипЗнч(ЭтотОбъект.Отбор.Регистратор.Значение) = Тип("ДокументСсылка.ЗакрытиеМесяца") Тогда
		ВалютаРасчетовКурсКратность = ЗапросСреднийКурсЗаМесяц(ЭтотОбъект.Отбор.Регистратор.Значение.Дата, ВалютаUSD);
	Иначе 
		ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Документ.Дата, Новый Структура("Валюта", ВалютаUSD));	
	КонецЕсли;
	
	НаборЗаписей = РегистрыБухгалтерии.AzRyХозрасчетныйUSD.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Документ.Ссылка);
	
	Для каждого ТекЗапись Из ЭтотОбъект Цикл
			
		Движение = НаборЗаписей.Добавить(); 	
		ЗаполнитьЗначенияСвойств(Движение, ТекЗапись);
		
		Движение.Сумма = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(ТекЗапись.Сумма, 1, ВалютаРасчетовКурсКратность.Курс, 1, ВалютаРасчетовКурсКратность.Кратность);
		
		Для каждого ТекСубконто Из ТекЗапись.СубконтоДт Цикл
			Движение.СубконтоДт.Вставить(ТекСубконто.Ключ, ТекСубконто.Значение);
		КонецЦикла;
		
		Для каждого ТекСубконто Из ТекЗапись.СубконтоКт Цикл
			Движение.СубконтоКт.Вставить(ТекСубконто.Ключ, ТекСубконто.Значение);
		КонецЦикла;
			
	КонецЦикла; 
	
	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей.Записать();	
	КонецЕсли;
	
КонецПроцедуры

Функция ЗапросСреднийКурсЗаМесяц(Период, Валюта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СРЕДНЕЕ(КурсыВалют.Курс) КАК Курс,
		|	СРЕДНЕЕ(КурсыВалют.Кратность) КАК Кратность
		|ИЗ
		|	РегистрСведений.КурсыВалют КАК КурсыВалют
		|ГДЕ
		|	КурсыВалют.Период МЕЖДУ &Период1 И &Период2
		|	И КурсыВалют.Валюта = &Валюта";
	
	Запрос.УстановитьПараметр("Период1", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("Период2", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Ответ = Новый Структура("Курс, Кратность", РезультатЗапроса[0].Курс, РезультатЗапроса[0].Кратность);
	
	Возврат Ответ;
	
КонецФункции
