
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОсновнаяОрганизация = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ОсновнаяОрганизация");
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.Организация = ОсновнаяОрганизация;
		ПредыдущаяОрганизация = Объект.Организация; 
		ВозможностьДобавлятьНовыеВидыОтпусков = РегистрыСведений.УчетнаяПолитикаРегл.ЗначениеПоляУчетнойПолитики("ВозможностьДобавлятьНовыеВидыОтпусков", Объект.Организация);
	Иначе
		ВозможностьДобавлятьНовыеВидыОтпусков = РегистрыСведений.УчетнаяПолитикаРегл.ЗначениеПоляУчетнойПолитики("ВозможностьДобавлятьНовыеВидыОтпусков", Объект.Организация);
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()

	Элементы.ВидВариантовВидовОтпуска.Видимость =  ВозможностьДобавлятьНовыеВидыОтпусков;

КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеУчетнойПолитикиНаСервере(ТребуемоеЗначение, ВыбраннаяОргинизацияОрганизация)
	
	Возврат РегистрыСведений.УчетнаяПолитикаРегл.ЗначениеПоляУчетнойПолитики(ТребуемоеЗначение, ВыбраннаяОргинизацияОрганизация);
	
КонецФункции

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ВозможностьДобавлятьНовыеВидыОтпусков = ПолучитьЗначениеУчетнойПолитикиНаСервере("ВозможностьДобавлятьНовыеВидыОтпусков", Объект.Организация);
	УстановитьВидимость();
	
	Если НЕ ВозможностьДобавлятьНовыеВидыОтпусков Тогда 
		ПоказатьПредупреждение(,"Для выбранной организации запрещенно создавать новые виды отпусков!");
		Объект.Организация = ПредыдущаяОрганизация;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПредыдущаяОрганизация = Объект.Организация;
	
КонецПроцедуры
