
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Номенклатура") Тогда
		
		Номенклатура = Параметры.Отбор.Номенклатура;
		
		Если Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Работа Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ka='დროის ნორმები ინახება მხოლოდ სამუშაოებისთვის';ru='Нормы времени хранятся только для работ'");
			
			Элементы.Список.ТолькоПросмотр = Истина;
			
		ИначеЕсли Номенклатура.ФиксированнаяСтоимость Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ka='""სამუშაოების ღირებულების გამოთვლის მეთოდი"" უნდა იყოს ""დროის ნორმა""';ru='""Способ расчета стоимости работ"" должен быть ""Норма времени""'");
			
			Элементы.Список.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры // ПриСозданииНаСервере()