#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//Перем ЗакрыватьПоРеглПлануСчетов;
Перем ИспользоватьТолькоРегламентированныйПланСчетов Экспорт; //+++ Дмгг
#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьОшибкуВТаблицу(ОписаниеОшибки, ВидОперации, ТаблицаОшибок, Аналитика = Неопределено)
	
	Если Аналитика = Неопределено Тогда
		Аналитика = Документы.ЗаказПокупателя.ПустаяСсылка()
	КонецЕсли;
	
	НоваяСтрока = ТаблицаОшибок.Добавить();
	НоваяСтрока.Период = Дата;
	НоваяСтрока.Организация = ДополнительныеСвойства.ДляПроведения.Организация;
	НоваяСтрока.ВидОперации = ВидОперации;
	НоваяСтрока.Аналитика = Аналитика;
	НоваяСтрока.ОписаниеОшибки = ОписаниеОшибки;
	НоваяСтрока.Регистратор = Ссылка;
	НоваяСтрока.Активность = Истина;
	
КонецПроцедуры // ДобавитьОшибкуВТаблицу()

Функция СформироватьОписаниеОшибкиРаспределенияЗатрат(СчетУчета, СпособРаспределения, ФильтрПоЗаказ, Сумма)
	
	ОписаниеОшибки = НСтр("ka='%СпособРаспределения%-ით პროდუქციის გამოშვებაზე განაწილებადი დანახარჯი ""%СчетУчета%"" %Сумма% ოდენობით არ შეიძლება განაწილდეს, ვინაიდან გამოსაანგარიშებელ პერიოდში არ ყოფილა %ДополнительноеОписание%.';ru='Затрата ""%СчетУчета%"" в сумме %Сумма%, распределяемая на выпуск продукции по %СпособРаспределения% не может быть распределена, т.к. в рассчитываемом периоде не было %ДополнительноеОписание%.';en='Expenditure ""% SchetUcheta%"" in the Amount% Amount% of% is allocated to the output SposobRaspredeleniya% may not be distributed, as in the count period, there was no% DopolnitelnoeOpisanie%.'"
	);
	
	ОписаниеОшибки = СтрЗаменить(
		ОписаниеОшибки,
		"%СчетУчета%",
		Строка(СчетУчета)
	);
	
	ОписаниеОшибки = СтрЗаменить(
		ОписаниеОшибки,
		"%Сумма%",
		Строка(Сумма) + " " + СокрЛП(Строка(Константы.ВалютаУчета.Получить()))
	);
	
	ОписаниеОшибки = СтрЗаменить(
		ОписаниеОшибки,
		"%СпособРаспределения%",
		?(СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ОбъемВыпуска,
			"объему выпуска",
			"прямым затратам"
		)
	);
	
	ОписаниеОшибки = СтрЗаменить(
		ОписаниеОшибки,
		"%ДополнительноеОписание%",
		?(СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ОбъемВыпуска,
			"выпусков продукции%Заказ%",
			"распределения прямых затрат%Заказ%, указанных в настройке распределения"
		)
	);
	
	ОписаниеОшибки = СтрЗаменить(
		ОписаниеОшибки,
		"%Заказ%",
		?(ЗначениеЗаполнено(ФильтрПоЗаказ),
			" по " + Строка(ФильтрПоЗаказ),
			""
		)
	);
	
	Возврат ОписаниеОшибки;
	
КонецФункции // СформироватьОписаниеОшибкиРаспределенияЗатрат()

Функция СформироватьОписаниеОшибкиРаспределенияРасходов(СчетУчета, СпособРаспределения, Сумма)
	
	ОписаниеОшибки = НСтр("ka='ფინანსურ შედეგზე %СпособРаспределения%-ით განაწილებული გასავალი ""%СчетУчета%"" %Сумма%-ის ოდენობით, არ შეიძლება იქნას განაწილებული, ვინაიდან გამოსაანგარიშებელ პერიოდში არ ყოფილა %ДополнительноеОписание%.';ru='Расход ""%СчетУчета%"" в сумме %Сумма%, распределяемый на финансовый результат по %СпособРаспределения% не может быть распределен, т.к. в рассчитываемом периоде не было %ДополнительноеОписание%.';en='Consumption ""% SchetUcheta%"" in total% Amount% proportioned to the financial results for% SposobRaspredeleniya% can not be distributed because in the count period, there was no% DopolnitelnoeOpisanie%.'"
	);
	
	ОписаниеОшибки = СтрЗаменить(
		ОписаниеОшибки,
		"%СчетУчета%",
		Строка(СчетУчета)
	);
	
	ОписаниеОшибки = СтрЗаменить(
		ОписаниеОшибки,
		"%Сумма%",
		Строка(Сумма) + " " + СокрЛП(Строка(Константы.ВалютаУчета.Получить()))
	);
	
	Если СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ОбъемПродаж Тогда
		ТекстСпособРаспределения = "объему продаж";
	ИначеЕсли СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ВыручкаОтПродаж Тогда
		ТекстСпособРаспределения = "выручке от продаж";
	ИначеЕсли СпособРаспределения = Перечисления.БазыРаспределенияРасходов.СебестоимостьПродаж Тогда
		ТекстСпособРаспределения = "себестоимости продаж";
	ИначеЕсли СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ВаловаяПрибыль Тогда
		ТекстСпособРаспределения = "валовой прибыли";
	КонецЕсли;
		
	ОписаниеОшибки = СтрЗаменить(
		ОписаниеОшибки,
		"%СпособРаспределения%",
		ТекстСпособРаспределения
	);
	
	Если СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ОбъемПродаж Тогда
		ТекстДополнительноеОписание = "продаж";
	ИначеЕсли СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ВыручкаОтПродаж Тогда
		ТекстДополнительноеОписание = "выручки от продаж";
	ИначеЕсли СпособРаспределения = Перечисления.БазыРаспределенияРасходов.СебестоимостьПродаж Тогда
		ТекстДополнительноеОписание = "себестоимости продаж";
	ИначеЕсли СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ВаловаяПрибыль Тогда
		ТекстДополнительноеОписание = "валовой прибыли";
	КонецЕсли;
	
	ОписаниеОшибки = СтрЗаменить(
		ОписаниеОшибки,
		"%ДополнительноеОписание%",
		ТекстДополнительноеОписание
	);
	
	Возврат ОписаниеОшибки;
	
КонецФункции // СформироватьОписаниеОшибкиРаспределенияРасходов()

//Малышев 2024-06-25    (--
Процедура ПроверитьСчетУчетаЗатратРегл_ДвиженияЗапасов(СтрокаТаблицыПриход, СтрокаТаблицаЗапасыПродукция = Неопределено)
	
	СчетУчетаЗатратРегл = СтрокаТаблицыПриход.Номенклатура.СчетУчетаЗатратРегл; 
	Если СтрокаТаблицаЗапасыПродукция<>Неопределено Тогда
		//СчетУчетаЗатратРегл = СтрокаТаблицаЗапасыПродукция.СчетУчетаПродукцииРегл;
	КонецЕсли;	
			
	Если СтрокаТаблицыПриход.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение 
		и не ЗначениеЗаполнено(СтрокаТаблицыПриход.СчетУчетаЗатратРегл) Тогда 
		  СтрокаТаблицыПриход.СчетУчетаЗатратРегл = СчетУчетаЗатратРегл;
	ИначеЕсли СтрокаТаблицыПриход.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад 
		и ЗначениеЗаполнено(СтрокаТаблицыПриход.СчетУчетаЗатратРегл) Тогда 
		  СтрокаТаблицыПриход.СчетУчетаЗатратРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	КонецЕсли;	
КонецПроцедуры

Функция ПолучитьПризнак_СебестоимостьЗапасовПоПроектам(ДополнительныеСвойства) 
	//Малышев 2024-11-08 ONESOFT-3227
	Если ДополнительныеСвойства.УчетнаяПолитика.УчетПопроектам Тогда
		Возврат Истина;
	КонецЕсли;	

	СебестоимостьЗапасовПоПроектам = ДополнительныеСвойства.УчетнаяПолитика.СебестоимостьЗапасовПоПроектам;
	Возврат СебестоимостьЗапасовПоПроектам;
	
КонецФункции

#КонецОбласти

#Область РасчетФактическойСебестоимостиВыпуска

// Функция формирует движения по регистру сведений УзлыКорректировкиСтоимостиСписания.
//
// Параметры:
//  Отказ        - Булево - флаг отказа проведения документа.
//
// Возвращаемое значение:
//  Число - номер записанного узла.
//
Функция СформироватьДвиженияПоРегиструУзлыКорректировкиСтоимостиСписания(Отказ)
	
	//Малышев 2024-11-07 ONESOFT-3227
	УдалимВременнуюТаблицу(ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц,"ВТ_ДвиженияЗапасовБезВозвратовСОстаткамиНаНачало0");
	УдалимВременнуюТаблицу(ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц,"УчетЗатратДляРасчетов");
	
	Запрос = Новый Запрос();
	
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНач", ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("ДатаКон", ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ПустойСчет", ДополнительныеСвойства.ДляПроведения.ПустойСчет);
	Запрос.УстановитьПараметр("ПустойСчетРегл", ДополнительныеСвойства.ДляПроведения.ПустойСчетРегл); //+++ Дмгг
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированныйПланСчетов", ДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	Запрос.УстановитьПараметр("УчетПоПроектам", ДополнительныеСвойства.УчетнаяПолитика.УчетПопроектам); //Малышев 2024-07-18
	Запрос.УстановитьПараметр("СебестоимостьЗапасовПоПроектам", ПолучитьПризнак_СебестоимостьЗапасовПоПроектам(ДополнительныеСвойства)); //Малышев 2024-07-29

	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости, закоментировал
	
	//// Получим таблицу новых узлов, каждый узел определяется комбинацией всех
	//// измерений учета. В колонку Сумма помещается средняя цена по соответствующему
	//// ресурсу регистра УчетЗапасовИЗатрат по внешнему поступлению для каждого узла.
	//// Эти колонки являются правыми частями в системе линейных уравнений. В колонки
	//// Количество помещается общее количество поступления в каждый узел. Если по
	//// данному узлу движений по количеству не было, а были только движения по
	//// стоимости, значит вместо количества используется стоимость (узел
	//// соответствует не материальным расходам). Если из узла было списание по
	//// фиксированной стоимости то уменьшаем количество и стоимость поступления в
	//// данный узел на количество и стоимость по фиксированной операции.
	//Запрос.Текст =    
	//"ВЫБРАТЬ
	//|	УчетЗатрат.Организация КАК Организация,
	//|	УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|	УчетЗатрат.СчетУчета КАК СчетУчета,
	//|	УчетЗатрат.Номенклатура КАК Номенклатура,
	//|	УчетЗатрат.Характеристика КАК Характеристика,
	//|	УчетЗатрат.Партия КАК Партия,
	////Малышев 2024-06-19 ONESOFT-3227
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	//|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	//|		КОГДА УчетЗатрат.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА УчетЗатрат.Проект
	//|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
	//|	КОНЕЦ КАК Проект, 
	////Малышев 2024-06-19 ONESOFT-3227
	//|	УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	//|	ВЫБОР
	//|		КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|			ТОГДА УчетЗатрат.Количество
	//|		ИНАЧЕ -УчетЗатрат.Количество
	//|	КОНЕЦ КАК Количество,
	//|	ВЫБОР
	//|		КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|			ТОГДА УчетЗатрат.Сумма
	//|		ИНАЧЕ -УчетЗатрат.Сумма
	//|	КОНЕЦ КАК СуммаДляКоличества,
	//|	ВЫБОР
	//|		КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|				И УчетЗатрат.ФиксированнаяСтоимость
	//|			ТОГДА УчетЗатрат.Сумма
	//|		КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|				И УчетЗатрат.ФиксированнаяСтоимость
	//|			ТОГДА -УчетЗатрат.Сумма
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК Сумма,
	//|	УчетЗатрат.СчетУчетаРегл КАК СчетУчетаРегл
	//|
	//|ПОМЕСТИТЬ ВТ_ДвиженияЗапасовБезВозвратовСОстаткамиНаНачало0 
	//|		ИЗ
	//|			РегистрНакопления.Запасы КАК УчетЗатрат 
	//|		ГДЕ
	//|			УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	//|			И (УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|						И НЕ УчетЗатрат.Возврат
	//|					ИЛИ УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|						И УчетЗатрат.Возврат)
	//|			И УчетЗатрат.Организация = &Организация
	////++++ Дмгг
	//|		
	//|СГРУППИРОВАТЬ ПО
	//|	УчетЗатрат.Организация,
	//|	УчетЗатрат.СтруктурнаяЕдиница,
	//|	УчетЗатрат.СчетУчета,
	//|	УчетЗатрат.Номенклатура,
	//|	УчетЗатрат.Характеристика,
	//|	УчетЗатрат.Партия,
	////Малышев 2024-06-19 ONESOFT-3227
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	//|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	//|		КОГДА УчетЗатрат.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА УчетЗатрат.Проект
	//|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
	//|	КОНЕЦ, 
	////Малышев 2024-06-19 ONESOFT-3227
	//|	УчетЗатрат.ЗаказПокупателя,
	//|	ВЫБОР
	//|		КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|			ТОГДА УчетЗатрат.Количество
	//|		ИНАЧЕ -УчетЗатрат.Количество
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|			ТОГДА УчетЗатрат.Сумма
	//|		ИНАЧЕ -УчетЗатрат.Сумма
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|				И УчетЗатрат.ФиксированнаяСтоимость
	//|			ТОГДА УчетЗатрат.Сумма
	//|		КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|				И УчетЗатрат.ФиксированнаяСтоимость
	//|			ТОГДА -УчетЗатрат.Сумма
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	УчетЗатрат.СчетУчетаРегл
	////--- Дмгг
	//|		
	//|ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|ВЫБРАТЬ
	//|	УчетЗатрат.Организация,
	//|	УчетЗатрат.СтруктурнаяЕдиница,
	//|	УчетЗатрат.СчетУчета,
	//|	УчетЗатрат.Номенклатура,
	//|	УчетЗатрат.Характеристика,
	//|	УчетЗатрат.Партия,
	////Малышев 2024-06-19 ONESOFT-3227
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	//|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	//|		КОГДА УчетЗатрат.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА УчетЗатрат.Проект
	//|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
	//|	КОНЕЦ КАК Проект, 
	////Малышев 2024-06-19 ONESOFT-3227
	//|	УчетЗатрат.ЗаказПокупателя,
	//|	ВЫБОР
	//|		КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|			ТОГДА УчетЗатрат.Количество
	//|		ИНАЧЕ 0 - УчетЗатрат.Количество
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|			ТОГДА УчетЗатрат.Сумма
	//|		ИНАЧЕ 0 - УчетЗатрат.Сумма
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|			ТОГДА УчетЗатрат.Сумма
	//|		ИНАЧЕ 0 - УчетЗатрат.Сумма
	//|	КОНЕЦ,
	//|	УчетЗатрат.СчетУчетаРегл
	//|ИЗ
	//|	РегистрНакопления.Запасы КАК УчетЗатрат
	//|ГДЕ
	//|	УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	//|	И (УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|				И НЕ УчетЗатрат.Возврат
	//|			ИЛИ УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|				И УчетЗатрат.Возврат)
	//|	И УчетЗатрат.ФиксированнаяСтоимость
	//|	И УчетЗатрат.Организация = &Организация
	//|		
	//|ОБЪЕДИНИТЬ ВСЕ
	//|		
	//|ВЫБРАТЬ
	//|	УчетЗатратОстатки.Организация,
	//|	УчетЗатратОстатки.СтруктурнаяЕдиница,
	//|	УчетЗатратОстатки.СчетУчета,
	//|	УчетЗатратОстатки.Номенклатура,
	//|	УчетЗатратОстатки.Характеристика,
	//|	УчетЗатратОстатки.Партия,
	////Малышев 2024-06-19 ONESOFT-3227
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	//|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	//|		КОГДА УчетЗатратОстатки.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА УчетЗатратОстатки.Проект
	//|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
	//|	КОНЕЦ КАК Проект, 
	////Малышев 2024-06-19 ONESOFT-3227
	//|	УчетЗатратОстатки.ЗаказПокупателя,
	//|	УчетЗатратОстатки.КоличествоОстаток,
	//|	УчетЗатратОстатки.СуммаОстаток,
	//|	УчетЗатратОстатки.СуммаОстаток,
	//|	УчетЗатратОстатки.СчетУчетаРегл
	//|ИЗ
	//|	РегистрНакопления.Запасы.Остатки(&ДатаНач, Организация = &Организация) КАК УчетЗатратОстатки
	//|;
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	УчетЗатрат.Организация КАК Организация,
	//|	УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|	УчетЗатрат.СчетУчета КАК СчетУчета,
	//|	УчетЗатрат.Номенклатура КАК Номенклатура,
	//|	УчетЗатрат.Характеристика КАК Характеристика,
	//|	УчетЗатрат.Партия КАК Партия,
	////Малышев 2024-06-19 ONESOFT-3227 (--
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	//|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	//|		КОГДА УчетЗатрат.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА УчетЗатрат.Проект
	//|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	//|	КОНЕЦ КАК Проект,
	////Малышев 2024-06-19 ONESOFT-3227  --)
	//|	УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	//|	УчетЗатрат.СчетУчетаРегл КАК СчетУчетаРегл
	//|
	//|ПОМЕСТИТЬ УчетЗатратДляРасчетов
	//|
	//|ИЗ
	//|	РегистрНакопления.Запасы КАК УчетЗатрат
	//|ГДЕ
	//|	УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	//|	И УчетЗатрат.Организация = &Организация
	//|	И (УчетЗатрат.Количество <> 0
	//|			ИЛИ УчетЗатрат.Сумма <> 0)
	//|;
	//|ВЫБРАТЬ
	//|	УчетЗатратДляРасчетов.Организация КАК Организация,
	//|	УчетЗатратДляРасчетов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|	УчетЗатратДляРасчетов.СчетУчета КАК СчетУчета,
	//|	УчетЗатратДляРасчетов.СчетУчетаРегл КАК СчетУчетаРегл,
	//|	УчетЗатратДляРасчетов.Номенклатура КАК Номенклатура,
	//|	УчетЗатратДляРасчетов.Характеристика КАК Характеристика,
	//|	УчетЗатратДляРасчетов.Партия КАК Партия,
	//|	УчетЗатратДляРасчетов.Проект КАК Проект,  //Малышев 2024-06-19 ONESOFT-3227
	//|	УчетЗатратДляРасчетов.ЗаказПокупателя КАК ЗаказПокупателя,
	//|	ВЫБОР
	//|		КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	//|			ТОГДА СУММА(ВложенныйЗапрос.СуммаДляКоличества)
	//|		ИНАЧЕ СУММА(ВложенныйЗапрос.Количество)
	//|	КОНЕЦ КАК Количество,
	//|	ВЫБОР
	//|		КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	//|				И СУММА(ВложенныйЗапрос.СуммаДляКоличества) = 0
	//|			ТОГДА 0
	//|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.Сумма) / ВЫБОР
	//|					КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	//|						ТОГДА СУММА(ВложенныйЗапрос.СуммаДляКоличества)
	//|					ИНАЧЕ СУММА(ВложенныйЗапрос.Количество)
	//|				КОНЕЦ КАК ЧИСЛО(23, 10))
	//|	КОНЕЦ КАК Сумма,
	//|	УчетЗатратДляРасчетов.СчетУчетаРегл
	//|ПОМЕСТИТЬ ТаблицаУзлыКорректировкиСтоимостиСписания
	//|ИЗ
	//|	УчетЗатратДляРасчетов КАК УчетЗатратДляРасчетов
	//|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДвиженияЗапасовБезВозвратовСОстаткамиНаНачало0 КАК ВложенныйЗапрос
	//|		ПО УчетЗатратДляРасчетов.Организация = ВложенныйЗапрос.Организация
	//|			И УчетЗатратДляРасчетов.СтруктурнаяЕдиница = ВложенныйЗапрос.СтруктурнаяЕдиница
	////+++ Дмгг
	////|			И УчетЗатратДляРасчетов.СчетУчета = ВложенныйЗапрос.СчетУчета
	//|			И (ВЫБОР
	//|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	//|					ТОГДА УчетЗатратДляРасчетов.СчетУчетаРегл = ВложенныйЗапрос.СчетУчетаРегл
	//|				ИНАЧЕ УчетЗатратДляРасчетов.СчетУчета = ВложенныйЗапрос.СчетУчета
	//|			КОНЕЦ)
	////--- Дмгг
	//|			И УчетЗатратДляРасчетов.Номенклатура = ВложенныйЗапрос.Номенклатура
	//|			И УчетЗатратДляРасчетов.Характеристика = ВложенныйЗапрос.Характеристика
	//|			И УчетЗатратДляРасчетов.Партия = ВложенныйЗапрос.Партия
	//|			И (&СебестоимостьЗапасовПоПроектам=ЛОЖЬ или УчетЗатратДляРасчетов.Проект = ВложенныйЗапрос.Проект)  //Малышев 2024-07-09
	//|			И УчетЗатратДляРасчетов.ЗаказПокупателя = ВложенныйЗапрос.ЗаказПокупателя
	//|ГДЕ
	//|	УчетЗатратДляРасчетов.Номенклатура.МетодОценки = ЗНАЧЕНИЕ(Перечисление.МетодОценкиЗапасов.FIFO)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	УчетЗатратДляРасчетов.Организация,
	//|	УчетЗатратДляРасчетов.СтруктурнаяЕдиница,
	//|	УчетЗатратДляРасчетов.СчетУчета,
	//|	УчетЗатратДляРасчетов.Номенклатура,
	//|	УчетЗатратДляРасчетов.Характеристика,
	//|	УчетЗатратДляРасчетов.Партия,
	//|	УчетЗатратДляРасчетов.Проект,   //Малышев 2024-06-19 ONESOFT-3227
	//|	УчетЗатратДляРасчетов.ЗаказПокупателя,
	//|	УчетЗатратДляРасчетов.СчетУчетаРегл";
	//
	//Запрос.Выполнить();
	//
	//// Формируем остатки на конец периода, которые будем закрывать по ФИФО.
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	УчетЗатратОстатки.Организация КАК Организация,
	//|	УчетЗатратОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|	УчетЗатратОстатки.СчетУчета КАК СчетУчета,
	//|	УчетЗатратОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
	//|	УчетЗатратОстатки.Номенклатура КАК Номенклатура,
	//|	УчетЗатратОстатки.Характеристика КАК Характеристика,
	//|	УчетЗатратОстатки.Партия КАК Партия,
	////Малышев 2024-06-19 ONESOFT-3227 (--
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	//|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	//|		КОГДА УчетЗатратОстатки.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА УчетЗатратОстатки.Проект
	//|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	//|	КОНЕЦ КАК Проект,
	////Малышев 2024-06-19 ONESOFT-3227  --)
	//|	УчетЗатратОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	//|	ВЫБОР
	//|		КОГДА УчетЗатратОстатки.КоличествоОстаток > 0
	//|			ТОГДА УчетЗатратОстатки.КоличествоОстаток
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК КоличествоОстаток,
	//|	ВЫБОР
	//|		КОГДА УчетЗатратОстатки.КоличествоОстаток > 0
	//|			ТОГДА УчетЗатратОстатки.КоличествоОстаток
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК КоличествоОстатокНаКонецПериода,
	//|	ДОБАВИТЬКДАТЕ(&ДатаКон, СЕКУНДА, 1) КАК Период,
	//|	0 КАК СуммаОстаток
	//|ПОМЕСТИТЬ ТаблицаОстатковПартий
	//|ИЗ
	//|	РегистрНакопления.Запасы.Остатки(
	//|			&ДатаКон,
	//|			Организация = &Организация
	//|				И Номенклатура.МетодОценки = ЗНАЧЕНИЕ(Перечисление.МетодОценкиЗапасов.FIFO)) КАК УчетЗатратОстатки
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	1 КАК Поле1
	//|ПОМЕСТИТЬ ПериодыПартий";
	//Запрос.Выполнить();
	//
	//Запрос.Текст =      
	//"УНИЧТОЖИТЬ ПериодыПартий
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	УчетЗатрат.Организация КАК Организация,
	//|	УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|	УчетЗатрат.СчетУчета КАК СчетУчета,
	//|	УчетЗатрат.СчетУчетаРегл КАК СчетУчетаРегл,
	//|	УчетЗатрат.Номенклатура КАК Номенклатура,
	//|	УчетЗатрат.Характеристика КАК Характеристика,
	//|	УчетЗатрат.Партия КАК Партия,
	////Малышев 2024-06-19 ONESOFT-3227 (--
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	//|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	//|		КОГДА УчетЗатрат.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА УчетЗатрат.Проект
	//|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	//|	КОНЕЦ КАК Проект,
	////Малышев 2024-06-19 ONESOFT-3227  --)
	//|	УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	//|	МАКСИМУМ(НАЧАЛОПЕРИОДА(УчетЗатрат.Период, ДЕНЬ)) КАК Период
	//|ПОМЕСТИТЬ ПериодыПартий
	//|ИЗ
	//|	РегистрНакопления.Запасы КАК УчетЗатрат
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатковПартий КАК ТаблицаОстатковПартий
	//|		ПО (ТаблицаОстатковПартий.Организация = УчетЗатрат.Организация)
	//|			И (ТаблицаОстатковПартий.СтруктурнаяЕдиница = УчетЗатрат.СтруктурнаяЕдиница)
	////+++ Дмгг
	////|			И (ТаблицаОстатковПартий.СчетУчета = УчетЗатрат.СчетУчета)
	//|			И (ВЫБОР
	//|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	//|					ТОГДА ТаблицаОстатковПартий.СчетУчетаРегл = УчетЗатрат.СчетУчетаРегл
	//|				ИНАЧЕ ТаблицаОстатковПартий.СчетУчета = УчетЗатрат.СчетУчета
	//|			КОНЕЦ)
	////--- Дмгг
	//|			И (ТаблицаОстатковПартий.Номенклатура = УчетЗатрат.Номенклатура)
	//|			И (ТаблицаОстатковПартий.Характеристика = УчетЗатрат.Характеристика)
	//|			И (ТаблицаОстатковПартий.Партия = УчетЗатрат.Партия)                          
	////Малышев 2024-06-19 ONESOFT-3227
	//|			И (
	//|			&СебестоимостьЗапасовПоПроектам=ЛОЖЬ ИЛИ 
	//|				ТаблицаОстатковПартий.Проект = 
	//|							ВЫБОР 
	//|								КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	//|								КОГДА УчетЗатрат.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	//|									ТОГДА УчетЗатрат.Проект
	//|								ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	//|							КОНЕЦ 
	//|			) 
	////Малышев 2024-06-19 ONESOFT-3227
	//|			И (ТаблицаОстатковПартий.ЗаказПокупателя = УчетЗатрат.ЗаказПокупателя)
	//|			И (ТаблицаОстатковПартий.КоличествоОстаток <> 0)
	//|ГДЕ
	//|	УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	////+++ Дмгг
	////|	И УчетЗатрат.КоррСчетУчета = &ПустойСчет
	//|	И ВЫБОР 
	//|		КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	//|			ТОГДА УчетЗатрат.КоррСчетУчетаРегл = &ПустойСчетРегл
	//|		ИНАЧЕ УчетЗатрат.КоррСчетУчета = &ПустойСчет
	//|	КОНЕЦ
	////--- Дмгг
	//|	И (УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|				И НЕ УчетЗатрат.Возврат
	//|			ИЛИ УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|				И УчетЗатрат.Возврат)
	//|	И УчетЗатрат.Период < ТаблицаОстатковПартий.Период
	//|	И УчетЗатрат.Организация = &Организация
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	УчетЗатрат.Организация,
	//|	УчетЗатрат.СтруктурнаяЕдиница,
	//|	УчетЗатрат.СчетУчета,
	//|	УчетЗатрат.СчетУчетаРегл,
	//|	УчетЗатрат.Номенклатура,
	//|	УчетЗатрат.Характеристика,
	//|	УчетЗатрат.Партия,
	////Малышев 2024-06-19 ONESOFT-3227 (--
	//|	ВЫБОР 
	//|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	//|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	//|		КОГДА УчетЗатрат.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	//|			ТОГДА УчетЗатрат.Проект
	//|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	//|	КОНЕЦ,
	////Малышев 2024-06-19 ONESOFT-3227  --)
	//|	УчетЗатрат.ЗаказПокупателя
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ПериодыПартий.Организация КАК Организация,
	//|	ПериодыПартий.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|	ПериодыПартий.СчетУчета КАК СчетУчета,
	//|	ПериодыПартий.СчетУчетаРегл КАК СчетУчетаРегл,
	//|	ПериодыПартий.Номенклатура КАК Номенклатура,
	//|	ПериодыПартий.Характеристика КАК Характеристика,
	//|	ПериодыПартий.Партия КАК Партия,
	//|	ПериодыПартий.Проект КАК Проект,  //Малышев 2024-06-19 ONESOFT-3227
	//|	ПериодыПартий.ЗаказПокупателя КАК ЗаказПокупателя,
	//|	СУММА(ВЫБОР
	//|			КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|				ТОГДА УчетЗатрат.Количество
	//|			ИНАЧЕ -УчетЗатрат.Количество
	//|		КОНЕЦ) КАК Количество,
	//|	СУММА(ВЫБОР
	//|			КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|				ТОГДА УчетЗатрат.Сумма
	//|			ИНАЧЕ -УчетЗатрат.Сумма
	//|		КОНЕЦ) КАК Сумма,
	//|	ПериодыПартий.Период
	//|ПОМЕСТИТЬ ВнешниеПоступленияЗаПериод
	//|ИЗ
	//|	ПериодыПартий КАК ПериодыПартий
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК УчетЗатрат
	//|		ПО ПериодыПартий.Организация = УчетЗатрат.Организация
	//|			И ПериодыПартий.СтруктурнаяЕдиница = УчетЗатрат.СтруктурнаяЕдиница
	////+++ Дмгг
	////|			И ПериодыПартий.СчетУчета = УчетЗатрат.СчетУчета
	//|			И ВЫБОР 
	//|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	//|					ТОГДА ПериодыПартий.СчетУчетаРегл = УчетЗатрат.СчетУчетаРегл
	//|				ИНАЧЕ ПериодыПартий.СчетУчета = УчетЗатрат.СчетУчета
	//|			КОНЕЦ
	////--- Дмгг
	//|			И ПериодыПартий.Номенклатура = УчетЗатрат.Номенклатура
	//|			И ПериодыПартий.Характеристика = УчетЗатрат.Характеристика
	//|			И ПериодыПартий.Партия = УчетЗатрат.Партия
	////Малышев 2024-06-19 ONESOFT-3227
	//|			И (&СебестоимостьЗапасовПоПроектам=ЛОЖЬ 
	//|					ИЛИ ПериодыПартий.Проект = 
	//|							ВЫБОР 
	//|								КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	//|								КОГДА УчетЗатрат.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	//|									ТОГДА УчетЗатрат.Проект
	//|								ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	//|							КОНЕЦ 
	//|				)    
	////Малышев 2024-06-19 ONESOFT-3227
	//|			И ПериодыПартий.ЗаказПокупателя = УчетЗатрат.ЗаказПокупателя
	//|			И (УчетЗатрат.Период МЕЖДУ ПериодыПартий.Период И КОНЕЦПЕРИОДА(ПериодыПартий.Период, ДЕНЬ))
	////--- Дмгг
	////|			И (УчетЗатрат.КоррСчетУчета = &ПустойСчет)
	//|			И (ВЫБОР 
	//|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	//|					ТОГДА УчетЗатрат.КоррСчетУчетаРегл = &ПустойСчетРегл
	//|				ИНАЧЕ УчетЗатрат.КоррСчетУчета = &ПустойСчет
	//|			КОНЕЦ)
	////--- Дмгг
	//|			И (УчетЗатрат.ФиксированнаяСтоимость)
	//|			И (УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|					И НЕ УчетЗатрат.Возврат
	//|				ИЛИ УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|					И УчетЗатрат.Возврат)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПериодыПартий.Организация,
	//|	ПериодыПартий.СтруктурнаяЕдиница,
	//|	ПериодыПартий.СчетУчета,
	//|	ПериодыПартий.СчетУчетаРегл,
	//|	ПериодыПартий.Номенклатура,
	//|	ПериодыПартий.Характеристика,
	//|	ПериодыПартий.Партия,
	//|	ПериодыПартий.Проект,   //Малышев 2024-06-19 ONESOFT-3227
	//|	ПериодыПартий.ЗаказПокупателя,
	//|	ПериодыПартий.Период
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТаблицаОстатковПартий.Организация КАК Организация,
	//|	ТаблицаОстатковПартий.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|	ТаблицаОстатковПартий.СчетУчета КАК СчетУчета,
	//|	ТаблицаОстатковПартий.СчетУчетаРегл КАК СчетУчетаРегл,
	//|	ТаблицаОстатковПартий.Номенклатура КАК Номенклатура,
	//|	ТаблицаОстатковПартий.Характеристика КАК Характеристика,
	//|	ТаблицаОстатковПартий.Партия КАК Партия,
	//|	ТаблицаОстатковПартий.Проект КАК Проект,   //Малышев 2024-06-19 ONESOFT-3227
	//|	ТаблицаОстатковПартий.ЗаказПокупателя КАК ЗаказПокупателя,
	//|	ВЫБОР
	//|		КОГДА ТаблицаОстатковПартий.КоличествоОстаток > ЕСТЬNULL(ВнешниеПоступленияЗаПериод.Количество, 0)
	//|			ТОГДА ТаблицаОстатковПартий.КоличествоОстаток - ЕСТЬNULL(ВнешниеПоступленияЗаПериод.Количество, 0)
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК КоличествоОстаток,
	//|	ВЫБОР
	//|		КОГДА ТаблицаОстатковПартий.КоличествоОстаток >= ЕСТЬNULL(ВнешниеПоступленияЗаПериод.Количество, 0)
	//|			ТОГДА ТаблицаОстатковПартий.СуммаОстаток + ЕСТЬNULL(ВнешниеПоступленияЗаПериод.Сумма, 0)
	//|		ИНАЧЕ ТаблицаОстатковПартий.СуммаОстаток + (ВЫРАЗИТЬ(ВнешниеПоступленияЗаПериод.Сумма * ТаблицаОстатковПартий.КоличествоОстаток / ВнешниеПоступленияЗаПериод.Количество КАК ЧИСЛО(23, 10)))
	//|	КОНЕЦ КАК СуммаОстаток,
	//|	ТаблицаОстатковПартий.КоличествоОстатокНаКонецПериода,
	//|	ВнешниеПоступленияЗаПериод.Период
	//|ПОМЕСТИТЬ ТаблицаТекущихОстатковПартий
	//|ИЗ
	//|	ТаблицаОстатковПартий КАК ТаблицаОстатковПартий
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВнешниеПоступленияЗаПериод КАК ВнешниеПоступленияЗаПериод
	//|		ПО ТаблицаОстатковПартий.Организация = ВнешниеПоступленияЗаПериод.Организация
	//|			И ТаблицаОстатковПартий.СтруктурнаяЕдиница = ВнешниеПоступленияЗаПериод.СтруктурнаяЕдиница
	////+++ Дмгг
	////|			И ТаблицаОстатковПартий.СчетУчета = ВнешниеПоступленияЗаПериод.СчетУчета
	//|			И ВЫБОР 
	//|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	//|					ТОГДА ТаблицаОстатковПартий.СчетУчетаРегл = ВнешниеПоступленияЗаПериод.СчетУчетаРегл
	//|				ИНАЧЕ ТаблицаОстатковПартий.СчетУчета = ВнешниеПоступленияЗаПериод.СчетУчета
	//|			КОНЕЦ
	////--- Дмгг
	//|			И ТаблицаОстатковПартий.Номенклатура = ВнешниеПоступленияЗаПериод.Номенклатура
	//|			И ТаблицаОстатковПартий.Характеристика = ВнешниеПоступленияЗаПериод.Характеристика
	//|			И ТаблицаОстатковПартий.Партия = ВнешниеПоступленияЗаПериод.Партия
	//|			И (&СебестоимостьЗапасовПоПроектам=ЛОЖЬ или ТаблицаОстатковПартий.Проект = ВнешниеПоступленияЗаПериод.Проект)   //Малышев 2024-06-19 ONESOFT-3227
	//|			И ТаблицаОстатковПартий.ЗаказПокупателя = ВнешниеПоступленияЗаПериод.ЗаказПокупателя
	//|			И (ТаблицаОстатковПартий.КоличествоОстаток <> 0)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|УНИЧТОЖИТЬ ТаблицаОстатковПартий
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|УНИЧТОЖИТЬ ВнешниеПоступленияЗаПериод
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТаблицаТекущихОстатковПартий.Организация КАК Организация,
	//|	ТаблицаТекущихОстатковПартий.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|	ТаблицаТекущихОстатковПартий.СчетУчета КАК СчетУчета,
	//|	ТаблицаТекущихОстатковПартий.СчетУчетаРегл КАК СчетУчетаРегл,
	//|	ТаблицаТекущихОстатковПартий.Номенклатура КАК Номенклатура,
	//|	ТаблицаТекущихОстатковПартий.Характеристика КАК Характеристика,
	//|	ТаблицаТекущихОстатковПартий.Партия КАК Партия,
	//|	ТаблицаТекущихОстатковПартий.Проект КАК Проект,  //Малышев 2024-06-19 ONESOFT-3227
	//|	ТаблицаТекущихОстатковПартий.ЗаказПокупателя КАК ЗаказПокупателя,
	//|	ТаблицаТекущихОстатковПартий.КоличествоОстаток КАК КоличествоОстаток,
	//|	ТаблицаТекущихОстатковПартий.КоличествоОстатокНаКонецПериода КАК КоличествоОстатокНаКонецПериода,
	//|	ТаблицаТекущихОстатковПартий.СуммаОстаток КАК СуммаОстаток,
	//|	ТаблицаТекущихОстатковПартий.Период КАК Период
	//|ПОМЕСТИТЬ ТаблицаОстатковПартий
	//|ИЗ
	//|	ТаблицаТекущихОстатковПартий КАК ТаблицаТекущихОстатковПартий
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|УНИЧТОЖИТЬ ТаблицаТекущихОстатковПартий
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ ПЕРВЫЕ 1
	//|	1 КАК Поле1
	//|ИЗ
	//|	ПериодыПартий КАК ПериодыПартий";
	//
	//// Выполняем поиск партий.
	//КоличествоИтераций = 0;
	//Результат = Запрос.Выполнить();
	//Пока НЕ Результат.Пустой() Цикл
	//	КоличествоИтераций = КоличествоИтераций + 1;
	//	Результат = Запрос.Выполнить();
	//КонецЦикла;
	
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости, закоментировал
	
	// Уменьшаем количество и сумму прихода в узлах, на количество и сумму
	// "зафиксированного" конечного остатка.
	Запрос.Текст = 
	"
	|ВЫБРАТЬ    
	|	""1. Приходы без возвратов и расход возвраты"" как ОписаниеДвижения,
	|	УчетЗатрат.Организация КАК Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатрат.СчетУчета КАК СчетУчета,
	|	УчетЗатрат.СчетУчетаРегл КАК СчетУчетаРегл,
	|	УчетЗатрат.Номенклатура КАК Номенклатура,
	|	УчетЗатрат.Характеристика КАК Характеристика,
	|	УчетЗатрат.Партия КАК Партия,
	//Малышев 2024-06-19 ONESOFT-3227
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА УчетЗатрат.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА УчетЗатрат.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
	|	КОНЕЦ КАК Проект, 
	//Малышев 2024-06-19 ONESOFT-3227
    |	УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	//|			УчетЗатрат.Резервирование КАК Резервирование, //+++ Дмгг
	//+++ Дмгг
	//|			ВЫБОР
	//|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|					ТОГДА УчетЗатрат.Количество
	//|				ИНАЧЕ -УчетЗатрат.Количество
	//|			КОНЕЦ КАК Количество,
	//|			ВЫБОР
	//|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|					ТОГДА УчетЗатрат.Сумма
	//|				ИНАЧЕ -УчетЗатрат.Сумма
	//|			КОНЕЦ КАК СуммаДляКоличества,
	//|			ВЫБОР
	//|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|						И УчетЗатрат.ФиксированнаяСтоимость
	//|					ТОГДА УчетЗатрат.Сумма
	//|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//|						И УчетЗатрат.ФиксированнаяСтоимость
	//|					ТОГДА -УчетЗатрат.Сумма
	//|				ИНАЧЕ 0
	//|			КОНЕЦ КАК Сумма
	|	СУММА(ВЫБОР
	|		КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА УчетЗатрат.Количество
	|		ИНАЧЕ -УчетЗатрат.Количество
	|	КОНЕЦ) КАК Количество,
	|	СУММА(ВЫБОР
	|		КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА УчетЗатрат.Сумма
	|		ИНАЧЕ -УчетЗатрат.Сумма
	|	КОНЕЦ) КАК СуммаДляКоличества,
	|	СУММА(ВЫБОР
	|		КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И УчетЗатрат.ФиксированнаяСтоимость
	|			ТОГДА УчетЗатрат.Сумма
	|		КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И УчетЗатрат.ФиксированнаяСтоимость
	|			ТОГДА -УчетЗатрат.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Сумма
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,УчетЗатрат.ДокументПоступления КАК ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ПОМЕСТИТЬ ВТ_ЗапасыБезВозвратов //ВТ_ДвиженияЗапасовБезВозвратовСОстаткамиНаНачало	
	//--- Дмгг
	|ИЗ
	|	РегистрНакопления.Запасы КАК УчетЗатрат
	|ГДЕ
	|	УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И (
	|		(УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И НЕ УчетЗатрат.Возврат)
	|		ИЛИ 
	|		(УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И УчетЗатрат.Возврат)
	|		)
	|	И УчетЗатрат.Организация = &Организация
	//+++ Дмгг
	|		
	|СГРУППИРОВАТЬ ПО
	//|			УчетЗатрат.Резервирование,  //Малышев 2024-07-18
	|	УчетЗатрат.Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница,
	|	УчетЗатрат.СчетУчета,
	|	УчетЗатрат.СчетУчетаРегл,
	|	УчетЗатрат.Номенклатура,
	|	УчетЗатрат.Характеристика,
	|	УчетЗатрат.Партия,
	//Малышев 2024-06-19 ONESOFT-3227
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА УчетЗатрат.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА УчетЗатрат.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
	|	КОНЕЦ, 
	//Малышев 2024-06-19 ONESOFT-3227
	|	УчетЗатрат.ЗаказПокупателя
	//--- Дмгг
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,УчетЗатрат.ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|		
	|ОБЪЕДИНИТЬ ВСЕ
	|		
	|ВЫБРАТЬ 
	|	""2.С Фиксированной Стоимостью. Приход возвраты и расход не возвраты"",
	|	УчетЗатрат.Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница,
	|	УчетЗатрат.СчетУчета,
	|	УчетЗатрат.СчетУчетаРегл,
	|	УчетЗатрат.Номенклатура,
	|	УчетЗатрат.Характеристика,
	|	УчетЗатрат.Партия,
	//Малышев 2024-06-19 ONESOFT-3227
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА УчетЗатрат.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА УчетЗатрат.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
	|	КОНЕЦ КАК Проект, 
	//Малышев 2024-06-19 ONESOFT-3227
    |	УчетЗатрат.ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА УчетЗатрат.Количество
	|		ИНАЧЕ 0 - УчетЗатрат.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА УчетЗатрат.Сумма
	|		ИНАЧЕ 0 - УчетЗатрат.Сумма
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА УчетЗатрат.Сумма
	|		ИНАЧЕ 0 - УчетЗатрат.Сумма
	|	КОНЕЦ
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,УчетЗатрат.ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ИЗ
	|	РегистрНакопления.Запасы КАК УчетЗатрат
	|ГДЕ
	|	УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И (
	|		(УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И УчетЗатрат.Возврат)
	|		ИЛИ 
	|		(УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НЕ УчетЗатрат.Возврат)
	|		)
	|	И УчетЗатрат.ФиксированнаяСтоимость
	|	И УчетЗатрат.Организация = &Организация
	|		
	|ОБЪЕДИНИТЬ ВСЕ
	|		
	|ВЫБРАТЬ 
	|	""3.Остатки на начало периода"",
	|	УчетЗатратОстатки.Организация,
	|	УчетЗатратОстатки.СтруктурнаяЕдиница,
	|	УчетЗатратОстатки.СчетУчета,
	|	УчетЗатратОстатки.СчетУчетаРегл,
	|	УчетЗатратОстатки.Номенклатура,
	|	УчетЗатратОстатки.Характеристика,
	|	УчетЗатратОстатки.Партия,
	//Малышев 2024-06-19 ONESOFT-3227
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА УчетЗатратОстатки.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА УчетЗатратОстатки.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
	|	КОНЕЦ КАК Проект, 
	//Малышев 2024-06-19 ONESOFT-3227
    |	УчетЗатратОстатки.ЗаказПокупателя,
	|	УчетЗатратОстатки.КоличествоОстаток,
	|	УчетЗатратОстатки.СуммаОстаток,
	|	УчетЗатратОстатки.СуммаОстаток
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,УчетЗатратОстатки.ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(&ДатаНач, Организация = &Организация) КАК УчетЗатратОстатки
	|;      
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УчетЗатрат.Организация КАК Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатрат.СчетУчета КАК СчетУчета,
	|	УчетЗатрат.СчетУчетаРегл КАК СчетУчетаРегл,
	|	УчетЗатрат.Номенклатура КАК Номенклатура,
	|	УчетЗатрат.Номенклатура.МетодОценки КАК МетодОценки, //Малышев 2024-07-18
	|	УчетЗатрат.Характеристика КАК Характеристика,
	|	УчетЗатрат.Партия КАК Партия,
	//Малышев 2024-06-19 ONESOFT-3227
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА УчетЗатрат.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА УчетЗатрат.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
	|	КОНЕЦ КАК Проект, 
	//Малышев 2024-06-19 ONESOFT-3227
    |	УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,УчетЗатрат.ДокументПоступления КАК ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ПОМЕСТИТЬ ВТ_УчетЗатратДляРасчетов //ВТ_УчетЗатратДляРасчетов_ИмеющиеЗначение
	|ИЗ
	|	РегистрНакопления.Запасы КАК УчетЗатрат
	|ГДЕ
	|	УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И УчетЗатрат.Организация = &Организация
	|	И (УчетЗатрат.Количество <> 0
	|			ИЛИ УчетЗатрат.Сумма <> 0)
	|;
	//|ВЫБРАТЬ
	//|	ТаблицаУзлыКорректировкиСтоимостиСписания.Организация КАК Организация,
	//|	ТаблицаУзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|	ТаблицаУзлыКорректировкиСтоимостиСписания.СчетУчета КАК СчетУчета,
	//|	ТаблицаУзлыКорректировкиСтоимостиСписания.СчетУчетаРегл КАК СчетУчетаРегл,
	//|	ТаблицаУзлыКорректировкиСтоимостиСписания.Номенклатура КАК Номенклатура,
	//|	ТаблицаУзлыКорректировкиСтоимостиСписания.Характеристика КАК Характеристика,
	//|	ТаблицаУзлыКорректировкиСтоимостиСписания.Партия КАК Партия,
	//|	ТаблицаУзлыКорректировкиСтоимостиСписания.Проект КАК Проект,  	//Малышев 2024-06-19 ONESOFT-3227
	//|	ТаблицаУзлыКорректировкиСтоимостиСписания.ЗаказПокупателя КАК ЗаказПокупателя,
	//|	ТаблицаУзлыКорректировкиСтоимостиСписания.Количество 
	//|		- ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстатокНаКонецПериода, 0) 
	//|		+ ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстаток, 0)
	//|	КАК Количество,
	//|	ВЫБОР
	//|		КОГДА ТаблицаУзлыКорректировкиСтоимостиСписания.Количество - ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстатокНаКонецПериода, 0) + ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстаток, 0) = 0
	//|			ТОГДА 0
	//|		ИНАЧЕ (ТаблицаУзлыКорректировкиСтоимостиСписания.Сумма * ТаблицаУзлыКорректировкиСтоимостиСписания.Количество - ЕСТЬNULL(ТаблицаОстатковПартий.СуммаОстаток, 0)) / (ТаблицаУзлыКорректировкиСтоимостиСписания.Количество - ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстатокНаКонецПериода, 0) + ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстаток, 0))
	//|	КОНЕЦ КАК Сумма
	//|ИЗ
	//|	ТаблицаУзлыКорректировкиСтоимостиСписания КАК ТаблицаУзлыКорректировкиСтоимостиСписания
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатковПартий КАК ТаблицаОстатковПартий
	//|		ПО ТаблицаУзлыКорректировкиСтоимостиСписания.Организация = ТаблицаОстатковПартий.Организация
	//|			И ТаблицаУзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница = ТаблицаОстатковПартий.СтруктурнаяЕдиница
	////+++ ДМгг
	////|			И ТаблицаУзлыКорректировкиСтоимостиСписания.СчетУчета = ТаблицаОстатковПартий.СчетУчета
	//|			И ВЫБОР 
	//|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	//|					ТОГДА ТаблицаУзлыКорректировкиСтоимостиСписания.СчетУчетаРегл = ТаблицаОстатковПартий.СчетУчетаРегл
	//|				ИНАЧЕ ТаблицаУзлыКорректировкиСтоимостиСписания.СчетУчета = ТаблицаОстатковПартий.СчетУчета
	//|			КОНЕЦ
	////--- Дмгг
	//|			И ТаблицаУзлыКорректировкиСтоимостиСписания.Номенклатура = ТаблицаОстатковПартий.Номенклатура
	//|			И ТаблицаУзлыКорректировкиСтоимостиСписания.Характеристика = ТаблицаОстатковПартий.Характеристика
	//|			И ТаблицаУзлыКорректировкиСтоимостиСписания.Партия = ТаблицаОстатковПартий.Партия
	//|			И (&СебестоимостьЗапасовПоПроектам=ЛОЖЬ или ТаблицаУзлыКорректировкиСтоимостиСписания.Проект = ТаблицаОстатковПартий.Проект)   //Малышев 2024-06-19 ONESOFT-3227
	//|			И ТаблицаУзлыКорректировкиСтоимостиСписания.ЗаказПокупателя = ТаблицаОстатковПартий.ЗаказПокупателя
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	УчетЗатратДляРасчетов.Организация,
	//|	УчетЗатратДляРасчетов.СтруктурнаяЕдиница,
	//|	УчетЗатратДляРасчетов.СчетУчета,
	//|	УчетЗатратДляРасчетов.СчетУчетаРегл,
	//|	УчетЗатратДляРасчетов.Номенклатура,
	//|	УчетЗатратДляРасчетов.Характеристика,
	//|	УчетЗатратДляРасчетов.Партия,
	//|	УчетЗатратДляРасчетов.Проект,  //Малышев 2024-06-19 ONESOFT-3227
	//|	УчетЗатратДляРасчетов.ЗаказПокупателя,
	//|	ВЫБОР
	//|		КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	//|			ТОГДА СУММА(ВложенныйЗапрос.СуммаДляКоличества)
	//|		ИНАЧЕ СУММА(ВложенныйЗапрос.Количество)
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	//|				И СУММА(ВложенныйЗапрос.СуммаДляКоличества) = 0
	//|			ТОГДА 0
	//|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.Сумма) / ВЫБОР
	//|					КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	//|						ТОГДА СУММА(ВложенныйЗапрос.СуммаДляКоличества)
	//|					ИНАЧЕ СУММА(ВложенныйЗапрос.Количество)
	//|				КОНЕЦ КАК ЧИСЛО(23, 10))
	//|	КОНЕЦ
	//|ИЗ
	//|	ВТ_УчетЗатратДляРасчетов КАК УчетЗатратДляРасчетов
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗапасыБезВозвратов КАК ВложенныйЗапрос
	//|		ПО УчетЗатратДляРасчетов.Организация = ВложенныйЗапрос.Организация
	//|			И УчетЗатратДляРасчетов.СтруктурнаяЕдиница = ВложенныйЗапрос.СтруктурнаяЕдиница
	////+++ Дмгг
	////|			И УчетЗатратДляРасчетов.СчетУчета = ВложенныйЗапрос.СчетУчета
	//|			И ВЫБОР 
	//|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	//|					ТОГДА УчетЗатратДляРасчетов.СчетУчетаРегл = ВложенныйЗапрос.СчетУчетаРегл
	//|				ИНАЧЕ УчетЗатратДляРасчетов.СчетУчета = ВложенныйЗапрос.СчетУчета
	//|			КОНЕЦ
	////--- Дмгг
	//|			И УчетЗатратДляРасчетов.Номенклатура = ВложенныйЗапрос.Номенклатура
	//|			И УчетЗатратДляРасчетов.Характеристика = ВложенныйЗапрос.Характеристика
	//|			И УчетЗатратДляРасчетов.Партия = ВложенныйЗапрос.Партия
	//|			И (&СебестоимостьЗапасовПоПроектам=ЛОЖЬ или УчетЗатратДляРасчетов.Проект = ВложенныйЗапрос.Проект)    //Малышев 2024-06-19 ONESOFT-3227
	//|			И УчетЗатратДляРасчетов.ЗаказПокупателя = ВложенныйЗапрос.ЗаказПокупателя
	//|ГДЕ
	//|	(УчетЗатратДляРасчетов.Номенклатура.МетодОценки = ЗНАЧЕНИЕ(Перечисление.МетодОценкиЗапасов.ПоСредней)
	//|			ИЛИ УчетЗатратДляРасчетов.Номенклатура.МетодОценки = ЗНАЧЕНИЕ(Перечисление.МетодОценкиЗапасов.ПустаяСсылка)
	//|			ИЛИ УчетЗатратДляРасчетов.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	УчетЗатратДляРасчетов.Организация,
	//|	УчетЗатратДляРасчетов.СтруктурнаяЕдиница,
	//|	УчетЗатратДляРасчетов.СчетУчета,
	//|	УчетЗатратДляРасчетов.СчетУчетаРегл,
	//|	УчетЗатратДляРасчетов.Номенклатура,
	//|	УчетЗатратДляРасчетов.Характеристика,
	//|	УчетЗатратДляРасчетов.Партия,
	//|	УчетЗатратДляРасчетов.Проект,     //Малышев 2024-06-19 ONESOFT-3227
	//|	УчетЗатратДляРасчетов.ЗаказПокупателя";
	
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости	
	|ВЫБРАТЬ
	|	""2"",
	|	УчетЗатратДляРасчетов.Организация КАК Организация,
	|	УчетЗатратДляРасчетов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатратДляРасчетов.СчетУчета КАК СчетУчета,
	|	УчетЗатратДляРасчетов.СчетУчетаРегл КАК СчетУчетаРегл,
	|	УчетЗатратДляРасчетов.Номенклатура КАК Номенклатура,
	|	УчетЗатратДляРасчетов.Характеристика КАК Характеристика,
	|	УчетЗатратДляРасчетов.Партия КАК Партия,
	|	УчетЗатратДляРасчетов.Проект КАК Проект,  	//Малышев 2024-06-19 ONESOFT-3227
	|	УчетЗатратДляРасчетов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	|			ТОГДА СУММА(ВложенныйЗапрос.СуммаДляКоличества)
	|		ИНАЧЕ СУММА(ВложенныйЗапрос.Количество)
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	|				И СУММА(ВложенныйЗапрос.СуммаДляКоличества) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.Сумма) / ВЫБОР
	|					КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	|						ТОГДА СУММА(ВложенныйЗапрос.СуммаДляКоличества)
	|					ИНАЧЕ СУММА(ВложенныйЗапрос.Количество)
	|				КОНЕЦ КАК ЧИСЛО(23, 10))
	|	КОНЕЦ КАК Сумма
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,УчетЗатратДляРасчетов.ДокументПоступления КАК ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ИЗ
	|	ВТ_УчетЗатратДляРасчетов КАК УчетЗатратДляРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗапасыБезВозвратов КАК ВложенныйЗапрос
	|		ПО УчетЗатратДляРасчетов.Организация = ВложенныйЗапрос.Организация
	|			И УчетЗатратДляРасчетов.СтруктурнаяЕдиница = ВложенныйЗапрос.СтруктурнаяЕдиница
	//+++ Дмгг
	//|			И УчетЗатратДляРасчетов.СчетУчета = ВложенныйЗапрос.СчетУчета
	|			И ВЫБОР 
	|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|					ТОГДА УчетЗатратДляРасчетов.СчетУчетаРегл = ВложенныйЗапрос.СчетУчетаРегл
	|				ИНАЧЕ УчетЗатратДляРасчетов.СчетУчета = ВложенныйЗапрос.СчетУчета
	|			КОНЕЦ
	//--- Дмгг
	|			И УчетЗатратДляРасчетов.Номенклатура = ВложенныйЗапрос.Номенклатура
	|			И УчетЗатратДляРасчетов.Характеристика = ВложенныйЗапрос.Характеристика
	|			И УчетЗатратДляРасчетов.Партия = ВложенныйЗапрос.Партия
	|			И (&СебестоимостьЗапасовПоПроектам=ЛОЖЬ или УчетЗатратДляРасчетов.Проект = ВложенныйЗапрос.Проект)    //Малышев 2024-06-19 ONESOFT-3227
	|			И УчетЗатратДляРасчетов.ЗаказПокупателя = ВложенныйЗапрос.ЗаказПокупателя
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|			И УчетЗатратДляРасчетов.ДокументПоступления = ВложенныйЗапрос.ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетЗатратДляРасчетов.Организация,
	|	УчетЗатратДляРасчетов.СтруктурнаяЕдиница,
	|	УчетЗатратДляРасчетов.СчетУчета,
	|	УчетЗатратДляРасчетов.СчетУчетаРегл,
	|	УчетЗатратДляРасчетов.Номенклатура,
	|	УчетЗатратДляРасчетов.Характеристика,
	|	УчетЗатратДляРасчетов.Партия,
	|	УчетЗатратДляРасчетов.Проект,     //Малышев 2024-06-19 ONESOFT-3227
	|	УчетЗатратДляРасчетов.ЗаказПокупателя
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,УчетЗатратДляРасчетов.ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости	
	|";
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	
	НомерУзла = 0;
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		НаборЗаписей = РегистрыСведений.УзлыКорректировкиСтоимостиСписания.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписей.Записать(Истина);
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НомерУзла = НомерУзла + 1;
			НовыйУзел = НаборЗаписей.Добавить();
			НовыйУзел.НомерУзла = НомерУзла;
			НовыйУзел.Регистратор = Ссылка;
			НовыйУзел.Период = Дата;
			ЗаполнитьЗначенияСвойств(НовыйУзел, Выборка);
		КонецЦикла;
		НаборЗаписей.Записать(Ложь);
	КонецЕсли;

	//+++ Мирошниченко Р.К. 19-08-2024
	Запрос.Текст = "УНИЧТОЖИТЬ ВТ_ЗапасыБезВозвратов;УНИЧТОЖИТЬ ВТ_УчетЗатратДляРасчетов";
	Запрос.Выполнить();
	//---


	// Первое приближение (решение на первой итерации).
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла,
	|	УзлыКорректировкиСтоимостиСписания.Сумма
	|ПОМЕСТИТЬ ТаблицаРешений
	|ИЗ
	|	РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
	|ГДЕ
	|	УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|";
	Запрос.Выполнить();
	
	////Малышев 2024-06-19 ONESOFT-3227  - для отладки (--
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	УзлыКорректировкиСтоимостиСписания.НомерУзла,
	//|	УзлыКорректировкиСтоимостиСписания.Сумма
	//|ПОМЕСТИТЬ ТаблицаРешений_УзлыКорректировкиСтоимостиСписания_ПервоеПриблежение
	//|ИЗ
	//|	РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
	//|ГДЕ
	//|	УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	НомерУзла
	//|";
	//Запрос.Выполнить();
	////Малышев 2024-06-19 ONESOFT-3227 --)
	
	Возврат НомерУзла;
	
КонецФункции // СформироватьДвиженияПоРегиструУзлыКорректировкиСтоимостиСписания()

// Решает систему линейных уравнений
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//  Булево - флаг нахождения решения.
//
Функция РешитьСЛУ()
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНач", ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("ДатаКон", ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ПустойСчет", ДополнительныеСвойства.ДляПроведения.ПустойСчет);
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированныйПланСчетов", ДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	Запрос.УстановитьПараметр("УчетПоПроектам", ДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//Малышев 2024-07-30 (-
	Запрос.УстановитьПараметр("СебестоимостьЗапасовПоПроектам", ПолучитьПризнак_СебестоимостьЗапасовПоПроектам(ДополнительныеСвойства));
	//Малышев 2024-07-30 -)
		
	ТекущееОтклонение = 1;
	ТребуемаяТочность = 0.00001;
	КоличествоИтераций = 0;
	
	// Подготовим таблицу перемещений и списаний за отчетный период. Возвраты
	// текущего периода отрабатываются как обычные перемещения.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетЗапасовИЗатрат.Организация КАК Организация,
	|	УчетЗапасовИЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗапасовИЗатрат.СчетУчета КАК СчетУчета,
	|	УчетЗапасовИЗатрат.СчетУчетаРегл КАК СчетУчетаРегл,
	|	УчетЗапасовИЗатрат.Номенклатура КАК Номенклатура,
	|	УчетЗапасовИЗатрат.Характеристика КАК Характеристика,
	|	УчетЗапасовИЗатрат.Партия КАК Партия,
	//Малышев 2024-06-19 ONESOFT-3227
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА УчетЗапасовИЗатрат.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА УчетЗапасовИЗатрат.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
	|	КОНЕЦ КАК Проект, 
	//Малышев 2024-06-19 ONESOFT-3227
    |	УчетЗапасовИЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗапасовИЗатрат.ЗаказПродажи КАК ЗаказПродажи,
	|	УчетЗапасовИЗатрат.ДокументПродажи КАК ДокументПродажи,
	|	-СУММА(УчетЗапасовИЗатрат.Количество) КАК Количество,
	|	-СУММА(УчетЗапасовИЗатрат.Сумма) КАК Сумма
	|
	|ПОМЕСТИТЬ УчетЗатратВозвратыТекПериода
	|
	|ИЗ
	|	РегистрНакопления.Запасы КАК УчетЗапасовИЗатрат
	|ГДЕ
	|	УчетЗапасовИЗатрат.Организация = &Организация
	|	И УчетЗапасовИЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И УчетЗапасовИЗатрат.Возврат
	|	И НЕ УчетЗапасовИЗатрат.ФиксированнаяСтоимость
	|	И УчетЗапасовИЗатрат.ДокументПродажи <> НЕОПРЕДЕЛЕНО
	|	И КОНЕЦПЕРИОДА(УчетЗапасовИЗатрат.ДокументПродажи.Дата, МЕСЯЦ) = КОНЕЦПЕРИОДА(УчетЗапасовИЗатрат.Период, МЕСЯЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетЗапасовИЗатрат.Организация,
	|	УчетЗапасовИЗатрат.СтруктурнаяЕдиница,
	|	УчетЗапасовИЗатрат.СчетУчета,
	|	УчетЗапасовИЗатрат.СчетУчетаРегл,
	|	УчетЗапасовИЗатрат.Номенклатура,
	|	УчетЗапасовИЗатрат.Характеристика,
	|	УчетЗапасовИЗатрат.Партия,
	//Малышев 2024-06-19 ONESOFT-3227
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА УчетЗапасовИЗатрат.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА УчетЗапасовИЗатрат.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
	|	КОНЕЦ, 
	//Малышев 2024-06-19 ONESOFT-3227
    |	УчетЗапасовИЗатрат.ЗаказПокупателя,
	|	УчетЗапасовИЗатрат.ЗаказПродажи,
	|	УчетЗапасовИЗатрат.ДокументПродажи
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПродажи,
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	СчетУчетаРегл, //+++ Дмгг
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	ЗаказПокупателя,
	|	ЗаказПродажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетЗатратВозвратыТекПериода.Организация КАК Организация,
	|	УчетЗатратВозвратыТекПериода.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатратВозвратыТекПериода.СчетУчета КАК СчетУчета,
	|	УчетЗатратВозвратыТекПериода.Номенклатура КАК Номенклатура,
	|	УчетЗатратВозвратыТекПериода.Характеристика КАК Характеристика,
	|	УчетЗатратВозвратыТекПериода.Партия КАК Партия,
	|	УчетЗатратВозвратыТекПериода.Проект КАК Проект,     //Малышев 2024-06-19 ONESOFT-3227
	|	УчетЗатратВозвратыТекПериода.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла КАК НомерУзла,
	|	СУММА(ЕСТЬNULL(УчетЗапасовИЗатрат.Количество, 0)) КАК КоличествоПродано,
	|	СУММА(ЕСТЬNULL(УчетЗапасовИЗатрат.Сумма, 0)) КАК СуммаПродано,
	|	УчетЗатратВозвратыТекПериода.Количество КАК КоличествоВозврат,
	|	УчетЗатратВозвратыТекПериода.Сумма КАК СуммаВозврат,
	|	УчетЗатратВозвратыТекПериода.ДокументПродажи КАК ДокументПродажи,
	|	УчетЗатратВозвратыТекПериода.СчетУчетаРегл
	|ПОМЕСТИТЬ УчетЗатратВозвратыПоРезервам
	|ИЗ
	|	УчетЗатратВозвратыТекПериода КАК УчетЗатратВозвратыТекПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК УчетЗапасовИЗатрат
	|		ПО УчетЗатратВозвратыТекПериода.ДокументПродажи = УчетЗапасовИЗатрат.ДокументПродажи
	|			И УчетЗатратВозвратыТекПериода.Организация = УчетЗапасовИЗатрат.Организация
	|			И УчетЗатратВозвратыТекПериода.Номенклатура = УчетЗапасовИЗатрат.Номенклатура
	|			И УчетЗатратВозвратыТекПериода.Характеристика = УчетЗапасовИЗатрат.Характеристика
	|			И УчетЗатратВозвратыТекПериода.Партия = УчетЗапасовИЗатрат.Партия
	//Малышев 2024-06-19 ONESOFT-3227
	|			И (
	|				&СебестоимостьЗапасовПоПроектам=ЛОЖЬ 
	|				ИЛИ УчетЗатратВозвратыТекПериода.Проект = 
	|					ВЫБОР 
	|						КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|						КОГДА УчетЗапасовИЗатрат.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|							ТОГДА УчетЗапасовИЗатрат.Проект
	|						ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
	|					КОНЕЦ 
	|				)      
	//Малышев 2024-06-19 ONESOFT-3227
	|			И УчетЗатратВозвратыТекПериода.ЗаказПродажи = УчетЗапасовИЗатрат.ЗаказПродажи
	|			И УчетЗатратВозвратыТекПериода.ЗаказПродажи = УчетЗапасовИЗатрат.ЗаказПокупателя
	|			И (УчетЗапасовИЗатрат.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))
	|			И (НЕ УчетЗапасовИЗатрат.Возврат)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
	|		ПО (УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор)
	|			И (УчетЗапасовИЗатрат.Организация = УзлыКорректировкиСтоимостиСписания.Организация)
	|			И (УчетЗапасовИЗатрат.СтруктурнаяЕдиница = УзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница)
	//+++ Дмгг
	//|			И (УчетЗапасовИЗатрат.СчетУчета = УзлыКорректировкиСтоимостиСписания.СчетУчета)
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|					ТОГДА УчетЗапасовИЗатрат.СчетУчетаРегл = УзлыКорректировкиСтоимостиСписания.СчетУчетаРегл
	|				ИНАЧЕ УчетЗапасовИЗатрат.СчетУчета = УзлыКорректировкиСтоимостиСписания.СчетУчета
	|			КОНЕЦ)
	//--- Дмгг
	|			И (УчетЗапасовИЗатрат.Номенклатура = УзлыКорректировкиСтоимостиСписания.Номенклатура)
	|			И (УчетЗапасовИЗатрат.Характеристика = УзлыКорректировкиСтоимостиСписания.Характеристика)
	|			И (УчетЗапасовИЗатрат.Партия = УзлыКорректировкиСтоимостиСписания.Партия)
	//Малышев 2024-07-09 ONESOFT-3227
	|			И (
	|				&СебестоимостьЗапасовПоПроектам=ЛОЖЬ 
	|					ИЛИ УчетЗапасовИЗатрат.Проект = 
	|						ВЫБОР 
	|							КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|							КОГДА УзлыКорректировкиСтоимостиСписания.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|								ТОГДА УзлыКорректировкиСтоимостиСписания.Проект
	|							ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
	|						КОНЕЦ 
	|				)  
	//Малышев 2024-07-09 ONESOFT-3227
	|			И (УчетЗапасовИЗатрат.ЗаказПокупателя = УзлыКорректировкиСтоимостиСписания.ЗаказПокупателя)
	|			И (УчетЗапасовИЗатрат.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))
	|ГДЕ
	|	УчетЗапасовИЗатрат.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетЗатратВозвратыТекПериода.Организация,
	|	УчетЗатратВозвратыТекПериода.СтруктурнаяЕдиница,
	|	УчетЗатратВозвратыТекПериода.СчетУчета,
	|	УчетЗатратВозвратыТекПериода.Номенклатура,
	|	УчетЗатратВозвратыТекПериода.Характеристика,
	|	УчетЗатратВозвратыТекПериода.Партия,
	|	УчетЗатратВозвратыТекПериода.Проект,   //Малышев 2024-06-19 ONESOFT-3227
	|	УчетЗатратВозвратыТекПериода.ЗаказПокупателя,
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла,
	|	УчетЗатратВозвратыТекПериода.Количество,
	|	УчетЗатратВозвратыТекПериода.Сумма,
	|	УчетЗатратВозвратыТекПериода.ДокументПродажи,
	|	УчетЗатратВозвратыТекПериода.СчетУчетаРегл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетЗатратВозвратыТекПериода.Организация КАК Организация,
	|	УчетЗатратВозвратыТекПериода.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатратВозвратыТекПериода.СчетУчета КАК СчетУчета,
	|	УчетЗатратВозвратыТекПериода.Номенклатура КАК Номенклатура,
	|	УчетЗатратВозвратыТекПериода.Характеристика КАК Характеристика,
	|	УчетЗатратВозвратыТекПериода.Партия КАК Партия,
	|	УчетЗатратВозвратыТекПериода.Проект КАК Проект,  //Малышев 2024-06-19 ONESOFT-3227
	|	УчетЗатратВозвратыТекПериода.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла КАК НомерУзла,
	|	СУММА(ЕСТЬNULL(УчетЗапасовИЗатрат.Количество, 0)) КАК КоличествоПродано,
	|	СУММА(ЕСТЬNULL(УчетЗапасовИЗатрат.Сумма, 0)) КАК СуммаПродано,
	|	УчетЗатратВозвратыТекПериода.Количество КАК КоличествоВозврат,
	|	УчетЗатратВозвратыТекПериода.Сумма КАК СуммаВозврат,
	|	УчетЗатратВозвратыТекПериода.ДокументПродажи КАК ДокументПродажи,
	|	УчетЗатратВозвратыТекПериода.СчетУчетаРегл
	|ПОМЕСТИТЬ УчетЗатратВозвратыСвободные
	|ИЗ
	|	УчетЗатратВозвратыТекПериода КАК УчетЗатратВозвратыТекПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК УчетЗапасовИЗатрат
	|		ПО УчетЗатратВозвратыТекПериода.ДокументПродажи = УчетЗапасовИЗатрат.ДокументПродажи
	|			И УчетЗатратВозвратыТекПериода.Организация = УчетЗапасовИЗатрат.Организация
	|			И УчетЗатратВозвратыТекПериода.Номенклатура = УчетЗапасовИЗатрат.Номенклатура
	|			И УчетЗатратВозвратыТекПериода.Характеристика = УчетЗапасовИЗатрат.Характеристика
	|			И УчетЗатратВозвратыТекПериода.Партия = УчетЗапасовИЗатрат.Партия      
	//Малышев 2024-06-19 ONESOFT-3227
	|			И ( &СебестоимостьЗапасовПоПроектам=ЛОЖЬ или 
	|				УчетЗатратВозвратыТекПериода.Проект = 
	|						ВЫБОР 
	|							КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|							КОГДА УчетЗапасовИЗатрат.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|								ТОГДА УчетЗапасовИЗатрат.Проект
	|							ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
	|						КОНЕЦ 
	|				)     
	//Малышев 2024-06-19 ONESOFT-3227
	|			И УчетЗатратВозвратыТекПериода.ЗаказПродажи = УчетЗапасовИЗатрат.ЗаказПродажи
	|			И (УчетЗапасовИЗатрат.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))
	|			И (НЕ УчетЗапасовИЗатрат.Возврат)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
	|		ПО (УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор)
	|			И (УчетЗапасовИЗатрат.Организация = УзлыКорректировкиСтоимостиСписания.Организация)
	|			И (УчетЗапасовИЗатрат.СтруктурнаяЕдиница = УзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница)
	//+++ Дмгг
	//|			И (УчетЗапасовИЗатрат.СчетУчета = УзлыКорректировкиСтоимостиСписания.СчетУчета)
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|					ТОГДА УчетЗапасовИЗатрат.СчетУчетаРегл = УзлыКорректировкиСтоимостиСписания.СчетУчетаРегл
	|				ИНАЧЕ УчетЗапасовИЗатрат.СчетУчета = УзлыКорректировкиСтоимостиСписания.СчетУчета
	|			КОНЕЦ)
	//--- Дмгг
	|			И (УчетЗапасовИЗатрат.Номенклатура = УзлыКорректировкиСтоимостиСписания.Номенклатура)
	|			И (УчетЗапасовИЗатрат.Характеристика = УзлыКорректировкиСтоимостиСписания.Характеристика)
	|			И (УчетЗапасовИЗатрат.Партия = УзлыКорректировкиСтоимостиСписания.Партия)
	//Малышев 2024-06-19 ONESOFT-3227
	|			И (&СебестоимостьЗапасовПоПроектам=ЛОЖЬ   
	|				ИЛИ УчетЗапасовИЗатрат.Проект = 
	|						ВЫБОР 
	|							КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|							КОГДА УзлыКорректировкиСтоимостиСписания.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|								ТОГДА УзлыКорректировкиСтоимостиСписания.Проект
	|							ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
	|						КОНЕЦ 
	|				)   
	//Малышев 2024-06-19 ONESOFT-3227
	|			И (УчетЗапасовИЗатрат.ЗаказПокупателя = УзлыКорректировкиСтоимостиСписания.ЗаказПокупателя)
	|			И (УчетЗапасовИЗатрат.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))
	|ГДЕ
	|	УчетЗапасовИЗатрат.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетЗатратВозвратыТекПериода.Организация,
	|	УчетЗатратВозвратыТекПериода.СтруктурнаяЕдиница,
	|	УчетЗатратВозвратыТекПериода.СчетУчета,
	|	УчетЗатратВозвратыТекПериода.Номенклатура,
	|	УчетЗатратВозвратыТекПериода.Характеристика,
	|	УчетЗатратВозвратыТекПериода.Партия,
	|	УчетЗатратВозвратыТекПериода.Проект,    //Малышев 2024-06-19 ONESOFT-3227
	|	УчетЗатратВозвратыТекПериода.ЗаказПокупателя,
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла,
	|	УчетЗатратВозвратыТекПериода.Количество,
	|	УчетЗатратВозвратыТекПериода.Сумма,
	|	УчетЗатратВозвратыТекПериода.ДокументПродажи,
	|	УчетЗатратВозвратыТекПериода.СчетУчетаРегл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетЗатратВозвраты.Организация КАК Организация,
	|	УчетЗатратВозвраты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатратВозвраты.СчетУчета КАК СчетУчета,
	|	УчетЗатратВозвраты.Номенклатура КАК Номенклатура,
	|	УчетЗатратВозвраты.Характеристика КАК Характеристика,
	|	УчетЗатратВозвраты.Партия КАК Партия,
	|	УчетЗатратВозвраты.Проект КАК Проект,    //Малышев 2024-06-19 ONESOFT-3227
	|	УчетЗатратВозвраты.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗатратВозвраты.НомерУзла КАК НомерУзла,
	|	УчетЗатратВозвраты.КоличествоПродано КАК КоличествоПродано,
	|	УчетЗатратВозвраты.СуммаПродано КАК СуммаПродано,
	|	УчетЗатратВозвраты.КоличествоВозврат КАК КоличествоВозврат,
	|	УчетЗатратВозвраты.СуммаВозврат КАК СуммаВозврат,
	|	0 КАК КоличествоРаспределено,
	|	0 КАК СуммаРаспределено,
	|	УчетЗатратВозвраты.ДокументПродажи КАК ДокументПродажи,
	|	УчетЗатратВозвраты.СчетУчетаРегл
	|ИЗ
	|	(ВЫБРАТЬ
	|		УчетЗатратВозвраты.Организация КАК Организация,
	|		УчетЗатратВозвраты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		УчетЗатратВозвраты.СчетУчета КАК СчетУчета,
	|		УчетЗатратВозвраты.Номенклатура КАК Номенклатура,
	|		УчетЗатратВозвраты.Характеристика КАК Характеристика,
	|		УчетЗатратВозвраты.Партия КАК Партия,
	|		УчетЗатратВозвраты.Проект КАК Проект,    //Малышев 2024-06-19 ONESOFT-3227
	|		УчетЗатратВозвраты.ЗаказПокупателя КАК ЗаказПокупателя,
	|		УчетЗатратВозвраты.НомерУзла КАК НомерУзла,
	|		УчетЗатратВозвраты.КоличествоПродано КАК КоличествоПродано,
	|		УчетЗатратВозвраты.СуммаПродано КАК СуммаПродано,
	|		УчетЗатратВозвраты.КоличествоВозврат КАК КоличествоВозврат,
	|		УчетЗатратВозвраты.СуммаВозврат КАК СуммаВозврат,
	|		УчетЗатратВозвраты.ДокументПродажи КАК ДокументПродажи,
	|		УчетЗатратВозвраты.СчетУчетаРегл КАК СчетУчетаРегл
	|	ИЗ
	|		УчетЗатратВозвратыСвободные КАК УчетЗатратВозвраты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		УчетЗатратВозвраты.Организация,
	|		УчетЗатратВозвраты.СтруктурнаяЕдиница,
	|		УчетЗатратВозвраты.СчетУчета,
	|		УчетЗатратВозвраты.Номенклатура,
	|		УчетЗатратВозвраты.Характеристика,
	|		УчетЗатратВозвраты.Партия,
	|		УчетЗатратВозвраты.Проект,   //Малышев 2024-06-19 ONESOFT-3227
	|		УчетЗатратВозвраты.ЗаказПокупателя,
	|		УчетЗатратВозвраты.НомерУзла,
	|		УчетЗатратВозвраты.КоличествоПродано,
	|		УчетЗатратВозвраты.СуммаПродано,
	|		УчетЗатратВозвраты.КоличествоВозврат,
	|		УчетЗатратВозвраты.СуммаВозврат,
	|		УчетЗатратВозвраты.ДокументПродажи,
	|		УчетЗатратВозвраты.СчетУчетаРегл
	|	ИЗ
	|		УчетЗатратВозвратыПоРезервам КАК УчетЗатратВозвраты) КАК УчетЗатратВозвраты
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерУзла
	|ИТОГИ ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	Проект,  //Малышев 2024-06-19 ONESOFT-3227
	|	ДокументПродажи,
	|	СуммаВозврат,
	|	КоличествоВозврат";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаВозвратов = РезультатЗапроса[3].Выгрузить();
	ТаблицаВозвратов.Очистить();
	
	ОбходПоОрганизация = РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ОбходПоОрганизация.Следующий() Цикл
		ОбходПоСтруктурнаяЕдиница = ОбходПоОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ОбходПоСтруктурнаяЕдиница.Следующий() Цикл
			ОбходПоСчетУчета = ОбходПоСтруктурнаяЕдиница.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ОбходПоСчетУчета.Следующий() Цикл
				ОбходПоНоменклатура = ОбходПоСчетУчета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ОбходПоНоменклатура.Следующий() Цикл
					ОбходПоХарактеристика = ОбходПоНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ОбходПоХарактеристика.Следующий() Цикл
						ОбходПоПартия = ОбходПоХарактеристика.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ОбходПоПартия.Следующий() Цикл
							
							//Малышев 2024-06-19 ONESOFT-3227 (--
							ОбходПоПроектам = ОбходПоПартия.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Пока ОбходПоПроектам.Следующий() Цикл
							//ОбходПоДокументПродажи = ОбходПоПартия.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							ОбходПоДокументПродажи = ОбходПоПроектам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							//Малышев 2024-06-19 ONESOFT-3227  --)
							
							
							Пока ОбходПоДокументПродажи.Следующий() Цикл
								ОбходПоСуммаВозврат = ОбходПоДокументПродажи.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Пока ОбходПоСуммаВозврат.Следующий() Цикл
									ОбходПоКоличествоВозврат = ОбходПоСуммаВозврат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									Пока ОбходПоКоличествоВозврат.Следующий() Цикл
										КоличествоОсталосьРаспределить = ОбходПоКоличествоВозврат.КоличествоВозврат;
										СуммаОсталосьРаспределить = ОбходПоКоличествоВозврат.СуммаВозврат;
										ВыборкаДетальныеЗаписи = ОбходПоКоличествоВозврат.Выбрать();
										Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
											Если КоличествоОсталосьРаспределить > 0 Тогда
												НоваяСтрока = ТаблицаВозвратов.Добавить();
												ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
												Если КоличествоОсталосьРаспределить <= ВыборкаДетальныеЗаписи.КоличествоПродано Тогда
													НоваяСтрока.КоличествоРаспределено = КоличествоОсталосьРаспределить;
													КоличествоОсталосьРаспределить = 0;
													НоваяСтрока.СуммаРаспределено = СуммаОсталосьРаспределить;
													СуммаОсталосьРаспределить = 0;
												Иначе
													НоваяСтрока.КоличествоРаспределено = ВыборкаДетальныеЗаписи.КоличествоПродано;
													КоличествоОсталосьРаспределить = КоличествоОсталосьРаспределить - ВыборкаДетальныеЗаписи.КоличествоПродано;
													НоваяСтрока.СуммаРаспределено = ВыборкаДетальныеЗаписи.СуммаПродано;
													СуммаОсталосьРаспределить = СуммаОсталосьРаспределить - ВыборкаДетальныеЗаписи.СуммаПродано;
												КонецЕсли;
											КонецЕсли;
										КонецЦикла;
									КонецЦикла;
								КонецЦикла;
							КонецЦикла;
							
							КонецЦикла; //Малышев 2024-06-19 ONESOFT-3227 по проектам
							
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	УдалимВременнуюТаблицу(Запрос.МенеджерВременныхТаблиц,"УчетЗатратБезУчетаВозвратов_ПодробныеДанные");  //Малышев 2024-11-07 ONESOFT-3227
	Запрос.УстановитьПараметр("ТаблицаВозвратов", ТаблицаВозвратов);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаВозвратов.Организация КАК Организация,
	|	ТаблицаВозвратов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаВозвратов.СчетУчета КАК СчетУчета,
	|	ТаблицаВозвратов.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ТаблицаВозвратов.Номенклатура КАК Номенклатура,
	|	ТаблицаВозвратов.Характеристика КАК Характеристика,
	|	ТаблицаВозвратов.Партия КАК Партия,
	|	ТаблицаВозвратов.Проект КАК Проект,    //Малышев 2024-06-19 ONESOFT-3227
	|	ТаблицаВозвратов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаВозвратов.НомерУзла КАК НомерУзла,
	|	ТаблицаВозвратов.КоличествоРаспределено КАК Количество,
	|	ТаблицаВозвратов.СуммаРаспределено КАК Сумма,
	|	ТаблицаВозвратов.ДокументПродажи КАК ДокументПродажи
	|ПОМЕСТИТЬ УчетЗатратВозвраты
	|ИЗ
	|	&ТаблицаВозвратов КАК ТаблицаВозвратов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетЗапасовИЗатрат.Организация КАК Организация,
	|	УчетЗапасовИЗатрат.КоррСтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗапасовИЗатрат.КоррСчетУчета КАК СчетУчета,
	|	УчетЗапасовИЗатрат.КоррСчетУчетаРегл КАК СчетУчетаРегл,
	|	УчетЗапасовИЗатрат.КоррНоменклатура КАК Номенклатура,
	|	УчетЗапасовИЗатрат.КоррХарактеристика КАК Характеристика,
	|	УчетЗапасовИЗатрат.КоррПартия КАК Партия,   
	//Малышев 2024-06-19 ONESOFT-3227
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА УчетЗапасовИЗатрат.КоррПроект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА УчетЗапасовИЗатрат.КоррПроект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
	|	КОНЕЦ как Проект, 
	//Малышев 2024-06-19 ONESOFT-3227
	|	УчетЗапасовИЗатрат.КоррЗаказПокупателя КАК ЗаказПокупателя,
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла КАК НомерУзла,
	|	ВЫБОР
	|		КОГДА УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НЕ УчетЗапасовИЗатрат.Возврат
	|			ТОГДА УчетЗапасовИЗатрат.Количество
	|		КОГДА УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И УчетЗапасовИЗатрат.Возврат
	|			ТОГДА -УчетЗапасовИЗатрат.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Количество,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					И НЕ УчетЗапасовИЗатрат.Возврат
	|				ТОГДА УчетЗапасовИЗатрат.Сумма
	|			КОГДА УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					И УчетЗапасовИЗатрат.Возврат
	|				ТОГДА -УчетЗапасовИЗатрат.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(23, 10)) 
	|	КАК Сумма, 
	//Малышев 2024-07-18 -вывод полей для отладки (--
	|	УчетЗапасовИЗатрат.Регистратор,
	|	УчетЗапасовИЗатрат.НомерСтроки,
	|	УчетЗапасовИЗатрат.ВидДвижения,
	|	ВЫБОР
	|		КОГДА УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НЕ УчетЗапасовИЗатрат.Возврат
	|			ТОГДА УчетЗапасовИЗатрат.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Количество_Приход,
	|	ВЫБОР
	|		КОГДА УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И УчетЗапасовИЗатрат.Возврат
	|			ТОГДА -УчетЗапасовИЗатрат.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Количество_Расход,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					И НЕ УчетЗапасовИЗатрат.Возврат
	|				ТОГДА УчетЗапасовИЗатрат.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(23, 10)) 
	|	КАК Сумма_Приход, 
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					И УчетЗапасовИЗатрат.Возврат
	|				ТОГДА -УчетЗапасовИЗатрат.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(23, 10)) 
	|	КАК Сумма_Расход 
	//Малышев 2024-07-18 -вывод полей для отладки --)
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,УчетЗапасовИЗатрат.КоррДокументПоступления КАК ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ПОМЕСТИТЬ УчетЗатратБезУчетаВозвратов_ПодробныеДанные
	|ИЗ
	|	РегистрНакопления.Запасы КАК УчетЗапасовИЗатрат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
	|		ПО (УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор)
	|			И УчетЗапасовИЗатрат.Организация = УзлыКорректировкиСтоимостиСписания.Организация
	|			И УчетЗапасовИЗатрат.СтруктурнаяЕдиница = УзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница
	//+++ Дмгг
	//|			И УчетЗапасовИЗатрат.СчетУчета = УзлыКорректировкиСтоимостиСписания.СчетУчета
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|					ТОГДА УчетЗапасовИЗатрат.СчетУчетаРегл = УзлыКорректировкиСтоимостиСписания.СчетУчетаРегл
	|				ИНАЧЕ УчетЗапасовИЗатрат.СчетУчета = УзлыКорректировкиСтоимостиСписания.СчетУчета
	|			КОНЕЦ)
	//--- Дмгг
	|			И УчетЗапасовИЗатрат.Номенклатура = УзлыКорректировкиСтоимостиСписания.Номенклатура
	|			И УчетЗапасовИЗатрат.Характеристика = УзлыКорректировкиСтоимостиСписания.Характеристика
	|			И УчетЗапасовИЗатрат.Партия = УзлыКорректировкиСтоимостиСписания.Партия
	//Малышев 2024-06-19 ONESOFT-3227 (--
	|			И (&СебестоимостьЗапасовПоПроектам=ЛОЖЬ или  
	|				УчетЗапасовИЗатрат.Проект = 
	|					ВЫБОР 
	|						КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|						КОГДА УзлыКорректировкиСтоимостиСписания.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|							ТОГДА УзлыКорректировкиСтоимостиСписания.Проект
	|						ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
	|					КОНЕЦ
	|				)    
	//Малышев 2024-06-19 ONESOFT-3227  --)
	|			И УчетЗапасовИЗатрат.ЗаказПокупателя = УзлыКорректировкиСтоимостиСписания.ЗаказПокупателя
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|			И УчетЗапасовИЗатрат.ДокументПоступления = УзлыКорректировкиСтоимостиСписания.ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ГДЕ
	|	УчетЗапасовИЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И УчетЗапасовИЗатрат.Организация = &Организация
	|	И НЕ УчетЗапасовИЗатрат.ФиксированнаяСтоимость
	|
	|///////////////////////////////////////////////////////////////////////////////////
	|;
	|ВЫБРАТЬ
	|	УчетЗапасовИЗатрат.Организация КАК Организация,
	|	УчетЗапасовИЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗапасовИЗатрат.СчетУчета КАК СчетУчета,
	|	УчетЗапасовИЗатрат.СчетУчетаРегл КАК СчетУчетаРегл,
	|	УчетЗапасовИЗатрат.Номенклатура КАК Номенклатура,
	|	УчетЗапасовИЗатрат.Характеристика КАК Характеристика,
	|	УчетЗапасовИЗатрат.Партия КАК Партия,   
	|	УчетЗапасовИЗатрат.Проект КАК Проект,   
	|	УчетЗапасовИЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗапасовИЗатрат.НомерУзла КАК НомерУзла,
	|	СУММА(УчетЗапасовИЗатрат.Количество) КАК Количество,
	|	СУММА(УчетЗапасовИЗатрат.Сумма) КАК Сумма
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,УчетЗапасовИЗатрат.ДокументПоступления КАК ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ПОМЕСТИТЬ УчетЗатратБезУчетаВозвратов
	|ИЗ 
    |   УчетЗатратБезУчетаВозвратов_ПодробныеДанные как УчетЗапасовИЗатрат
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетЗапасовИЗатрат.Организация,
	|	УчетЗапасовИЗатрат.СтруктурнаяЕдиница,
	|	УчетЗапасовИЗатрат.СчетУчета,
	|	УчетЗапасовИЗатрат.СчетУчетаРегл,
	|	УчетЗапасовИЗатрат.Номенклатура,
	|	УчетЗапасовИЗатрат.Характеристика,
	|	УчетЗапасовИЗатрат.Партия,
	|	УчетЗапасовИЗатрат.Проект,
	|	УчетЗапасовИЗатрат.ЗаказПокупателя,
	|	УчетЗапасовИЗатрат.НомерУзла
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,УчетЗапасовИЗатрат.ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|
	|///////////////////////////////////////////////////////////////////////////////////
	|;
	|ВЫБРАТЬ
	|	""УчетЗатратЗаВычетомВозвратов"" как КомментарийЗатраты,
	|	УчетЗатратЗаВычетомВозвратов.Организация КАК Организация,
	|	УчетЗатратЗаВычетомВозвратов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатратЗаВычетомВозвратов.СчетУчета КАК СчетУчета,
	|	УчетЗатратЗаВычетомВозвратов.Номенклатура КАК Номенклатура,
	|	УчетЗатратЗаВычетомВозвратов.Характеристика КАК Характеристика,
	|	УчетЗатратЗаВычетомВозвратов.Партия КАК Партия,
	|	УчетЗатратЗаВычетомВозвратов.Проект КАК Проект,   //Малышев 2024-06-19 ONESOFT-3227
	|	УчетЗатратЗаВычетомВозвратов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗатратЗаВычетомВозвратов.НомерУзла КАК НомерУзла,
	|	УчетЗатратЗаВычетомВозвратов.Количество КАК Количество,
	|	УчетЗатратЗаВычетомВозвратов.Сумма КАК Сумма,
	|	УчетЗатратЗаВычетомВозвратов.СчетУчетаРегл КАК СчетУчетаРегл
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,УчетЗатратЗаВычетомВозвратов.ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ПОМЕСТИТЬ ВТ_ВсеЗатратыПодробно
	|ИЗ
	|	УчетЗатратБезУчетаВозвратов КАК УчетЗатратЗаВычетомВозвратов
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	""УчетЗатратВозвраты"" как КомментарийЗатраты,
	|	УчетЗатратВозвраты.Организация,
	|	УчетЗатратВозвраты.СтруктурнаяЕдиница,
	|	УчетЗатратВозвраты.СчетУчета,
	|	УчетЗатратВозвраты.Номенклатура,
	|	УчетЗатратВозвраты.Характеристика,
	|	УчетЗатратВозвраты.Партия,
	|	УчетЗатратВозвраты.Проект,  //Малышев 2024-06-19 ONESOFT-3227
	|	УчетЗатратВозвраты.ЗаказПокупателя,
	|	УчетЗатратВозвраты.НомерУзла,
	|	УчетЗатратВозвраты.Количество,
	|	УчетЗатратВозвраты.Сумма,
	|	УчетЗатратВозвраты.СчетУчетаРегл
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,НЕОПРЕДЕЛЕНО
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ИЗ
	|	УчетЗатратВозвраты КАК УчетЗатратВозвраты
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	""УчетЗатратВозвраты_с пустыми полями"" как КомментарийЗатраты,
	|	УчетЗатратВозвраты.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка),
	
	//Малышев 2024-06-19 ONESOFT-3227 (--
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = Ложь ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)  //2024-07-09
	|	КОНЕЦ,  
	//Малышев 2024-06-19 ONESOFT-3227  --)
	
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка),
	|	УчетЗатратВозвраты.НомерУзла,
	|	-УчетЗатратВозвраты.Количество,
	|	-УчетЗатратВозвраты.Сумма,
	|	УчетЗатратВозвраты.СчетУчетаРегл
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,НЕОПРЕДЕЛЕНО
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ИЗ
	|	УчетЗатратВозвраты КАК УчетЗатратВозвраты
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетЗатрат.Организация КАК Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатрат.СчетУчета КАК СчетУчета,
	|	УчетЗатрат.СчетУчетаРегл,
	|	УчетЗатрат.Номенклатура КАК Номенклатура,
	|	УчетЗатрат.Характеристика КАК Характеристика,
	|	УчетЗатрат.Партия КАК Партия,
	|	УчетЗатрат.Проект КАК Проект,    //Малышев 2024-06-19 ONESOFT-3227
	|	УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗатрат.НомерУзла КАК НомерУзла,
	|	СУММА(УчетЗатрат.Количество) КАК Количество,
	|	СУММА(УчетЗатрат.Сумма) КАК Сумма
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,УчетЗатрат.ДокументПоступления КАК ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ПОМЕСТИТЬ УчетЗатрат
	|ИЗ
	|	ВТ_ВсеЗатратыПодробно КАК УчетЗатрат
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетЗатрат.Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница,
	|	УчетЗатрат.СчетУчета,
	|	УчетЗатрат.Номенклатура,
	|	УчетЗатрат.Характеристика,
	|	УчетЗатрат.Партия,
	|	УчетЗатрат.Проект,  //Малышев 2024-06-19 ONESOFT-3227
	|	УчетЗатрат.ЗаказПокупателя,
	|	УчетЗатрат.НомерУзла,
	|	УчетЗатрат.СчетУчетаРегл
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,УчетЗатрат.ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	СчетУчетаРегл,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	Проект,  //Малышев 2024-06-19 ONESOFT-3227
	|	ЗаказПокупателя,
	|	НомерУзла";
	
	//Малышев 2024-06-19 ONESOFT-3227 (--
	Запрос.УстановитьПараметр("УчетПоПроектам", Константы.ФункциональнаяОпцияУчетПоПроектам.Получить()); 
	//Малышев 2024-06-19 ONESOFT-3227 --)
	
	Запрос.ВыполнитьПакет();
	
	// ДЛЯ ОТЛАДКИ  Малышев 2024-06-19 ONESOFT-3227
	//для просмотра временных таблиц запросов пользовался просмотром выражения
	//
	//ОбщегоНазначения.ПолучитьВременныеТаблицыИсточника(Запрос) - возвращает структуру с данными
	//ОбщегоНазначения.ПолучитьВременныеТаблицыИсточника(Запрос,"E:\1С\_OneSoft\Задачи\11.mxl") - кроме структуры формирует табличный документ на диске
	//
	
	
	// Итерационно ищем решение системы линейных уравнений, пока отклонение не
	// будет меньше требуемого или не будет выполнено 100 итераций расчета.
	Сумма = 0;
	Пока (ТекущееОтклонение > ТребуемаяТочность * ТребуемаяТочность) И (КоличествоИтераций < 100) Цикл
		
		КоличествоИтераций = КоличествоИтераций + 1;
		
		// Следующая итерация расчета.
		//+++ Истомин
		// Все множетели, делители и сумма первого аакета приведины к максимальному числу, которое поддерживает 1С
		// Проблемную строку расчета определить не удалось (результат определненный через цикл дал значение которе походит для ЧИСЛО(23,10))
		// Во втором пакете значения первого приводится к родному 23,10
		// старый вариант: только СЦММА(ВЫРАЗИТЬ(... ; все остальное было без выразить
		//--- Истомин
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УзлыКорректировкиСтоимостиСписания.НомерУзла КАК НомерУзла,
		|	СУММА(ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА УзлыКорректировкиСтоимостиСписания.Количество <> 0
		|					ТОГДА (ВЫРАЗИТЬ(ТаблицаРешений.Сумма КАК ЧИСЛО(38, 28))) * (ВЫРАЗИТЬ(ВЫБОР
		|								КОГДА УчетЗатрат.Количество = 0
		|									ТОГДА ВЫРАЗИТЬ(УчетЗатрат.Сумма КАК ЧИСЛО(38, 28))
		|								ИНАЧЕ ВЫРАЗИТЬ(УчетЗатрат.Количество КАК ЧИСЛО(38, 28))
		|							КОНЕЦ КАК ЧИСЛО(38, 28))) / (ВЫРАЗИТЬ(УзлыКорректировкиСтоимостиСписания.Количество КАК ЧИСЛО(38, 28)))
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК ЧИСЛО(38, 28))) КАК Сумма
		|ПОМЕСТИТЬ ВременнаяТаблицаРешений
		|ИЗ
		|	РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
		|		ЛЕВОЕ СОЕДИНЕНИЕ УчетЗатрат КАК УчетЗатрат
		|			ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРешений КАК ТаблицаРешений
		|			ПО УчетЗатрат.НомерУзла = ТаблицаРешений.НомерУзла
		|		ПО УзлыКорректировкиСтоимостиСписания.Организация = УчетЗатрат.Организация
		|			И УзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница = УчетЗатрат.СтруктурнаяЕдиница
		//+++ Дмгг
		//|			И УзлыКорректировкиСтоимостиСписания.СчетУчета = УчетЗатрат.СчетУчета
		|			И (ВЫБОР
		|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
		|					ТОГДА УзлыКорректировкиСтоимостиСписания.СчетУчетаРегл = УчетЗатрат.СчетУчетаРегл
		|				ИНАЧЕ УзлыКорректировкиСтоимостиСписания.СчетУчета = УчетЗатрат.СчетУчета
		|			КОНЕЦ)
		//--- Дмгг
		|			И УзлыКорректировкиСтоимостиСписания.Номенклатура = УчетЗатрат.Номенклатура
		|			И УзлыКорректировкиСтоимостиСписания.Характеристика = УчетЗатрат.Характеристика
		|			И УзлыКорректировкиСтоимостиСписания.Партия = УчетЗатрат.Партия
		//Малышев 2024-06-19 ONESOFT-3227  (--
		|			И (&СебестоимостьЗапасовПоПроектам=ЛОЖЬ   
		|				ИЛИ УчетЗатрат.Проект = 
		|					ВЫБОР 
		|						КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
		|						КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
		|						КОГДА УзлыКорректировкиСтоимостиСписания.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
		|							ТОГДА УзлыКорректировкиСтоимостиСписания.Проект
		|						ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
		|					КОНЕЦ 
		|				)   
		//Малышев 2024-06-19 ONESOFT-3227  --)
		|			И УзлыКорректировкиСтоимостиСписания.ЗаказПокупателя = УчетЗатрат.ЗаказПокупателя
		// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
		|			И УзлыКорректировкиСтоимостиСписания.ДокументПоступления = УчетЗатрат.ДокументПоступления
		// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
		|ГДЕ
		|	УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	УзлыКорректировкиСтоимостиСписания.НомерУзла
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерУзла
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА((ЕСТЬNULL(ТаблицаРешений.Сумма, 0) - (УзлыКорректировкиСтоимостиСписания.Сумма + (ВЫРАЗИТЬ(ЕСТЬNULL(ВременнаяТаблицаРешений.Сумма, 0) КАК ЧИСЛО(23, 10))))) * (ЕСТЬNULL(ТаблицаРешений.Сумма, 0) - (УзлыКорректировкиСтоимостиСписания.Сумма + (ВЫРАЗИТЬ(ЕСТЬNULL(ВременнаяТаблицаРешений.Сумма, 0) КАК ЧИСЛО(23, 10)))))) КАК СуммаКвадратовОтклонений
		|ИЗ
		|	РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаРешений КАК ВременнаяТаблицаРешений
		|		ПО (ВременнаяТаблицаРешений.НомерУзла = УзлыКорректировкиСтоимостиСписания.НомерУзла)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРешений КАК ТаблицаРешений
		|		ПО (ТаблицаРешений.НомерУзла = УзлыКорректировкиСтоимостиСписания.НомерУзла)
		|ГДЕ
		|	УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор";
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		Результат = МассивРезультатов[1];
		
		СтароеОтклонение = ТекущееОтклонение;
		Если Результат.Пустой() Тогда
			ТекущееОтклонение = 0; // отклонений нет
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			// Определим текущее отклонение от решения.
			ТекущееОтклонение = ?(Выборка.СуммаКвадратовОтклонений = NULL, 0, Выборка.СуммаКвадратовОтклонений);
		КонецЕсли;
		
		Запрос.Текст =
		"УНИЧТОЖИТЬ ТаблицаРешений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УзлыКорректировкиСтоимостиСписания.НомерУзла КАК НомерУзла,
		|	УзлыКорректировкиСтоимостиСписания.Сумма + ЕСТЬNULL(ВременнаяТаблицаРешений.Сумма, 0) КАК Сумма
		|ПОМЕСТИТЬ ТаблицаРешений
		|ИЗ
		|	РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаРешений КАК ВременнаяТаблицаРешений
		|		ПО (ВременнаяТаблицаРешений.НомерУзла = УзлыКорректировкиСтоимостиСписания.НомерУзла)
		|ГДЕ
		|	УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерУзла
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаРешений";
		
		Запрос.ВыполнитьПакет();
		
	КонецЦикла;
	
	//+++ Мирошниченко Р.К. 19-08-2024
	Запрос.Текст = "УНИЧТОЖИТЬ ВТ_ВсеЗатратыПодробно";
	Запрос.Выполнить();
	//---
	
	Возврат Истина;
	
КонецФункции // РешитьСЛУ()

// Формирует движения по регистру учета затрат.
//
// Параметры:
//  НаборЗаписей - Набор записей регистра Запасы
//  НаборЗаписейУправленческий - Набор записей регистра бухгалтерии Управленческий
//  СтрокаДвижения - СтрокаТаблицыЗначений содержащая данные для движения
//                 по регистру
//  Сумма        - Число содержащее сумму движения
//  ФиксированнаяСтоимость - Булево - флаг фиксированной стоимости.
//
Процедура СформироватьДвиженияПоРегиструУчетаЗатрат(НаборЗаписей, НаборЗаписейУправленческий, НаборЗаписейХозрасчетный, СтрокаДвижения, Сумма, ФиксированнаяСтоимость, СодержаниеПроводки = Неопределено)
	
	Если СодержаниеПроводки = Неопределено Тогда
		Если СтрокаДвижения.СчетУчетаТипСчета = Перечисления.ТипыСчетов.Запасы Тогда
			СодержаниеПроводки = НСтр("ka='მარაგების ჩამოწერა საწყობიდან';ru='Списание запасов со склада';en='Write-off of inventories from the warehouse'");
		Иначе
			Если ЗначениеЗаполнено(СтрокаДвижения.Номенклатура) Тогда
				СодержаниеПроводки = НСтр("ka='ხარჯების ჩამოწერა';ru='Списание расходов';en='Write-off costs'");
			Иначе
				СодержаниеПроводки = НСтр("ka='საწარმოდან მარაგების ჩამოწერა';ru='Списание запасов из производства';en='The write-downs of production'");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Расход по регистру Учет запасов и затрат.
	НоваяСтрока = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДвижения);
	НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
	Если НоваяСтрока.Номенклатура.МетодОценки = Перечисления.МетодОценкиЗапасов.FIFO Тогда 
		НоваяСтрока.Период = ?(ЗначениеЗаполнено(НоваяСтрока.Период), НоваяСтрока.Период, Дата); // для возвратов период будет заполнен, это нужно для FIFO
	Иначе
		НоваяСтрока.Период = Дата; 
	КонецЕсли;
	НоваяСтрока.Регистратор = Ссылка;
	НоваяСтрока.ФиксированнаяСтоимость = ФиксированнаяСтоимость;
	НоваяСтрока.Количество = 0;
	НоваяСтрока.Сумма = Сумма;
	НоваяСтрока.СодержаниеПроводки = СодержаниеПроводки;
		
	Если (СтрокаДвижения.КоррСчетУчета = ДополнительныеСвойства.ДляПроведения.ПустойСчет И НЕ ИспользоватьТолькоРегламентированныйПланСчетов)
		ИЛИ (СтрокаДвижения.КоррСчетУчетаРегл = ДополнительныеСвойства.ДляПроведения.ПустойСчетРегл И ИспользоватьТолькоРегламентированныйПланСчетов) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаДвижения.КоррСчетУчетаТипСчета = Перечисления.ТипыСчетов.Запасы Тогда
		СодержаниеПроводки = НСтр("ka='საწყობში მარაგების შემოსავალში გატარება';ru='Оприходование запасов на склад';en='Posting inventory at the warehouse'");
	Иначе
		Если ЗначениеЗаполнено(СтрокаДвижения.Номенклатура) Тогда
			СодержаниеПроводки = НСтр("ka='ხარჯების შემოსვლა';ru='Поступление расходов';en='Admission costs'");
		Иначе
			СодержаниеПроводки = НСтр("ka='წარმოებაში მარაგების შემოსავალში აყვანა';ru='Оприходование запасов в производство';en='Posting inventory to production'");
		КонецЕсли;
	КонецЕсли;
	
	// Приход по регистру Учет запасов и затрат.
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
	НоваяСтрока.Период = Дата;
	НоваяСтрока.Регистратор = Ссылка;
	НоваяСтрока.Организация = СтрокаДвижения.Организация;
	//--------------------------------------------------------------------------
	// © Шишка В.В. [1 октября 2021 г.]  НАЧАЛО
	//УчетСебестоимостиВРазрезеОрганизации
	//НоваяСтрока.СтруктурнаяЕдиница = СтрокаДвижения.КоррСтруктурнаяЕдиница;
	НоваяСтрока.СтруктурнаяЕдиница = ?(СтрокаДвижения.КоррСтруктурнаяЕдиница = Неопределено ИЛИ (СтрокаДвижения.КоррСтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Склад")
									И СтрокаДвижения.УчетСебестоимостиВРазрезеОрганизации), Неопределено, СтрокаДвижения.КоррСтруктурнаяЕдиница);
	// © Шишка В.В. [1 октября 2021 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	НоваяСтрока.СчетУчета = СтрокаДвижения.КоррСчетУчета;
	НоваяСтрока.СчетУчетаРегл = СтрокаДвижения.КоррСчетУчетаРегл;
	НоваяСтрока.Номенклатура = СтрокаДвижения.КоррНоменклатура;
	НоваяСтрока.Характеристика = СтрокаДвижения.КоррХарактеристика;
	НоваяСтрока.Партия = СтрокаДвижения.КоррПартия;
	НоваяСтрока.Проект = СтрокаДвижения.КоррПроект;      //Малышев 2024-06-19   ONESOFT-3227
	НоваяСтрока.ЗаказПокупателя = СтрокаДвижения.КоррЗаказПокупателя;	
	НоваяСтрока.Спецификация = СтрокаДвижения.КоррСпецификация;
	НоваяСтрока.КоррСпецификация = СтрокаДвижения.Спецификация;
	НоваяСтрока.КоррСтруктурнаяЕдиница = СтрокаДвижения.СтруктурнаяЕдиница;
	НоваяСтрока.КоррСчетУчета = СтрокаДвижения.СчетУчета;
	НоваяСтрока.КоррСчетУчетаРегл = СтрокаДвижения.СчетУчетаРегл;
	НоваяСтрока.КоррНоменклатура = СтрокаДвижения.Номенклатура;
	НоваяСтрока.КоррХарактеристика = СтрокаДвижения.Характеристика;
	НоваяСтрока.КоррПартия = СтрокаДвижения.Партия;
	НоваяСтрока.КоррПроект = СтрокаДвижения.Проект;  //Малышев 2024-06-19   ONESOFT-3227
	НоваяСтрока.КоррЗаказПокупателя = СтрокаДвижения.ЗаказПокупателя;
	НоваяСтрока.ФиксированнаяСтоимость = ФиксированнаяСтоимость;
	НоваяСтрока.Сумма = Сумма;
	НоваяСтрока.СодержаниеПроводки = СодержаниеПроводки;
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	НоваяСтрока.ДокументПоступления = СтрокаДвижения.КоррДокументПоступления;
	НоваяСтрока.КоррДокументПоступления = СтрокаДвижения.ДокументПоступления;
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	
	// Движения по регистру Управленческий.
	НоваяСтрока = НаборЗаписейУправленческий.Добавить();
	НоваяСтрока.Период = Дата;
	НоваяСтрока.Регистратор = Ссылка;
	НоваяСтрока.Организация = СтрокаДвижения.Организация;
	НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
	НоваяСтрока.СчетДт = СтрокаДвижения.КоррСчетУчета;
	НоваяСтрока.СчетКт = СтрокаДвижения.СчетУчета;
	НоваяСтрока.Сумма = Сумма; 
	НоваяСтрока.Содержание = СодержаниеПроводки;
	
	// Движения по регистру Хозрасчетный.
	НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
	НоваяСтрока.Период = Дата;
	НоваяСтрока.Регистратор = Ссылка;
	НоваяСтрока.Организация = СтрокаДвижения.Организация;
	НоваяСтрока.СчетДт = СтрокаДвижения.КоррСчетУчетаРегл;
	НоваяСтрока.СчетКт = СтрокаДвижения.СчетУчетаРегл;
	НоваяСтрока.Содержание = СодержаниеПроводки;
	НоваяСтрока.Сумма = Сумма;                                                                           
	
	//+++ ДМГГ
	Если СодержаниеПроводки = НСтр("ka='წარმოებაში მარაგების შემოსავალში აყვანა';ru='Оприходование запасов в производство';en='Posting inventory to production'") 
		И СтрокаДвижения.Свойство("ДопСвойства") Тогда 
		
		// Дт
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", СтрокаДвижения.НоменклатураДт);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", СтрокаДвижения.ПодразделениеДт);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "ХарактеристикиНоменклатуры", СтрокаДвижения.ХарактеристикаДт);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", СтрокаДвижения.СтруктурнаяЕдиницаДт);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Проекты", СтрокаДвижения.Проект); //Малышев 2024-06-19   ONESOFT-3227
		
		
		// Кт
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", СтрокаДвижения.НоменклатураКт);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", СтрокаДвижения.ПодразделениеКт);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "ХарактеристикиНоменклатуры", СтрокаДвижения.ХарактеристикаКт);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", СтрокаДвижения.СтруктурнаяЕдиницаКт);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Проекты", СтрокаДвижения.Проект); //Малышев 2024-06-19   ONESOFT-3227
		
	Иначе
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ?(ЗначениеЗаполнено(СтрокаДвижения.КоррНоменклатура),СтрокаДвижения.КоррНоменклатура,СтрокаДвижения.Номенклатура));//Номенклатура);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ?(ЗначениеЗаполнено(СтрокаДвижения.Подразделение), СтрокаДвижения.Подразделение, 
																										//--------------------------------------------------------------------------
																										// © Шишка В.В. [21 октября 2021]  НАЧАЛО
																										//?(ТипЗнч(СтрокаДвижения.СтруктурнаяЕдиница) = Тип("СправочникСсылка.СтруктурныеЕдиницы")
																										//И СтрокаДвижения.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение, 
																										//	СтрокаДвижения.СтруктурнаяЕдиница,
																										//	?(СтрокаДвижения.КоррСтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение, 
																										//	СтрокаДвижения.КоррСтруктурнаяЕдиница, СтрокаДвижения.Подразделение))));
																										?(СтрокаДвижения.СтруктурнаяЕдиница <> Неопределено И ТипЗнч(СтрокаДвижения.СтруктурнаяЕдиница) = Тип("СправочникСсылка.СтруктурныеЕдиницы")
																										И СтрокаДвижения.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение, 
																											СтрокаДвижения.СтруктурнаяЕдиница,
																											?(СтрокаДвижения.КоррСтруктурнаяЕдиница <> Неопределено И СтрокаДвижения.КоррСтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение, 
																											СтрокаДвижения.КоррСтруктурнаяЕдиница, СтрокаДвижения.Подразделение))));
																											
																										// © Шишка В.В. [21 октября 2021]  КОНЕЦ
																										//--------------------------------------------------------------------------
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", СтрокаДвижения.КоррСтруктурнаяЕдиница);
	    БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Проекты", СтрокаДвижения.КоррПроект); //Малышев 2024-06-19   ONESOFT-3227
	
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", СтрокаДвижения.Номенклатура);//Номенклатура);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ?(ЗначениеЗаполнено(СтрокаДвижения.Подразделение), СтрокаДвижения.Подразделение, 
																										//--------------------------------------------------------------------------
																										// © Шишка В.В. [21 октября 2021]  НАЧАЛО
																										//?(ТипЗнч(СтрокаДвижения.СтруктурнаяЕдиница) = Тип("СправочникСсылка.СтруктурныеЕдиницы"),
																										//?(СтрокаДвижения.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение, 
																										//	СтрокаДвижения.СтруктурнаяЕдиница, СтрокаДвижения.Подразделение),
																										//	?(СтрокаДвижения.КоррСтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение, 
																										//	СтрокаДвижения.КоррСтруктурнаяЕдиница, СтрокаДвижения.Подразделение))));
																										?(СтрокаДвижения.СтруктурнаяЕдиница <> Неопределено И ТипЗнч(СтрокаДвижения.СтруктурнаяЕдиница) = Тип("СправочникСсылка.СтруктурныеЕдиницы"),
																										?(СтрокаДвижения.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение, 
																											СтрокаДвижения.СтруктурнаяЕдиница, СтрокаДвижения.Подразделение),
																											?(СтрокаДвижения.КоррСтруктурнаяЕдиница <> Неопределено И СтрокаДвижения.КоррСтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение, 
																											СтрокаДвижения.КоррСтруктурнаяЕдиница, СтрокаДвижения.Подразделение))));
																											
																										// © Шишка В.В. [21 октября 2021]  КОНЕЦ
																										//--------------------------------------------------------------------------
																										//?(ЗначениеЗаполнено(СтрокаДвижения.Подразделение), СтрокаДвижения.Подразделение, 
																										//?(СтрокаДвижения.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение, 
																										//	СтрокаДвижения.СтруктурнаяЕдиница, СтрокаДвижения.Подразделение)));
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", СтрокаДвижения.СтруктурнаяЕдиница);//КоррСтруктурнаяЕдиница);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Проекты", СтрокаДвижения.Проект); //Малышев 2024-06-19   ONESOFT-3227
	
	КонецЕсли;

КонецПроцедуры // СформироватьДвиженияПоРегиструУчетаЗатрат()

// Формирует корректирующие движения по регистру учета затрат.
//
// Параметры:
//  Нет.
//
Процедура СформироватьКорректирующиеДвиженияПоРегиструУчетаЗатрат()
	
	ДатаНач = ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода;
	ДатаКон = ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод;
	//--------------------------------------------------------------------------
	// © Шишка В.В. [1 октября 2021 г.]  НАЧАЛО
	УчетСебестоимостиВРазрезеОрганизации = ДополнительныеСвойства.УчетнаяПолитика.УчетСебестоимостиВРазрезеОрганизации;
	// © Шишка В.В. [1 октября 2021 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	
	Запрос = Новый Запрос();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	//--------------------------------------------------------------------------
	// © Шишка В.В. [14 июня 2023]  НАЧАЛО
	//|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	//|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	//|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция
	//|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	//|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|			ТОГДА ВЫРАЗИТЬ(УчетЗатрат.ДокументПродажи КАК Документ.СписаниеЗапасов).Корреспонденция
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|			ТОГДА ВЫРАЗИТЬ(УчетЗатрат.ДокументПродажи КАК Документ.ПересортицаЗапасов).Корреспонденция
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА ВЫРАЗИТЬ(УчетЗатрат.ДокументПродажи КАК Документ.ПеремещениеЗапасов).СчетЗатрат
	// © Шишка В.В. [14 июня 2023]  КОНЕЦ
	//--------------------------------------------------------------------------
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетУчетаСписания,
	|	ВЫБОР
	//--------------------------------------------------------------------------
	// © Шишка В.В. [14 июня 2023]  НАЧАЛО
	//|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	//|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	//|			ТОГДА УчетЗатрат.ДокументПродажи.КорреспонденцияРегл
	//|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	//|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатратРегл
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|			ТОГДА ВЫРАЗИТЬ(УчетЗатрат.ДокументПродажи КАК Документ.СписаниеЗапасов).КорреспонденцияРегл
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|			ТОГДА ВЫРАЗИТЬ(УчетЗатрат.ДокументПродажи КАК Документ.ПересортицаЗапасов).КорреспонденцияРегл
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА ВЫРАЗИТЬ(УчетЗатрат.ДокументПродажи КАК Документ.ПеремещениеЗапасов).СчетЗатратРегл
	// © Шишка В.В. [14 июня 2023]  КОНЕЦ
	//--------------------------------------------------------------------------
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетУчетаСписанияРегл,
	|	ВЫБОР
	|		КОГДА УчетЗатрат.ПеремещениеВРозницуСуммовойУчет
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПриходнаяНакладная)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК РозничнаяСтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	//+++ Дмгг
	//|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция.ТипСчета
	|			ТОГДА ВЫБОР 
	|				КОГДА &ЗакрыватьПоРеглПлануСчетов
	|					ТОГДА УчетЗатрат.ДокументПродажи.КорреспонденцияРегл.ТипСчета
	|				ИНАЧЕ УчетЗатрат.ДокументПродажи.Корреспонденция.ТипСчета
	|			КОНЕЦ	
	//--- Дмгг
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	//+++ Дмгг
	//|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат.ТипСчета
	|			ТОГДА ВЫБОР 
	|				КОГДА &ЗакрыватьПоРеглПлануСчетов
	|					ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатратРегл.ТипСчета
	|				ИНАЧЕ УчетЗатрат.ДокументПродажи.СчетЗатрат.ТипСчета
	|			КОНЕЦ
	//--- Дмгг
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетУчетаСписанияТипСчета,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.НаправлениеДеятельности
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК НаправлениеДеятельностиСписания,
	|	УчетЗатрат.Организация КАК Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|		ИНАЧЕ УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиницаПолучатель,
	|	УчетЗатрат.СчетУчета КАК СчетУчета,
	|	УчетЗатрат.СчетУчетаРегл КАК СчетУчетаРегл,
	|	УчетЗатрат.Номенклатура КАК Номенклатура,
	|	УчетЗатрат.Характеристика КАК Характеристика,
	|	УчетЗатрат.Партия КАК Партия,
	//Малышев 2024-07-22   ONESOFT-3227 
	|   ВЫБОР 
	|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|       КОГДА УчетЗатрат.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА УчетЗатрат.Проект
	|       ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ КАК Проект,   
	//Малышев 2024-07-22   ONESOFT-3227
	|	УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗатрат.Спецификация КАК Спецификация,
	|	УчетЗатрат.КоррСпецификация КАК КоррСпецификация,
	|	УчетЗатрат.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
	|	УчетЗатрат.КоррСчетУчета КАК КоррСчетУчета,
	|	УчетЗатрат.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл,
	|	УчетЗатрат.КоррНоменклатура КАК КоррНоменклатура,
	|	УчетЗатрат.КоррХарактеристика КАК КоррХарактеристика,
	|	УчетЗатрат.КоррПартия КАК КоррПартия,
	//Малышев 2024-07-22   ONESOFT-3227 
	|   ВЫБОР 
	|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|       КОГДА УчетЗатрат.КоррПроект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА УчетЗатрат.КоррПроект
	|       ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ как КоррПроект,   
	//Малышев 2024-07-22   ONESOFT-3227
	|	УчетЗатрат.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА УчетЗатрат.Количество
	|			ИНАЧЕ -УчетЗатрат.Количество
	|		КОНЕЦ) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА УчетЗатрат.Сумма
	|			ИНАЧЕ -УчетЗатрат.Сумма
	|		КОНЕЦ) КАК Сумма,
	|	УчетЗатрат.Номенклатура.КатегорияНоменклатуры КАК НоменклатураКатегорияНоменклатуры,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности КАК НаправлениеДеятельностиПродажи,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
	//+++ Дмгг
	//|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета,
	|	ВЫБОР 
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл.ТипСчета
	|		ИНАЧЕ УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета
	|	КОНЕЦ КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета,
	//--- Дмгг
	|	УчетЗатрат.ДокументПродажи КАК ДокументПродажи,
	|	УчетЗатрат.ЗаказПродажи КАК ЗаказПродажи,
	|	УчетЗатрат.Подразделение КАК Подразделение,
	|	УчетЗатрат.Ответственный КАК Ответственный,
	|	УчетЗатрат.СтавкаНДС КАК СтавкаНДС,
	|	УчетЗатрат.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
	|	УчетЗатрат.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,УчетЗатрат.ДокументПоступления КАК ДокументПоступления
	|	,УчетЗатрат.КоррДокументПоступления КАК КоррДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ПОМЕСТИТЬ УчетЗатратСписания
	|ИЗ
	|	РегистрНакопления.Запасы КАК УчетЗатрат
	|ГДЕ
	|	УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И (УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НЕ УчетЗатрат.Возврат
	|			ИЛИ УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И УчетЗатрат.Возврат)
	|	И УчетЗатрат.Организация = &Организация
	|	И НЕ УчетЗатрат.ФиксированнаяСтоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА УчетЗатрат.ПеремещениеВРозницуСуммовойУчет
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПриходнаяНакладная)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	//+++ ДМгг
	//|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция.ТипСчета
	|			ТОГДА ВЫБОР 
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА УчетЗатрат.ДокументПродажи.КорреспонденцияРегл.ТипСчета
	|					ИНАЧЕ УчетЗатрат.ДокументПродажи.Корреспонденция.ТипСчета
	|				КОНЕЦ
	//--- Дмгг
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	//+++ Дмгг
	//|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат.ТипСчета
	|			ТОГДА ВЫБОР 
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатратРегл.ТипСчета
	|					ИНАЧЕ УчетЗатрат.ДокументПродажи.СчетЗатрат.ТипСчета
	|				КОНЕЦ
	//--- Дмгг
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.НаправлениеДеятельности
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	УчетЗатрат.Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|		ИНАЧЕ УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|	КОНЕЦ,
	|	УчетЗатрат.СчетУчета,
	|	УчетЗатрат.СчетУчетаРегл,
	|	УчетЗатрат.Номенклатура,
	|	УчетЗатрат.Характеристика,
	|	УчетЗатрат.Партия,
	//Малышев 2024-07-22   ONESOFT-3227 
	|   ВЫБОР 
	|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|       КОГДА УчетЗатрат.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА УчетЗатрат.Проект
	|       ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ,   
	//Малышев 2024-07-22   ONESOFT-3227
	|	УчетЗатрат.ЗаказПокупателя,
	|	УчетЗатрат.Спецификация,
	|	УчетЗатрат.КоррСпецификация,
	|	УчетЗатрат.КоррСтруктурнаяЕдиница,
	|	УчетЗатрат.КоррСчетУчета,
	|	УчетЗатрат.КоррСчетУчетаРегл,
	|	УчетЗатрат.КоррНоменклатура,
	|	УчетЗатрат.КоррХарактеристика,
	|	УчетЗатрат.КоррПартия,
	//Малышев 2024-07-22   ONESOFT-3227 
	|   ВЫБОР 
	|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|       КОГДА УчетЗатрат.КоррПроект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА УчетЗатрат.КоррПроект
	|       ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ,   
	//Малышев 2024-07-22   ONESOFT-3227
	|	УчетЗатрат.КоррЗаказПокупателя,
	|	УчетЗатрат.Номенклатура.КатегорияНоменклатуры,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл,
	//+++ Дмгг
	//|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета,
	|	ВЫБОР 
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл.ТипСчета
	|		ИНАЧЕ УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета
	|	КОНЕЦ,
	//--- Дмгг
	|	УчетЗатрат.ДокументПродажи,
	|	УчетЗатрат.ЗаказПродажи,
	|	УчетЗатрат.Подразделение,
	|	УчетЗатрат.Ответственный,
	|	УчетЗатрат.СтавкаНДС,
	|	УчетЗатрат.ЗатратыНаВыпуск,
	|	УчетЗатрат.ПеремещениеВРозницуСуммовойУчет,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ОтчетПереработчика)
	|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ОтчетПереработчика)
	|			ТОГДА УчетЗатрат.ДокументПродажи.КорреспонденцияРегл
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатратРегл
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,УчетЗатрат.ДокументПоступления
	|	,УчетЗатрат.КоррДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	СчетУчетаРегл,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	Проект,    //Малышев 2024-06-19   ONESOFT-3227
	|	ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УзлыКорректировкиСтоимостиСписания.Организация КАК Организация,
	|	УзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатрат.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
	|	УзлыКорректировкиСтоимостиСписания.СчетУчета КАК СчетУчета,
	//+++ Дмгг
	|	УзлыКорректировкиСтоимостиСписания.СчетУчетаРегл КАК СчетУчетаРегл,
	//|	УзлыКорректировкиСтоимостиСписания.СчетУчета.ТипСчета КАК СчетУчетаТипСчета,
	|	ВЫБОР 
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УзлыКорректировкиСтоимостиСписания.СчетУчетаРегл.ТипСчета
	|		ИНАЧЕ УзлыКорректировкиСтоимостиСписания.СчетУчета.ТипСчета
	|	КОНЕЦ КАК СчетУчетаТипСчета,
	//--- Дмгг
	|	УзлыКорректировкиСтоимостиСписания.Номенклатура КАК Номенклатура,
	|	УзлыКорректировкиСтоимостиСписания.Характеристика КАК Характеристика,
	|	УзлыКорректировкиСтоимостиСписания.Партия КАК Партия,
	|	УзлыКорректировкиСтоимостиСписания.Проект КАК Проект,  //Малышев 2024-06-19   ONESOFT-3227
	|	УзлыКорректировкиСтоимостиСписания.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла КАК НомерУзла,
	|	УчетЗатрат.Спецификация КАК Спецификация,
	|	УчетЗатрат.КоррСпецификация КАК КоррСпецификация,
	|	УчетЗатрат.СчетУчетаСписания КАК СчетУчетаСписания,
	|	УчетЗатрат.СчетУчетаСписанияРегл КАК СчетУчетаСписанияРегл,
	|	УчетЗатрат.СчетУчетаСписанияТипСчета КАК СчетУчетаСписанияТипСчета,
	|	УчетЗатрат.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
	|	УчетЗатрат.КоррСчетУчета КАК КоррСчетУчета,
	|	УчетЗатрат.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл,
	//+++ Дмгг
	//|	УчетЗатрат.КоррСчетУчета.ТипСчета КАК КоррСчетУчетаТипСчета,
	|	ВЫБОР 
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗатрат.КоррСчетУчетаРегл.ТипСчета
	|		ИНАЧЕ УчетЗатрат.КоррСчетУчета.ТипСчета
	|	КОНЕЦ КАК КоррСчетУчетаТипСчета,
	//--- Дмгг
	|	УчетЗатрат.КоррНоменклатура КАК КоррНоменклатура,
	|	УчетЗатрат.КоррХарактеристика КАК КоррХарактеристика,
	|	УчетЗатрат.КоррПартия КАК КоррПартия,
	
	//Малышев 2024-07-22   ONESOFT-3227
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА УчетЗатрат.КоррПроект  <> Значение(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА УчетЗатрат.КоррПроект                                          
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	 КОНЕЦ КАК КоррПроект,  
	//Малышев 2024-07-22   ONESOFT-3227
	
	|	УчетЗатрат.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УчетЗатрат.Количество, 0) = 0
	|			ТОГДА ЕСТЬNULL(УчетЗатрат.Сумма, 0)
	|		ИНАЧЕ ЕСТЬNULL(УчетЗатрат.Количество, 0)
	|	КОНЕЦ КАК Количество,
	|	ЕСТЬNULL(УчетЗатрат.Сумма, 0) КАК Сумма,
	|	ЕСТЬNULL(ТаблицаРешений.Сумма, 0) КАК Цена,
	|	УчетЗатрат.НоменклатураКатегорияНоменклатуры КАК НоменклатураКатегорияНоменклатуры,
	|	УчетЗатрат.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельностиПродажи,
	|	УчетЗатрат.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
	//+++ Дмгг
	|	УчетЗатрат.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
	|	УчетЗатрат.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета,
	//|	ВЫБОР
	//|		КОГДА УчетнаяПолитикаРеглСрезПоследних.СчетУчетаСебестоимостиВозврат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	//|			ТОГДА УчетЗатрат.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл
	//|		ИНАЧЕ УчетнаяПолитикаРеглСрезПоследних.СчетУчетаСебестоимостиВозврат
	//|	КОНЕЦ КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
	//|	ВЫБОР
	//|		КОГДА УчетнаяПолитикаРеглСрезПоследних.СчетУчетаСебестоимостиВозврат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	//|			ТОГДА УчетЗатрат.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета
	//|		ИНАЧЕ УчетнаяПолитикаРеглСрезПоследних.СчетУчетаСебестоимостиВозврат.ТипСчета
	//|	КОНЕЦ КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета,
	|	УчетЗатрат.ДокументПродажи КАК ДокументПродажи,
	|	УчетЗатрат.ЗаказПродажи КАК ЗаказПродажи,
	|	УчетЗатрат.Подразделение КАК Подразделение,
	|	УчетЗатрат.Ответственный КАК Ответственный,
	|	УчетЗатрат.СтавкаНДС КАК СтавкаНДС,
	|	УчетЗатрат.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
	|	УчетЗатрат.НаправлениеДеятельностиСписания КАК НаправлениеДеятельностиСписания,
	|	УчетЗатрат.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
	|	УчетЗатрат.РозничнаяСтруктурнаяЕдиница КАК РозничнаяСтруктурнаяЕдиница,
	|	УзлыКорректировкиСтоимостиСписания.СчетУчетаРегл
	//--------------------------------------------------------------------------
	// © Шишка В.В. [1 октября 2021 г.]  НАЧАЛО
	|	, &УчетСебестоимостиВРазрезеОрганизации КАК УчетСебестоимостиВРазрезеОрганизации
	// © Шишка В.В. [1 октября 2021 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,УчетЗатрат.ДокументПоступления КАК ДокументПоступления
	|	,УчетЗатрат.КоррДокументПоступления КАК КоррДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ИЗ
	|	РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетЗатратСписания КАК УчетЗатрат
	|		ПО УзлыКорректировкиСтоимостиСписания.Организация = УчетЗатрат.Организация
	|			И УзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница = УчетЗатрат.СтруктурнаяЕдиница
	//+++ Дмгг
	//|			И УзлыКорректировкиСтоимостиСписания.СчетУчета = УчетЗатрат.СчетУчета
	|			И ВЫБОР 
	|				КОГДА &ЗакрыватьПоРеглПлануСчетов
	|					ТОГДА УзлыКорректировкиСтоимостиСписания.СчетУчетаРегл = УчетЗатрат.СчетУчетаРегл
	|				ИНАЧЕ УзлыКорректировкиСтоимостиСписания.СчетУчета = УчетЗатрат.СчетУчета
	|			КОНЕЦ
	//--- Дмгг 
	|			И УзлыКорректировкиСтоимостиСписания.Номенклатура = УчетЗатрат.Номенклатура
	|			И УзлыКорректировкиСтоимостиСписания.Характеристика = УчетЗатрат.Характеристика
	|			И УзлыКорректировкиСтоимостиСписания.Партия = УчетЗатрат.Партия
	|			И УзлыКорректировкиСтоимостиСписания.Проект = УчетЗатрат.Проект     //Малышев 2024-06-19   ONESOFT-3227
	|			И УзлыКорректировкиСтоимостиСписания.ЗаказПокупателя = УчетЗатрат.ЗаказПокупателя
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|			И УзлыКорректировкиСтоимостиСписания.ДокументПоступления = УчетЗатрат.ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРешений КАК ТаблицаРешений
	|		ПО (ТаблицаРешений.НомерУзла = УзлыКорректировкиСтоимостиСписания.НомерУзла)
	//|	РегистрСведений.УчетнаяПолитикаРегл.СрезПоследних(&ДатаКон, Организация = &Организация) КАК УчетнаяПолитикаРеглСрезПоследних
	|ГДЕ
	|	УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерУзла УБЫВ";
	
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ЗакрыватьПоРеглПлануСчетов", ДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	Запрос.УстановитьПараметр("УчетПоПроектам", ДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	Запрос.УстановитьПараметр("СебестоимостьЗапасовПоПроектам", ПолучитьПризнак_СебестоимостьЗапасовПоПроектам(ДополнительныеСвойства));
	//--------------------------------------------------------------------------
	// © Шишка В.В. [1 октября 2021 г.]  НАЧАЛО
	Запрос.УстановитьПараметр("УчетСебестоимостиВРазрезеОрганизации", УчетСебестоимостиВРазрезеОрганизации);
	// © Шишка В.В. [1 октября 2021 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	
	Результат = Запрос.ВыполнитьПакет();
	
	Если Результат[1].Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Создадим набор записей регистра накопления Учет запасов и затрат.
	НаборЗаписейЗапасы = РегистрыНакопления.Запасы.СоздатьНаборЗаписей();
	НаборЗаписейЗапасы.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Продажи.
	НаборЗаписейПродажи = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
	НаборЗаписейПродажи.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления УчетДоходовИРасходов.
	НаборЗаписейДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей();
	НаборЗаписейДоходыИРасходы.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления СуммовойУчетВРознице.
	НаборЗаписейСуммовойУчетВРознице = РегистрыНакопления.СуммовойУчетВРознице.СоздатьНаборЗаписей();
	НаборЗаписейСуммовойУчетВРознице.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Управленческий.
	НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
	НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Хозрасчетный.
	НаборЗаписейХозрасчетный = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборЗаписейХозрасчетный.Отбор.Регистратор.Установить(Ссылка);
	
	ВыборкаДетальныеЗаписи = Результат[1].Выбрать();
	
	СтруктураПараметровРегл = РегламентированныйУчетСервер.ПолучитьСтруктуруСчетовУчета(ДополнительныеСвойства.ДляПроведения.Организация, ДополнительныеСвойства.ДляПроведения.Дата);
	Если СтруктураПараметровРегл.Выбран() Тогда
		СчетПрочиеДоходыРегл = СтруктураПараметровРегл.СчетПрочихДоходов;
		СчетПрочиеРасходыРегл = СтруктураПараметровРегл.СчетПрочихРасходов;
	Иначе
		СчетПрочиеДоходыРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		СчетПрочиеРасходыРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	КонецЕсли;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		// Сделаем проверку, на случай, если есть не закрытые кассовые смены.
		Если ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ЧекККМ")
			ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
			Продолжить;
		КонецЕсли;
		
		// Посчитаем суммы перемещения и корректировки.
		СуммаПеремещения = ВыборкаДетальныеЗаписи.Цена * ВыборкаДетальныеЗаписи.Количество;
		СуммаКорректировки = СуммаПеремещения - ВыборкаДетальныеЗаписи.Сумма;
		
		//Если Окр(СуммаКорректировки, 2) <> 0 Тогда
		// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
		Если (СуммаКорректировки <= -0.01) ИЛИ (СуммаКорректировки >= 0.01) Тогда
		// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
			
			// Движения по регистру Учет запасов и затрат.
			СформироватьДвиженияПоРегиструУчетаЗатрат(
				НаборЗаписейЗапасы,
				НаборЗаписейУправленческий,
				НаборЗаписейХозрасчетный,
				ВыборкаДетальныеЗаписи,
				СуммаКорректировки,
				Ложь
			);
			
			Если ВыборкаДетальныеЗаписи.КоррСчетУчета = ДополнительныеСвойства.ДляПроведения.ПустойСчет
				ИЛИ ВыборкаДетальныеЗаписи.КоррСчетУчетаРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка() Тогда
				
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДокументПродажи)
				   И ((ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.РасходнаяНакладная")
					 И ВыборкаДетальныеЗаписи.ДокументПродажи.ВидОперации <> Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.АктВыполненныхРабот")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ОтчетКомиссионера")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ЗаказПокупателя")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ОтчетОПереработке")) Тогда
					
					// Движения по регистру Продажи.
					НоваяСтрока = НаборЗаписейПродажи.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПродажи;
					НоваяСтрока.Подразделение = ВыборкаДетальныеЗаписи.Подразделение;
					НоваяСтрока.Ответственный = ВыборкаДетальныеЗаписи.Ответственный;
					НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
					НоваяСтрока.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
					НоваяСтрока.Партия = ВыборкаДетальныеЗаписи.Партия;
					НоваяСтрока.Проект = ВыборкаДетальныеЗаписи.Проект;  //Малышев 2024-06-19   ONESOFT-3227
					НоваяСтрока.Документ = ВыборкаДетальныеЗаписи.ДокументПродажи;
					НоваяСтрока.СтавкаНДС = ВыборкаДетальныеЗаписи.СтавкаНДС;
					НоваяСтрока.Себестоимость = СуммаКорректировки;
					
					// Движения по регистру ДоходыИРасходы.
					НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.Подразделение;
					НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПродажи;
					НоваяСтрока.НаправлениеДеятельности = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажи;
					НоваяСтрока.СчетУчета = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж;
					НоваяСтрока.СчетУчетаРегл = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл;
					НоваяСтрока.Проект = ВыборкаДетальныеЗаписи.Проект;       //Малышев 2024-06-19   ONESOFT-3227
					НоваяСтрока.СуммаРасходов = СуммаКорректировки;
					НоваяСтрока.СодержаниеПроводки = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					НоваяСтрока.Содержание = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					// Движения по регистру Хозрасчетный.
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
					НоваяСтрока.Содержание = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
					НоваяСтрока.Сумма = СуммаКорректировки;
										
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Проекты", ВыборкаДетальныеЗаписи.Проект); //Малышев 2024-06-19   ONESOFT-3227
					                             
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
                    БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Проекты", ВыборкаДетальныеЗаписи.Проект); //Малышев 2024-06-19   ONESOFT-3227
					
					
				ИначеЕсли ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДокументПродажи)
						И ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.РасходнаяНакладная")
						И ВыборкаДетальныеЗаписи.ДокументПродажи.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику Тогда
						
					// Движения по регистру Доходы и расходы.
					НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
					НоваяСтрока.Период = ДополнительныеСвойства.ДляПроведения.Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = Неопределено;
					НоваяСтрока.ЗаказПокупателя = Неопределено;
					НоваяСтрока.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
					
					Если СуммаКорректировки < 0 Тогда
						НоваяСтрока.СчетУчета = ПланыСчетов.Управленческий.ПрочиеРасходы;
						НоваяСтрока.СчетУчетаРегл = СчетПрочиеРасходыРегл;
						НоваяСтрока.СуммаРасходов = СуммаКорректировки;
						НоваяСтрока.СодержаниеПроводки = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					Иначе
						НоваяСтрока.СчетУчета = ПланыСчетов.Управленческий.ПрочиеДоходы;
						НоваяСтрока.СчетУчетаРегл = СчетПрочиеДоходыРегл;
						НоваяСтрока.СуммаДоходов = СуммаКорректировки;
						НоваяСтрока.СодержаниеПроводки = НСтр("ka='სხვა შემოსავლები';ru='Прочие доходы';en='Other income'");
					Конецесли;
					НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Номенклатура;
					НоваяСтрока.Проект = ВыборкаДетальныеЗаписи.Проект;   //Малышев 2024-06-19   ONESOFT-3227
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					
					Если СуммаКорректировки < 0 Тогда
						НоваяСтрока.СчетДт = ПланыСчетов.Управленческий.ПрочиеРасходы;
						НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
						НоваяСтрока.Сумма = - СуммаКорректировки;
						НоваяСтрока.Содержание = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					Иначе
						НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчета;
						НоваяСтрока.СчетКт = ПланыСчетов.Управленческий.ПрочиеДоходы;
						НоваяСтрока.Сумма = СуммаКорректировки;
						НоваяСтрока.Содержание = НСтр("ka='სხვა შემოსავლები';ru='Прочие доходы';en='Other income'");
					КонецЕсли;
					
					// Движения по регистру Хозрасчетный.
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
										
					Если СуммаКорректировки < 0 Тогда
						НоваяСтрока.СчетДт = СчетПрочиеРасходыРегл;
						НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
						НоваяСтрока.Сумма = - СуммаКорректировки;
						НоваяСтрока.Содержание = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					Иначе
						НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
						НоваяСтрока.СчетКт = СчетПрочиеДоходыРегл;
						НоваяСтрока.Сумма = СуммаКорректировки;
						НоваяСтрока.Содержание = НСтр("ka='სხვა შემოსავლები';ru='Прочие доходы';en='Other income'");
					КонецЕсли;
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Проекты", ВыборкаДетальныеЗаписи.Проект); //Малышев 2024-06-19   ONESOFT-3227
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Проекты", ВыборкаДетальныеЗаписи.Проект); //Малышев 2024-06-19   ONESOFT-3227
					
				ИначеЕсли ВыборкаДетальныеЗаписи.ПеремещениеВРозницуСуммовойУчет Тогда
					
					// Движения по регистру СуммовойУчетВРознице.
					НоваяСтрока = НаборЗаписейСуммовойУчетВРознице.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница;
					НоваяСтрока.Валюта = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница.РозничныйВидЦен.ВалютаЦены;
					НоваяСтрока.СодержаниеПроводки = НСтр("ka='საცალო ვაჭრობაში გადაადგილება';ru='Перемещение в розницу';en='Moving into retail'");
					НоваяСтрока.Себестоимость = СуммаКорректировки;
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница.СчетУчетаВРознице;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					НоваяСтрока.Содержание = НСтр("ka='საცალო ვაჭრობაში გადაადგილება';ru='Перемещение в розницу';en='Moving into retail'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					// Движения по регистру Хозрасчетный.
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница.СчетУчетаВРозницеРегл;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
					НоваяСтрока.Содержание = НСтр("ka='საცალო ვაჭრობაში გადაადგილება';ru='Перемещение в розницу';en='Moving into retail'");
					НоваяСтрока.Сумма = СуммаКорректировки;
										
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Проекты", ВыборкаДетальныеЗаписи.Проект); //Малышев 2024-06-19   ONESOFT-3227
						
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Проекты", ВыборкаДетальныеЗаписи.Проект); //Малышев 2024-06-19   ONESOFT-3227
						
				ИначеЕсли ВыборкаДетальныеЗаписи.СчетУчетаСписанияТипСчета = Перечисления.ТипыСчетов.ПрочиеРасходы
					  ИЛИ ВыборкаДетальныеЗаписи.СчетУчетаСписанияТипСчета = Перечисления.ТипыСчетов.Расходы
					  ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяРасходным(ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл) Тогда
					
					// Движения по регистру Доходы и расходы.
					НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
					НоваяСтрока.Период = ДополнительныеСвойства.ДляПроведения.Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.СтруктурнаяЕдиницаПолучатель;
					
					Если ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ПеремещениеЗапасов")
					   И ВыборкаДетальныеЗаписи.СчетУчетаСписанияТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
						НоваяСтрока.НаправлениеДеятельности = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиСписания;
						НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПокупателя;
					Иначе
						НоваяСтрока.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
					КонецЕсли;
					
					НоваяСтрока.СчетУчета = ВыборкаДетальныеЗаписи.СчетУчетаСписания;
					НоваяСтрока.СчетУчетаРегл = ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл;
					НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Номенклатура;
					НоваяСтрока.Проект = ВыборкаДетальныеЗаписи.Проект;   //Малышев 2024-06-19   ONESOFT-3227
					НоваяСтрока.СуммаРасходов = СуммаКорректировки;
					НоваяСтрока.СодержаниеПроводки = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаСписания;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					НоваяСтрока.Содержание = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					// Движения по регистру Хозрасчетный.
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
					НоваяСтрока.Содержание = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					НоваяСтрока.Сумма = СуммаКорректировки;
										
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Подразделение),ВыборкаДетальныеЗаписи.Подразделение,ВыборкаДетальныеЗаписи.СтруктурнаяЕдиницаПолучатель));
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Проекты", ВыборкаДетальныеЗаписи.Проект); //Малышев 2024-06-19   ONESOFT-3227
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Подразделение),ВыборкаДетальныеЗаписи.Подразделение,ВыборкаДетальныеЗаписи.СтруктурнаяЕдиницаПолучатель));//ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Проекты", ВыборкаДетальныеЗаписи.Проект); //Малышев 2024-06-19   ONESOFT-3227
					
				Иначе
					
					//+++ Дмгг
					//// Движения по регистру Управленческий.
					//НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					//НоваяСтрока.Период = Дата;
					//НоваяСтрока.Регистратор = Ссылка;
					//НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					//НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					//НоваяСтрока.СчетДт = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СчетУчетаСписания),ВыборкаДетальныеЗаписи.СчетУчетаСписания,ВыборкаДетальныеЗаписи.СчетУчета);
					//НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					//НоваяСтрока.Содержание = НСтр("ka='მარაგების ჩამოწერა თავისუფალ ანგარიშზე';ru='Списание запасов на произвольный счет';en='The write-downs on an arbitrary score'");
					//НоваяСтрока.Сумма = СуммаКорректировки;
					//
					//// Движения по регистру Хозрасчетный.
					//НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					//НоваяСтрока.Период = Дата;
					//НоваяСтрока.Регистратор = Ссылка;
					//НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					//НоваяСтрока.СчетДт = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл),ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл,ВыборкаДетальныеЗаписи.СчетУчетаРегл);;
					//НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
					//НоваяСтрока.Содержание = НСтр("ka='მარაგების ჩამოწერა თავისუფალ ანგარიშზე';ru='Списание запасов на произвольный счет';en='The write-downs on an arbitrary score'");
					//НоваяСтрока.Сумма = СуммаКорректировки;
					//
					//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					//
					//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					//--- Дмгг
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Пишем оставшиеся записи Учет запасов и затрат.
	НаборЗаписейЗапасы.Записать(Ложь);
	
	// Пишем оставшиеся записи Продажи.
	НаборЗаписейПродажи.Записать(Ложь);
	
	// Пишем оставшиеся записи Учет доходов и расходов.
	НаборЗаписейДоходыИРасходы.Записать(Ложь);
	
	// Пишем оставшиеся записи Суммовой учет в рознице.
	НаборЗаписейСуммовойУчетВРознице.Записать(Ложь);
	
	// Пишем оставшиеся записи Управленческий.
	Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()) Тогда  //+++ Дмгг
		НаборЗаписейУправленческий.Записать(Ложь);
	КонецЕсли;  //--- Дмгг
	
	// Пишем оставшиеся записи Хозрасчетный.
	НаборЗаписейХозрасчетный.Записать(Ложь);
	
КонецПроцедуры // СформироватьКорректирующиеДвиженияПоРегиструУчетаЗатрат()

// Процедура распределения зависших сумм без количества (ошибки округления при решении СЛУ).
//
//
Процедура РаспределитьСуммыБезКоличества(ВидОперации, ТаблицаОшибок)
	
	СписокОбработанныхУзлов = Новый Массив();
	СписокОбработанныхУзлов.Добавить("");
	//--------------------------------------------------------------------------
	// © Шишка В.В. [1 октября 2021 г.]  НАЧАЛО
	УчетСебестоимостиВРазрезеОрганизации = ДополнительныеСвойства.УчетнаяПолитика.УчетСебестоимостиВРазрезеОрганизации;
	// © Шишка В.В. [1 октября 2021 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	ДатаНач = ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода;
	ДатаКон = ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ЗакрыватьПоРеглПлануСчетов", ИспользоватьТолькоРегламентированныйПланСчетов);
	
	// Готовится таблица перемещений.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетЗатрат.Организация КАК Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатрат.СчетУчета КАК СчетУчета,
	//+++ Дмгг
	//|	УчетЗатрат.СчетУчета.ТипСчета КАК СчетУчетаТипСчета,
	|	ВЫБОР
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗатрат.СчетУчетаРегл.ТипСчета
	|		ИНАЧЕ УчетЗатрат.СчетУчета.ТипСчета
	|	КОНЕЦ КАК СчетУчетаТипСчета,
	//--- Дмгг	
	|	УчетЗатрат.Номенклатура КАК Номенклатура,
	|	УчетЗатрат.Характеристика КАК Характеристика,
	|	УчетЗатрат.Партия КАК Партия,  
	
	//Малышев 2024-07-22   ONESOFT-3227 (--
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА УчетЗатрат.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|          ТОГДА УчетЗатрат.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ КАК Проект,      
	//Малышев 2024-07-22   ONESOFT-3227  --)
	
	|	УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗатрат.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
	|	УчетЗатрат.КоррСчетУчета КАК КоррСчетУчета,
	//+++ Дмгг
	//|	УчетЗатрат.КоррСчетУчета.ТипСчета КАК КоррСчетУчетаТипСчета,
	|	ВЫБОР
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗатрат.КоррСчетУчетаРегл.ТипСчета
	|		ИНАЧЕ УчетЗатрат.КоррСчетУчета.ТипСчета
	|	КОНЕЦ КАК КоррСчетУчетаТипСчета,
	//--- Дмгг
	|	УчетЗатрат.КоррНоменклатура КАК КоррНоменклатура,
	|	УчетЗатрат.КоррХарактеристика КАК КоррХарактеристика,
	|	УчетЗатрат.КоррПартия КАК КоррПартия,
	//Малышев 2024-07-22   ONESOFT-3227  (--
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА УчетЗатрат.КоррПроект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|          ТОГДА УчетЗатрат.КоррПроект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ КАК КоррПроект,      
	//Малышев 2024-07-22   ONESOFT-3227  --)
	|	УчетЗатрат.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
	|	УчетЗатрат.ДокументПродажи КАК ДокументПродажи,
	|	УчетЗатрат.ЗаказПродажи КАК ЗаказПродажи,
	|	УчетЗатрат.Подразделение КАК Подразделение,
	|	УчетЗатрат.Ответственный КАК Ответственный,
	|	УчетЗатрат.СтавкаНДС КАК СтавкаНДС,
	|	УчетЗатрат.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетУчетаСписания,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.КорреспонденцияРегл
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатратРегл
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетУчетаСписанияРегл,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	//+++ Дмгг
	//|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция.ТипСчета
	|			ТОГДА ВЫБОР
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА УчетЗатрат.ДокументПродажи.КорреспонденцияРегл.ТипСчета
	|					ИНАЧЕ УчетЗатрат.ДокументПродажи.Корреспонденция.ТипСчета
	|			КОНЕЦ
	//--- Дмгг
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	//+++ Дмгг
	//|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат.ТипСчета
	|			ТОГДА ВЫБОР
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатратРегл.ТипСчета
	|					ИНАЧЕ УчетЗатрат.ДокументПродажи.СчетЗатрат.ТипСчета
	|			КОНЕЦ
	//--- Дмгг
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетУчетаСписанияТипСчета,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.НаправлениеДеятельности
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК НаправлениеДеятельностиСписания,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|		ИНАЧЕ УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиницаПолучатель,
	|	ВЫБОР
	|		КОГДА УчетЗатрат.ПеремещениеВРозницуСуммовойУчет
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПриходнаяНакладная)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК РозничнаяСтруктурнаяЕдиница,
	|	УчетЗатрат.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
	|	УчетЗатрат.Номенклатура.КатегорияНоменклатуры КАК НоменклатураКатегорияНоменклатуры,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности КАК НаправлениеДеятельностиПродажи,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
	//+++ Дмгг
	//|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета,
	|	ВЫБОР
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл.ТипСчета
	|		ИНАЧЕ УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета
	|	КОНЕЦ КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета,
	//--- Дмгг
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И НЕ УчетЗатрат.Возврат
	|					ИЛИ УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И УчетЗатрат.Возврат
	|				ТОГДА УчетЗатрат.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма,
	|	УчетЗатрат.СчетУчетаРегл,
	|	УчетЗатрат.КоррСчетУчетаРегл     
	//+++ Дмгг, 10.04.2025, ONESOFT-3970
	|	,УчетЗатрат.Спецификация
	|	,УчетЗатрат.КоррСпецификация 
	//--- Дмгг, 10.04.2025, ONESOFT-3970
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,УчетЗатрат.ДокументПоступления КАК ДокументПоступления
	|	,УчетЗатрат.КоррДокументПоступления КАК КоррДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ПОМЕСТИТЬ УчетЗатратДвиженияРасход 
	|ИЗ
	|	РегистрНакопления.Запасы КАК УчетЗатрат
	|ГДЕ
	|	УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И УчетЗатрат.Организация = &Организация
	|	И НЕ УчетЗатрат.ФиксированнаяСтоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетЗатрат.Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница,
	|	УчетЗатрат.СчетУчета,
	|	УчетЗатрат.Номенклатура,
	|	УчетЗатрат.Характеристика,
	|	УчетЗатрат.Партия,
	//Малышев 2024-07-22   ONESOFT-3227 (--
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА УчетЗатрат.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|          ТОГДА УчетЗатрат.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ,      
	//Малышев 2024-07-22   ONESOFT-3227 --)
	|	УчетЗатрат.ЗаказПокупателя,
	|	УчетЗатрат.КоррСтруктурнаяЕдиница,
	|	УчетЗатрат.КоррСчетУчета,
	|	УчетЗатрат.КоррНоменклатура,
	|	УчетЗатрат.КоррХарактеристика,
	|	УчетЗатрат.КоррПартия,
	//Малышев 2024-07-22   ONESOFT-3227 (--
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА УчетЗатрат.КоррПроект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|          ТОГДА УчетЗатрат.КоррПроект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ,      
	//Малышев 2024-07-22   ONESOFT-3227 --)
	|	УчетЗатрат.КоррЗаказПокупателя,
	|	УчетЗатрат.ДокументПродажи,
	|	УчетЗатрат.ЗаказПродажи,
	|	УчетЗатрат.Подразделение,
	|	УчетЗатрат.Ответственный,
	|	УчетЗатрат.СтавкаНДС,
	|	УчетЗатрат.ЗатратыНаВыпуск,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.КорреспонденцияРегл
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатратРегл
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	//+++ Дмгг
	//|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция.ТипСчета
	|			ТОГДА ВЫБОР
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА УчетЗатрат.ДокументПродажи.КорреспонденцияРегл.ТипСчета
	|					ИНАЧЕ УчетЗатрат.ДокументПродажи.Корреспонденция.ТипСчета
	|				КОНЕЦ
	//--- Дмгг
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	//+++ Дмгг
	//|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат.ТипСчета
	|			ТОГДА ВЫБОР
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатратРегл.ТипСчета
	|					ИНАЧЕ УчетЗатрат.ДокументПродажи.СчетЗатрат.ТипСчета
	|				КОНЕЦ
	//--- Дмгг
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.НаправлениеДеятельности
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|		ИНАЧЕ УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА УчетЗатрат.ПеремещениеВРозницуСуммовойУчет
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПриходнаяНакладная)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	УчетЗатрат.ПеремещениеВРозницуСуммовойУчет,
	|	УчетЗатрат.Номенклатура.КатегорияНоменклатуры,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл,
	//+++
	//|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета,
	//|	УчетЗатрат.СчетУчета.ТипСчета,
	//|	УчетЗатрат.КоррСчетУчета.ТипСчета,
	|	ВЫБОР
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл.ТипСчета
	|		ИНАЧЕ УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗатрат.СчетУчетаРегл.ТипСчета
	|		ИНАЧЕ УчетЗатрат.СчетУчета.ТипСчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗатрат.КоррСчетУчетаРегл.ТипСчета
	|		ИНАЧЕ УчетЗатрат.КоррСчетУчета.ТипСчета
	|	КОНЕЦ,
	//--- Дмгг
	|	УчетЗатрат.СчетУчетаРегл,
	|	УчетЗатрат.КоррСчетУчетаРегл
	//+++ Дмгг, 10.04.2025, ONESOFT-3970
	|	,УчетЗатрат.Спецификация
	|	,УчетЗатрат.КоррСпецификация 
	//--- Дмгг, 10.04.2025, ONESOFT-3970
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,УчетЗатрат.ДокументПоступления
	|	,УчетЗатрат.КоррДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	Проект,  //
	|	ЗаказПокупателя,
	|	КоррСтруктурнаяЕдиница,
	|	КоррСчетУчета,
	|	КоррНоменклатура,
	|	КоррХарактеристика,
	|	КоррПартия,
	|	КоррПроект, //
	|	КоррЗаказПокупателя";
	
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("УчетПоПроектам", ДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//Малышев 2024-07-30 (-
	Запрос.УстановитьПараметр("СебестоимостьЗапасовПоПроектам", ПолучитьПризнак_СебестоимостьЗапасовПоПроектам(ДополнительныеСвойства));
	//Малышев 2024-07-30 -)
		
	Запрос.Выполнить();
	//--------------------------------------------------------------------------
	// © Шишка В.В. [1 октября 2021 г.]  НАЧАЛО
	Запрос.УстановитьПараметр("УчетСебестоимостиВРазрезеОрганизации", УчетСебестоимостиВРазрезеОрганизации);	
	// © Шишка В.В. [1 октября 2021 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	//+++ Мирошниченко Р.К. 19-08-2024
	Запрос.УстановитьПараметр("ГраницаДатаКон", Новый Граница(ДатаКон, ВидГраницы.Включая));

    Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
	//|	ЗапасыОстатки.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл, //Малышев 2024-08-27 ONESOFT-3441 - закоментировал
	//|	ЗапасыОстатки.Проект КАК Проект,
	//Малышев 2024-08-27   ONESOFT-3227 (--
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА ЗапасыОстатки.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|          ТОГДА ЗапасыОстатки.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ как Проект,      
	//Малышев 2024-08-27   ONESOFT-3227 --)
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,ЗапасыОстатки.ДокументПоступления КАК ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ПОМЕСТИТЬ УчетЗатратОстатки
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(&ГраницаДатаКон, Организация = &Организация) КАК ЗапасыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	ЗаказПокупателя,
	|	СчетУчетаРегл,
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА ЗапасыОстатки.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|          ТОГДА ЗапасыОстатки.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,ЗапасыОстатки.ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|
	//|ИМЕЮЩИЕ СУММА(ЗапасыОстатки.КоличествоОстаток) >0 или СУММА(ЗапасыОстатки.СуммаОстаток)>0
	// Kuzmich, 14.07.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ИМЕЮЩИЕ СУММА(ЗапасыОстатки.КоличествоОстаток) >0 или СУММА(ЗапасыОстатки.СуммаОстаток)<>0
	// Kuzmich, 14.07.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	ЗаказПокупателя,
	|	СчетУчетаРегл,
	//|	СчетУчетаЗатратРегл, //Малышев 2024-09-05 ONESOFT-3441 - закоментировал
	|	Проект
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|;
	|ВЫБРАТЬ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
	//|	ЗапасыОстатки.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,  //Малышев 2024-09-05 ONESOFT-3441 - закоментировал
	//|	ЗапасыОстатки.Проект КАК Проект,
	//Малышев 2024-08-27   ONESOFT-3227 (--
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА ЗапасыОстатки.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|          ТОГДА ЗапасыОстатки.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ как Проект,      
	//Малышев 2024-08-27   ONESOFT-3227 --)
	|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,ЗапасыОстатки.ДокументПоступления КАК ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ПОМЕСТИТЬ УчетЗатратОстаткиКор
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(&ГраницаДатаКон, ) КАК ЗапасыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	Проект,  //Малышев 2024-09-05 ONESOFT-3227
	|	ЗаказПокупателя,
	|	СчетУчетаРегл,
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА ЗапасыОстатки.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|          ТОГДА ЗапасыОстатки.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,ЗапасыОстатки.ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|
	//|ИМЕЮЩИЕ СУММА(ЗапасыОстатки.КоличествоОстаток) >0 или СУММА(ЗапасыОстатки.СуммаОстаток)>0
	// Kuzmich, 14.07.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ИМЕЮЩИЕ СУММА(ЗапасыОстатки.КоличествоОстаток) >0 или СУММА(ЗапасыОстатки.СуммаОстаток)<>0
	// Kuzmich, 14.07.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	Проект,  //Малышев 2024-09-05 ONESOFT-3227
	|	ЗаказПокупателя,
	|	СчетУчетаРегл,
	//|	СчетУчетаЗатратРегл, //Малышев 2024-09-05 ONESOFT-3441 - закоментировал
	|	Проект
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|;";
	
	//Запрос.Выполнить();
	
	//---

	
	// Определяются направления списания всех сумм меньше рубля, для узлов по которым
	// есть остатки по суммам и без количества.
	//Запрос.Текст = Запрос.Текст +  //Малышев 2025-10-18 ONESOFT-4439 ((- свертка итоговой таблицы
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""РаспределитьСуммыБезКоличества"" КАК Поле1,
	|	УчетЗатратОстатки.Организация КАК Организация,
	|	УчетЗатратОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатратОстатки.СчетУчета КАК СчетУчета,
	|	УчетЗатратОстатки.СчетУчета.ТипСчета КАК СчетУчетаТипСчета,
	|	УчетЗатратОстатки.Номенклатура КАК Номенклатура,
	|	УчетЗатратОстатки.Характеристика КАК Характеристика,
	|	УчетЗатратОстатки.Партия КАК Партия, 
	//Малышев 2024-07-22   ONESOFT-3227 (--
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА УчетЗатратОстатки.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|          ТОГДА УчетЗатратОстатки.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ как Проект,      
	//Малышев 2024-07-22   ONESOFT-3227 --)
	|	УчетЗатратОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА УчетЗатратОстатки.КоличествоОстаток = 0
	|				И ВложенныйЗапрос.Сумма <> 0
	|				И (УчетЗатратОстатки.СуммаОстаток МЕЖДУ -1 И 1
	//|					ИЛИ УчетЗатратОстатки.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	// Kuzmich, 11.07.06.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
	|					И УчетЗатратОстатки.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	// Kuzmich, 11.07.06.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
	|			ТОГДА УчетЗатратОстатки.СуммаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма,
	|	ВложенныйЗапрос.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,    
	//+++ Дмгг, 10.04.2025, ONESOFT-3970
	//|	НЕОПРЕДЕЛЕНО КАК Спецификация,
	//|	НЕОПРЕДЕЛЕНО КАК КоррСпецификация,
	|	ВложенныйЗапрос.Спецификация КАК Спецификация, 
	|	ВложенныйЗапрос.КоррСпецификация КАК КоррСпецификация,
	//--- Дмгг, 10.04.2025, ONESOFT-3970
	|	ВложенныйЗапрос.КоррСчетУчета КАК КоррСчетУчета,
	|	ВложенныйЗапрос.КоррСчетУчетаТипСчета КАК КоррСчетУчетаТипСчета,
	|	ВложенныйЗапрос.КоррНоменклатура КАК КоррНоменклатура,
	|	ВложенныйЗапрос.КоррХарактеристика КАК КоррХарактеристика,
	|	ВложенныйЗапрос.КоррПартия КАК КоррПартия,
	
	//Малышев 2024-07-22   ONESOFT-3227 (--
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = ЛОЖЬ ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА ВложенныйЗапрос.КоррПроект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|          ТОГДА ВложенныйЗапрос.КоррПроект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ как КоррПроект,      
	//Малышев 2024-07-22   ONESOFT-3227 --)
		
	|	ВложенныйЗапрос.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
	|	ВложенныйЗапрос.ДокументПродажи КАК ДокументПродажи,
	|	ВложенныйЗапрос.ЗаказПродажи КАК ЗаказПродажи,
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ВложенныйЗапрос.Ответственный КАК Ответственный,
	|	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
	|	ВложенныйЗапрос.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
	|	ВложенныйЗапрос.НоменклатураКатегорияНоменклатуры КАК НоменклатураКатегорияНоменклатуры,
	|	ВложенныйЗапрос.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельностиПродажи,
	|	ВложенныйЗапрос.НаправлениеДеятельностиСписания КАК НаправлениеДеятельностиСписания,
	|	ВложенныйЗапрос.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
	|	ВложенныйЗапрос.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета,
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла КАК НомерУзла,
	|	УзлыКорректировкиСтоимостиСписанияИсточник.НомерУзла КАК НомерУзлаИсточник,
	|	ВложенныйЗапрос.СчетУчетаСписания КАК СчетУчетаСписания,
	|	ВложенныйЗапрос.СчетУчетаСписанияРегл КАК СчетУчетаСписанияРегл,
	|	ВложенныйЗапрос.СчетУчетаСписанияТипСчета КАК СчетУчетаСписанияТипСчета,
	|	ВложенныйЗапрос.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
	|	ВложенныйЗапрос.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
	|	ВложенныйЗапрос.РозничнаяСтруктурнаяЕдиница КАК РозничнаяСтруктурнаяЕдиница,
	|	УчетЗатратОстаткиКор.КоличествоОстаток КАК КоличествоОстаток,
	|	УчетЗатратОстатки.СчетУчетаРегл,
	|	ВложенныйЗапрос.КоррСчетУчетаРегл,
	|	ВложенныйЗапрос.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл
	//--------------------------------------------------------------------------
	// © Шишка В.В. [1 октября 2021 г.]  НАЧАЛО
	|	, &УчетСебестоимостиВРазрезеОрганизации КАК УчетСебестоимостиВРазрезеОрганизации	
	// © Шишка В.В. [1 октября 2021 г.]  КОНЕЦ
	//--------------------------------------------------------------------------
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,УчетЗатратОстатки.ДокументПоступления КАК ДокументПоступления
	|	,ВложенныйЗапрос.КоррДокументПоступления КАК КоррДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ИЗ
	//+++ Мирошниченко
	//|	РегистрНакопления.Запасы.Остатки(&ГраницаДатаКон, Организация = &Организация) КАК УчетЗатратОстатки
	|	УчетЗатратОстатки КАК УчетЗатратОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетЗатратДвиженияРасход КАК ВложенныйЗапрос
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(&ГраницаДатаКон, ) КАК УчетЗатратОстаткиКор
	|			ЛЕВОЕ СОЕДИНЕНИЕ УчетЗатратОстаткиКор КАК УчетЗатратОстаткиКор
	//--- Мирошниченко
	|			ПО ВложенныйЗапрос.Организация = УчетЗатратОстаткиКор.Организация
	|				И ВложенныйЗапрос.КоррСтруктурнаяЕдиница = УчетЗатратОстаткиКор.СтруктурнаяЕдиница
	//|				И ВложенныйЗапрос.КоррСчетУчета = УчетЗатратОстаткиКор.СчетУчета //+++ ДМгг
	|				И ВЫБОР
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА ВложенныйЗапрос.КоррСчетУчетаРегл = УчетЗатратОстаткиКор.СчетУчетаРегл
	|					ИНАЧЕ ВложенныйЗапрос.КоррСчетУчета = УчетЗатратОстаткиКор.СчетУчета
	|				КОНЕЦ
	//--- Дмгг
	|				И ВложенныйЗапрос.КоррНоменклатура = УчетЗатратОстаткиКор.Номенклатура
	|				И ВложенныйЗапрос.КоррХарактеристика = УчетЗатратОстаткиКор.Характеристика
	|				И ВложенныйЗапрос.КоррПартия = УчетЗатратОстаткиКор.Партия
	|				И (&СебестоимостьЗапасовПоПроектам=ЛОЖЬ или ВложенныйЗапрос.КоррПроект = УчетЗатратОстаткиКор.Проект)        //Малышев 2024-06-19   ONESOFT-3227
	|				И ВложенныйЗапрос.КоррЗаказПокупателя = УчетЗатратОстаткиКор.ЗаказПокупателя 
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|				И ВложенныйЗапрос.КоррДокументПоступления = УчетЗатратОстаткиКор.ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
	|			ПО ВложенныйЗапрос.Организация = УзлыКорректировкиСтоимостиСписания.Организация
	|				И ВложенныйЗапрос.КоррСтруктурнаяЕдиница = УзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница
	//|				И ВложенныйЗапрос.КоррСчетУчета = УзлыКорректировкиСтоимостиСписания.СчетУчета //--- Дмгг
	|				И ВЫБОР
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА ВложенныйЗапрос.КоррСчетУчетаРегл = УзлыКорректировкиСтоимостиСписания.СчетУчетаРегл
	|					ИНАЧЕ ВложенныйЗапрос.КоррСчетУчета = УзлыКорректировкиСтоимостиСписания.СчетУчета
	|				КОНЕЦ
	//--- Дмгг
	|				И ВложенныйЗапрос.КоррНоменклатура = УзлыКорректировкиСтоимостиСписания.Номенклатура
	|				И ВложенныйЗапрос.КоррХарактеристика = УзлыКорректировкиСтоимостиСписания.Характеристика
	|				И ВложенныйЗапрос.КоррПартия = УзлыКорректировкиСтоимостиСписания.Партия
	|				И (&СебестоимостьЗапасовПоПроектам=ЛОЖЬ или ВложенныйЗапрос.КоррПроект = УзлыКорректировкиСтоимостиСписания.Проект)     //Малышев 2024-06-19   ONESOFT-3227
	|				И ВложенныйЗапрос.КоррЗаказПокупателя = УзлыКорректировкиСтоимостиСписания.ЗаказПокупателя
	|				И (УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор)
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|				И ВложенныйЗапрос.КоррДокументПоступления = УзлыКорректировкиСтоимостиСписания.ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|		ПО УчетЗатратОстатки.Организация = ВложенныйЗапрос.Организация
	|			И УчетЗатратОстатки.СтруктурнаяЕдиница = ВложенныйЗапрос.СтруктурнаяЕдиница
	//|			И УчетЗатратОстатки.СчетУчета = ВложенныйЗапрос.СчетУчета //+++ Дмгг
	|			И ВЫБОР
	|				КОГДА &ЗакрыватьПоРеглПлануСчетов
	|					ТОГДА УчетЗатратОстатки.СчетУчетаРегл = ВложенныйЗапрос.СчетУчетаРегл
	|				ИНАЧЕ  УчетЗатратОстатки.СчетУчета = ВложенныйЗапрос.СчетУчета
	|			КОНЕЦ
	//--- Дмгг
	|			И УчетЗатратОстатки.Номенклатура = ВложенныйЗапрос.Номенклатура
	|			И УчетЗатратОстатки.Характеристика = ВложенныйЗапрос.Характеристика
	|			И УчетЗатратОстатки.Партия = ВложенныйЗапрос.Партия
	|			И (&СебестоимостьЗапасовПоПроектам=ЛОЖЬ или УчетЗатратОстатки.Проект = ВложенныйЗапрос.Проект)     //Малышев 2024-06-19   ONESOFT-3227
	|			И УчетЗатратОстатки.ЗаказПокупателя = ВложенныйЗапрос.ЗаказПокупателя
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|			И УчетЗатратОстатки.ДокументПоступления = ВложенныйЗапрос.ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписанияИсточник
	|		ПО (УзлыКорректировкиСтоимостиСписанияИсточник.Регистратор = &Регистратор)
	|			И УчетЗатратОстатки.Организация = УзлыКорректировкиСтоимостиСписанияИсточник.Организация
	|			И УчетЗатратОстатки.СтруктурнаяЕдиница = УзлыКорректировкиСтоимостиСписанияИсточник.СтруктурнаяЕдиница
	//|			И УчетЗатратОстатки.СчетУчета = УзлыКорректировкиСтоимостиСписанияИсточник.СчетУчета //+++ Дмгг
	|			И ВЫБОР
	|				КОГДА &ЗакрыватьПоРеглПлануСчетов
	|					ТОГДА УчетЗатратОстатки.СчетУчетаРегл = УзлыКорректировкиСтоимостиСписанияИсточник.СчетУчетаРегл
	|				ИНАЧЕ УчетЗатратОстатки.СчетУчета = УзлыКорректировкиСтоимостиСписанияИсточник.СчетУчета
	|			КОНЕЦ
	//--- Дмгг
	|			И УчетЗатратОстатки.Номенклатура = УзлыКорректировкиСтоимостиСписанияИсточник.Номенклатура
	|			И УчетЗатратОстатки.Характеристика = УзлыКорректировкиСтоимостиСписанияИсточник.Характеристика
	|			И УчетЗатратОстатки.Партия = УзлыКорректировкиСтоимостиСписанияИсточник.Партия
	|			И (&СебестоимостьЗапасовПоПроектам=ЛОЖЬ или УчетЗатратОстатки.Проект = УзлыКорректировкиСтоимостиСписанияИсточник.Проект)    //Малышев 2024-06-19   ONESOFT-3227
	|			И УчетЗатратОстатки.ЗаказПокупателя = УзлыКорректировкиСтоимостиСписанияИсточник.ЗаказПокупателя
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|			И УчетЗатратОстатки.ДокументПоступления = УзлыКорректировкиСтоимостиСписанияИсточник.ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ГДЕ
	|	УчетЗатратОстатки.СуммаОстаток <> 0
	|	И УчетЗатратОстатки.КоличествоОстаток = 0
	|	И ВложенныйЗапрос.Сумма <> 0
	|	И (УчетЗатратОстатки.СуммаОстаток МЕЖДУ -1 И 1
	//|			ИЛИ УчетЗатратОстатки.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	// Kuzmich, 11.07.06.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
	|			И УчетЗатратОстатки.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	// Kuzmich, 11.07.06.2025, (ONESOFT-4179) Проводки партии в документе "расспределение затрат на товары"
	|	И УчетЗатратОстатки.СуммаОстаток <> 0
	//|	И НЕ ВложенныйЗапрос.СчетУчета ЕСТЬ NULL //+++ Дмгг
	|	И ВЫБОР
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА НЕ ВложенныйЗапрос.СчетУчетаРегл ЕСТЬ NULL
	|		ИНАЧЕ НЕ ВложенныйЗапрос.СчетУчета ЕСТЬ NULL
	|	КОНЕЦ
	//--- Дмгг
	|	И НЕ ЕСТЬNULL(УзлыКорректировкиСтоимостиСписанияИсточник.НомерУзла, 0) = ЕСТЬNULL(УзлыКорректировкиСтоимостиСписания.НомерУзла, 0)
	|

	//Малышев 2025-10-18 ONESOFT-4439 ((- свертка итоговой таблицы
	//|УПОРЯДОЧИТЬ ПО
	//|	КоличествоОстаток УБЫВ,
	//|	ВЫБОР
	//|		КОГДА УзлыКорректировкиСтоимостиСписания.НомерУзла В (&СписокОбработанныхУзлов)
	//|			ТОГДА 0
	//|		ИНАЧЕ 1
	//|	КОНЕЦ УБЫВ
	//Малышев 2025-10-18 ONESOFT-4439 ((- свертка итоговой таблицы
	|";
	
	
	//Малышев 2025-10-18 ONESOFT-4439 ((- свертка итоговой таблицы
	Запрос.Текст = Запрос.Текст + "
	|ВЫБРАТЬ
	|Т.ДокументПродажи,
	|Т.ЗаказПокупателя,
	|Т.ЗаказПродажи,
	|Т.ЗатратыНаВыпуск ,
	|Т.КоличествоОстаток,
	|Т.КоррЗаказПокупателя,
	|Т.КоррНоменклатура,
	|Т.КоррПартия ,
	|Т.КоррПроект ,
	|Т.КоррСпецификация,
	|Т.КоррСтруктурнаяЕдиница ,
	|Т.КоррСчетУчета,
	|Т.КоррСчетУчетаРегл,
	|Т.КоррСчетУчетаТипСчета,
	|Т.КоррХарактеристика,
	|Т.НаправлениеДеятельностиПродажи,
	|Т.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
	|Т.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
	|Т.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета,
	|Т.НаправлениеДеятельностиСписания,
	|Т.Номенклатура,
	|Т.НоменклатураКатегорияНоменклатуры,
	|Т.НомерУзла,
	|Т.НомерУзлаИсточник ,
	|Т.Организация,
	|Т.Ответственный,
	|Т.Партия,
	|Т.ПеремещениеВРозницуСуммовойУчет ,
	|Т.Подразделение,
	|Т.Поле1,
	|Т.Проект,
	|Т.РозничнаяСтруктурнаяЕдиница,
	|Т.Спецификация,
	|Т.СтавкаНДС,
	|Т.СтруктурнаяЕдиница,
	|Т.СтруктурнаяЕдиницаПолучатель ,
	|СУММА(Т.Сумма) как Сумма,
	|СУММА(Т.КоличествоОстаток) как КоличествоОстаток,
	|Т.СчетУчета,
	|Т.СчетУчетаРегл,
	|Т.СчетУчетаСписания,
	|Т.СчетУчетаСписанияРегл,
	|Т.СчетУчетаСписанияТипСчета,
	|Т.СчетУчетаТипСчета,
	|Т.УчетСебестоимостиВРазрезеОрганизации,
	|Т.Характеристика,
	|Т.ДокументПоступления,
	|Т.КоррДокументПоступления
	|
	|ИЗ (" + ТекстЗапроса + ") КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|
	|Т.ДокументПродажи,
	|Т.ЗаказПокупателя,
	|Т.ЗаказПродажи,
	|Т.ЗатратыНаВыпуск ,
	|Т.КоличествоОстаток,
	|Т.КоррЗаказПокупателя,
	|Т.КоррНоменклатура,
	|Т.КоррПартия ,
	|Т.КоррПроект ,
	|Т.КоррСпецификация,
	|Т.КоррСтруктурнаяЕдиница ,
	|Т.КоррСчетУчета,
	|Т.КоррСчетУчетаРегл,
	|Т.КоррСчетУчетаТипСчета,
	|Т.КоррХарактеристика,
	|Т.НаправлениеДеятельностиПродажи,
	|Т.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
	|Т.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
	|Т.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета,
	|Т.НаправлениеДеятельностиСписания,
	|Т.Номенклатура,
	|Т.НоменклатураКатегорияНоменклатуры,
	|Т.НомерУзла,
	|Т.НомерУзлаИсточник ,
	|Т.Организация,
	|Т.Ответственный,
	|Т.Партия,
	|Т.ПеремещениеВРозницуСуммовойУчет ,
	|Т.Подразделение,
	|Т.Поле1,
	|Т.Проект,
	|Т.РозничнаяСтруктурнаяЕдиница,
	|Т.Спецификация,
	|Т.СтавкаНДС,
	|Т.СтруктурнаяЕдиница,
	|Т.СтруктурнаяЕдиницаПолучатель ,
	|Т.СчетУчета,
	|Т.СчетУчетаРегл,
	|Т.СчетУчетаСписания,
	|Т.СчетУчетаСписанияРегл,
	|Т.СчетУчетаСписанияТипСчета,
	|Т.СчетУчетаТипСчета,
	|Т.УчетСебестоимостиВРазрезеОрганизации,
	|Т.Характеристика,
	|Т.ДокументПоступления,
	|Т.КоррДокументПоступления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сумма УБЫВ,
	|	ВЫБОР
	|		КОГДА Т.НомерУзла В (&СписокОбработанныхУзлов)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ УБЫВ
	|";  
	//Малышев 2025-10-18 ONESOFT-4439 свертка итоговой таблицы  --))

	
	Запрос.УстановитьПараметр("ГраницаДатаКон", Новый Граница(ДатаКон, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("СписокОбработанныхУзлов", СписокОбработанныхУзлов);
	Запрос.УстановитьПараметр("ЗакрыватьПоРеглПлануСчетов", ИспользоватьТолькоРегламентированныйПланСчетов);
	
	// Создадим набор записей регистра накопления Учет запасов и затрат.
	НаборЗаписейЗапасы = РегистрыНакопления.Запасы.СоздатьНаборЗаписей();
	НаборЗаписейЗапасы.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Продажи.
	НаборЗаписейПродажи = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
	НаборЗаписейПродажи.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления УчетДоходовИРасходов.
	НаборЗаписейДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей();
	НаборЗаписейДоходыИРасходы.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления СуммовойУчетВРознице.
	НаборЗаписейСуммовойУчетВРознице = РегистрыНакопления.СуммовойУчетВРознице.СоздатьНаборЗаписей();
	НаборЗаписейСуммовойУчетВРознице.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра бухгалтерии НаборЗаписейУправленческий.
	НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
	НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Хозрасчетный.
	НаборЗаписейХозрасчетный = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборЗаписейХозрасчетный.Отбор.Регистратор.Установить(Ссылка);	
	
	КоличествоИтераций = 0;
	Количество4 = 0;
	
	Результат = Запрос.Выполнить();
	
	СтруктураПараметровРегл = РегламентированныйУчетСервер.ПолучитьСтруктуруСчетовУчета(ДополнительныеСвойства.ДляПроведения.Организация, ДополнительныеСвойства.ДляПроведения.Дата);
	Если СтруктураПараметровРегл.Выбран() Тогда
		СчетПрочиеДоходыРегл = СтруктураПараметровРегл.СчетПрочихДоходов;
		СчетПрочиеРасходыРегл = СтруктураПараметровРегл.СчетПрочихРасходов;
	Иначе
		СчетПрочиеДоходыРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		СчетПрочиеРасходыРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	КонецЕсли; 
	
	Пока НЕ Результат.Пустой() Цикл
		
		КоличествоИтераций = КоличествоИтераций + 1;
		Если КоличествоИтераций > 60 Тогда
			ОписаниеОшибки = НСтр("ka='ხარჯების მიხედვით თანხობრივი ნაშთები კორექტირება ვერ მოხერხდა.';
									|ru='Не удалось скорректировать суммовые остатки по затратам.';
									|en='Could not adjust the accrual balances costs.'");
			ДобавитьОшибкуВТаблицу(ОписаниеОшибки, ВидОперации, ТаблицаОшибок);
			Прервать;
		КонецЕсли;
		
		//Малышев 2024-09-27 - заглушка на зацикливание
		Если Результат.Выгрузить().Количество()<=4 Тогда
			Количество4 = Количество4 + 1;
			Если Количество4>4 Тогда
				Прервать;
			КонецЕсли;	
		КонецЕсли;	

		
		НаборЗаписейЗапасы.Очистить();
		НаборЗаписейПродажи.Очистить();
		НаборЗаписейДоходыИРасходы.Очистить();
		НаборЗаписейСуммовойУчетВРознице.Очистить();
		НаборЗаписейУправленческий.Очистить();
		НаборЗаписейХозрасчетный.Очистить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		СписокОбработанныхУзловИсточников = Новый Массив();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			// Сделаем проверку, на случай, если есть не закрытые кассовые смены.
			Если ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ЧекККМ")
				ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
				Продолжить;
			КонецЕсли;
			
			Если СписокОбработанныхУзловИсточников.Найти(ВыборкаДетальныеЗаписи.НомерУзлаИсточник) = Неопределено Тогда
				СписокОбработанныхУзловИсточников.Добавить(ВыборкаДетальныеЗаписи.НомерУзлаИсточник);
			Иначе
				Продолжить; // Этот источник уже скорректировали.
			КонецЕсли;
			
			Если СписокОбработанныхУзлов.Найти(ВыборкаДетальныеЗаписи.НомерУзла) = Неопределено Тогда
				СписокОбработанныхУзлов.Добавить(ВыборкаДетальныеЗаписи.НомерУзла);
			КонецЕсли;
			
			СуммаКорректировки = ВыборкаДетальныеЗаписи.Сумма;
			
			СформироватьДвиженияПоРегиструУчетаЗатрат(
				НаборЗаписейЗапасы,
				НаборЗаписейУправленческий,
				НаборЗаписейХозрасчетный,
				ВыборкаДетальныеЗаписи,
				СуммаКорректировки,
				Ложь,
			);
			
			Если ВыборкаДетальныеЗаписи.КоррСчетУчета = ДополнительныеСвойства.ДляПроведения.ПустойСчет
				ИЛИ ВыборкаДетальныеЗаписи.КоррСчетУчетаРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка() Тогда
				
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДокументПродажи)
				   И ((ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.РасходнаяНакладная")
					 И ВыборкаДетальныеЗаписи.ДокументПродажи.ВидОперации <> Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.АктВыполненныхРабот")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ОтчетКомиссионера")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ЗаказПокупателя")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ОтчетОПереработке")) Тогда
					
					// Движения по регистру Продажи.
					НоваяСтрока = НаборЗаписейПродажи.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПродажи;
					НоваяСтрока.Подразделение = ВыборкаДетальныеЗаписи.Подразделение;
					НоваяСтрока.Ответственный = ВыборкаДетальныеЗаписи.Ответственный;
					НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
					НоваяСтрока.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
					НоваяСтрока.Партия = ВыборкаДетальныеЗаписи.Партия;
					НоваяСтрока.Проект = ВыборкаДетальныеЗаписи.Проект;   //Малышев 2024-06-19   ONESOFT-3227
					НоваяСтрока.Документ = ВыборкаДетальныеЗаписи.ДокументПродажи;
					НоваяСтрока.СтавкаНДС = ВыборкаДетальныеЗаписи.СтавкаНДС;
					НоваяСтрока.Себестоимость = СуммаКорректировки;
					
					// Движения по регистру ДоходыИРасходы.
					НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.Подразделение;
					НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПродажи;
					НоваяСтрока.НаправлениеДеятельности = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажи;
					НоваяСтрока.СчетУчета = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж;
					НоваяСтрока.СчетУчетаРегл = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл;
					НоваяСтрока.СуммаРасходов = СуммаКорректировки;
					НоваяСтрока.СодержаниеПроводки = НСтр("ka='რეალიზაციისას ხარჯების ასახვა';ru='Отражение расходов по продаже';en='Reflection selling expenses'");
					НоваяСтрока.Проект = ВыборкаДетальныеЗаписи.Проект;   //Малышев 2024-06-19   ONESOFT-3227
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					НоваяСтрока.Содержание = НСтр("ka='რეალიზაციისას ხარჯების ასახვა';ru='Отражение расходов по продаже';en='Reflection selling expenses'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					// Движения по регистру Хозрасчетный.
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
					НоваяСтрока.Содержание = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Проекты", ВыборкаДетальныеЗаписи.Проект); //Малышев 2024-06-19   ONESOFT-3227
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Проекты", ВыборкаДетальныеЗаписи.Проект); //Малышев 2024-06-19   ONESOFT-3227
					
				ИначеЕсли ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДокументПродажи)
						И ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.РасходнаяНакладная")
						И ВыборкаДетальныеЗаписи.ДокументПродажи.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику Тогда
						
					// Движения по регистру Доходы и расходы.
					НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
					НоваяСтрока.Период = ДополнительныеСвойства.ДляПроведения.Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = Неопределено;
					НоваяСтрока.ЗаказПокупателя = Неопределено;
					НоваяСтрока.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
					
					Если СуммаКорректировки < 0 Тогда
						НоваяСтрока.СчетУчета = ПланыСчетов.Управленческий.ПрочиеРасходы;
						НоваяСтрока.СчетУчетаРегл = СчетПрочиеРасходыРегл;
						НоваяСтрока.СуммаРасходов = СуммаКорректировки;
						НоваяСтрока.СодержаниеПроводки = НСтр("ka='სხვა ხარჯები მომწოდებლისთვის დაბრუნებისას';ru='Прочие расходы по возврату поставщику';en='Other expenses for return to the supplier'");
					Иначе
						НоваяСтрока.СчетУчета = ПланыСчетов.Управленческий.ПрочиеДоходы;
						НоваяСтрока.СчетУчетаРегл = СчетПрочиеДоходыРегл;
						НоваяСтрока.СуммаДоходов = СуммаКорректировки;
						НоваяСтрока.СодержаниеПроводки = НСтр("ka='სხვა შემოსავლები მომწოდებლისთვის დაბრუნებისას';ru='Прочие доходы по возврату поставщику';en='Other income for return to the supplier'");
					Конецесли;
					НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Номенклатура;
					НоваяСтрока.Проект = ВыборкаДетальныеЗаписи.Проект;    //Малышев 2024-06-19   ONESOFT-3227
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					
					Если СуммаКорректировки < 0 Тогда
						НоваяСтрока.СчетДт = ПланыСчетов.Управленческий.ПрочиеРасходы;
						НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
						НоваяСтрока.Сумма = - СуммаКорректировки;
						НоваяСтрока.Содержание = НСтр("ka='სხვა ხარჯები მომწოდებლისთვის დაბრუნებისას';ru='Прочие расходы по возврату поставщику';en='Other expenses for return to the supplier'");
					Иначе
						НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчета;
						НоваяСтрока.СчетКт = ПланыСчетов.Управленческий.ПрочиеДоходы;
						НоваяСтрока.Сумма = СуммаКорректировки;
						НоваяСтрока.Содержание = НСтр("ka='სხვა შემოსავლები მომწოდებლისთვის დაბრუნებისას';ru='Прочие доходы по возврату поставщику';en='Other income for return to the supplier'");
					КонецЕсли;
					
					// Движения по регистру Хозрасчетный.
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
										
					Если СуммаКорректировки < 0 Тогда
						НоваяСтрока.СчетДт = СчетПрочиеРасходыРегл;
						НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
						НоваяСтрока.Сумма = - СуммаКорректировки;
						НоваяСтрока.Содержание = НСтр("ka='სხვა ხარჯები მომწოდებლისთვის დაბრუნებისას';ru='Прочие расходы по возврату поставщику';en='Other expenses for return to the supplier'");
					Иначе
						НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
						НоваяСтрока.СчетКт = СчетПрочиеДоходыРегл;
						НоваяСтрока.Сумма = СуммаКорректировки;
						НоваяСтрока.Содержание = НСтр("ka='სხვა შემოსავლები მომწოდებლისთვის დაბრუნებისას';ru='Прочие доходы по возврату поставщику';en='Other income for return to the supplier'");
					КонецЕсли;
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Проекты", ВыборкаДетальныеЗаписи.Проект);  //Малышев 2024-06-19   ONESOFT-3227
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Проекты", ВыборкаДетальныеЗаписи.Проект);  //Малышев 2024-06-19   ONESOFT-3227
					
				ИначеЕсли ВыборкаДетальныеЗаписи.ПеремещениеВРозницуСуммовойУчет Тогда
					
					// Движения по регистру СуммовойУчетВРознице.
					НоваяСтрока = НаборЗаписейСуммовойУчетВРознице.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница;
					НоваяСтрока.Валюта = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница.РозничныйВидЦен.ВалютаЦены;
					НоваяСтрока.СодержаниеПроводки = НСтр("ka='საცალო ვაჭრობაში გადაადგილება';ru='Перемещение в розницу';en='Moving into retail'");
					НоваяСтрока.Себестоимость = СуммаКорректировки;
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница.СчетУчетаВРознице;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					НоваяСтрока.Содержание = НСтр("ka='საცალო ვაჭრობაში გადაადგილება';ru='Перемещение в розницу';en='Moving into retail'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					// Движения по регистру Хозрасчетный.
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница.СчетУчетаВРозницеРегл;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
					НоваяСтрока.Содержание = НСтр("ka='საცალო ვაჭრობაში გადაადგილება';ru='Перемещение в розницу';en='Moving into retail'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Проекты", ВыборкаДетальныеЗаписи.Проект);  //Малышев 2024-06-19   ONESOFT-3227
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Проекты", ВыборкаДетальныеЗаписи.Проект);  //Малышев 2024-06-19   ONESOFT-3227
				
				ИначеЕсли ВыборкаДетальныеЗаписи.СчетУчетаСписанияТипСчета = Перечисления.ТипыСчетов.ПрочиеРасходы
					  ИЛИ ВыборкаДетальныеЗаписи.СчетУчетаСписанияТипСчета = Перечисления.ТипыСчетов.Расходы
					  ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяРасходным(ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл) Тогда
					
					// Движения по регистру Доходы и расходы.
					НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
					НоваяСтрока.Период = ДополнительныеСвойства.ДляПроведения.Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.СтруктурнаяЕдиницаПолучатель;
					
					Если ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ПеремещениеЗапасов")
					   И ВыборкаДетальныеЗаписи.СчетУчетаСписанияТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
						НоваяСтрока.НаправлениеДеятельности = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиСписания;
						НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПокупателя;
					Иначе
						НоваяСтрока.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
					КонецЕсли;
					
					НоваяСтрока.СчетУчета = ВыборкаДетальныеЗаписи.СчетУчетаСписания;
					НоваяСтрока.СчетУчетаРегл = ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл;
					НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Номенклатура;
					НоваяСтрока.Проект = ВыборкаДетальныеЗаписи.Проект;       //Малышев 2024-06-19   ONESOFT-3227
					НоваяСтрока.СуммаРасходов = СуммаКорректировки;
					НоваяСтрока.СодержаниеПроводки = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаСписания;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					НоваяСтрока.Содержание = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					// Движения по регистру Хозрасчетный.
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
					НоваяСтрока.Содержание = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Проекты", ВыборкаДетальныеЗаписи.Проект);  //Малышев 2024-06-19   ONESOFT-3227
				
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Проекты", ВыборкаДетальныеЗаписи.Проект);  //Малышев 2024-06-19   ONESOFT-3227
				
				Иначе
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаСписания;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					НоваяСтрока.Содержание = НСтр("ka='მარაგების ჩამოწერა თავისუფალ ანგარიშზე';ru='Списание запасов на произвольный счет';en='The write-downs on an arbitrary score'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					// Движения по регистру Хозрасчетный.
					//+++ Пока что костыль
					Если ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл = ДополнительныеСвойства.ДляПроведения.ПустойСчетРегл 
						ИЛИ ВыборкаДетальныеЗаписи.СчетУчетаРегл = ДополнительныеСвойства.ДляПроведения.ПустойСчетРегл Тогда 
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
					НоваяСтрока.Содержание = НСтр("ka='მარაგების ჩამოწერა თავისუფალ ანგარიშზე';ru='Списание запасов на произвольный счет';en='The write-downs on an arbitrary score'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Проекты", ВыборкаДетальныеЗаписи.Проект);  //Малышев 2024-06-19   ONESOFT-3227
				
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Проекты", ВыборкаДетальныеЗаписи.Проект);  //Малышев 2024-06-19   ONESOFT-3227
				
					КонецЕсли; //+++ Дмгг
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		НаборЗаписейЗапасы.Записать(Ложь);
		НаборЗаписейПродажи.Записать(Ложь);
		НаборЗаписейДоходыИРасходы.Записать(Ложь);
		НаборЗаписейСуммовойУчетВРознице.Записать(Ложь);
		Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()) Тогда  //+++ Дмгг
			НаборЗаписейУправленческий.Записать(Ложь);
		КонецЕсли;  //--- Дмгг
		НаборЗаписейХозрасчетный.Записать(Ложь);
		
		Если КоличествоИтераций = 15 ИЛИ КоличествоИтераций = 30 ИЛИ КоличествоИтераций = 45 Тогда
			// Сброс списка отработанных узлов.
			СписокОбработанныхУзлов.Очистить();
			СписокОбработанныхУзлов.Добавить("");
		КонецЕсли;
		
		УдалимВременнуюТаблицу(Запрос.МенеджерВременныхТаблиц,"УчетЗатратОстатки");
		УдалимВременнуюТаблицу(Запрос.МенеджерВременныхТаблиц,"УчетЗатратОстаткиКор");
		
		Запрос.УстановитьПараметр("СписокОбработанныхУзлов", СписокОбработанныхУзлов);
		Результат = Запрос.Выполнить();
		
	КонецЦикла;
	
	//+++ Мирошниченко Р.К. 19-08-2024
	//Запрос.Текст = "УНИЧТОЖИТЬ УчетЗатратДвиженияРасход";
	//Запрос.Текст = "УНИЧТОЖИТЬ УчетЗатратДвиженияРасход;УНИЧТОЖИТЬ УчетЗатратОстатки;УНИЧТОЖИТЬ УчетЗатратОстаткиКор";
	//Запрос.Выполнить();
	УдалимВременнуюТаблицу(Запрос.МенеджерВременныхТаблиц,"УчетЗатратДвиженияРасход");
	УдалимВременнуюТаблицу(Запрос.МенеджерВременныхТаблиц,"УчетЗатратОстатки");
	УдалимВременнуюТаблицу(Запрос.МенеджерВременныхТаблиц,"УчетЗатратОстаткиКор");
	//---
	
КонецПроцедуры // РаспределитьСуммыБезКоличества()

Функция УдалимВременнуюТаблицу(МенеджерВременныхТаблиц, ИмяТаблицы)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Если Запрос.МенеджерВременныхТаблиц.Таблицы.Найти(ИмяТаблицы) <> Неопределено Тогда
		Запрос.Текст = "УНИЧТОЖИТЬ " + ИмяТаблицы;
		Запрос.Выполнить();
		Возврат Истина;
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции

// Корректирует списание учета затрат.
//
// Параметры:
//  Отказ        - Булево - флаг отказа проведения документа.
//
Процедура КорректировкаСписанияУчетЗатрат(ВидОперации, ТаблицаОшибок, Отказ)
	
	// Сформируем список состояний.
	КоличествоУравненийСЛУ = СформироватьДвиженияПоРегиструУзлыКорректировкиСтоимостиСписания(Отказ);
	
	Если КоличествоУравненийСЛУ > 0 Тогда
		
		// Решим СЛУ и определим среднюю цену в каждом состоянии.
		РешениеНайдено = РешитьСЛУ();
		
		Если НЕ РешениеНайдено Тогда
			Возврат;
		КонецЕсли;
		
		// Скорректируем движения по состояниям.
		СформироватьКорректирующиеДвиженияПоРегиструУчетаЗатрат();
		
		// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
		// Костыль. Попробуем скмпнсировать взаимные ошибки округления.
		КопменсацияВзаимныхОшибокОкругления();
		// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
		
		// Распределим оставшиеся в состояниях копейки (результаты ошибок округления).
		РаспределитьСуммыБезКоличества(ВидОперации, ТаблицаОшибок);
		
	Иначе
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	""Уравнений нет"" КАК Поле1
			|ПОМЕСТИТЬ УчетЗатрат
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	""Уравнений нет"" КАК Поле1
			|ПОМЕСТИТЬ УчетЗатратВозвратыТекПериода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	""Уравнений нет"" КАК Поле1
			|ПОМЕСТИТЬ УчетЗатратСписания
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	""Уравнений нет"" КАК Поле1
			|ПОМЕСТИТЬ УчетЗатратВозвратыПоРезервам
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	""Уравнений нет"" КАК Поле1
			|ПОМЕСТИТЬ УчетЗатратВозвратыСвободные
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	""Уравнений нет"" КАК Поле1
			|ПОМЕСТИТЬ УчетЗатратВозвраты
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	""Уравнений нет"" КАК Поле1
			|ПОМЕСТИТЬ УчетЗатратБезУчетаВозвратов"
		);
		
		Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		
		Запрос.Выполнить();
		
	КонецЕсли;
	
КонецПроцедуры // КорректировкаСписанияУчетЗатрат()

// Процедура выполняет корректировку стоимости возвратов от клиента.
//
Процедура РассчитатьСтоимостьВозвратов()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Запасы.Номенклатура.МетодОценки = ЗНАЧЕНИЕ(Перечисление.МетодОценкиЗапасов.FIFO)
	|			ТОГДА Запасы.Период
	|		ИНАЧЕ КОНЕЦПЕРИОДА(Запасы.Период, МЕСЯЦ)
	|	КОНЕЦ КАК Период,
	|	Запасы.Организация КАК Организация,
	|	Запасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Запасы.СчетУчета КАК СчетУчета,
	|	Запасы.Номенклатура КАК Номенклатура,
	|	Запасы.Характеристика КАК Характеристика,
	|	Запасы.Партия КАК Партия,
	
	//Малышев 2024-07-30 ONESOFT-3358
//	|	Запасы.Проект КАК Проект, 			//Малышев 2024-06-18 ONESOFT-3227
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА Запасы.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА Запасы.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
	|	КОНЕЦ КАК Проект, 
	//Малышев 2024-07-30 ONESOFT-3358
	
	|	Запасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	Запасы.ЗаказПродажи КАК ЗаказПродажи,
	|	Запасы.СтавкаНДС КАК СтавкаНДС,
	|	Запасы.ДокументПродажи КАК ДокументПродажи,
	|	Запасы.Подразделение КАК Подразделение,
	|	Запасы.КоррСчетУчета КАК КоррСчетУчета,

	//Малышев 2024-07-30 ONESOFT-3358
	//|	Запасы.КоррПроект КАК КоррПроект, 		//Малышев 2024-06-18 ONESOFT-3227
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА Запасы.КоррПроект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА Запасы.КоррПроект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
	|	КОНЕЦ КАК КоррПроект, 
	//Малышев 2024-07-30 ONESOFT-3358

	|	Запасы.Ответственный КАК Ответственный,
	|	ВЫБОР
	|		КОГДА КОНЕЦПЕРИОДА(Запасы.ДокументПродажи.Дата, МЕСЯЦ) < КОНЕЦПЕРИОДА(Запасы.Период, МЕСЯЦ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратПрошлогоПериода,
	|	-СУММА(Запасы.Количество) КАК Количество,
	|	-СУММА(Запасы.Сумма) КАК Сумма,
	|	Запасы.СчетУчетаРегл,
	|	Запасы.КоррСчетУчетаРегл
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,Запасы.ДокументПоступления КАК ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ПОМЕСТИТЬ ВтВозвраты
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Запасы.Возврат
	|	И Запасы.Организация = &Организация
	|	И ВЫБОР
	|			КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|				ТОГДА Запасы.КоррСчетУчетаРегл = &ПустойСчетРегл
	|			ИНАЧЕ Запасы.КоррСчетУчета = &ПустойСчет
	|		КОНЕЦ
	|	И Запасы.ДокументПродажи <> НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА Запасы.Номенклатура.МетодОценки = ЗНАЧЕНИЕ(Перечисление.МетодОценкиЗапасов.FIFO)
	|			ТОГДА Запасы.Период
	|		ИНАЧЕ КОНЕЦПЕРИОДА(Запасы.Период, МЕСЯЦ)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КОНЕЦПЕРИОДА(Запасы.ДокументПродажи.Дата, МЕСЯЦ) < КОНЕЦПЕРИОДА(Запасы.Период, МЕСЯЦ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	Запасы.Организация,
	|	Запасы.СтруктурнаяЕдиница,
	|	Запасы.СчетУчета,
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.Партия,
	
	//Малышев 2024-07-30 ONESOFT-3358
	//|	Запасы.Проект, //Малышев 2024-06-18 ONESOFT-3227
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА Запасы.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА Запасы.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
	|	КОНЕЦ, 
	//Малышев 2024-07-30 ONESOFT-3358
	
	|	Запасы.ЗаказПокупателя,
	|	Запасы.ЗаказПродажи,
	|	Запасы.СтавкаНДС,
	|	Запасы.ДокументПродажи,
	|	Запасы.Подразделение,
	|	Запасы.КоррСчетУчета,
	|	Запасы.Ответственный,
	
	//Малышев 2024-07-30 ONESOFT-3358
	//|	Запасы.КоррПроект, //Малышев 2024-06-18 ONESOFT-3227
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА Запасы.КоррПроект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА Запасы.КоррПроект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
	|	КОНЕЦ, 
	//Малышев 2024-07-30 ONESOFT-3358
	
	|	Запасы.СчетУчетаРегл,
	|	Запасы.КоррСчетУчетаРегл
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,Запасы.ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаВозвратов.Период КАК Период,
	|	ИСТИНА КАК Возврат,
	|	&Организация КАК Организация,
	|	ТаблицаВозвратов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаВозвратов.СчетУчета КАК СчетУчета,
	|	ТаблицаВозвратов.Номенклатура КАК Номенклатура,
	|	ТаблицаВозвратов.Номенклатура.НаправлениеДеятельности КАК НаправлениеДеятельностиПродажи,
	|	ТаблицаВозвратов.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитикаРеглСрезПоследних.СчетУчетаСебестоимостиВозврат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА ТаблицаВозвратов.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл
	|		ИНАЧЕ УчетнаяПолитикаРеглСрезПоследних.СчетУчетаСебестоимостиВозврат
	|	КОНЕЦ КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
	|	ТаблицаВозвратов.Характеристика КАК Характеристика,
	|	ТаблицаВозвратов.Партия КАК Партия,
	|	ТаблицаВозвратов.Проект КАК Проект,  //Малышев 2024-06-18 ONESOFT-3227
	|	ТаблицаВозвратов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаВозвратов.ЗаказПродажи КАК ЗаказПродажи,
	|	ТаблицаВозвратов.Количество КАК КоличествоВозвратов,
	|	ТаблицаВозвратов.Сумма КАК СуммаВозвратов,
	|	ТаблицаВозвратов.ДокументПродажи КАК ДокументПродажи,
	|	ТаблицаВозвратов.Подразделение КАК Подразделение,
	|	ТаблицаВозвратов.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаВозвратов.Ответственный КАК Ответственный,
	|	ТаблицаВозвратов.КоррПроект КАК КоррПроект,  //Малышев 2024-06-18 ONESOFT-3227
	|	ТаблицаВозвратов.ЭтоВозвратПрошлогоПериода КАК ЭтоВозвратПрошлогоПериода,
	|	&ПустойСчет КАК КоррСчетУчета,
	|	&ПустойСчетРегл КАК КоррСчетУчетаРегл,
	|	СУММА(ТаблицаПродажи.Количество) КАК КоличествоПродаж,
	|	СУММА(ТаблицаПродажи.Сумма) КАК СуммаПродаж,
	|	ТаблицаВозвратов.СчетУчетаРегл КАК СчетУчетаРегл
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,ТаблицаВозвратов.ДокументПоступления КАК ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ИЗ
	|	ВтВозвраты КАК ТаблицаВозвратов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК ТаблицаПродажи
	|		ПО ТаблицаВозвратов.Номенклатура = ТаблицаПродажи.Номенклатура
	|			И ТаблицаВозвратов.Характеристика = ТаблицаПродажи.Характеристика
	|			И ТаблицаВозвратов.Партия = ТаблицаПродажи.Партия
	//Малышев 2024-06-18 ONESOFT-3227
	|			И (&СебестоимостьЗапасовПоПроектам=ЛОЖЬ 
	|				или ТаблицаВозвратов.Проект = ТаблицаПродажи.Проект)   
	//Малышев 2024-06-18 ONESOFT-3227				
	|			И ТаблицаВозвратов.ЗаказПродажи = ТаблицаПродажи.ЗаказПродажи
	|			И (ТаблицаПродажи.Организация = &Организация)
	|			И ТаблицаВозвратов.ДокументПродажи = ТаблицаПродажи.ДокументПродажи
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|					ТОГДА ТаблицаВозвратов.СчетУчетаРегл = ТаблицаПродажи.СчетУчетаРегл
	|				ИНАЧЕ ТаблицаВозвратов.СчетУчета = ТаблицаПродажи.СчетУчета
	|			КОНЕЦ)
	|			И ТаблицаВозвратов.СтавкаНДС = ТаблицаПродажи.СтавкаНДС
	|			И (ВЫБОР
	|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
	|					ТОГДА ТаблицаПродажи.КоррСчетУчетаРегл = &ПустойСчетРегл
	|				ИНАЧЕ ТаблицаПродажи.КоррСчетУчета = &ПустойСчет
	|			КОНЕЦ)
	|			И (ТаблицаПродажи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|			И ТаблицаВозвратов.ДокументПоступления = ТаблицаПродажи.ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|			И (НЕ ТаблицаПродажи.Возврат),
	|	РегистрСведений.УчетнаяПолитикаРегл.СрезПоследних(&КонецПериода, Организация = &Организация) КАК УчетнаяПолитикаРеглСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаВозвратов.Период,
	|	ТаблицаВозвратов.СтруктурнаяЕдиница,
	|	ТаблицаВозвратов.СчетУчета,
	|	ТаблицаВозвратов.Номенклатура,
	|	ТаблицаВозвратов.Характеристика,
	|	ТаблицаВозвратов.Партия,
	|	ТаблицаВозвратов.Проект,  //Малышев 2024-06-18 ONESOFT-3227
	|	ТаблицаВозвратов.ЗаказПокупателя,
	|	ТаблицаВозвратов.ЗаказПродажи,
	|	ТаблицаВозвратов.Количество,
	|	ТаблицаВозвратов.Сумма,
	|	ТаблицаВозвратов.ДокументПродажи,
	|	ТаблицаВозвратов.Подразделение,
	|	ТаблицаВозвратов.СтавкаНДС,
	|	ТаблицаВозвратов.Ответственный,
	|	ТаблицаВозвратов.КоррПроект,  //Малышев 2024-06-18 ONESOFT-3227
	|	ТаблицаВозвратов.ЭтоВозвратПрошлогоПериода,
	|	ТаблицаВозвратов.Номенклатура.НаправлениеДеятельности,
	|	ТаблицаВозвратов.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж,
	|	ТаблицаВозвратов.СчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитикаРеглСрезПоследних.СчетУчетаСебестоимостиВозврат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|			ТОГДА ТаблицаВозвратов.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл
	|		ИНАЧЕ УчетнаяПолитикаРеглСрезПоследних.СчетУчетаСебестоимостиВозврат
	|	КОНЕЦ
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,ТаблицаВозвратов.ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|
	|ИМЕЮЩИЕ
	|	(ВЫРАЗИТЬ(СУММА(ТаблицаПродажи.Сумма) - ТаблицаВозвратов.Сумма КАК ЧИСЛО(15, 2))) <> 0");
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПустойСчет", ДополнительныеСвойства.ДляПроведения.ПустойСчет);
	Запрос.УстановитьПараметр("ПустойСчетРегл", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("КонецПериода", ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод);
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированныйПланСчетов", ДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	//Малышев 2024-07-30 (-
	Запрос.УстановитьПараметр("УчетПоПроектам", ДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	Запрос.УстановитьПараметр("СебестоимостьЗапасовПоПроектам", ПолучитьПризнак_СебестоимостьЗапасовПоПроектам(ДополнительныеСвойства));
	//Малышев 2024-07-30 -)
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Корректировка стоимости.
	
	// Создадим набор записей регистра накопления Учет запасов и затрат.
	НаборЗаписейЗапасы = РегистрыНакопления.Запасы.СоздатьНаборЗаписей();
	НаборЗаписейЗапасы.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Продажи.
	НаборЗаписейПродажи = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
	НаборЗаписейПродажи.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления УчетДоходовИРасходов.
	НаборЗаписейДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей();
	НаборЗаписейДоходыИРасходы.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Управленческий.
	НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
	НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Хозрасчетный.
	НаборЗаписейХозрасчетный = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборЗаписейХозрасчетный.Отбор.Регистратор.Установить(Ссылка);

	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.КоличествоПродаж = 0 Тогда
			СуммаКорректировки = 0;
		Иначе
			ЦенаПродажи = ВыборкаДетальныеЗаписи.СуммаПродаж / ВыборкаДетальныеЗаписи.КоличествоПродаж;
			СуммаВозвратов = ЦенаПродажи * ВыборкаДетальныеЗаписи.КоличествоВозвратов;
			СуммаКорректировки = ВыборкаДетальныеЗаписи.СуммаВозвратов - ЦенаПродажи * ВыборкаДетальныеЗаписи.КоличествоВозвратов;
		КонецЕсли;
		
		Если (НЕ Окр(СуммаКорректировки, 2) = 0) Тогда
			
			// Движения по регистру Учет запасов и затрат.
			СформироватьДвиженияПоРегиструУчетаЗатрат(
				НаборЗаписейЗапасы,
				НаборЗаписейУправленческий,
				НаборЗаписейХозрасчетный,
				ВыборкаДетальныеЗаписи,
				СуммаКорректировки,
				ВыборкаДетальныеЗаписи.ЭтоВозвратПрошлогопериода, // возвраты прошлого периода по фиксированной стоимости
				НСтр("ka='მყიდველისგან დაბრუნების თვითღირებულება';ru='Себестоимость возврата от покупателя';en='The cost price of the return from the buyer'")
			);
			
			// Движения по регистру Продажи.
			НоваяСтрока = НаборЗаписейПродажи.Добавить();
			НоваяСтрока.Период = Дата;
			НоваяСтрока.Регистратор = Ссылка;
			НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
			НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПродажи;
			НоваяСтрока.Подразделение = ВыборкаДетальныеЗаписи.Подразделение;
			НоваяСтрока.Ответственный = ВыборкаДетальныеЗаписи.Ответственный;
			НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			НоваяСтрока.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
			НоваяСтрока.Партия = ВыборкаДетальныеЗаписи.Партия;
			НоваяСтрока.Проект = ВыборкаДетальныеЗаписи.Проект;   //Малышев 2024-06-18 ONESOFT-3227
			НоваяСтрока.Документ = ВыборкаДетальныеЗаписи.ДокументПродажи;
			НоваяСтрока.СтавкаНДС = ВыборкаДетальныеЗаписи.СтавкаНДС;
			НоваяСтрока.Себестоимость = СуммаКорректировки;
			
			// Движения по регистру ДоходыИРасходы.
			НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
			НоваяСтрока.Период = Дата;
			НоваяСтрока.Регистратор = Ссылка;
			НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
			НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.Подразделение;
			НоваяСтрока.Проект = ВыборкаДетальныеЗаписи.Проект;   //Малышев 2024-06-18 ONESOFT-3227
			НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПродажи;
			НоваяСтрока.НаправлениеДеятельности = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажи;
			НоваяСтрока.СчетУчета = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж;
			НоваяСтрока.СчетУчетаРегл = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл;
			НоваяСтрока.СуммаРасходов = СуммаКорректировки;
			НоваяСтрока.СодержаниеПроводки = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
			
			// Движения по регистру Управленческий.
			НоваяСтрока = НаборЗаписейУправленческий.Добавить();
			НоваяСтрока.Период = Дата;
			НоваяСтрока.Регистратор = Ссылка;
			НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
			НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
			НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж;
			НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
			НоваяСтрока.Содержание = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
			НоваяСтрока.Сумма = СуммаКорректировки;
			
			// Движения по регистру Хозрасчетный.
			НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
			НоваяСтрока.Период = Дата;
			НоваяСтрока.Регистратор = Ссылка;
			НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
			//НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл;
			//НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
			НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
			НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл;
			НоваяСтрока.Содержание = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
			//НоваяСтрока.Сумма = СуммаКорректировки;
			НоваяСтрока.Сумма = -СуммаКорректировки;
						
			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Проекты", ВыборкаДетальныеЗаписи.Проект);//Малышев 2024-06-18 ONESOFT-3227
			
			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Проекты", ВыборкаДетальныеЗаписи.Проект);//Малышев 2024-06-18 ONESOFT-3227
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Пишем оставшиеся записи Учет запасов и затрат.
	НаборЗаписейЗапасы.Записать(Ложь);
	
	// Пишем оставшиеся записи Продажи.
	НаборЗаписейПродажи.Записать(Ложь);
	
	// Пишем оставшиеся записи Учет доходов и расходов.
	НаборЗаписейДоходыИРасходы.Записать(Ложь);
	
	// Пишем оставшиеся записи Управленческий.
	Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()) Тогда  //+++ Дмгг
		НаборЗаписейУправленческий.Записать(Ложь);
	КонецЕсли;  //--- Дмгг
	
	// Пишем оставшиеся записи Хозрасчетный.
	НаборЗаписейХозрасчетный.Записать(Ложь);

КонецПроцедуры

// Процедура производит расчет фактической себестоимости выпуска.
//
// Параметры:
//  Отказ        - Булево - флаг отказа проведения документа.
//
Процедура РассчитатьФактическуюСебестоимостьВыпуска(Отказ, ВидОперации, ТаблицаОшибок)
	
	// Kuzmich, 29.10.2025, (ONESOFT-4400) Отключение функционала усреднение остатков в конфигурации УНФ
	УстановитьПривилегированныйРежим(ИСТИНА);
	ОтключениеУсредненияСебестоимостиВЗакритииМесяца = Константы.ОтключениеУсредненияСебестоимостиВЗакритииМесяца.Получить();
	УстановитьПривилегированныйРежим(ЛОЖЬ);
	
	Если ЗначениеЗаполнено(ОтключениеУсредненияСебестоимостиВЗакритииМесяца) И Дата>=ОтключениеУсредненияСебестоимостиВЗакритииМесяца Тогда
		
		РассчитатьФактическуюСебестоимостьВыпуска_ОтключениеУсреднения(Отказ, ВидОперации, ТаблицаОшибок);
		
		// Очистим набор записей УзлыКорректировкиСтоимостиСписания.
		НаборЗаписей = РегистрыСведений.УзлыКорректировкиСтоимостиСписания.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписей.Записать(Истина);
		
		Возврат;
		
	КонецЕсли;
	// Kuzmich, 29.10.2025, (ONESOFT-4400) Отключение функционала усреднение остатков в конфигурации УНФ
	
	КорректировкаСписанияУчетЗатрат(ВидОперации, ТаблицаОшибок, Отказ);
	
	// Уничтожим временные таблицы.
	Запрос = Новый Запрос();
	//Запрос.Текст = "УНИЧТОЖИТЬ ТаблицаРешений; УНИЧТОЖИТЬ УчетЗатрат; УНИЧТОЖИТЬ ТаблицаУзлыКорректировкиСтоимостиСписания; УНИЧТОЖИТЬ ТаблицаОстатковПартий; УНИЧТОЖИТЬ ПериодыПартий; УНИЧТОЖИТЬ УчетЗатратВозвратыТекПериода; УНИЧТОЖИТЬ УчетЗатратСписания; УНИЧТОЖИТЬ УчетЗатратВозвратыПоРезервам; УНИЧТОЖИТЬ УчетЗатратВозвратыСвободные; УНИЧТОЖИТЬ УчетЗатратВозвраты; УНИЧТОЖИТЬ УчетЗатратБезУчетаВозвратов";
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	Запрос.Текст = "УНИЧТОЖИТЬ ТаблицаРешений; УНИЧТОЖИТЬ УчетЗатрат; УНИЧТОЖИТЬ УчетЗатратВозвратыТекПериода; УНИЧТОЖИТЬ УчетЗатратСписания; УНИЧТОЖИТЬ УчетЗатратВозвратыПоРезервам; УНИЧТОЖИТЬ УчетЗатратВозвратыСвободные; УНИЧТОЖИТЬ УчетЗатратВозвраты; УНИЧТОЖИТЬ УчетЗатратБезУчетаВозвратов";
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.ВыполнитьПакет();
	
	// Очистим набор записей УзлыКорректировкиСтоимостиСписания.
	НаборЗаписей = РегистрыСведений.УзлыКорректировкиСтоимостиСписания.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры // РассчитатьФактическуюСебестоимостьВыпуска()

#КонецОбласти

#Область Распределение

// Формирует таблицу базы распределения.
//
// Параметры:
//	БазаРаспределения - Перечисления.БазыРаспределенияРасходов
//	МассивСчетовУчета - Массив, содержащий фильтр по счетам учета
//	ФильтрПоСтруктурнаяЕдиница - фильтр по структурным единицам
//	ФильтрПоЗаказ - фильтр по заказам
//
// Возвращаемое значение:
//  ТаблицаЗначений, содержащая базу распределения.
//
Функция СформироватьТаблицуБазыРаспределения(БазаРаспределения, МассивСчетовУчета, ФильтрПоСтруктурнаяЕдиница, ФильтрПоЗаказ, СчетНезавершенноеПроизводство) Экспорт
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	
	Если БазаРаспределения = Перечисления.БазыРаспределенияРасходов.ОбъемВыпуска Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВыпускПродукцииОбороты.Организация КАК Организация,
		|	ВыпускПродукцииОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ВыпускПродукцииОбороты.Номенклатура КАК Номенклатура,
		|	ВыпускПродукцииОбороты.Характеристика КАК Характеристика,
		|	ВыпускПродукцииОбороты.Партия КАК Партия,
		//Малышев 2024-07-30 ONESOFT-3358
		//|	ВыпускПродукцииОбороты.Проект КАК Проект,  //Малышев 2024-06-18 ONESOFT-3227
		|	ВЫБОР 
		|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
		|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
		|		КОГДА ВыпускПродукцииОбороты.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
		|			ТОГДА ВыпускПродукцииОбороты.Проект
		|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
		|	КОНЕЦ КАК Проект, 
		//Малышев 2024-07-30 ONESOFT-3358
		|	ВыпускПродукцииОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ВыпускПродукцииОбороты.Спецификация КАК Спецификация,
		|	ВыпускПродукцииОбороты.Номенклатура.СчетУчетаЗатрат КАК СчетУчета,
		|	ВыпускПродукцииОбороты.Номенклатура.СчетУчетаЗатратРегл КАК СчетУчетаРегл, //Малышев 2024-09-05 ONESOFT-3441 - закоментировал
		|	ВыпускПродукцииОбороты.Номенклатура.СчетУчетаЗатрат.ТипСчета КАК СчетУчетаТипСчета,
		|	ВыпускПродукцииОбороты.КоличествоОборот КАК База
		// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
		|	,ВЫБОР
		|		КОГДА ВыпускПродукцииОбороты.Номенклатура.МетодОценки = ЗНАЧЕНИЕ(Перечисление.МетодОценкиЗапасов.FIFO)
		|			ТОГДА ВыпускПродукцииОбороты.Регистратор
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ДокументПоступления
		|ПОМЕСТИТЬ ВыпускПродукцииОборотыПред
		// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
		|ИЗ
		|	РегистрНакопления.ВыпускПродукции.Обороты(
		|			&НачДата,
		|			&КонДата,
		// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
		|			Регистратор
		// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
		|			,
		|			Организация = &Организация
		|			// ФильтрПоЗаказ
		|			// ФильтрПоСтруктурнаяЕдиница
		|	) КАК ВыпускПродукцииОбороты
		|ГДЕ
		|	ВыпускПродукцииОбороты.Организация = &Организация
		|	И ВыпускПродукцииОбороты.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение)
		|	И ВыпускПродукцииОбороты.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	СтруктурнаяЕдиница,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	Проект,
		|	ЗаказПокупателя,
		|	Спецификация,
		|	ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыпускПродукцииОборотыПред.Организация КАК Организация,
		|	ВыпускПродукцииОборотыПред.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ВыпускПродукцииОборотыПред.Номенклатура КАК Номенклатура,
		|	ВыпускПродукцииОборотыПред.Характеристика КАК Характеристика,
		|	ВыпускПродукцииОборотыПред.Партия КАК Партия,
		|	ВыпускПродукцииОборотыПред.Проект КАК Проект,
		|	ВыпускПродукцииОборотыПред.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ВыпускПродукцииОборотыПред.Спецификация КАК Спецификация,
		|	ВыпускПродукцииОборотыПред.СчетУчета КАК СчетУчета,
		|	ВыпускПродукцииОборотыПред.СчетУчетаРегл КАК СчетУчетаРегл,
		|	ВыпускПродукцииОборотыПред.СчетУчетаТипСчета КАК СчетУчетаТипСчета,
		|	СУММА(ВыпускПродукцииОборотыПред.База) КАК База,
		|	ВыпускПродукцииОборотыПред.ДокументПоступления КАК ДокументПоступления
		|ИЗ
		|	ВыпускПродукцииОборотыПред КАК ВыпускПродукцииОборотыПред
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыпускПродукцииОборотыПред.Организация,
		|	ВыпускПродукцииОборотыПред.СтруктурнаяЕдиница,
		|	ВыпускПродукцииОборотыПред.Номенклатура,
		|	ВыпускПродукцииОборотыПред.Характеристика,
		|	ВыпускПродукцииОборотыПред.Партия,
		|	ВыпускПродукцииОборотыПред.Проект,
		|	ВыпускПродукцииОборотыПред.ЗаказПокупателя,
		|	ВыпускПродукцииОборотыПред.Спецификация,
		|	ВыпускПродукцииОборотыПред.СчетУчета,
		|	ВыпускПродукцииОборотыПред.СчетУчетаРегл,
		|	ВыпускПродукцииОборотыПред.СчетУчетаТипСчета,
		|	ВыпускПродукцииОборотыПред.ДокументПоступления";
		// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// ФильтрПоЗаказ", ?(ЗначениеЗаполнено(ФильтрПоЗаказ), "И ЗаказПокупателя В (&МассивЗаказов)", ""));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// ФильтрПоСтруктурнаяЕдиница", ?(ЗначениеЗаполнено(ФильтрПоСтруктурнаяЕдиница), "И СтруктурнаяЕдиница В (&МассивСтруктурныхЕдиниц)", ""));
		
	ИначеЕсли БазаРаспределения = Перечисления.БазыРаспределенияРасходов.ПрямыеЗатраты Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	УчетЗатрат.Организация КАК Организация,
		|	УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	НЕОПРЕДЕЛЕНО КАК Номенклатура,
		|	НЕОПРЕДЕЛЕНО КАК Характеристика,
		|	НЕОПРЕДЕЛЕНО КАК Партия,
		|	НЕОПРЕДЕЛЕНО КАК Проект,   //Малышев 2024-06-18 ONESOFT-3227
		|	НЕОПРЕДЕЛЕНО КАК ЗаказПокупателя,
		|	НЕОПРЕДЕЛЕНО КАК Спецификация,
		|	УчетЗатрат.СчетУчета КАК СчетУчета,
		|	УчетЗатрат.СчетУчетаРегл КАК СчетУчетаРегл,
		|	УчетЗатрат.СчетУчета.ТипСчета КАК СчетУчетаТипСчета,
		|	УчетЗатрат.СуммаКонечныйОстаток КАК База
		// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
		|	,НЕОПРЕДЕЛЕНО КАК ДокументПоступления
		// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
		|ИЗ
		|	РегистрНакопления.Запасы.ОстаткиИОбороты(
		|			&НачДата,
		|			&КонДата,
		|			,
		|			,
		|			Организация = &Организация
		//|				И СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
		//|				И СчетУчета В (&МассивСчетовУчета)
		|				И СчетУчетаРегл = &СчетНезавершенноеПроизводство
		|			// ФильтрПоСтруктурнаяЕдиницаОбороты
		|			// ФильтрПоЗаказОбороты
		|	) КАК УчетЗатрат
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УчетЗатрат.Организация,
		|	УчетЗатрат.КоррСтруктурнаяЕдиница,
		|	УчетЗатрат.КоррНоменклатура,
		|	УчетЗатрат.КоррХарактеристика,
		|	УчетЗатрат.КоррПартия,
		//Малышев 2024-07-30 ONESOFT-3358
		//|	УчетЗатрат.КоррПроект, //Малышев 2024-06-18 ONESOFT-3227
		|	ВЫБОР 
		|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
		|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
		|		КОГДА УчетЗатрат.КоррПроект <> Значение(Справочник.Проекты.ПустаяСсылка)
		|			ТОГДА УчетЗатрат.КоррПроект
		|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
		|	КОНЕЦ КАК Проект, 
		//Малышев 2024-07-30 ONESOFT-3358
		|	УчетЗатрат.КоррЗаказПокупателя,
		|	УчетЗатрат.КоррСпецификация,
		|	УчетЗатрат.КоррСчетУчета,
		|	УчетЗатрат.КоррСчетУчетаРегл,
		|	УчетЗатрат.КоррСчетУчета.ТипСчета,
		|	СУММА(УчетЗатрат.Сумма)
		// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
		|	,УчетЗатрат.КоррДокументПоступления
		// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
		|ИЗ
		|	РегистрНакопления.Запасы КАК УчетЗатрат
		|ГДЕ
		|	УчетЗатрат.Период МЕЖДУ &НачДата И &КонДата
		|	И УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И УчетЗатрат.Организация = &Организация
		//|	И УчетЗатрат.СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
		//|	И УчетЗатрат.СчетУчета В(&МассивСчетовУчета)
		|	И УчетЗатрат.СчетУчетаРегл = &СчетНезавершенноеПроизводство
		|	И УчетЗатрат.ЗатратыНаВыпуск
		|	// ФильтрПоСтруктурнаяЕдиница
		|	// ФильтрПоЗаказ
		|
		|СГРУППИРОВАТЬ ПО
		|	УчетЗатрат.Организация,
		|	УчетЗатрат.КоррСтруктурнаяЕдиница,
		|	УчетЗатрат.КоррНоменклатура,
		|	УчетЗатрат.КоррХарактеристика,
		|	УчетЗатрат.КоррПартия,
		//Малышев 2024-07-30 ONESOFT-3358
		//|	УчетЗатрат.КоррПроект, //Малышев 2024-07-09 ONESOFT-3227
		|	ВЫБОР 
		|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
		|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
		|		КОГДА УчетЗатрат.КоррПроект <> Значение(Справочник.Проекты.ПустаяСсылка)
		|			ТОГДА УчетЗатрат.КоррПроект
		|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
		|	КОНЕЦ, 
		//Малышев 2024-07-30 ONESOFT-3358
		|	УчетЗатрат.КоррЗаказПокупателя,
		|	УчетЗатрат.КоррСпецификация,
		|	УчетЗатрат.КоррСчетУчета,
		|	УчетЗатрат.КоррСчетУчетаРегл,
		|	УчетЗатрат.КоррСчетУчета.ТипСчета
		// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
		|	,УчетЗатрат.КоррДокументПоступления
		// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
		|";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// ФильтрПоСтруктурнаяЕдиницаОбороты", ?(ЗначениеЗаполнено(ФильтрПоСтруктурнаяЕдиница), "И СтруктурнаяЕдиница В (&МассивСтруктурныхЕдиниц)", ""));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// ФильтрПоЗаказОбороты", ?(ЗначениеЗаполнено(ФильтрПоЗаказ), "И ЗаказПокупателя В (&МассивЗаказов)", ""));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// ФильтрПоСтруктурнаяЕдиница", ?(ЗначениеЗаполнено(ФильтрПоСтруктурнаяЕдиница), "И УчетЗатрат.КоррСтруктурнаяЕдиница В (&МассивСтруктурныхЕдиниц)", ""));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// ФильтрПоЗаказ", ?(ЗначениеЗаполнено(ФильтрПоЗаказ), "И УчетЗатрат.КоррЗаказПокупателя В (&МассивЗаказов)", ""));
		
		Запрос.УстановитьПараметр("МассивСчетовУчета"			 , МассивСчетовУчета);
		Запрос.УстановитьПараметр("СчетНезавершенноеПроизводство", СчетНезавершенноеПроизводство);
		
	Иначе
		Возврат ТаблицаРезультата;
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("НачДата"    , ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("КонДата"    , ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод);
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("УчетПоПроектам", ДополнительныеСвойства.УчетнаяПолитика.УчетПопроектам); //Малышев 2024-07-18
	Запрос.УстановитьПараметр("СебестоимостьЗапасовПоПроектам", ПолучитьПризнак_СебестоимостьЗапасовПоПроектам(ДополнительныеСвойства)); //Малышев 2024-07-29
		
	Если ЗначениеЗаполнено(ФильтрПоЗаказ) Тогда
		Если ТипЗнч(ФильтрПоЗаказ) = Тип("Массив") Тогда
			Запрос.УстановитьПараметр("МассивЗаказов", ФильтрПоЗаказ);
		Иначе
			МассивДляОтбора = Новый Массив;
			МассивДляОтбора.Добавить(ФильтрПоЗаказ);
			Запрос.УстановитьПараметр("МассивЗаказов", МассивДляОтбора);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФильтрПоСтруктурнаяЕдиница) Тогда
		Если ТипЗнч(ФильтрПоСтруктурнаяЕдиница) = Тип("Массив") Тогда
			Запрос.УстановитьПараметр("МассивСтруктурныхЕдиниц", ФильтрПоСтруктурнаяЕдиница);
		Иначе
			МассивДляОтбора = Новый Массив;
			МассивДляОтбора.Добавить(ФильтрПоСтруктурнаяЕдиница);
			Запрос.УстановитьПараметр("МассивСтруктурныхЕдиниц", МассивДляОтбора);
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультата;
	
КонецФункции // СформироватьТаблицуБазыРаспределения()

// Распределяет затраты.
//
// Параметры:
//  Отказ        - Булево - флаг отказа проведения документа.
//
Процедура РаспределитьЗатраты(Отказ, ТаблицаОшибок)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетЗапасовИЗатрат.Организация КАК Организация,
	|	УчетЗапасовИЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗапасовИЗатрат.СчетУчета КАК СчетУчета,
	//+++ Дмгг
	//|	УчетЗапасовИЗатрат.СчетУчета.ТипСчета КАК СчетУчетаТипСчета,
	//|	УчетЗапасовИЗатрат.СчетУчета.СпособРаспределения КАК СчетУчетаСпособРаспределения,
	//|	УчетЗапасовИЗатрат.СчетУчета.СчетЗакрытия КАК СчетУчетаСчетЗакрытия,
	|	ВЫБОР
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗапасовИЗатрат.СчетУчетаРегл.ТипСчета
	|		ИНАЧЕ УчетЗапасовИЗатрат.СчетУчета.ТипСчета
	|	КОНЕЦ КАК СчетУчетаТипСчета,
	|	ВЫБОР
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗапасовИЗатрат.СчетУчетаРегл.СпособРаспределения
	|		ИНАЧЕ УчетЗапасовИЗатрат.СчетУчета.СпособРаспределения
	|	КОНЕЦ КАК СчетУчетаСпособРаспределения,
	|	ВЫБОР
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА УчетЗапасовИЗатрат.СчетУчетаРегл.СчетЗакрытия
	|		ИНАЧЕ УчетЗапасовИЗатрат.СчетУчета.СчетЗакрытия
	|	КОНЕЦ КАК СчетУчетаСчетЗакрытия,		
	//--- Дмгг
	|	УчетЗапасовИЗатрат.СчетУчета.СчетЗакрытия.ТипСчета КАК СчетУчетаСчетЗакрытияТипСчета,
	|	УчетЗапасовИЗатрат.Номенклатура КАК Номенклатура,
	|	УчетЗапасовИЗатрат.Характеристика КАК Характеристика,
	|	УчетЗапасовИЗатрат.Партия КАК Партия,
	
	//Малышев 2024-07-30 ONESOFT-3358
	//|	УчетЗапасовИЗатрат.Проект КАК Проект,  //Малышев 2024-06-18 ONESOFT-3227
	|	ВЫБОР 
	|		КОГДА &УчетПоПроектам = Ложь ТОГДА Значение(Справочник.Проекты.ПустаяСсылка)
	|		КОГДА &СебестоимостьЗапасовПоПроектам=ЛОЖЬ ТОГДА Значение(Справочник.Проекты.БезПроекта) //Малышев 2024-07-30 ONESOFT-3358
	|		КОГДА УчетЗапасовИЗатрат.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА УчетЗапасовИЗатрат.Проект
	|		ИНАЧЕ Значение(Справочник.Проекты.БезПроекта) 
	|	КОНЕЦ КАК Проект, 
	//Малышев 2024-07-30 ONESOFT-3358
	
	|	УчетЗапасовИЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗапасовИЗатрат.СуммаОстаток КАК Сумма,
	|	УчетЗапасовИЗатрат.СчетУчетаРегл
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,УчетЗапасовИЗатрат.ДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(
	|			&КонДата,
	|			Организация = &Организация
	//+++ Дмгг
	//|				И СчетУчета.СпособРаспределения <> ЗНАЧЕНИЕ(Перечисление.БазыРаспределенияРасходов.НеРаспределять)
	|				И ВЫБОР
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА СчетУчетаРегл.СпособРаспределения
	|					ИНАЧЕ СчетУчета.СпособРаспределения
	|				КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.БазыРаспределенияРасходов.НеРаспределять)
	//--- Дмгг
	//|				И (СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
	//|					ИЛИ СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|				И (СчетУчетаРегл В (&СчетаКоственныхЗатрат)
	|					ИЛИ СчетУчетаРегл = &СчетНезаверПроизводство
	|						И Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))) КАК УчетЗапасовИЗатрат
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетУчетаСпособРаспределения,
	|	СтруктурнаяЕдиница,
	|	ЗаказПокупателя
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	СчетУчетаСпособРаспределения,
	|	СтруктурнаяЕдиница,
	|	ЗаказПокупателя";
	
	Запрос.УстановитьПараметр("Организация"			 , ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("НачДата"    			 , ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("КонДата"    			 , ДополнительныеСвойства.ДляПроведения.КонечнаяГраницаПериода);
	Запрос.УстановитьПараметр("СчетаКоственныхЗатрат", РегламентированныйУчетСервер.ПолучитьСчетаКосвенныхПроизводственныхЗатрат());
	Запрос.УстановитьПараметр("ЗакрыватьПоРеглПлануСчетов", ИспользоватьТолькоРегламентированныйПланСчетов); //+++ Дмгг
	
	//Малышев 2024-07-30 ONESOFT-3358
	Запрос.УстановитьПараметр("УчетПоПроектам"    			 , ДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	Запрос.УстановитьПараметр("СебестоимостьЗапасовПоПроектам"  , ПолучитьПризнак_СебестоимостьЗапасовПоПроектам(ДополнительныеСвойства));
	//Малышев 2024-07-30 ONESOFT-3358
		
	СтруктураПараметровРегл = РегламентированныйУчетСервер.ПолучитьСтруктуруСчетовУчета(ДополнительныеСвойства.ДляПроведения.Организация, ДополнительныеСвойства.ДляПроведения.Дата);
	Если СтруктураПараметровРегл.Выбран() Тогда
		СчетНезавершенноеПроизводство = СтруктураПараметровРегл.СчетНезавершенноеПроизводство;
	Иначе
		СчетНезавершенноеПроизводство = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СчетНезаверПроизводство", СчетНезавершенноеПроизводство);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Создадим набор записей регистра накопления Учет запасов и затрат.
	НаборЗаписейЗапасы = РегистрыНакопления.Запасы.СоздатьНаборЗаписей();
	НаборЗаписейЗапасы.Отбор.Регистратор.Установить(ДополнительныеСвойства.ДляПроведения.Ссылка);
	
	// Создадим набор записей регистра накопления Управленческий.
	НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
	НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Хозрасчетный.
	НаборЗаписейХозрасчетный = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборЗаписейХозрасчетный.Отбор.Регистратор.Установить(Ссылка);
	
	ОбходПоСпособРаспределения = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ОбходПоСпособРаспределения.Следующий() Цикл
		
		ОбходПоСтруктурнаяЕдиница = ОбходПоСпособРаспределения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		// Обход по подразделениям.
		Пока ОбходПоСтруктурнаяЕдиница.Следующий() Цикл
			
			ФильтрПоСтруктурнаяЕдиница = ОбходПоСтруктурнаяЕдиница.СтруктурнаяЕдиница;
			ОбходПоЗаказ = ОбходПоСтруктурнаяЕдиница.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			// Обход по заказам.
			Пока ОбходПоЗаказ.Следующий() Цикл
				
				ФильтрПоЗаказ = ОбходПоЗаказ.ЗаказПокупателя;
				
				Если ОбходПоЗаказ.СчетУчетаСпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять Тогда
					Продолжить;
				КонецЕСли;
				
				ОбходПоСчетамУчета = ОбходПоЗаказ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				// Обход по счетам затрат.
				Пока ОбходПоСчетамУчета.Следующий() Цикл
					
					// Сформируем таблицу базы распределения.
					ТаблицаБазы = СформироватьТаблицуБазыРаспределения(
						ОбходПоСчетамУчета.СчетУчетаСпособРаспределения,
						ОбходПоСчетамУчета.СчетУчета.СчетаУчета.ВыгрузитьКолонку("СчетУчета"),
						ФильтрПоСтруктурнаяЕдиница,
						ФильтрПоЗаказ,
						СчетНезавершенноеПроизводство
					);
					
					Если ТаблицаБазы.Количество() = 0 Тогда
						ТаблицаБазы = СформироватьТаблицуБазыРаспределения(
							ОбходПоСчетамУчета.СчетУчетаСпособРаспределения,
							ОбходПоСчетамУчета.СчетУчета.СчетаУчета.ВыгрузитьКолонку("СчетУчета"),
							Неопределено,
							ФильтрПоЗаказ,
							СчетНезавершенноеПроизводство
						);
					КонецЕсли;
				
					// Проверим таблицу базы распределения.
					Если ТаблицаБазы.Количество() = 0 Тогда
						ОписаниеОшибки = СформироватьОписаниеОшибкиРаспределенияЗатрат(
							ОбходПоСчетамУчета.СчетУчета,
							ОбходПоСчетамУчета.СчетУчетаСпособРаспределения,
							ФильтрПоЗаказ,
							ОбходПоСчетамУчета.Сумма
						);
						ДобавитьОшибкуВТаблицу(ОписаниеОшибки, "РаспределениеЗатрат", ТаблицаОшибок, ФильтрПоЗаказ);
						Продолжить;
					КонецЕсли;
					
					ВсегоБазаРаспределения = ТаблицаБазы.Итог("База");
					КоличествоНаправлений  = ТаблицаБазы.Количество() - 1;
					
					// Распределяем сумму.
					Если ОбходПоСчетамУчета.Сумма <> 0 Тогда
						
						СуммаКРаспределению = ОбходПоСчетамУчета.Сумма;
						СуммаРаспределили = 0;
					
						Для каждого НаправлениеРаспределения Из ТаблицаБазы Цикл
							
							СуммаЗатрат = ?(СуммаКРаспределению = 0, 0, Окр(НаправлениеРаспределения.База / ВсегоБазаРаспределения * СуммаКРаспределению, 2, 1));
							СуммаРаспределили = СуммаРаспределили + СуммаЗатрат;
							
							// Если это последняя строка - скорректируем сумму в ней на ошибку округления.
							Если ТаблицаБазы.Индекс(НаправлениеРаспределения) = КоличествоНаправлений Тогда
								СуммаЗатрат = СуммаЗатрат + СуммаКРаспределению - СуммаРаспределили;
								СуммаРаспределили = СуммаРаспределили + СуммаЗатрат;
							КонецЕсли;
							
							Если СуммаЗатрат <> 0 Тогда
								
								Если ОбходПоСчетамУчета.СчетУчетаТипСчета = Перечисления.ТипыСчетов.КосвенныеЗатраты
									ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяКосвенныйПоПроизводственнымЗатратам(ОбходПоСчетамУчета.СчетУчетаРегл) Тогда // косвенные распределяются через счет закрытия
								
									СтрокаДвижения = Новый Структура;
									СтрокаДвижения.Вставить("Организация"           , ОбходПоСчетамУчета.Организация);
									СтрокаДвижения.Вставить("СтруктурнаяЕдиница"    , ОбходПоСчетамУчета.СтруктурнаяЕдиница);
									СтрокаДвижения.Вставить("СчетУчета"             , ОбходПоСчетамУчета.СчетУчета);
									СтрокаДвижения.Вставить("СчетУчетаРегл"         , ОбходПоСчетамУчета.СчетУчетаРегл);
									СтрокаДвижения.Вставить("СчетУчетаТипСчета"     , ОбходПоСчетамУчета.СчетУчетаТипСчета);
									СтрокаДвижения.Вставить("Номенклатура"          , ОбходПоСчетамУчета.Номенклатура);
									СтрокаДвижения.Вставить("Характеристика"        , ОбходПоСчетамУчета.Характеристика);
									СтрокаДвижения.Вставить("Партия"                , ОбходПоСчетамУчета.Партия);
									СтрокаДвижения.Вставить("Проект"                , ОбходПоСчетамУчета.Проект);  //Малышев 2024-06-18 ONESOFT-3227
									СтрокаДвижения.Вставить("ЗаказПокупателя"       , ОбходПоСчетамУчета.ЗаказПокупателя);
									СтрокаДвижения.Вставить("КоррСтруктурнаяЕдиница", НаправлениеРаспределения.СтруктурнаяЕдиница);
									СтрокаДвижения.Вставить("КоррСчетУчета"         , ОбходПоСчетамУчета.СчетУчетаСчетЗакрытия);
									СтрокаДвижения.Вставить("КоррСчетУчетаРегл"     , СчетНезавершенноеПроизводство);
									СтрокаДвижения.Вставить("КоррСчетУчетаТипСчета" , ОбходПоСчетамУчета.СчетУчетаСчетЗакрытияТипСчета);
									СтрокаДвижения.Вставить("КоррНоменклатура"      , Справочники.Номенклатура.ПустаяСсылка());
									СтрокаДвижения.Вставить("КоррХарактеристика"    , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
									СтрокаДвижения.Вставить("КоррПартия"            , Справочники.ПартииНоменклатуры.ПустаяСсылка());
									
									//Малышев 2024-06-18 ONESOFT-3227
									Если Константы.ФункциональнаяОпцияУчетПоПроектам.Получить()= Истина Тогда
										СтрокаДвижения.Вставить("КоррПроект"            , Справочники.Проекты.БезПроекта);  
									Иначе     
										СтрокаДвижения.Вставить("КоррПроект"            , Справочники.Проекты.ПустаяСсылка());
									КонецЕсли;	
											
									СтрокаДвижения.Вставить("КоррЗаказПокупателя"   , Документы.ЗаказПокупателя.ПустаяСсылка());
									СтрокаДвижения.Вставить("ДокументПродажи"       , Неопределено);
									СтрокаДвижения.Вставить("ЗатратыНаВыпуск"       , Ложь);
									СтрокаДвижения.Вставить("Спецификация"          , Справочники.Спецификации.ПустаяСсылка());
									СтрокаДвижения.Вставить("КоррСпецификация"      , Справочники.Спецификации.ПустаяСсылка());
									СтрокаДвижения.Вставить("СтавкаНДС"             , Справочники.СтавкиНДС.ПустаяСсылка());
									СтрокаДвижения.Вставить("Подразделение"         , ОбходПоСчетамУчета.СтруктурнаяЕдиница);
									// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
									СтрокаДвижения.Вставить("ДокументПоступления"   , ОбходПоСчетамУчета.ДокументПоступления);
									СтрокаДвижения.Вставить("КоррДокументПоступления", НЕОПРЕДЕЛЕНО);
									// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
									
									// Движения по регистру Учет запасов и затрат.
									СформироватьДвиженияПоРегиструУчетаЗатрат(
										НаборЗаписейЗапасы,
										НаборЗаписейУправленческий,
										НаборЗаписейХозрасчетный,
										СтрокаДвижения,
										СуммаЗатрат,
										Истина
									);
									
									Если ЗначениеЗаполнено(НаправлениеРаспределения.Номенклатура) Тогда
										
										СтрокаДвижения = Новый Структура;
										СтрокаДвижения.Вставить("Организация"           , ОбходПоСчетамУчета.Организация);
										СтрокаДвижения.Вставить("СтруктурнаяЕдиница"    , НаправлениеРаспределения.СтруктурнаяЕдиница);
										СтрокаДвижения.Вставить("СчетУчета"             , ОбходПоСчетамУчета.СчетУчетаСчетЗакрытия);
										СтрокаДвижения.Вставить("СчетУчетаРегл"         , СчетНезавершенноеПроизводство);
										СтрокаДвижения.Вставить("СчетУчетаТипСчета"     , ОбходПоСчетамУчета.СчетУчетаСчетЗакрытияТипСчета);
										СтрокаДвижения.Вставить("Номенклатура"          , Справочники.Номенклатура.ПустаяСсылка());
										СтрокаДвижения.Вставить("Характеристика"        , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
										СтрокаДвижения.Вставить("Партия"                , Справочники.ПартииНоменклатуры.ПустаяСсылка());
										
										//Малышев 2024-06-18 ONESOFT-3227
										Если Константы.ФункциональнаяОпцияУчетПоПроектам.Получить()= Истина Тогда
											СтрокаДвижения.Вставить("Проект"                , Справочники.Проекты.БезПроекта);  
										Иначе     
											СтрокаДвижения.Вставить("Проект"                , Справочники.Проекты.ПустаяСсылка());
										КонецЕсли;	
											
										
										СтрокаДвижения.Вставить("ЗаказПокупателя"       , Документы.ЗаказПокупателя.ПустаяСсылка());
										СтрокаДвижения.Вставить("КоррСтруктурнаяЕдиница", НаправлениеРаспределения.СтруктурнаяЕдиница);
										СтрокаДвижения.Вставить("КоррСчетУчета"         , НаправлениеРаспределения.СчетУчета);
										СтрокаДвижения.Вставить("КоррСчетУчетаРегл"     , НаправлениеРаспределения.СчетУчетаРегл);
										СтрокаДвижения.Вставить("КоррСчетУчетаТипСчета" , НаправлениеРаспределения.СчетУчетаТипСчета);
										СтрокаДвижения.Вставить("КоррНоменклатура"      , НаправлениеРаспределения.Номенклатура);
										СтрокаДвижения.Вставить("КоррХарактеристика"    , НаправлениеРаспределения.Характеристика);
										СтрокаДвижения.Вставить("КоррПартия"            , НаправлениеРаспределения.Партия);
										СтрокаДвижения.Вставить("КоррПроект"            , НаправлениеРаспределения.Проект);  //Малышев 2024-06-18 ONESOFT-3227
										СтрокаДвижения.Вставить("КоррЗаказПокупателя"   , НаправлениеРаспределения.ЗаказПокупателя);
										СтрокаДвижения.Вставить("ДокументПродажи"       , Неопределено);
										СтрокаДвижения.Вставить("ЗатратыНаВыпуск"       , Истина);
										СтрокаДвижения.Вставить("Спецификация"          , Справочники.Спецификации.ПустаяСсылка());
										СтрокаДвижения.Вставить("КоррСпецификация"      , НаправлениеРаспределения.Спецификация);
										СтрокаДвижения.Вставить("СтавкаНДС"             , Справочники.СтавкиНДС.ПустаяСсылка());
										СтрокаДвижения.Вставить("Подразделение"         , НаправлениеРаспределения.СтруктурнаяЕдиница);
										
										//+++ Дмгг
										СтрокаДвижения.Вставить("ДопСвойства"         	, Истина);
										СтрокаДвижения.Вставить("ПодразделениеДт"       , НаправлениеРаспределения.СтруктурнаяЕдиница);
										СтрокаДвижения.Вставить("ПодразделениеКт"       , ОбходПоСчетамУчета.СтруктурнаяЕдиница);
										СтрокаДвижения.Вставить("СтруктурнаяЕдиницаДт"  , НаправлениеРаспределения.СтруктурнаяЕдиница);
										СтрокаДвижения.Вставить("СтруктурнаяЕдиницаКт"  , НаправлениеРаспределения.СтруктурнаяЕдиница);
										СтрокаДвижения.Вставить("НоменклатураДт"        , НаправлениеРаспределения.Номенклатура);
										СтрокаДвижения.Вставить("НоменклатураКт"        , ОбходПоСчетамУчета.Номенклатура);
										СтрокаДвижения.Вставить("ХарактеристикаДт"      , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
										СтрокаДвижения.Вставить("ХарактеристикаКт"      , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
										//--- Дмгг
										// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
										СтрокаДвижения.Вставить("ДокументПоступления"   , НЕОПРЕДЕЛЕНО);
										СтрокаДвижения.Вставить("КоррДокументПоступления", НаправлениеРаспределения.ДокументПоступления);
										// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
									
										// Движения по регистру Учет запасов и затрат.
										СформироватьДвиженияПоРегиструУчетаЗатрат(
											НаборЗаписейЗапасы,
											НаборЗаписейУправленческий,
											НаборЗаписейХозрасчетный,
											СтрокаДвижения,
											СуммаЗатрат,
											Истина
										);
										
									КонецЕсли;
									
								ИначеЕсли ЗначениеЗаполнено(НаправлениеРаспределения.Номенклатура) Тогда // распределение прямых
									
									СтрокаДвижения = Новый Структура;
									СтрокаДвижения.Вставить("Организация"           , ОбходПоСчетамУчета.Организация);
									СтрокаДвижения.Вставить("СтруктурнаяЕдиница"    , ОбходПоСчетамУчета.СтруктурнаяЕдиница);
									СтрокаДвижения.Вставить("СчетУчета"             , ОбходПоСчетамУчета.СчетУчета);
									СтрокаДвижения.Вставить("СчетУчетаРегл"         , ОбходПоСчетамУчета.СчетУчетаРегл);
									СтрокаДвижения.Вставить("СчетУчетаТипСчета"     , ОбходПоСчетамУчета.СчетУчетаТипСчета);
									СтрокаДвижения.Вставить("Номенклатура"          , ОбходПоСчетамУчета.Номенклатура);
									СтрокаДвижения.Вставить("Характеристика"        , ОбходПоСчетамУчета.Характеристика);
									СтрокаДвижения.Вставить("Партия"                , ОбходПоСчетамУчета.Партия);
									СтрокаДвижения.Вставить("Проект"                , ОбходПоСчетамУчета.Проект);       //Малышев 2024-06-18 ONESOFT-3227
									СтрокаДвижения.Вставить("ЗаказПокупателя"       , ОбходПоСчетамУчета.ЗаказПокупателя);
									СтрокаДвижения.Вставить("КоррСтруктурнаяЕдиница", НаправлениеРаспределения.СтруктурнаяЕдиница);
									СтрокаДвижения.Вставить("КоррСчетУчета"         , НаправлениеРаспределения.СчетУчета);
									СтрокаДвижения.Вставить("КоррСчетУчетаРегл"     , НаправлениеРаспределения.СчетУчетаРегл);
									СтрокаДвижения.Вставить("КоррСчетУчетаТипСчета" , НаправлениеРаспределения.СчетУчетаТипСчета);
									СтрокаДвижения.Вставить("КоррНоменклатура"      , НаправлениеРаспределения.Номенклатура);
									СтрокаДвижения.Вставить("КоррХарактеристика"    , НаправлениеРаспределения.Характеристика);
									СтрокаДвижения.Вставить("КоррПартия"            , НаправлениеРаспределения.Партия);
									СтрокаДвижения.Вставить("КоррПроект"            , НаправлениеРаспределения.Проект);   //Малышев 2024-06-18 ONESOFT-3227
									СтрокаДвижения.Вставить("КоррЗаказПокупателя"   , НаправлениеРаспределения.ЗаказПокупателя);
									СтрокаДвижения.Вставить("ДокументПродажи"       , Неопределено);
									СтрокаДвижения.Вставить("ЗатратыНаВыпуск"       , Истина);
									СтрокаДвижения.Вставить("Спецификация"          , Справочники.Спецификации.ПустаяСсылка());
									СтрокаДвижения.Вставить("КоррСпецификация"      , НаправлениеРаспределения.Спецификация);
									СтрокаДвижения.Вставить("СтавкаНДС"             , Справочники.СтавкиНДС.ПустаяСсылка());
									СтрокаДвижения.Вставить("Подразделение"         , ОбходПоСчетамУчета.СтруктурнаяЕдиница);
									// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
									СтрокаДвижения.Вставить("ДокументПоступления"   , ОбходПоСчетамУчета.ДокументПоступления);
									СтрокаДвижения.Вставить("КоррДокументПоступления", НаправлениеРаспределения.ДокументПоступления);
									// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
									
									// Движения по регистру Учет запасов и затрат.
									СформироватьДвиженияПоРегиструУчетаЗатрат(
										НаборЗаписейЗапасы,
										НаборЗаписейУправленческий,
										НаборЗаписейХозрасчетный,
										СтрокаДвижения,
										СуммаЗатрат,
										Истина
									);
									
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЦикла;
						
						Если СуммаРаспределили = 0 Тогда
							ОписаниеОшибки = СформироватьОписаниеОшибкиРаспределенияЗатрат(
								ОбходПоСчетамУчета.СчетУчета,
								ОбходПоСчетамУчета.СчетУчетаСпособРаспределения,
								ФильтрПоЗаказ,
								ОбходПоСчетамУчета.Сумма
							);
							ДобавитьОшибкуВТаблицу(ОписаниеОшибки, "РаспределениеЗатрат", ТаблицаОшибок, ФильтрПоЗаказ);
							Продолжить;
						КонецЕсли;
						
					КонецЕсли
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Пишем оставшиеся записи Учет запасов и затрат.
	НаборЗаписейЗапасы.Записать(Ложь);
	
	// Пишем оставшиеся записи Управленческий.
	Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()) Тогда  //+++ Дмгг
		НаборЗаписейУправленческий.Записать(Ложь);
	КонецЕсли;  //--- Дмгг
	
	// Пишем оставшиеся записи Хозрасчетный.
	НаборЗаписейХозрасчетный.Записать(Ложь);
	
КонецПроцедуры // РаспределитьЗатраты()

#КонецОбласти

#Область РасчетФинансовогоРезультата

// Формирует таблицу базы распределения.
//
// Параметры:
//	БазаРаспределения - Перечисления.БазыРаспределенияРасходов
//	МассивСчетовУчета - Массив, содержащий фильтр по счетам учета
//	ФильтрПоСтруктурнаяЕдиница - фильтр по структурным единицам
//	ФильтрПоЗаказ - фильтр по заказам
//
// Возвращаемое значение:
//  ТаблицаЗначений, содержащая базу распределения.
//
Функция СформироватьТаблицуБазыРаспределенияФинансовогоРезультата(БазаРаспределения, ФильтрПоСтруктурнаяЕдиница, ФильтрПоНаправлениеДеятельности, ФильтрПоЗаказ) Экспорт
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	
	Если БазаРаспределения = Перечисления.БазыРаспределенияРасходов.ВыручкаОтПродаж
	 ИЛИ БазаРаспределения = Перечисления.БазыРаспределенияРасходов.СебестоимостьПродаж
	 ИЛИ БазаРаспределения = Перечисления.БазыРаспределенияРасходов.ОбъемПродаж
	 ИЛИ БазаРаспределения = Перечисления.БазыРаспределенияРасходов.ВаловаяПрибыль Тогда
		
		Если БазаРаспределения = Перечисления.БазыРаспределенияРасходов.ВыручкаОтПродаж Тогда
			ТекстБазы = "ПродажиОбороты.СуммаОборот";
		ИначеЕсли БазаРаспределения = Перечисления.БазыРаспределенияРасходов.СебестоимостьПродаж Тогда 
			ТекстБазы = "ПродажиОбороты.СебестоимостьОборот";
		ИначеЕсли БазаРаспределения = Перечисления.БазыРаспределенияРасходов.ВаловаяПрибыль Тогда 
			ТекстБазы = "ПродажиОбороты.СуммаОборот - ПродажиОбороты.СебестоимостьОборот";
		Иначе
			ТекстБазы = "ПродажиОбороты.КоличествоОборот";
		КонецЕсли; 
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПродажиОбороты.Организация КАК Организация,
		|	ПродажиОбороты.Номенклатура.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ПродажиОбороты.ЗаказПокупателя КАК Заказ,
		|	ПродажиОбороты.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж КАК СчетУчетаВыручкиОтПродаж,
		|	ПродажиОбороты.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж КАК СчетУчетаСебестоимостиПродаж,
		|	ПродажиОбороты.Номенклатура.НаправлениеДеятельности.СчетУчетаПрибыли КАК СчетУчетаПрибыли,
		|	ПродажиОбороты.Номенклатура.НаправлениеДеятельности.СчетУчетаПрибылиРегл КАК СчетУчетаПрибылиРегл,
		|	// ТекстБазы КАК База,
		|	ПродажиОбороты.Подразделение КАК СтруктурнаяЕдиница
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			&НачДата,
		|			&КонДата,
		|			Авто,
		|			Организация = &Организация
		|				// ФильтрПоСтруктурнаяЕдиница
		|				// ФильтрПоНаправлениеДеятельности
		|				// ФильтрПоЗаказ
		|			) КАК ПродажиОбороты
		|ГДЕ
		|	ПродажиОбороты.Номенклатура.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// ФильтрПоСтруктурнаяЕдиница", ?(ЗначениеЗаполнено(ФильтрПоСтруктурнаяЕдиница), "И Подразделение В (&МассивСтруктурныхЕдиниц)", ""));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// ФильтрПоНаправлениеДеятельности", ?(ЗначениеЗаполнено(ФильтрПоНаправлениеДеятельности), "И Номенклатура.НаправлениеДеятельности В (&МассивНаправленийДеятельности)", ""));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// ФильтрПоЗаказ", ?(ЗначениеЗаполнено(ФильтрПоЗаказ), "И ЗаказПокупателя В (&МассивЗаказов)", ""));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// ТекстБазы", ТекстБазы);
		
	Иначе
		Возврат ТаблицаРезультата;
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("НачДата"    , ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("КонДата"    , ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод);
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
		
	Если ЗначениеЗаполнено(ФильтрПоЗаказ) Тогда
		Если ТипЗнч(ФильтрПоЗаказ) = Тип("Массив") Тогда
			Запрос.УстановитьПараметр("МассивЗаказов", ФильтрПоЗаказ);
		Иначе
			МассивДляОтбора = Новый Массив;
			МассивДляОтбора.Добавить(ФильтрПоЗаказ);
			Запрос.УстановитьПараметр("МассивЗаказов", МассивДляОтбора);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФильтрПоСтруктурнаяЕдиница) Тогда
		Если ТипЗнч(ФильтрПоСтруктурнаяЕдиница) = Тип("Массив") Тогда
			Запрос.УстановитьПараметр("МассивСтруктурныхЕдиниц", ФильтрПоСтруктурнаяЕдиница);
		Иначе
			МассивДляОтбора = Новый Массив;
			МассивДляОтбора.Добавить(ФильтрПоСтруктурнаяЕдиница);
			Запрос.УстановитьПараметр("МассивСтруктурныхЕдиниц", МассивДляОтбора);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФильтрПоНаправлениеДеятельности) Тогда
		Если ТипЗнч(ФильтрПоНаправлениеДеятельности) = Тип("Массив") Тогда
			Запрос.УстановитьПараметр("МассивНаправленийДеятельности", ФильтрПоНаправлениеДеятельности);
		Иначе
			МассивДляОтбора = Новый Массив;
			МассивДляОтбора.Добавить(ФильтрПоНаправлениеДеятельности);
			Запрос.УстановитьПараметр("МассивНаправленийДеятельности", ФильтрПоНаправлениеДеятельности);
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультата;
	
КонецФункции // СформироватьТаблицуБазыРаспределения()

#КонецОбласти

// Рассчитывает финансовый результат.
//
// Параметры:
//  Отказ        - Булево - флаг отказа проведения документа.
//
Процедура РассчитатьФинансовыйРезультат(Отказ, ТаблицаОшибок)
	
	// 1) Прямое распределение.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоходыИРасходыОбороты.Организация КАК Организация,
	|	ДоходыИРасходыОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ДоходыИРасходыОбороты.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДоходыИРасходыОбороты.НаправлениеДеятельности.СчетУчетаПрибыли КАК СчетУчетаПрибыли,
	|	ДоходыИРасходыОбороты.НаправлениеДеятельности.СчетУчетаПрибылиРегл КАК СчетУчетаПрибылиРегл,
	|	ДоходыИРасходыОбороты.ЗаказПокупателя КАК Заказ,
	|	ДоходыИРасходыОбороты.СчетУчета КАК СчетУчета,
	|	ДоходыИРасходыОбороты.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ДоходыИРасходыОбороты.Аналитика КАК Аналитика,
	|	ДоходыИРасходыОбороты.СуммаДоходовОборот КАК СуммаДоходов,
	|	ДоходыИРасходыОбороты.СуммаРасходовОборот КАК СуммаРасходов
	|ИЗ
	|	РегистрНакопления.ДоходыИРасходы.Обороты(
	|			&НачДата,
	|			&КонДата,
	|			Авто,
	|			Организация = &Организация
	//+++ Дмгг
	//|				И (СчетУчета.СпособРаспределения = ЗНАЧЕНИЕ(Перечисление.БазыРаспределенияРасходов.НеРаспределять)
	|				И (ВЫБОР
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА СчетУчетаРегл.СпособРаспределения
	|					ИНАЧЕ СчетУчета.СпособРаспределения
	//|				КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.БазыРаспределенияРасходов.НеРаспределять)
	|				КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.БазыРаспределенияРасходов.НеРаспределять)
	//--- Дмгг
	|					ИЛИ (ВЫБОР
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл = СчетУчетаРегл
	|					ИНАЧЕ НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж = СчетУчета
	|					Конец
	|						ИЛИ ВЫБОР
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл = СчетУчетаРегл
	|					ИНАЧЕ НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж = СчетУчета
	|					Конец)
	|						И НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее))) КАК ДоходыИРасходыОбороты";
	
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("НачДата"    , ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("КонДата"    , ДополнительныеСвойства.ДляПроведения.КонечнаяГраницаПериода);
	Запрос.УстановитьПараметр("ЗакрыватьПоРеглПлануСчетов", ИспользоватьТолькоРегламентированныйПланСчетов); //+++ Дмгг
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда

		// Создадим набор записей регистра накопления Финансовый результат.
		НаборЗаписейФинансовыйРезультат = РегистрыНакопления.ФинансовыйРезультат.СоздатьНаборЗаписей();
		НаборЗаписейФинансовыйРезультат.Отбор.Регистратор.Установить(ДополнительныеСвойства.ДляПроведения.Ссылка);
		
		// Создадим набор записей регистра бухгалтерии "Управленческий".
		НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
		НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
		
		// Создадим набор записей регистра бухгалтерии "Хозрасчетный".
		//НаборЗаписейХозрасчетный = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
		//НаборЗаписейХозрасчетный.Отбор.Регистратор.Установить(Ссылка);
		
	КонецЕсли;
	
	ВыборкаРезультатЗапроса = РезультатЗапроса.Выбрать();

	Пока ВыборкаРезультатЗапроса.Следующий() Цикл
		
		// Движения по регистру Финансовый результат.
		НоваяСтрока = НаборЗаписейФинансовыйРезультат.Добавить();
		НоваяСтрока.Период = Дата;
		НоваяСтрока.Регистратор = Ссылка;
		НоваяСтрока.Организация = ВыборкаРезультатЗапроса.Организация;
		НоваяСтрока.СтруктурнаяЕдиница = ВыборкаРезультатЗапроса.СтруктурнаяЕдиница;
		НоваяСтрока.НаправлениеДеятельности = ?(
			ЗначениеЗаполнено(ВыборкаРезультатЗапроса.НаправлениеДеятельности), ВыборкаРезультатЗапроса.НаправлениеДеятельности, Справочники.НаправленияДеятельности.ОсновноеНаправление
		);
		НоваяСтрока.ЗаказПокупателя = ВыборкаРезультатЗапроса.Заказ;
		НоваяСтрока.СчетУчета = ВыборкаРезультатЗапроса.СчетУчета;
		НоваяСтрока.СчетУчетаРегл = ВыборкаРезультатЗапроса.СчетУчетаРегл;
		НоваяСтрока.Аналитика = ВыборкаРезультатЗапроса.Аналитика;
		
		Если ВыборкаРезультатЗапроса.СуммаДоходов <> 0 Тогда
			НоваяСтрока.СуммаДоходов = ВыборкаРезультатЗапроса.СуммаДоходов;
		ИначеЕсли ВыборкаРезультатЗапроса.СуммаРасходов <> 0 Тогда
			НоваяСтрока.СуммаРасходов = ВыборкаРезультатЗапроса.СуммаРасходов;
		КонецЕсли;
		
		НоваяСтрока.СодержаниеПроводки = "Финансовый результат";
		
		// Движения по регистру Управленческий.
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		НоваяСтрока.Период = Дата;
		НоваяСтрока.Регистратор = Ссылка;
		НоваяСтрока.Организация = ВыборкаРезультатЗапроса.Организация;
		НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
		
		Если ВыборкаРезультатЗапроса.СуммаДоходов <> 0 Тогда
			НоваяСтрока.СчетДт = ВыборкаРезультатЗапроса.СчетУчета;
			НоваяСтрока.СчетКт = ?(
				ЗначениеЗаполнено(ВыборкаРезультатЗапроса.НаправлениеДеятельности),
				ВыборкаРезультатЗапроса.СчетУчетаПрибыли,
				Справочники.НаправленияДеятельности.ОсновноеНаправление.СчетУчетаПрибыли
			);
			НоваяСтрока.Сумма = ВыборкаРезультатЗапроса.СуммаДоходов; 
		ИначеЕсли ВыборкаРезультатЗапроса.СуммаРасходов <> 0 Тогда
			НоваяСтрока.СчетДт = ?(
				ЗначениеЗаполнено(ВыборкаРезультатЗапроса.НаправлениеДеятельности),
				ВыборкаРезультатЗапроса.СчетУчетаПрибыли,
				Справочники.НаправленияДеятельности.ОсновноеНаправление.СчетУчетаПрибыли
			);
			НоваяСтрока.СчетКт = ВыборкаРезультатЗапроса.СчетУчета;
			НоваяСтрока.Сумма = ВыборкаРезультатЗапроса.СуммаРасходов;
		КонецЕсли;
		
		НоваяСтрока.Содержание = "Финансовый результат";
		
		// Движения по регистру Хозрасчетный.
		//НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
		//НоваяСтрока.Период = Дата;     
		//НоваяСтрока.Регистратор = Ссылка;
		//НоваяСтрока.Организация = ВыборкаРезультатЗапроса.Организация;
		////ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатЗапроса);
		//Если ВыборкаРезультатЗапроса.СуммаДоходов <> 0 Тогда
		//	НоваяСтрока.СчетДт = ВыборкаРезультатЗапроса.СчетУчетаРегл;
		//	НоваяСтрока.СчетКт = ?(
		//		ЗначениеЗаполнено(ВыборкаРезультатЗапроса.НаправлениеДеятельности),
		//		ВыборкаРезультатЗапроса.СчетУчетаПрибылиРегл,
		//		Справочники.НаправленияДеятельности.ОсновноеНаправление.СчетУчетаПрибылиРегл
		//	);
		//	НоваяСтрока.Сумма = ВыборкаРезультатЗапроса.СуммаДоходов; 
		//ИначеЕсли ВыборкаРезультатЗапроса.СуммаРасходов <> 0 Тогда
		//	НоваяСтрока.СчетДт = ?(
		//		ЗначениеЗаполнено(ВыборкаРезультатЗапроса.НаправлениеДеятельности),
		//		ВыборкаРезультатЗапроса.СчетУчетаПрибылиРегл,
		//		Справочники.НаправленияДеятельности.ОсновноеНаправление.СчетУчетаПрибылиРегл
		//	);
		//	НоваяСтрока.СчетКт = ВыборкаРезультатЗапроса.СчетУчетаРегл;
		//	НоваяСтрока.Сумма = ВыборкаРезультатЗапроса.СуммаРасходов;
		//КонецЕсли;
		
		//Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
		//	НоваяСтрока.ВалютаДт = ВыборкаДетальныеЗаписи.Валюта;
		//Иначе
		//	НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
		//КонецЕсли; 
		//
		//Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
		//	НоваяСтрока.ВалютаКт = ВыборкаДетальныеЗаписи.Валюта;
		//Иначе
		//	НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
		//КонецЕсли; 
		
		//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", СтрокаДвижения.Номенклатура);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаРезультатЗапроса.СтруктурнаяЕдиница);
		//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", СтрокаДвижения.КоррСтруктурнаяЕдиница);
		
		//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", СтрокаДвижения.Номенклатура);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаРезультатЗапроса.СтруктурнаяЕдиница);
		//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", СтрокаДвижения.КоррСтруктурнаяЕдиница);
		
		НоваяСтрока.Содержание = "Финансовый результат";

		
	КонецЦикла;
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		// Пишем оставшиеся записи Финансовый результат.
		НаборЗаписейФинансовыйРезультат.Записать(Ложь);
		
		// Пишем оставшиеся записи Управленческий.
		Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Дата) Тогда //+++ Дмгг

			НаборЗаписейУправленческий.Записать(Ложь);
			
		КонецЕсли;	//--- Дмгг	
		// Пишем оставшиеся записи Хозрасчетный.
		//НаборЗаписейХозрасчетный.Записать(Ложь);
		
	КонецЕсли;
	
	// 2) Распределение по базе распределения.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоходыИРасходыОбороты.Организация КАК Организация,
	|	ДоходыИРасходыОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ДоходыИРасходыОбороты.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДоходыИРасходыОбороты.НаправлениеДеятельности.СчетУчетаПрибыли КАК СчетУчетаПрибыли,
	|	ДоходыИРасходыОбороты.НаправлениеДеятельности.СчетУчетаПрибылиРегл КАК СчетУчетаПрибылиРегл,
	|	ДоходыИРасходыОбороты.ЗаказПокупателя КАК Заказ,
	|	ДоходыИРасходыОбороты.СчетУчета КАК СчетУчета,
	|	ДоходыИРасходыОбороты.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ДоходыИРасходыОбороты.Аналитика КАК Аналитика,
	//+++ Дмгг
	//|	ДоходыИРасходыОбороты.СчетУчета.СпособРаспределения КАК СчетУчетаСпособРаспределения,
	|	ВЫБОР
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА ДоходыИРасходыОбороты.СчетУчетаРегл.СпособРаспределения
	|		ИНАЧЕ ДоходыИРасходыОбороты.СчетУчета.СпособРаспределения
	|	КОНЕЦ КАК СчетУчетаСпособРаспределения,
	//--- Дмгг
	|	ДоходыИРасходыОбороты.СуммаДоходовОборот КАК СуммаДоходов,
	|	ДоходыИРасходыОбороты.СуммаРасходовОборот КАК СуммаРасходов
	|ИЗ
	|	РегистрНакопления.ДоходыИРасходы.Обороты(
	|			&НачДата,
	|			&КонДата,
	|			Авто,
	|			Организация = &Организация
	//+++ Дмгг
	//|				И СчетУчета.СпособРаспределения <> ЗНАЧЕНИЕ(Перечисление.БазыРаспределенияРасходов.НеРаспределять)
	|				И ВЫБОР
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА СчетУчетаРегл.СпособРаспределения
	|					ИНАЧЕ СчетУчета.СпособРаспределения
	|				КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.БазыРаспределенияРасходов.НеРаспределять)
	//--- Дмгг
	//|				И (НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж <> СчетУчета
	//|						И НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж <> СчетУчета 
	|				И (ВЫБОР
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл <> СчетУчетаРегл
	|					ИНАЧЕ НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж <> СчетУчета 
	|					КОНЕЦ
	|						И ВЫБОР
	|					КОГДА &ЗакрыватьПоРеглПлануСчетов
	|						ТОГДА НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл <> СчетУчетаРегл
	|					ИНАЧЕ НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж <> СчетУчета
	|					КОНЕЦ
	|					ИЛИ НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|					ИЛИ НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))) КАК ДоходыИРасходыОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетУчетаСпособРаспределения,
	|	СтруктурнаяЕдиница,
	|	НаправлениеДеятельности,
	|	Заказ
	|ИТОГИ
	|	СУММА(СуммаДоходов),
	|	СУММА(СуммаРасходов)
	|ПО
	|	СчетУчетаСпособРаспределения,
	|	СтруктурнаяЕдиница,
	|	НаправлениеДеятельности,
	|	Заказ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		// Создадим набор записей регистра накопления Учет запасов и затрат.
		НаборЗаписейФинансовыйРезультат = РегистрыНакопления.ФинансовыйРезультат.СоздатьНаборЗаписей();
		НаборЗаписейФинансовыйРезультат.Отбор.Регистратор.Установить(ДополнительныеСвойства.ДляПроведения.Ссылка);
		
		// Создадим набор записей регистра бухгалтерии "Управленческий".
		НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
		НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
		
		// Создадим набор записей регистра бухгалтерии "Хозрасчетный".
		//НаборЗаписейХозрасчетный = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
		//НаборЗаписейХозрасчетный.Отбор.Регистратор.Установить(Ссылка);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ОбходПоСпособРаспределения = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Обход по способам распределения.
	Пока ОбходПоСпособРаспределения.Следующий() Цикл
		
		ОбходПоСтруктурнаяЕдиница = ОбходПоСпособРаспределения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		// Обход по подразделениям.
		Пока ОбходПоСтруктурнаяЕдиница.Следующий() Цикл
			
			ФильтрПоСтруктурнаяЕдиница = ОбходПоСтруктурнаяЕдиница.СтруктурнаяЕдиница;
			
			ОбходПоНаправлениеДеятельности = ОбходПоСтруктурнаяЕдиница.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			// Обход по направлениям деятельности.
			Пока ОбходПоНаправлениеДеятельности.Следующий() Цикл
				
				ФильтрПоНаправлениеДеятельности = ОбходПоНаправлениеДеятельности.НаправлениеДеятельности;
				
				ОбходПоЗаказ = ОбходПоНаправлениеДеятельности.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				// Обход по заказам.
				Пока ОбходПоЗаказ.Следующий() Цикл
					
					ФильтрПоЗаказ = ОбходПоЗаказ.Заказ;
					
					Если ОбходПоЗаказ.СчетУчетаСпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять Тогда
						Продолжить;
					КонецЕСли;
					
					// Сформируем таблицу базы распределения.
					ТаблицаБазы = СформироватьТаблицуБазыРаспределенияФинансовогоРезультата(
						ОбходПоЗаказ.СчетУчетаСпособРаспределения,
						ФильтрПоСтруктурнаяЕдиница,
						Неопределено,
						Неопределено
					);
					
					Если ТаблицаБазы.Количество() > 0 Тогда
						
						ТаблицаБазы = СформироватьТаблицуБазыРаспределенияФинансовогоРезультата(
							ОбходПоЗаказ.СчетУчетаСпособРаспределения,
							ФильтрПоСтруктурнаяЕдиница,
							ФильтрПоНаправлениеДеятельности,
							ФильтрПоЗаказ
						);
						
						Если ТаблицаБазы.Количество() = 0 Тогда
							ТаблицаБазы = СформироватьТаблицуБазыРаспределенияФинансовогоРезультата(
								ОбходПоЗаказ.СчетУчетаСпособРаспределения,
								ФильтрПоСтруктурнаяЕдиница,
								ФильтрПоНаправлениеДеятельности,
								Неопределено
							);
						КонецЕсли;
						
						Если ТаблицаБазы.Количество() = 0 Тогда
							ТаблицаБазы = СформироватьТаблицуБазыРаспределенияФинансовогоРезультата(
								ОбходПоЗаказ.СчетУчетаСпособРаспределения,
								ФильтрПоСтруктурнаяЕдиница,
								Неопределено,
								Неопределено
							);
						КонецЕсли;
						
					Иначе
						
						ТаблицаБазы = СформироватьТаблицуБазыРаспределенияФинансовогоРезультата(
							ОбходПоЗаказ.СчетУчетаСпособРаспределения,
							Неопределено,
							ФильтрПоНаправлениеДеятельности,
							ФильтрПоЗаказ
						);
						
						Если ТаблицаБазы.Количество() = 0 Тогда
							ТаблицаБазы = СформироватьТаблицуБазыРаспределенияФинансовогоРезультата(
								ОбходПоЗаказ.СчетУчетаСпособРаспределения,
								Неопределено,
								ФильтрПоНаправлениеДеятельности,
								Неопределено
							);
						КонецЕсли;
						
						Если ТаблицаБазы.Количество() = 0 Тогда
							ТаблицаБазы = СформироватьТаблицуБазыРаспределенияФинансовогоРезультата(
								ОбходПоЗаказ.СчетУчетаСпособРаспределения,
								Неопределено,
								Неопределено,
								Неопределено
							);
						КонецЕсли;
					
					КонецЕсли;
					
					Если ТаблицаБазы.Количество() > 0 Тогда
						ВсегоБазаРаспределения = ТаблицаБазы.Итог("База");
						КоличествоНаправлений  = ТаблицаБазы.Количество() - 1;
					Иначе
						ВсегоБазаРаспределения = 0;
						КоличествоНаправлений  = 0;
					КонецЕсли;
					
					ОбходПоСчетамУчета = ОбходПоЗаказ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					// Обход по счетам затрат.
					Пока ОбходПоСчетамУчета.Следующий() Цикл
						
						Если ТаблицаБазы.Количество() = 0
						 ИЛИ ВсегоБазаРаспределения = 0 Тогда
							ТаблицаБазы = Новый ТаблицаЗначений;
							ТаблицаБазы.Колонки.Добавить("Организация");
							ТаблицаБазы.Колонки.Добавить("СтруктурнаяЕдиница");
							ТаблицаБазы.Колонки.Добавить("НаправлениеДеятельности");
							ТаблицаБазы.Колонки.Добавить("Заказ");
							ТаблицаБазы.Колонки.Добавить("СчетУчетаВыручкиОтПродаж");
							ТаблицаБазы.Колонки.Добавить("СчетУчетаСебестоимостиПродаж");
							ТаблицаБазы.Колонки.Добавить("СчетУчетаПрибыли");
							ТаблицаБазы.Колонки.Добавить("СчетУчетаПрибылиРегл");
							ТаблицаБазы.Колонки.Добавить("База");
							СтрокаТаблицы = ТаблицаБазы.Добавить();
							СтрокаТаблицы.Организация = ОбходПоСчетамУчета.Организация;
							СтрокаТаблицы.СтруктурнаяЕдиница = ОбходПоСчетамУчета.СтруктурнаяЕдиница;
							СтрокаТаблицы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
							СтрокаТаблицы.Заказ = ОбходПоСчетамУчета.Заказ;
							СтрокаТаблицы.СчетУчетаВыручкиОтПродаж = ОбходПоСчетамУчета.СчетУчета;
							СтрокаТаблицы.СчетУчетаСебестоимостиПродаж = ОбходПоСчетамУчета.СчетУчета;
							СтрокаТаблицы.СчетУчетаПрибыли = Справочники.НаправленияДеятельности.ОсновноеНаправление.СчетУчетаПрибыли;
							СтрокаТаблицы.СчетУчетаПрибылиРегл = Справочники.НаправленияДеятельности.ОсновноеНаправление.СчетУчетаПрибылиРегл;
							СтрокаТаблицы.База = 1;
							ВсегоБазаРаспределения = 1;
						КонецЕсли;
						
						// Распределяем сумму.
						Если ОбходПоСчетамУчета.СуммаДоходов <> 0 
						 ИЛИ ОбходПоСчетамУчета.СуммаРасходов <> 0 Тогда
							
							Если ОбходПоСчетамУчета.СуммаДоходов <> 0 Тогда
								СуммаКРаспределению = ОбходПоСчетамУчета.СуммаДоходов;
							ИначеЕсли ОбходПоСчетамУчета.СуммаРасходов <> 0 Тогда
								СуммаКРаспределению = ОбходПоСчетамУчета.СуммаРасходов;
							КонецЕсли;
							
							СуммаРаспределили = 0;
							
							Для каждого НаправлениеРаспределения Из ТаблицаБазы Цикл
								
								СуммаЗатрат = ?(СуммаКРаспределению = 0, 0, Окр(НаправлениеРаспределения.База / ВсегоБазаРаспределения * СуммаКРаспределению, 2, 1));
								СуммаРаспределили = СуммаРаспределили + СуммаЗатрат;
								
								// Если это последняя строка - скорректируем сумму в ней на ошибку округления.
								Если ТаблицаБазы.Индекс(НаправлениеРаспределения) = КоличествоНаправлений Тогда
									СуммаЗатрат = СуммаЗатрат + СуммаКРаспределению - СуммаРаспределили;
									СуммаРаспределили = СуммаРаспределили + СуммаЗатрат;
								КонецЕсли;
								
								Если СуммаЗатрат <> 0 Тогда
									
									// Движения по регистру Финансовый результат.
									НоваяСтрока	= НаборЗаписейФинансовыйРезультат.Добавить();
									НоваяСтрока.Период = Дата;
									НоваяСтрока.Регистратор	= Ссылка;
									НоваяСтрока.Организация	= НаправлениеРаспределения.Организация;
									НоваяСтрока.СтруктурнаяЕдиница = НаправлениеРаспределения.СтруктурнаяЕдиница;
									НоваяСтрока.НаправлениеДеятельности	= НаправлениеРаспределения.НаправлениеДеятельности;
									НоваяСтрока.ЗаказПокупателя	= НаправлениеРаспределения.Заказ;
									
									НоваяСтрока.СчетУчета = ОбходПоСчетамУчета.СчетУчета;
									НоваяСтрока.СчетУчетаРегл = ОбходПоСчетамУчета.СчетУчетаРегл;
									НоваяСтрока.Аналитика = ОбходПоСчетамУчета.Аналитика;
									Если ОбходПоСчетамУчета.СуммаДоходов <> 0 Тогда
										НоваяСтрока.СуммаДоходов = СуммаЗатрат;
									ИначеЕсли ОбходПоСчетамУчета.СуммаРасходов <> 0 Тогда
										НоваяСтрока.СуммаРасходов = СуммаЗатрат;
									КонецЕсли;
									
									НоваяСтрока.СодержаниеПроводки = "Финансовый результат";
									
									// Движения по регистру Управленческий.
									НоваяСтрока = НаборЗаписейУправленческий.Добавить();
									НоваяСтрока.Период = Дата;
									НоваяСтрока.Регистратор = Ссылка;
									НоваяСтрока.Организация = НаправлениеРаспределения.Организация;
									НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
									
									Если ОбходПоСчетамУчета.СуммаДоходов <> 0 Тогда
										НоваяСтрока.СчетДт = ОбходПоСчетамУчета.СчетУчета;
										НоваяСтрока.СчетКт = НаправлениеРаспределения.СчетУчетаПрибыли;
										НоваяСтрока.Сумма = СуммаЗатрат; 
									ИначеЕсли ОбходПоСчетамУчета.СуммаРасходов <> 0 Тогда
										НоваяСтрока.СчетДт = НаправлениеРаспределения.СчетУчетаПрибыли;
										НоваяСтрока.СчетКт = ОбходПоСчетамУчета.СчетУчета;
										НоваяСтрока.Сумма = СуммаЗатрат;
									КонецЕсли;
									
									НоваяСтрока.Содержание = "Финансовый результат";
									
									// Движения по регистру Хозрасчетный.
									//НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
									//НоваяСтрока.Период = Дата;
									//НоваяСтрока.Регистратор = Ссылка;
									//НоваяСтрока.Организация = ВыборкаРезультатЗапроса.Организация;
									//
									//Если ОбходПоСчетамУчета.СуммаДоходов <> 0 Тогда
									//	НоваяСтрока.СчетДт = ОбходПоСчетамУчета.СчетУчетаРегл;
									//	НоваяСтрока.СчетКт = НаправлениеРаспределения.СчетУчетаПрибылиРегл;
									//	НоваяСтрока.Сумма = СуммаЗатрат;
									//ИначеЕсли ОбходПоСчетамУчета.СуммаРасходов <> 0 Тогда
									//	НоваяСтрока.СчетДт = НаправлениеРаспределения.СчетУчетаПрибылиРегл;
									//	НоваяСтрока.СчетКт = ОбходПоСчетамУчета.СчетУчетаРегл;
									//	НоваяСтрока.Сумма = СуммаЗатрат;
									//КонецЕсли;
									//
									//НоваяСтрока.Содержание = "Финансовый результат";
									//
									////БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", СтрокаДвижения.Номенклатура);
									//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", НаправлениеРаспределения.СтруктурнаяЕдиница);
									////БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", СтрокаДвижения.КоррСтруктурнаяЕдиница);
									//
									////БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", СтрокаДвижения.Номенклатура);
									//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", НаправлениеРаспределения.СтруктурнаяЕдиница);
									////БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", СтрокаДвижения.КоррСтруктурнаяЕдиница);
									
								КонецЕсли;
								
							КонецЦикла;
							
							Если СуммаРаспределили = 0 Тогда
								
								ОписаниеОшибки = СформироватьОписаниеОшибкиРаспределенияРасходов(
									ОбходПоСчетамУчета.СчетУчета,
									ОбходПоЗаказ.СчетУчетаСпособРаспределения,
									?(ОбходПоСчетамУчета.СуммаДоходов <> 0,
										ОбходПоСчетамУчета.СуммаДоходов,
										ОбходПоСчетамУчета.СуммаРасходов)
								);
								ДобавитьОшибкуВТаблицу(ОписаниеОшибки, "РасчетФинансовогоРезультата", ТаблицаОшибок);
								Продолжить;
								
							КонецЕсли;
							
						КонецЕсли
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// закрываем оприходывание товаров
	
	
	// Пишем Финансовый результат.
	НаборЗаписейФинансовыйРезультат.Записать(Ложь);
	НаборЗаписейФинансовыйРезультат.Очистить();
	
	// Пишем Управленческий.
	Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Дата) Тогда //+++ Дмгг
		НаборЗаписейУправленческий.Записать(Ложь);
	КонецЕсли; //--- Дмгг
	
	НаборЗаписейУправленческий.Очистить();
	
	// Пишем Хозрасчетный.
	//НаборЗаписейХозрасчетный.Записать(Ложь);
	//НаборЗаписейХозрасчетный.Очистить();
	
КонецПроцедуры // РассчитатьФинансовыйРезультат()

// Рассчитывает финансовый результат (регл.)
//
// Параметры:
//  Отказ        - Булево - флаг отказа проведения документа.
//
Процедура РассчитатьФинансовыйРезультатРегл(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УчетнаяПолитикаРеглСрезПоследних.СчетПрибыльУбытки КАК СчетПрибыльУбытки
		|ПОМЕСТИТЬ Вт_УчетнаяПолитикаОрганизации
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаРегл.СрезПоследних(&КонецПериода, Организация = &Организация) КАК УчетнаяПолитикаРеглСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаФинансовогоРезультатаДоходы.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ Вт_ФинРезСчетаДоходов
		|ИЗ
		|	РегистрСведений.СчетаФинансовогоРезультатаДоходы КАК СчетаФинансовогоРезультатаДоходы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаФинансовогоРезультатаРасходы.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ Вт_ФинРезСчетаРасходов
		|ИЗ
		|	РегистрСведений.СчетаФинансовогоРезультатаРасходы КАК СчетаФинансовогоРезультатаРасходы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ХозрасчетныйОбороты.Организация,
		|	ХозрасчетныйОбороты.Счет КАК СчетДт,
		|	ХозрасчетныйОбороты.Субконто1 КАК СубконтоДт1,
		|	ХозрасчетныйОбороты.Субконто2 КАК СубконтоДт2,
		|	ХозрасчетныйОбороты.Субконто3 КАК СубконтоДт3,
		//|	СУММА(ХозрасчетныйОбороты.КоличествоОборотКт) КАК КоличествоОборотДт,
		// Kuzmich, 14.03.2025, (ONESOFT-3872) თვის დახურვა - ფინანსური შედეგის გამოთვლა - ხარჯების და შემოსავლების ნაშთების მიხედვით გადახურვ
		|	СУММА(ХозрасчетныйОбороты.КоличествоОборотКт) - СУММА(ХозрасчетныйОбороты.КоличествоОборотДт) КАК КоличествоОборотДт,
		// Kuzmich, 14.03.2025, (ONESOFT-3872) თვის დახურვა - ფინანსური შედეგის გამოთვლა - ხარჯების და შემოსავლების ნაშთების მიხედვით გადახურვ
		|	Вт_УчетнаяПолитикаОрганизации.СчетПрибыльУбытки КАК СчетКт,
		|	&ВалютаУчета КАК СубконтоКт1,
		|	NULL КАК СубконтоКт2,
		|	NULL КАК СубконтоКт3,
		|	0 КАК КоличествоОборотКт,
		//|	СУММА(ХозрасчетныйОбороты.СуммаОборотКт) КАК СуммаОборот
		// Kuzmich, 14.03.2025, (ONESOFT-3872) თვის დახურვა - ფინანსური შედეგის გამოთვლა - ხარჯების და შემოსავლების ნაშთების მიხედვით გადახურვ
		|	СУММА(ХозрасчетныйОбороты.СуммаОборотКт) - СУММА(ХозрасчетныйОбороты.СуммаОборотДт) КАК СуммаОборот
		// Kuzmich, 14.03.2025, (ONESOFT-3872) თვის დახურვა - ფინანსური შედეგის გამოთვლა - ხარჯების და შემოსავლების ნაშთების მიხედვით გადახურვ
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет В
		|				(ВЫБРАТЬ
		|					Вт_ФинРезСчетаДоходов.СчетУчета
		|				ИЗ
		|					Вт_ФинРезСчетаДоходов КАК Вт_ФинРезСчетаДоходов),
		|			,
		|			Организация = &Организация,
		|			,
		|			) КАК ХозрасчетныйОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_УчетнаяПолитикаОрганизации КАК Вт_УчетнаяПолитикаОрганизации
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ХозрасчетныйОбороты.Регистратор <> &ИсключаемыйРегистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйОбороты.Организация,
		|	ХозрасчетныйОбороты.Счет,
		|	ХозрасчетныйОбороты.Субконто1,
		|	ХозрасчетныйОбороты.Субконто2,
		|	ХозрасчетныйОбороты.Субконто3,
		|	Вт_УчетнаяПолитикаОрганизации.СчетПрибыльУбытки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ХозрасчетныйОбороты.Организация,
		|	Вт_УчетнаяПолитикаОрганизации.СчетПрибыльУбытки,
		|	&ВалютаУчета,
		|	NULL,
		|	NULL,
		|	0,
		|	ХозрасчетныйОбороты.Счет,
		|	ХозрасчетныйОбороты.Субконто1,
		|	ХозрасчетныйОбороты.Субконто2,
		|	ХозрасчетныйОбороты.Субконто3,
		//|	СУММА(ХозрасчетныйОбороты.КоличествоОборотДт),
		//|	СУММА(ХозрасчетныйОбороты.СуммаОборотДт)
		// Kuzmich, 14.03.2025, (ONESOFT-3872) თვის დახურვა - ფინანსური შედეგის გამოთვლა - ხარჯების და შემოსავლების ნაშთების მიხედვით გადახურვ
		|	СУММА(ХозрасчетныйОбороты.КоличествоОборотДт)-СУММА(ХозрасчетныйОбороты.КоличествоОборотКт),
		|	СУММА(ХозрасчетныйОбороты.СуммаОборотДт) - СУММА(ХозрасчетныйОбороты.СуммаОборотКт)
		// Kuzmich, 14.03.2025, (ONESOFT-3872) თვის დახურვა - ფინანსური შედეგის გამოთვლა - ხარჯების და შემოსავლების ნაშთების მიხედვით გადახურვ
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Счет В
		|				(ВЫБРАТЬ
		|					Вт_ФинРезСчетаРасходов.СчетУчета
		|				ИЗ
		|					Вт_ФинРезСчетаРасходов КАК Вт_ФинРезСчетаРасходов),
		|			,
		|			Организация = &Организация,
		|			,
		|			) КАК ХозрасчетныйОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_УчетнаяПолитикаОрганизации КАК Вт_УчетнаяПолитикаОрганизации
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ХозрасчетныйОбороты.Регистратор <> &ИсключаемыйРегистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйОбороты.Организация,
		|	Вт_УчетнаяПолитикаОрганизации.СчетПрибыльУбытки,
		|	ХозрасчетныйОбороты.Счет,
		|	ХозрасчетныйОбороты.Субконто1,
		|	ХозрасчетныйОбороты.Субконто2,
		|	ХозрасчетныйОбороты.Субконто3";
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	Запрос.УстановитьПараметр("НачалоПериода"			, ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("КонецПериода"			, ДополнительныеСвойства.ДляПроведения.КонечнаяГраницаПериода);
	Запрос.УстановитьПараметр("Организация"				, ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета"				, Справочники.Валюты.ПустаяСсылка());
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор"	, Ссылка);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
				
		// Создадим набор записей регистра бухгалтерии "Хозрасчетный".
		НаборЗаписейХозрасчетный = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
		НаборЗаписейХозрасчетный.Отбор.Регистратор.Установить(Ссылка);
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ВыборкаРезультатЗапроса = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаРезультатЗапроса.Следующий() Цикл
		
		// Движения по регистру Хозрасчетный.
		НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
		НоваяСтрока.Период 		= Дата;
		НоваяСтрока.Регистратор = Ссылка;
		НоваяСтрока.Организация = ВыборкаРезультатЗапроса.Организация;
		НоваяСтрока.СчетДт 		= ВыборкаРезультатЗапроса.СчетДт;
		НоваяСтрока.СчетКт 		= ВыборкаРезультатЗапроса.СчетКт;
		НоваяСтрока.Сумма 		= ВыборкаРезультатЗапроса.СуммаОборот;
		НоваяСтрока.Содержание 	= "Финансовый результат";
		
		//Если НоваяСтрока.СчетДт.Валютный Тогда
		//	НоваяСтрока.ВалютаДт = ВалютаУчета;	
		//КонецЕсли;
		
		Если НоваяСтрока.СчетДт.Количественный Тогда
			НоваяСтрока.КоличествоДт = ВыборкаРезультатЗапроса.КоличествоОборотДт;
		КонецЕсли;
		
		//Если НоваяСтрока.СчетКт.Валютный Тогда
		//	НоваяСтрока.ВалютаКт = ВалютаУчета;	
		//КонецЕсли;
		
		Если НоваяСтрока.СчетКт.Количественный Тогда
			НоваяСтрока.КоличествоКт = ВыборкаРезультатЗапроса.КоличествоОборотКт;
		КонецЕсли;
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, 1, ВыборкаРезультатЗапроса.СубконтоДт1);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, 2, ВыборкаРезультатЗапроса.СубконтоДт2);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, 3, ВыборкаРезультатЗапроса.СубконтоДт3);
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, 1, ВыборкаРезультатЗапроса.СубконтоКт1);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, 2, ВыборкаРезультатЗапроса.СубконтоКт2);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, 3, ВыборкаРезультатЗапроса.СубконтоКт3);	
		
	КонецЦикла;
	
	// Пишем Хозрасчетный.
	НаборЗаписейХозрасчетный.Записать(Ложь);
	НаборЗаписейХозрасчетный.Очистить();
	
КонецПроцедуры // РассчитатьФинансовыйРезультатРегл()

#Область РасчетСебестоимостиВРозницеСуммовойУчет

Процедура РассчитатьСебестоимостьВРозницеСуммовойУчет(Отказ, ТаблицаОшибок)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДатаНач", ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("ДатаКон", ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод);
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СуммовойУчетВРозницеОбороты.Организация КАК Организация,
	|	СуммовойУчетВРозницеОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СуммовойУчетВРозницеОбороты.Валюта КАК Валюта,
	|	СуммовойУчетВРозницеОбороты.СуммаВалПриход КАК СуммаВалПриход,
	|	СуммовойУчетВРозницеОбороты.СуммаВалРасход КАК СуммаВалРасход,
	|	СуммовойУчетВРозницеОбороты.СебестоимостьПриход КАК СебестоимостьПриход,
	|	СуммовойУчетВРозницеОбороты.СебестоимостьРасход КАК СебестоимостьРасход,
	|	ВЫБОР
	|		КОГДА СуммовойУчетВРозницеОбороты.СуммаВалПриход <> 0
	|			ТОГДА (ВЫРАЗИТЬ(СуммовойУчетВРозницеОбороты.СуммаВалРасход * СуммовойУчетВРозницеОбороты.СебестоимостьПриход / СуммовойУчетВРозницеОбороты.СуммаВалПриход КАК ЧИСЛО(15, 2))) - СуммовойУчетВРозницеОбороты.СебестоимостьРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбщаяСуммаКорректировки
	|ПОМЕСТИТЬ ВременнаяТаблицаСуммаКорректировки
	|ИЗ
	|	РегистрНакопления.СуммовойУчетВРознице.Обороты(, &ДатаКон, , Организация = &Организация) КАК СуммовойУчетВРозницеОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммовойУчетВРознице.Организация КАК Организация,
	|	СуммовойУчетВРознице.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СуммовойУчетВРознице.Валюта КАК Валюта,
	|	СУММА(СуммовойУчетВРознице.Себестоимость) КАК СебестоимостьРасход
	|ПОМЕСТИТЬ ВременнаяТаблицаОбщаяСебестоимостьРасход
	|ИЗ
	|	РегистрНакопления.СуммовойУчетВРознице КАК СуммовойУчетВРознице
	|ГДЕ
	|	СуммовойУчетВРознице.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И СуммовойУчетВРознице.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И СуммовойУчетВРознице.Себестоимость <> 0
	|	И СуммовойУчетВРознице.Организация = &Организация
	|	И СуммовойУчетВРознице.ДокументПродажи <> ЗНАЧЕНИЕ(Документ.ПоступлениеВКассу.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммовойУчетВРознице.Организация,
	|	СуммовойУчетВРознице.СтруктурнаяЕдиница,
	|	СуммовойУчетВРознице.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммовойУчетВРознице.Организация КАК Организация,
	|	СуммовойУчетВРознице.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СуммовойУчетВРознице.Валюта КАК Валюта,
	|	СуммовойУчетВРознице.ДокументПродажи КАК ДокументПродажи,
	|	СуммовойУчетВРознице.ДокументПродажи.Подразделение КАК ДокументПродажиПодразделение,
	|	СуммовойУчетВРознице.ДокументПродажи.СтруктурнаяЕдиница.РозничныйВидЦен.ВалютаЦены КАК ДокументПродажиСтруктурнаяЕдиницаРозничныйВидЦенВалютаЦены,
	|	СуммовойУчетВРознице.ДокументПродажи.НаправлениеДеятельности КАК ДокументПродажиНаправлениеДеятельности,
	|	СуммовойУчетВРознице.ДокументПродажи.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж КАК ДокументПродажиНаправлениеДеятельностиСчетУчетаСебестоимостиПродаж,
	|	СуммовойУчетВРознице.ДокументПродажи.СтруктурнаяЕдиница.СчетУчетаВРознице КАК ДокументПродажиСтруктурнаяЕдиницаСчетУчетаВРознице,
	|	СуммовойУчетВРознице.ДокументПродажи.СтруктурнаяЕдиница.СчетУчетаНаценки КАК ДокументПродажиСтруктурнаяЕдиницаСчетУчетаНаценки,
	|	СуммовойУчетВРознице.ДокументПродажи.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл КАК ДокументПродажиНаправлениеДеятельностиСчетУчетаСебестоимостиПродажРегл,
	|	СуммовойУчетВРознице.ДокументПродажи.СтруктурнаяЕдиница.СчетУчетаВРозницеРегл КАК ДокументПродажиСтруктурнаяЕдиницаСчетУчетаВРозницеРегл,
	|	СуммовойУчетВРознице.ДокументПродажи.СтруктурнаяЕдиница.СчетУчетаНаценкиРегл КАК ДокументПродажиСтруктурнаяЕдиницаСчетУчетаНаценкиРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВременнаяТаблицаОбщаяСебестоимостьРасход.СебестоимостьРасход, 0) <> 0
	|			ТОГДА ВЫРАЗИТЬ(СуммовойУчетВРознице.Себестоимость / ВременнаяТаблицаОбщаяСебестоимостьРасход.СебестоимостьРасход * ВременнаяТаблицаСуммаКорректировки.ОбщаяСуммаКорректировки КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаКорректировки
	|ИЗ
	|	РегистрНакопления.СуммовойУчетВРознице КАК СуммовойУчетВРознице
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСуммаКорректировки КАК ВременнаяТаблицаСуммаКорректировки
	|		ПО СуммовойУчетВРознице.Организация = ВременнаяТаблицаСуммаКорректировки.Организация
	|			И СуммовойУчетВРознице.СтруктурнаяЕдиница = ВременнаяТаблицаСуммаКорректировки.СтруктурнаяЕдиница
	|			И СуммовойУчетВРознице.Валюта = ВременнаяТаблицаСуммаКорректировки.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОбщаяСебестоимостьРасход КАК ВременнаяТаблицаОбщаяСебестоимостьРасход
	|		ПО СуммовойУчетВРознице.Организация = ВременнаяТаблицаОбщаяСебестоимостьРасход.Организация
	|			И СуммовойУчетВРознице.СтруктурнаяЕдиница = ВременнаяТаблицаОбщаяСебестоимостьРасход.СтруктурнаяЕдиница
	|			И СуммовойУчетВРознице.Валюта = ВременнаяТаблицаОбщаяСебестоимостьРасход.Валюта
	|ГДЕ
	|	СуммовойУчетВРознице.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И СуммовойУчетВРознице.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И СуммовойУчетВРознице.Себестоимость <> 0
	|	И СуммовойУчетВРознице.Организация = &Организация
	|	И СуммовойУчетВРознице.ДокументПродажи <> ЗНАЧЕНИЕ(Документ.ПоступлениеВКассу.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВременнаяТаблицаСуммаКорректировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВременнаяТаблицаОбщаяСебестоимостьРасход";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса[2].Выбрать();
	
	// Создадим набор записей регистра накопления СуммовойУчетВРознице.
	НаборЗаписейСуммовойУчетВРознице = РегистрыНакопления.СуммовойУчетВРознице.СоздатьНаборЗаписей();
	НаборЗаписейСуммовойУчетВРознице.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления УчетДоходовИРасходов.
	НаборЗаписейДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей();
	НаборЗаписейДоходыИРасходы.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Управленческий.
	НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
	НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Хозрасчетный.
	НаборЗаписейХозрасчетный = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборЗаписейХозрасчетный.Отбор.Регистратор.Установить(Ссылка);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Окр(ВыборкаДетальныеЗаписи.СуммаКорректировки, 2) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Движения по регистру СуммовойУчетВРознице.
		НоваяСтрока = НаборЗаписейСуммовойУчетВРознице.Добавить();
		НоваяСтрока.Период = Дата;
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
		НоваяСтрока.Регистратор = Ссылка;
		НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
		НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница;
		НоваяСтрока.Валюта = ВыборкаДетальныеЗаписи.ДокументПродажиСтруктурнаяЕдиницаРозничныйВидЦенВалютаЦены;
		НоваяСтрока.СодержаниеПроводки = НСтр("ka='თვითღირებულება';ru='Себестоимость';en='Cost price'");
		НоваяСтрока.Себестоимость = ВыборкаДетальныеЗаписи.СуммаКорректировки;
		
		// Движения по регистру ДоходыИРасходы.
		НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
		НоваяСтрока.Период = Дата;
		НоваяСтрока.Регистратор = Ссылка;
		НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
		НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.ДокументПродажиПодразделение;
		НоваяСтрока.НаправлениеДеятельности = ВыборкаДетальныеЗаписи.ДокументПродажиНаправлениеДеятельности;
		НоваяСтрока.СчетУчета = ВыборкаДетальныеЗаписи.ДокументПродажиНаправлениеДеятельностиСчетУчетаСебестоимостиПродаж;
		НоваяСтрока.СчетУчетаРегл = ВыборкаДетальныеЗаписи.ДокументПродажиНаправлениеДеятельностиСчетУчетаСебестоимостиПродажРегл;
		НоваяСтрока.СуммаРасходов = ВыборкаДетальныеЗаписи.СуммаКорректировки;
		НоваяСтрока.СодержаниеПроводки = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
		
		// Движения по регистру Управленческий.
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		НоваяСтрока.Период = Дата;
		НоваяСтрока.Регистратор = Ссылка;
		НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
		НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
		НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.ДокументПродажиНаправлениеДеятельностиСчетУчетаСебестоимостиПродаж;
		НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.ДокументПродажиСтруктурнаяЕдиницаСчетУчетаВРознице;
		НоваяСтрока.Содержание = НСтр("ka='თვითღირებულება';ru='Себестоимость';en='Cost price'");
		НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.СуммаКорректировки;
		
		// Движения по регистру Управленческий.
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		НоваяСтрока.Период = Дата;
		НоваяСтрока.Регистратор = Ссылка;
		НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
		НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
		НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.ДокументПродажиСтруктурнаяЕдиницаСчетУчетаВРознице;
		НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.ДокументПродажиСтруктурнаяЕдиницаСчетУчетаНаценки;
		НоваяСтрока.Содержание = НСтр("ka='ფასნამატი';ru='Наценка';en='mark-up'");
		НоваяСтрока.Сумма = - ВыборкаДетальныеЗаписи.СуммаКорректировки;
		
		// Движения по регистру Хозрасчетный.
		НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
		НоваяСтрока.Период = Дата;
		НоваяСтрока.Регистратор = Ссылка;
		НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
		НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.ДокументПродажиНаправлениеДеятельностиСчетУчетаСебестоимостиПродажРегл;
		НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.ДокументПродажиСтруктурнаяЕдиницаСчетУчетаВРозницеРегл;
		НоваяСтрока.Содержание = НСтр("ka='თვითღირებულება';ru='Себестоимость';en='Cost price'");
		НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.СуммаКорректировки;
		
		//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", СтрокаДвижения.Номенклатура);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.ДокументПродажиПодразделение);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
		
		//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", СтрокаДвижения.Номенклатура);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.ДокументПродажиПодразделение);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
			
		// Движения по регистру Хозрасчетный.
		НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
		НоваяСтрока.Период = Дата;
		НоваяСтрока.Регистратор = Ссылка;
		НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
		НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.ДокументПродажиСтруктурнаяЕдиницаСчетУчетаВРозницеРегл;
		НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.ДокументПродажиСтруктурнаяЕдиницаСчетУчетаНаценкиРегл;
		НоваяСтрока.Содержание = НСтр("ka='ფასნამატი';ru='Наценка';en='mark-up'");
		НоваяСтрока.Сумма = - ВыборкаДетальныеЗаписи.СуммаКорректировки;
		
		//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", СтрокаДвижения.Номенклатура);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.ДокументПродажиПодразделение);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
		
		//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", СтрокаДвижения.Номенклатура);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.ДокументПродажиПодразделение);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
		
	КонецЦикла;
	
	// Пишем оставшиеся записи Учет доходов и расходов.
	НаборЗаписейДоходыИРасходы.Записать(Ложь);
	
	// Пишем оставшиеся записи Суммовой учет в рознице.
	НаборЗаписейСуммовойУчетВРознице.Записать(Ложь);
	
	// Пишем оставшиеся записи Управленческий.
	Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Дата) Тогда //+++ Дмгг
		НаборЗаписейУправленческий.Записать(Ложь);
	КонецЕсли;
	
	// Пишем оставшиеся записи Хозрасчетный.
	НаборЗаписейХозрасчетный.Записать(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область РасчетКурсовыхРазниц

Процедура РассчитатьКурсовыеРазницы(Отказ, ТаблицаОшибок)
	
	// Создадим набор записей регистра накопления ДенежныеСредства.
	НаборЗаписейДенежныеСредства = РегистрыНакопления.ДенежныеСредства.СоздатьНаборЗаписей();
	НаборЗаписейДенежныеСредства.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления ДенежныеСредстваВКассахККМ.
	НаборЗаписейДенежныеСредстваВКассахККМ = РегистрыНакопления.ДенежныеСредстваВКассахККМ.СоздатьНаборЗаписей();
	НаборЗаписейДенежныеСредстваВКассахККМ.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления РасчетыСПерсоналом.
	НаборЗаписейРасчетыСПерсоналом = РегистрыНакопления.РасчетыСПерсоналом.СоздатьНаборЗаписей();
	НаборЗаписейРасчетыСПерсоналом.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления РасчетыСПодотчетниками.
	НаборЗаписейРасчетыСПодотчетниками = РегистрыНакопления.РасчетыСПодотчетниками.СоздатьНаборЗаписей();
	НаборЗаписейРасчетыСПодотчетниками.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления РасчетыСПокупателями.
	НаборЗаписейРасчетыСПокупателями = РегистрыНакопления.РасчетыСПокупателями.СоздатьНаборЗаписей();
	НаборЗаписейРасчетыСПокупателями.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления РасчетыСПоставщиками.
	НаборЗаписейРасчетыСПоставщиками = РегистрыНакопления.РасчетыСПоставщиками.СоздатьНаборЗаписей();
	НаборЗаписейРасчетыСПоставщиками.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления УчетДоходовИРасходов.
	НаборЗаписейДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей();
	НаборЗаписейДоходыИРасходы.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления РасчетыПоКредитамИЗаймам.
	НаборЗаписейРасчетыПоКредитамИЗаймам = РегистрыНакопления.РасчетыПоКредитамИЗаймам.СоздатьНаборЗаписей();
	НаборЗаписейРасчетыПоКредитамИЗаймам.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра сведений ОтчетПоКурсовымРазницам.
	НаборЗаписейОтчетПоКурсовымРазницам = РегистрыСведений.ОтчетПоКурсовымРазницам.СоздатьНаборЗаписей();
	НаборЗаписейОтчетПоКурсовымРазницам.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра бухгалтерии Управленческий.
	НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
	НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра бухгалтерии Хозрасчетный.
	НаборЗаписейХозрасчетный = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборЗаписейХозрасчетный.Отбор.Регистратор.Установить(Ссылка);
	
	СтруктураОтраженияКурсовыхРазницРегл = РегламентированныйУчетСервер.ПолучитьСтруктуруОтраженияКурсовыхРазниц2(Дата, Организация);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаКон", ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод);
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	
	Запрос.УстановитьПараметр("СчетДеньгиОтрицательная", СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаДеньги);
	Запрос.УстановитьПараметр("СчетДеньгиПоложительная", СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаДеньги);
	Запрос.УстановитьПараметр("СчетЗадолженностьОтрицательная", СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность);
	Запрос.УстановитьПараметр("СчетЗадолженностьПоложительная", СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность);
	
	Запрос.УстановитьПараметр("СчетУчетаРегл_ДеньгиВПути", СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетДеньгиВПути); //Малышев 2025-08-18 ONESOFT-4277
	
	
	Запрос.УстановитьПараметр("НеПереоцениватьСчета", СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета);
	
	// Денежные средства.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОстатки.Организация КАК Организация,
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ТаблицаОстатки.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ТаблицаОстатки.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК Аналитика,
	|	ТаблицаОстатки.Валюта КАК Валюта,
	|	ТаблицаОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвиженияУправленческий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПоложительнаяКурсоваяРазница)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОтрицательнаяКурсоваяРазница)
	|	КОНЕЦ КАК Статья,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА 0
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	//Малышев 2025-08-18 ONESOFT-4277 ((--
	//|			ТОГДА ТаблицаОстатки.БанковскийСчетКасса.СчетУчета
	|			ТОГДА 
	|				ВЫБОР 
	|					КОГДА ТаблицаОстатки.БанковскийСчетКасса = Значение(Перечисление.ВременноеХранилищеДенежныхСредств.ДеньгиВПути)
	|						ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|					ИНАЧЕ ТаблицаОстатки.БанковскийСчетКасса.СчетУчета
	|				КОНЕЦ
	//Малышев 2025-08-18 ONESOFT-4277 --))
	
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	//Малышев 2025-08-18 ONESOFT-4277 ((--
	//|			ТОГДА ТаблицаОстатки.БанковскийСчетКасса.СчетУчетаРегл
	|			ТОГДА 
	|				ВЫБОР 
	|					КОГДА ТаблицаОстатки.БанковскийСчетКасса = Значение(Перечисление.ВременноеХранилищеДенежныхСредств.ДеньгиВПути)
	|						ТОГДА &СчетУчетаРегл_ДеньгиВПути
	|					ИНАЧЕ ТаблицаОстатки.БанковскийСчетКасса.СчетУчетаРегл
	|				КОНЕЦ
	//Малышев 2025-08-18 ONESOFT-4277 --))
	|		ИНАЧЕ &СчетДеньгиОтрицательная
	|	КОНЕЦ КАК СчетДтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ТаблицаОстатки.БанковскийСчетКасса.СчетУчета
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетДеньгиПоложительная
	//Малышев 2025-08-18 ONESOFT-4277 ((--
	//|		ИНАЧЕ ТаблицаОстатки.БанковскийСчетКасса.СчетУчетаРегл
	|		ИНАЧЕ 
	|			ВЫБОР 
	|				КОГДА ТаблицаОстатки.БанковскийСчетКасса = Значение(Перечисление.ВременноеХранилищеДенежныхСредств.ДеньгиВПути)
	|					ТОГДА &СчетУчетаРегл_ДеньгиВПути
	|				ИНАЧЕ ТаблицаОстатки.БанковскийСчетКасса.СчетУчетаРегл
	|			КОНЕЦ
	//Малышев 2025-08-18 ONESOFT-4277 --))
	
	|	КОНЕЦ КАК СчетКтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|				И ТаблицаОстатки.БанковскийСчетКасса.СчетУчета.Валютный
	|			ТОГДА ТаблицаОстатки.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
	|				И ТаблицаОстатки.БанковскийСчетКасса.СчетУчета.Валютный
	|			ТОГДА ТаблицаОстатки.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	&КурсоваяРазница КАК Содержание,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетДеньгиПоложительная
	|		ИНАЧЕ &СчетДеньгиОтрицательная
	|	КОНЕЦ КАК СчетУчетаРегл
	// Kuzmich, 09.12.2024, (ONESOFT-3668) Переоценка процента кредитов и заполнение "проекта" в регистре "расчеты с кредитами и займами"
	|	,ТаблицаОстатки.Проект
	// Kuzmich, 09.12.2024, (ONESOFT-3668) Переоценка процента кредитов и заполнение "проекта" в регистре "расчеты с кредитами и займами"
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Остатки(&ДатаКон, Организация = &Организация) КАК ТаблицаОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&ДатаКон,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
	|		ПО ТаблицаОстатки.Валюта = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
	|ГДЕ
	|	ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> ТаблицаОстатки.СуммаОстаток
	|	И (ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток >= 0.005
	|			ИЛИ ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток <= -0.005)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Окр(ВыборкаДетальныеЗаписи.Сумма, 2) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетДтРегл) <> Неопределено
			ИЛИ СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетКтРегл) <> Неопределено Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		// Движения по регистрам.
		НоваяСтрока = НаборЗаписейДенежныеСредства.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.ХозяйственнаяОперация = ХозяйственнаяОперация; // Хозяйственная операция
		НоваяСтрока.ВидДвижения = ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий;
		НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Валюта;
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Сумма = ?(ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий = ВидДвиженияНакопления.Приход, НоваяСтрока.Сумма, -НоваяСтрока.Сумма);
		НоваяСтрока.Аналитика = "" + ВыборкаДетальныеЗаписи.БанковскийСчетКасса;
		НоваяСтрока.Раздел = "Денежные средства";
		
		НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетДтРегл;
		НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетКтРегл;
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
			НоваяСтрока.ВалютаДт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
			НоваяСтрока.ВалютаКт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "БанковскиеСчета", ВыборкаДетальныеЗаписи.БанковскийСчетКасса);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Касса", ВыборкаДетальныеЗаписи.БанковскийСчетКасса);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "СтатьиДвиженияДенежныхСредств", ВыборкаДетальныеЗаписи.Статья);
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "БанковскиеСчета", ВыборкаДетальныеЗаписи.БанковскийСчетКасса);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Касса", ВыборкаДетальныеЗаписи.БанковскийСчетКасса);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "СтатьиДвиженияДенежныхСредств", ВыборкаДетальныеЗаписи.Статья);
		
	КонецЦикла;
	
	// Денежные средства в кассах ККМ.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОстатки.Организация КАК Организация,
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ТаблицаОстатки.КассаККМ КАК КассаККМ,
	|	ТаблицаОстатки.КассаККМ.ВалютаДенежныхСредств КАК Валюта,
	|	ТаблицаОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвиженияУправленческий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК Сумма,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА 0
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ТаблицаОстатки.КассаККМ.СчетУчета
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ТаблицаОстатки.КассаККМ.СчетУчетаРегл
	|		ИНАЧЕ &СчетДеньгиОтрицательная
	|	КОНЕЦ КАК СчетДтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ТаблицаОстатки.КассаККМ.СчетУчета
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетДеньгиПоложительная
	|		ИНАЧЕ ТаблицаОстатки.КассаККМ.СчетУчетаРегл
	|	КОНЕЦ КАК СчетКтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|				И ТаблицаОстатки.КассаККМ.СчетУчета.Валютный
	|			ТОГДА ТаблицаОстатки.КассаККМ.ВалютаДенежныхСредств
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
	|				И ТаблицаОстатки.КассаККМ.СчетУчета.Валютный
	|			ТОГДА ТаблицаОстатки.КассаККМ.ВалютаДенежныхСредств
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	&КурсоваяРазница КАК Содержание,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетДеньгиПоложительная
	|		ИНАЧЕ &СчетДеньгиОтрицательная
	|	КОНЕЦ КАК СчетУчетаРегл
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(&ДатаКон, Организация = &Организация) КАК ТаблицаОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&ДатаКон,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
	|		ПО ТаблицаОстатки.КассаККМ.ВалютаДенежныхСредств = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
	|ГДЕ
	|	ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> ТаблицаОстатки.СуммаОстаток
	|	И (ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток >= 0.005
	|			ИЛИ ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток <= -0.005)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Окр(ВыборкаДетальныеЗаписи.Сумма, 2) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетДтРегл) <> Неопределено
			ИЛИ СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетКтРегл) <> Неопределено Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		// Движения по регистрам.
		НоваяСтрока = НаборЗаписейДенежныеСредстваВКассахККМ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.ВидДвижения = ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий;
		НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Валюта;
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Сумма = ?(ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий = ВидДвиженияНакопления.Приход, НоваяСтрока.Сумма, -НоваяСтрока.Сумма);
		НоваяСтрока.Аналитика = "" + ВыборкаДетальныеЗаписи.КассаККМ;
		НоваяСтрока.Раздел = "Денежные средства в кассах ККМ";
		
		НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетДтРегл;
		НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетКтРегл;
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
			НоваяСтрока.ВалютаДт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
			НоваяСтрока.ВалютаКт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "БанковскиеСчета", ВыборкаДетальныеЗаписи.БанковскийСчетКасса);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Касса", ВыборкаДетальныеЗаписи.БанковскийСчетКасса);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "СтатьиДвиженияДенежныхСредств", ВыборкаДетальныеЗаписи.Статья);
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "БанковскиеСчета", ВыборкаДетальныеЗаписи.БанковскийСчетКасса);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Касса", ВыборкаДетальныеЗаписи.БанковскийСчетКасса);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "СтатьиДвиженияДенежныхСредств", ВыборкаДетальныеЗаписи.Статья);
		
	КонецЦикла;
	
	// Расчеты с персоналом.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОстатки.Организация КАК Организация,
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ТаблицаОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаОстатки.Сотрудник КАК Сотрудник,
	|	ТаблицаОстатки.Сотрудник.Код КАК СотрудникКод,
	|	ТаблицаОстатки.Валюта КАК Валюта,
	|	ТаблицаОстатки.ПериодРегистрации КАК ПериодРегистрации,
	|	ТаблицаОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвиженияУправленческий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК Сумма,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА 0
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|	КОНЕЦ КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|		ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовСПерсоналом
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетЗадолженностьОтрицательная
	|		ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовСПерсоналомРегл
	|	КОНЕЦ КАК СчетДтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПерсоналом
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПерсоналомРегл
	|		ИНАЧЕ &СчетЗадолженностьПоложительная
	|	КОНЕЦ КАК СчетКтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
	|				И ТаблицаОстатки.Сотрудник.СчетРасчетовСПерсоналом.Валютный
	|			ТОГДА ТаблицаОстатки.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|				И ТаблицаОстатки.Сотрудник.СчетРасчетовСПерсоналом.Валютный
	|			ТОГДА ТаблицаОстатки.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	&КурсоваяРазница КАК Содержание,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетЗадолженностьОтрицательная
	|		ИНАЧЕ &СчетЗадолженностьПоложительная
	|	КОНЕЦ КАК СчетУчетаРегл
	// Kuzmich, 09.12.2024, (ONESOFT-3668) Переоценка процента кредитов и заполнение "проекта" в регистре "расчеты с кредитами и займами"
	|	,ТаблицаОстатки.Проект
	// Kuzmich, 09.12.2024, (ONESOFT-3668) Переоценка процента кредитов и заполнение "проекта" в регистре "расчеты с кредитами и займами"
	|ИЗ
	|	РегистрНакопления.РасчетыСПерсоналом.Остатки(&ДатаКон, Организация = &Организация) КАК ТаблицаОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&ДатаКон,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
	|		ПО ТаблицаОстатки.Валюта = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
	|ГДЕ
	|	ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> ТаблицаОстатки.СуммаОстаток
	|	И (ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток >= 0.005
	|			ИЛИ ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток <= -0.005)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Окр(ВыборкаДетальныеЗаписи.Сумма, 2) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетДтРегл) <> Неопределено
			ИЛИ СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетКтРегл) <> Неопределено Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		// Движения по регистрам.
		НоваяСтрока = НаборЗаписейРасчетыСПерсоналом.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.ВидДвижения = ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий;
		НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Валюта;
		НоваяСтрока.СтруктурнаяЕдиница = Неопределено;
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Сумма = ?(ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий = ВидДвиженияНакопления.Приход, НоваяСтрока.Сумма, -НоваяСтрока.Сумма);
		НоваяСтрока.Аналитика = 
			""
		  + ВыборкаДетальныеЗаписи.Сотрудник + " (" + ВыборкаДетальныеЗаписи.СотрудникКод + ")"
		  + " / "
		  + ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница
		  + " / "
		  + Формат(ВыборкаДетальныеЗаписи.ПериодРегистрации, "ДФ='ММММ гггг'")+ " г.";
		НоваяСтрока.Раздел = "Расчеты с персоналом";
		
		НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетДтРегл;
		НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетКтРегл;
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
			НоваяСтрока.ВалютаДт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
			НоваяСтрока.ВалютаКт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "РаботникиОрганизаций", ВыборкаДетальныеЗаписи.Сотрудник);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Сотрудники", ВыборкаДетальныеЗаписи.Сотрудник);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница); //+++ Дмгг, 27.12.23, ONESOFT-2747
	
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "РаботникиОрганизаций", ВыборкаДетальныеЗаписи.Сотрудник); 
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Сотрудники", ВыборкаДетальныеЗаписи.Сотрудник);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
		
	КонецЦикла;
	
	// Расчеты с подотчетниками.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОстатки.Организация КАК Организация,
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ТаблицаОстатки.Сотрудник КАК Сотрудник,
	|	ТаблицаОстатки.Документ КАК Документ,
	|	ТаблицаОстатки.Валюта КАК Валюта,
	|	ТаблицаОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвиженияУправленческий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПоложительнаяКурсоваяРазница)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОтрицательнаяКурсоваяРазница)
	|	КОНЕЦ КАК Статья,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА 0
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0
	|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетниками
	|					ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходу
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0
	|							И ТаблицаОстатки.Валюта = ВалютаУчета.Значение
	|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходуРегл
	//+++ Дмгг
	|					КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) < 0
	|							И ТаблицаОстатки.Документ ССЫЛКА Документ.Конвертация
	|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл
	//--- Дмгг
	|					КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) < 0
	|							И ТаблицаОстатки.Валюта <> ВалютаУчета.Значение
	|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходуРегл
	|					КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0
	|							И ТаблицаОстатки.Валюта <> ВалютаУчета.Значение
	|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл
	//+++ Дмгг
	|					КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) = 0
	|							И ТаблицаОстатки.Документ ССЫЛКА Документ.АвансовыйОтчет
	|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходуРегл
	//--- Дмгг
	|					ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл
	|				КОНЕЦ
	|		ИНАЧЕ &СчетЗадолженностьОтрицательная
	|	КОНЕЦ КАК СчетДтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0
	|					ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетниками
	|				ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходу
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетЗадолженностьПоложительная
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0
	|					ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл
	//+++ Дмгг
	|				КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) = 0
	|					И (ТаблицаОстатки.Документ ССЫЛКА Документ.РасходСоСчета
	|						ИЛИ ТаблицаОстатки.Документ ССЫЛКА Документ.РасходИзКассы)
	|					ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл
	|				ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходуРегл
	//|				ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетКтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|				И ВЫБОР
	|					КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0
	|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетниками.Валютный
	|					ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходу.Валютный
	|				КОНЕЦ
	|			ТОГДА ТаблицаОстатки.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
	|				И ВЫБОР
	|					КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0
	|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетниками.Валютный
	|					ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходу.Валютный
	|				КОНЕЦ
	|			ТОГДА ТаблицаОстатки.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	&КурсоваяРазница КАК Содержание,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетЗадолженностьПоложительная
	|		ИНАЧЕ &СчетЗадолженностьОтрицательная
	|	КОНЕЦ КАК СчетУчетаРегл
	|ИЗ
	|	РегистрНакопления.РасчетыСПодотчетниками.Остатки(&ДатаКон, Организация = &Организация) КАК ТаблицаОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&ДатаКон,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
	|		ПО ТаблицаОстатки.Валюта = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
	//+++ Дмгг
	|,
	|		Константа.ВалютаУчета КАК ВалютаУчета
	//--- Дмгг
	|ГДЕ
	|	ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> ТаблицаОстатки.СуммаОстаток
	|	И (ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток >= 0.005
	|			ИЛИ ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток <= -0.005)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Окр(ВыборкаДетальныеЗаписи.Сумма, 2) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетДтРегл) <> Неопределено
			ИЛИ СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетКтРегл) <> Неопределено Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		// Движения по регистрам.
		НоваяСтрока = НаборЗаписейРасчетыСПодотчетниками.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.ВидДвижения = ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий;
		НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Валюта;
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Сумма = ?(ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий = ВидДвиженияНакопления.Приход, НоваяСтрока.Сумма, -НоваяСтрока.Сумма);
		НоваяСтрока.Аналитика =
			""
		  + ВыборкаДетальныеЗаписи.Сотрудник
		  + " / "
		  + ВыборкаДетальныеЗаписи.Документ;
		НоваяСтрока.Раздел = "Расчеты с подотчетниками";
		
		//НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		//НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетДтРегл;
		//НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетКтРегл;
		
		//Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
		//	НоваяСтрока.ВалютаДт = ВыборкаДетальныеЗаписи.Валюта;
		//Иначе
		//	НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
		//КонецЕсли; 
		//
		//Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
		//	НоваяСтрока.ВалютаКт = ВыборкаДетальныеЗаписи.Валюта;
		//Иначе
		//	НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
		//КонецЕсли; 
		
	//	БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
	//	БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Сотрудники", ВыборкаДетальныеЗаписи.Сотрудник);
	//
	//	БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
	//	БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Сотрудники", ВыборкаДетальныеЗаписи.Сотрудник);
		
		
	КонецЦикла;

	//+++ Дмгг
	// для проводок по хоз расчетному
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаОстатки.Организация КАК Организация,
		|	&Дата КАК Период,
		|	&Ссылка КАК Регистратор,
		|	ТаблицаОстатки.Сотрудник КАК Сотрудник,
		|	ТаблицаОстатки.Валюта КАК Валюта,
		|	ТаблицаОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ТаблицаОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
		|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
		|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
		|	КОНЕЦ КАК Сумма,
		|	&КурсоваяРазница КАК СодержаниеПроводки,
		|	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиница,
		|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
		|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаДоходов,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
		|			ТОГДА 0
		|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
		|	КОНЕЦ КАК СуммаРасходов,
		|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
		//|	&СчетЗадолженностьОтрицательная КАК СчетДт,
		|	ВЫБОР
		//--------------------------------------------------------------------------
		// © Шишка В.В. [23 сентября 2021]  НАЧАЛО
		//|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0 
		//|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
		//|			ТОГДА &СчетЗадолженностьОтрицательная
		//|		ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл
		|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
		|			ТОГДА &СчетЗадолженностьОтрицательная
		|		ИНАЧЕ ВЫБОР КОГДА  ТаблицаОстатки.Документ Ссылка Документ.АвансовыйОтчет
		|			ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходуРегл
		|			ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл
		|	        КОНЕЦ
		// © Шишка В.В. [23 сентября 2021]  КОНЕЦ
		//--------------------------------------------------------------------------
		|	КОНЕЦ КАК СчетДт,
		//|	ВЫБОР
		//|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0 
		////+++ Дмгг
		//|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
		////--- Дмгг
		//|			ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл
		//|		ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходуРегл
		//|	КОНЕЦ КАК СчетКт,
		|	ВЫБОР
		//--------------------------------------------------------------------------
		// © Шишка В.В. [23 сентября 2021]  НАЧАЛО
		//|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0 
		//|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
		//|			ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл
		//|		ИНАЧЕ &СчетЗадолженностьПоложительная
		|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
		|			ТОГДА ВЫБОР КОГДА  ТаблицаОстатки.Документ Ссылка Документ.АвансовыйОтчет
		|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходуРегл
		|						ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетникамиРегл
		|	                    КОНЕЦ
		|		ИНАЧЕ &СчетЗадолженностьПоложительная
		// © Шишка В.В. [23 сентября 2021]  КОНЕЦ
		//--------------------------------------------------------------------------
		|	КОНЕЦ КАК СчетКт,
		//--------------------------------------------------------------------------
		// © Шишка В.В. [23 сентября 2021]  НАЧАЛО
		|	ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) КАК СуммаКР,
		// © Шишка В.В. [23 сентября 2021]  КОНЕЦ
		//--------------------------------------------------------------------------
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
		|				И ВЫБОР
		|					КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0
		|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетниками.Валютный
		|					ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходу.Валютный
		|				КОНЕЦ
		|			ТОГДА ТаблицаОстатки.Валюта
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ВалютаДт,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
		|				И ВЫБОР
		|					КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0
		|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетниками.Валютный
		|					ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходу.Валютный
		|				КОНЕЦ
		|			ТОГДА ТаблицаОстатки.Валюта
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ВалютаКт,
		|	&КурсоваяРазница КАК Содержание,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
		|			ТОГДА &СчетЗадолженностьПоложительная
		|		ИНАЧЕ &СчетЗадолженностьОтрицательная
		|	КОНЕЦ КАК СчетУчетаРегл
		|ИЗ
		|	РегистрНакопления.РасчетыСПодотчетниками.Остатки(&ДатаКон, Организация = &Организация) КАК ТаблицаОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&ДатаКон,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						Константы.ВалютаУчета
		|					ИЗ
		|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
		|		ПО ТаблицаОстатки.Валюта = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта,
		|	Константа.ВалютаУчета КАК ВалютаУчета
		|ГДЕ
		|	ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> ТаблицаОстатки.СуммаОстаток
		|	И (ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток >= 0.005
		|			ИЛИ ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток <= -0.005)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетДт) <> Неопределено
			ИЛИ СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетКт) <> Неопределено Тогда
		
			Продолжить;
		
		КонецЕсли;
		
		НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
			НоваяСтрока.ВалютаДт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
			НоваяСтрока.ВалютаКт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Сотрудники", ВыборкаДетальныеЗаписи.Сотрудник);
	
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Сотрудники", ВыборкаДетальныеЗаписи.Сотрудник);
	
	КонецЦикла;
	//--- Дмгг
	
	// Расчеты с покупателями.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОстатки.Организация КАК Организация,
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ТаблицаОстатки.ТипРасчетов КАК ТипРасчетов,
	|	ТаблицаОстатки.Контрагент КАК Контрагент,
	|	ТаблицаОстатки.Договор КАК Договор,
	|	ТаблицаОстатки.Документ КАК Документ,
	|	ТаблицаОстатки.Заказ КАК Заказ,
	|	ТаблицаОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	|	ТаблицаОстатки.Договор.ВалютаРасчетов КАК Валюта,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвиженияУправленческий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПоложительнаяКурсоваяРазница)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОтрицательнаяКурсоваяРазница)
	|	КОНЕЦ КАК Статья,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА 0
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|						ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПокупателем
	|					ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПокупателя
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|						ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПокупателемРегл
	|					ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПокупателяРегл
	|				КОНЕЦ
	|		ИНАЧЕ &СчетЗадолженностьОтрицательная
	|	КОНЕЦ КАК СчетДтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|					ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПокупателем
	|				ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПокупателя
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетЗадолженностьПоложительная
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|					ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПокупателемРегл
	|				ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПокупателяРегл
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетКтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|				И ВЫБОР
	|					КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|						ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПокупателем.Валютный
	|					ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПокупателя.Валютный
	|				КОНЕЦ
	|			ТОГДА ТаблицаОстатки.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
	|				И ВЫБОР
	|					КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|						ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПокупателем.Валютный
	|					ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПокупателя.Валютный
	|				КОНЕЦ
	|			ТОГДА ТаблицаОстатки.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	&КурсоваяРазница КАК Содержание,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетЗадолженностьПоложительная
	|		ИНАЧЕ &СчетЗадолженностьОтрицательная
	|	КОНЕЦ КАК СчетУчетаРегл
	|ИЗ
	|	РегистрНакопления.РасчетыСПокупателями.Остатки(
	|			&ДатаКон,
	|			Организация = &Организация
	|				И ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)) КАК ТаблицаОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&ДатаКон,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
	|		ПО ТаблицаОстатки.Договор.ВалютаРасчетов = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
	|ГДЕ
	|	ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> ТаблицаОстатки.СуммаОстаток
	|	И (ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток >= 0.005
	|			ИЛИ ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток <= -0.005)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Окр(ВыборкаДетальныеЗаписи.Сумма, 2) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетДтРегл) <> Неопределено
			ИЛИ СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетКтРегл) <> Неопределено Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		
		// Движения по регистрам.
		НоваяСтрока = НаборЗаписейРасчетыСПокупателями.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.ВидДвижения = ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий;
		НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Валюта;
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Сумма = ?(ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий = ВидДвиженияНакопления.Приход, НоваяСтрока.Сумма, -НоваяСтрока.Сумма);
		НоваяСтрока.Аналитика =
			""
		  + ВыборкаДетальныеЗаписи.Контрагент
		  + " / "
		  + ВыборкаДетальныеЗаписи.Договор
		  + " / "
		  + ВыборкаДетальныеЗаписи.Документ
		  + " / "
		  + ВыборкаДетальныеЗаписи.Заказ;
		НоваяСтрока.Раздел = "Расчеты с покупателями";
		
		НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетДтРегл;
		НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетКтРегл;
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
			НоваяСтрока.ВалютаДт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
			НоваяСтрока.ВалютаКт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Контрагенты", ВыборкаДетальныеЗаписи.Контрагент);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "КонтрагентыСотрудники", ВыборкаДетальныеЗаписи.Контрагент); //+++ Дмгг
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Договоры", ВыборкаДетальныеЗаписи.Договор);
	
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Контрагенты", ВыборкаДетальныеЗаписи.Контрагент);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "КонтрагентыСотрудники", ВыборкаДетальныеЗаписи.Контрагент); //+++ Дмгг
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Договоры", ВыборкаДетальныеЗаписи.Договор);
		
	КонецЦикла;
	
	// Расчеты с поставщиками.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОстатки.Организация КАК Организация,
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ТаблицаОстатки.ТипРасчетов КАК ТипРасчетов,
	|	ТаблицаОстатки.Контрагент КАК Контрагент,
	|	ТаблицаОстатки.Договор КАК Договор,
	|	ТаблицаОстатки.Документ КАК Документ,
	|	ТаблицаОстатки.Заказ КАК Заказ,
	|	ТаблицаОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	|	ТаблицаОстатки.Договор.ВалютаРасчетов КАК Валюта,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвиженияУправленческий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК Сумма,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА 0
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|	КОНЕЦ КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|					ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком
	|				ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПоставщику
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетЗадолженностьОтрицательная
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|					ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|				ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетДтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|						ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком
	|					ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПоставщику
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|						ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПоставщикомРегл
	|					ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПоставщикуРегл
	|				КОНЕЦ
	|		ИНАЧЕ &СчетЗадолженностьПоложительная
	|	КОНЕЦ КАК СчетКтРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
	|				И ВЫБОР
	|					КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|						ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком.Валютный
	|					ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПоставщику.Валютный
	|				КОНЕЦ
	|			ТОГДА ТаблицаОстатки.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|				И ВЫБОР
	|					КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|						ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком.Валютный
	|					ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПоставщику.Валютный
	|				КОНЕЦ
	|			ТОГДА ТаблицаОстатки.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	&КурсоваяРазница КАК Содержание,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА &СчетЗадолженностьОтрицательная
	|		ИНАЧЕ &СчетЗадолженностьПоложительная
	|	КОНЕЦ КАК СчетУчетаРегл
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Остатки(
	|			&ДатаКон,
	|			Организация = &Организация
	|				И ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)) КАК ТаблицаОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&ДатаКон,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
	|		ПО ТаблицаОстатки.Договор.ВалютаРасчетов = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
	|ГДЕ
	|	ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> ТаблицаОстатки.СуммаОстаток
	|	И (ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток >= 0.005
	|			ИЛИ ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток <= -0.005)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Окр(ВыборкаДетальныеЗаписи.Сумма, 2) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетДтРегл) <> Неопределено
			ИЛИ СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаДетальныеЗаписи.СчетКтРегл) <> Неопределено Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		// Движения по регистрам.
		НоваяСтрока = НаборЗаписейРасчетыСПоставщиками.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.ВидДвижения = ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий;
		НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Валюта;
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Сумма = ?(ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий = ВидДвиженияНакопления.Приход, НоваяСтрока.Сумма, -НоваяСтрока.Сумма);
		НоваяСтрока.Аналитика =
			""
		  + ВыборкаДетальныеЗаписи.Контрагент
		  + " / "
		  + ВыборкаДетальныеЗаписи.Договор
		  + " / "
		  + ВыборкаДетальныеЗаписи.Документ
		  + " / "
		  + ВыборкаДетальныеЗаписи.Заказ;
		НоваяСтрока.Раздел = "Расчеты с поставщиками";
		
		
		НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетДтРегл;
		НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетКтРегл;
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
			НоваяСтрока.ВалютаДт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
			НоваяСтрока.ВалютаКт = ВыборкаДетальныеЗаписи.Валюта;
		Иначе
			НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Контрагенты", ВыборкаДетальныеЗаписи.Контрагент);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "КонтрагентыСотрудники", ВыборкаДетальныеЗаписи.Контрагент); //+++ Дмгг
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Договоры", ВыборкаДетальныеЗаписи.Договор);
	
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаДетальныеЗаписи.Валюта);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Контрагенты", ВыборкаДетальныеЗаписи.Контрагент);
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "КонтрагентыСотрудники", ВыборкаДетальныеЗаписи.Контрагент); //+++ Дмгг
		БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Договоры", ВыборкаДетальныеЗаписи.Договор);
		
		
	КонецЦикла;
	
	_РасчетКурсовыхРазницКредиты = Истина;
	Если _РасчетКурсовыхРазницКредиты Тогда
		
		// Расчеты по кредитам и займам
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		// Kuzmich, 19.09.2023, (ONESOFT-2346) ვალუტაში გაცემული სესხის შემთხვევაში თვის დახურვა არ აკეთებს ძირი თანხის გადაფასებას, восстановил из предыдущей версии
		Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));
		Запрос.УстановитьПараметр("КонецМесяцаГраница", Новый Граница(КонецМесяца(Дата), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация); //Lazare 14.07.2022
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	&КонецМесяца КАК Период,
		|	РасчетыПоКредитамИЗаймамОстатки.Организация КАК Организация,
		|	РасчетыПоКредитамИЗаймамОстатки.Контрагент КАК Контрагент,
		|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
		|	РасчетыПоКредитамИЗаймамОстатки.ОсновнойДолгОстаток КАК ОсновнойДолгОстаток,
		|	РасчетыПоКредитамИЗаймамОстатки.ОсновнойДолгВалОстаток КАК ОсновнойДолгВалОстаток,
		|	КурсыВалютУчетаСрезПоследних.Курс КАК Курс,
		|	КурсыВалютУчетаСрезПоследних.Кратность КАК Кратность,
		|	ЕСТЬNULL(РасчетыПоКредитамИЗаймамОстатки.ОсновнойДолгВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(РасчетыПоКредитамИЗаймамОстатки.ОсновнойДолгОстаток, 0) КАК КурсоваяРазница,
		//+++ Дмгг, 10.07.2025, ONESOFT-4185
		|	ЕСТЬNULL(РасчетыПоКредитамИЗаймамОстатки.ПроцентыВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(РасчетыПоКредитамИЗаймамОстатки.ПроцентыОстаток, 0) КАК ПроцентыКурсоваяРазница,
		|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма.СчетУчетаПроцентовРегл КАК СчетУчетаПроцентовРегл,
		//--- Дмгг, 10.07.2025, ONESOFT-4185
		|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма.ВалютаРасчетов КАК Валюта,
		|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма.СчетУчетаРегл КАК СчетУчетаРегл
		// Kuzmich, 09.12.2024, (ONESOFT-3668) Переоценка процента кредитов и заполнение "проекта" в регистре "расчеты с кредитами и займами"
		|	, РасчетыПоКредитамИЗаймамОстатки.Проект
		// Kuzmich, 09.12.2024, (ONESOFT-3668) Переоценка процента кредитов и заполнение "проекта" в регистре "расчеты с кредитами и займами"
		// Kuzmich, 12.12.2024, (ONESOFT-3680) Не зполняется вид договора кредитов в проводках закрытия месяца
		|	, РасчетыПоКредитамИЗаймамОстатки.ВидДоговора
		// Kuzmich, 12.12.2024, (ONESOFT-3680) Не зполняется вид договора кредитов в проводках закрытия месяца
		|ИЗ
		|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Остатки(&КонецМесяцаГраница, ) КАК РасчетыПоКредитамИЗаймамОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				&КонецМесяца,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						Константы.ВалютаУчета
		|					ИЗ
		|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
		|		ПО (ИСТИНА)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецМесяца, ) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
		|		ПО РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма.ВалютаРасчетов = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
		|ГДЕ
		|	РасчетыПоКредитамИЗаймамОстатки.ОсновнойДолгВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> РасчетыПоКредитамИЗаймамОстатки.ОсновнойДолгОстаток
		//+++ Дмгг, 10.07.2025, ONESOFT-4185
		|	ИЛИ ЕСТЬNULL(РасчетыПоКредитамИЗаймамОстатки.ПроцентыВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> ЕСТЬNULL(РасчетыПоКредитамИЗаймамОстатки.ПроцентыОстаток, 0)
		//--- Дмгг, 10.07.2025, ONESOFT-4185
		|ИТОГИ ПО
		|	ДоговорКредитаЗайма";
		
		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаВзятияКредитов = РезультатЗапроса.Выгрузить();
		
		ВыборкаПоДоговорамКредитов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоДоговорамКредитов.Следующий() Цикл
			
			ВыборкаЗакрытиеКредита = ВыборкаПоДоговорамКредитов.Выбрать();	
			Пока ВыборкаЗакрытиеКредита.Следующий() Цикл			
				
				
				Если Окр(ВыборкаЗакрытиеКредита.КурсоваяРазница, 2) = 0 //Тогда  
					И Окр(ВыборкаЗакрытиеКредита.ПроцентыКурсоваяРазница, 2) = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				КурсоваяРазница = ВыборкаЗакрытиеКредита.КурсоваяРазница;    
				//+++ Дмгг, НеПереоцениватьСчета
				//Если Окр(ВыборкаЗакрытиеКредита.КурсоваяРазница, 2) <> 0 Тогда 
				Если Окр(ВыборкаЗакрытиеКредита.КурсоваяРазница, 2) <> 0 
					И СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаЗакрытиеКредита.СчетУчетаРегл) = Неопределено Тогда
						
					//	Продолжить;
					//	
					//КонецЕсли; 
					//--- Дмгг, НеПереоцениватьСчета
					
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗакрытиеКредита);
					НоваяСтрока.Период = КонецМесяца(Дата);
					НоваяСтрока.Сумма = ?(КурсоваяРазница < 0, -КурсоваяРазница, КурсоваяРазница);
					НоваяСтрока.Содержание = НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница кредиты';en='The exchange rate difference Loans'");
					
					Если КурсоваяРазница > 0 Тогда	
						НоваяСтрока.СчетДт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
						НоваяСтрока.СчетКт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;							
					Иначе				
						НоваяСтрока.СчетДт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
						НоваяСтрока.СчетКт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;							
					КонецЕсли;
					
					Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
						НоваяСтрока.ВалютаДт = ВыборкаЗакрытиеКредита.Валюта;
					Иначе
						НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
					КонецЕсли; 
					
					Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
						НоваяСтрока.ВалютаКт = ВыборкаЗакрытиеКредита.Валюта;
					Иначе
						НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
					КонецЕсли; 
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаЗакрытиеКредита.Валюта);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Контрагенты", ВыборкаЗакрытиеКредита.Контрагент);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "КонтрагентыСотрудники", ВыборкаЗакрытиеКредита.Контрагент); 					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "ДоговорыКредитовИЗаймов", ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма);
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаЗакрытиеКредита.Валюта);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Контрагенты", ВыборкаЗакрытиеКредита.Контрагент);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "КонтрагентыСотрудники", ВыборкаЗакрытиеКредита.Контрагент); 
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "ДоговорыКредитовИЗаймов", ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма);		
				КонецЕсли;
				//+++ Дмгг, 10.07.2025, ONESOFT-418  
				//+++ Дмгг, НеПереоцениватьСчета
				//Если ВыборкаЗакрытиеКредита.ПроцентыКурсоваяРазница <> 0 Тогда    
					
				//+++ Дмгг, НеПереоцениватьСчета 
				Если ВыборкаЗакрытиеКредита.ПроцентыКурсоваяРазница <> 0
					И СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаЗакрытиеКредита.СчетУчетаПроцентовРегл) = Неопределено Тогда
						
					//	Продолжить;
					//	
					//КонецЕсли; 
					//--- Дмгг, НеПереоцениватьСчета
					
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗакрытиеКредита);
					НоваяСтрока.Период = КонецМесяца(Дата);
					НоваяСтрока.Сумма = ?(ВыборкаЗакрытиеКредита.ПроцентыКурсоваяРазница < 0, -ВыборкаЗакрытиеКредита.ПроцентыКурсоваяРазница, ВыборкаЗакрытиеКредита.ПроцентыКурсоваяРазница);
					НоваяСтрока.Содержание = НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница кредиты';en='The exchange rate difference Loans'");
					
					Если ВыборкаЗакрытиеКредита.ПроцентыКурсоваяРазница > 0 Тогда	
						НоваяСтрока.СчетДт = ВыборкаЗакрытиеКредита.СчетУчетаПроцентовРегл;
						НоваяСтрока.СчетКт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;							
					Иначе				
						НоваяСтрока.СчетДт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
						НоваяСтрока.СчетКт = ВыборкаЗакрытиеКредита.СчетУчетаПроцентовРегл;							
					КонецЕсли;
					
					Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
						НоваяСтрока.ВалютаДт = ВыборкаЗакрытиеКредита.Валюта;
					Иначе
						НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
					КонецЕсли; 
					
					Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
						НоваяСтрока.ВалютаКт = ВыборкаЗакрытиеКредита.Валюта;
					Иначе
						НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
					КонецЕсли; 
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаЗакрытиеКредита.Валюта);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Контрагенты", ВыборкаЗакрытиеКредита.Контрагент);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "КонтрагентыСотрудники", ВыборкаЗакрытиеКредита.Контрагент); 					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "ДоговорыКредитовИЗаймов", ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма);
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаЗакрытиеКредита.Валюта);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Контрагенты", ВыборкаЗакрытиеКредита.Контрагент);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "КонтрагентыСотрудники", ВыборкаЗакрытиеКредита.Контрагент); 
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "ДоговорыКредитовИЗаймов", ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма);	
				КонецЕсли;
				//--- Дмгг, 10.07.2025, ONESOFT-4185
				
				//+++ Дмгг, 10.07.2025, ONESOFT-4372
				Если (Окр(ВыборкаЗакрытиеКредита.КурсоваяРазница, 2) <> 0 
					И СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаЗакрытиеКредита.СчетУчетаРегл) = Неопределено)
					ИЛИ (ВыборкаЗакрытиеКредита.ПроцентыКурсоваяРазница <> 0
					И СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаЗакрытиеКредита.СчетУчетаПроцентовРегл) = Неопределено) Тогда
					
					НоваяСтрокаРасчетыПоКредитамИЗаймам = НаборЗаписейРасчетыПоКредитамИЗаймам.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаРасчетыПоКредитамИЗаймам, ВыборкаЗакрытиеКредита);
					//+++ Дмгг, 12.11.25, ONESOFT-4499
					//НоваяСтрокаРасчетыПоКредитамИЗаймам.ВидДвижения = ?(КурсоваяРазница < 0, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);     
					Если КурсоваяРазница = 0 И ВыборкаЗакрытиеКредита.ПроцентыКурсоваяРазница <> 0 Тогда 
						НоваяСтрокаРасчетыПоКредитамИЗаймам.ВидДвижения = ?(ВыборкаЗакрытиеКредита.ПроцентыКурсоваяРазница < 0, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
					Иначе
						НоваяСтрокаРасчетыПоКредитамИЗаймам.ВидДвижения = ?(КурсоваяРазница < 0, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
					КонецЕсли;
					//--- Дмгг, 12.11.25, ONESOFT-4499					
					//+++ Дмгг, 10.07.2025, ONESOFT-4372
					Если Окр(ВыборкаЗакрытиеКредита.КурсоваяРазница, 2) <> 0 
						И СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаЗакрытиеКредита.СчетУчетаРегл) = Неопределено Тогда
						
						НоваяСтрокаРасчетыПоКредитамИЗаймам.ОсновнойДолг = ?(КурсоваяРазница < 0, -КурсоваяРазница, КурсоваяРазница);  
					КонецЕсли;
					//--- Дмгг, 10.07.2025, ONESOFT-4372
					//+++ Дмгг, 10.07.2025, ONESOFT-4372   
					Если ВыборкаЗакрытиеКредита.ПроцентыКурсоваяРазница <> 0
						И СтруктураОтраженияКурсовыхРазницРегл.НеПереоцениватьСчета.Найти(ВыборкаЗакрытиеКредита.СчетУчетаПроцентовРегл) = Неопределено Тогда   
						
						Если КурсоваяРазница < 0 И ВыборкаЗакрытиеКредита.ПроцентыКурсоваяРазница > 0 Тогда 
							НоваяСтрокаРасчетыПоКредитамИЗаймам.Проценты = -ВыборкаЗакрытиеКредита.ПроцентыКурсоваяРазница;     
						ИначеЕсли КурсоваяРазница > 0 И ВыборкаЗакрытиеКредита.ПроцентыКурсоваяРазница < 0 Тогда      
							НоваяСтрокаРасчетыПоКредитамИЗаймам.Проценты = ВыборкаЗакрытиеКредита.ПроцентыКурсоваяРазница; 
						Иначе    
							НоваяСтрокаРасчетыПоКредитамИЗаймам.Проценты = ?(ВыборкаЗакрытиеКредита.ПроцентыКурсоваяРазница < 0, -ВыборкаЗакрытиеКредита.ПроцентыКурсоваяРазница, ВыборкаЗакрытиеКредита.ПроцентыКурсоваяРазница);
						КонецЕсли;     
						
					КонецЕсли;
					//--- Дмгг, 10.07.2025, ONESOFT-4372
					НоваяСтрокаРасчетыПоКредитамИЗаймам.ОсновнойДолгВал = 0;
					НоваяСтрокаРасчетыПоКредитамИЗаймам.Период = КонецМесяца(Дата);
					НоваяСтрокаРасчетыПоКредитамИЗаймам.СодержаниеПроводки = НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница кредиты остаток';en='The exchange rate difference balance of the loan'");
					НоваяСтрокаРасчетыПоКредитамИЗаймам.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ЗакрытиеМесяца;
				КонецЕсли;
				//--- Дмгг, 10.07.2025, ONESOFT-4372
				НоваяСтрокаОтчетПоКурсовымРазницам = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
				НоваяСтрокаДоходыИРасходы = НаборЗаписейДоходыИРасходы.Добавить();
				
				Если КурсоваяРазница < 0 Тогда			
					
					НоваяСтрокаОтчетПоКурсовымРазницам.Сумма = -КурсоваяРазница;
					НоваяСтрокаОтчетПоКурсовымРазницам.СуммаДоходов = -КурсоваяРазница;
					
					НоваяСтрокаДоходыИРасходы.СчетУчетаРегл = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;
					НоваяСтрокаДоходыИРасходы.СчетУчета = ПланыСчетов.Управленческий.ПрочиеДоходы;
					НоваяСтрокаДоходыИРасходы.СуммаДоходов = -КурсоваяРазница;
					
				Иначе
					
					НоваяСтрокаОтчетПоКурсовымРазницам.Сумма = КурсоваяРазница;
					НоваяСтрокаОтчетПоКурсовымРазницам.СуммаРасходов = КурсоваяРазница;
					
					НоваяСтрокаДоходыИРасходы.СчетУчетаРегл = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
					НоваяСтрокаДоходыИРасходы.СчетУчета = ПланыСчетов.Управленческий.ПрочиеРасходы;
					НоваяСтрокаДоходыИРасходы.СуммаРасходов = КурсоваяРазница;
					
				КонецЕсли; 
				
				НоваяСтрокаДоходыИРасходы.Период = КонецМесяца(Дата);
				НоваяСтрокаДоходыИРасходы.Организация = Организация;
				НоваяСтрокаДоходыИРасходы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
				НоваяСтрокаДоходыИРасходы.СодержаниеПроводки = НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница кредиты';en='The exchange rate difference Loans'");
				
				НоваяСтрокаОтчетПоКурсовымРазницам.Период = КонецМесяца(Дата);
				НоваяСтрокаОтчетПоКурсовымРазницам.Организация = Организация;
				НоваяСтрокаОтчетПоКурсовымРазницам.Валюта = ВыборкаЗакрытиеКредита.Валюта;
				//ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
				
				НоваяСтрокаОтчетПоКурсовымРазницам.Аналитика =
				""
				+ ВыборкаЗакрытиеКредита.Контрагент
				+ " / "
				+ ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма;
				//+ " / "
				//+ ВыборкаДетальныеЗаписи.Документ
				//+ " / "
				//+ ВыборкаДетальныеЗаписи.Заказ;
				НоваяСтрокаОтчетПоКурсовымРазницам.Раздел = "Расчеты по кредитам и займам";
				
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если 1 > 2 Тогда 
			
			// Расчеты по кредитам и займам
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			// Kuzmich, 19.09.2023, (ONESOFT-2346) ვალუტაში გაცემული სესხის შემთხვევაში თვის დახურვა არ აკეთებს ძირი თანხის გადაფასებას, восстановил из предыдущей версии
			Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
			Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));
			Запрос.УстановитьПараметр("КонецМесяцаГраница", Новый Граница(КонецМесяца(Дата), ВидГраницы.Включая));
			Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация); //Lazare 14.07.2022
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
			|	РасчетыПоКредитамИЗаймамОстатки.ОсновнойДолгОстаток КАК ОсновнойДолгОстаток,
			|	РасчетыПоКредитамИЗаймамОстатки.ОсновнойДолгВалОстаток КАК ОсновнойДолгВалОстаток
			|ПОМЕСТИТЬ ВТ_Остатки
			|ИЗ
			|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Остатки(&КонецМесяцаГраница, ) КАК РасчетыПоКредитамИЗаймамОстатки
			|ГДЕ
			|	РасчетыПоКредитамИЗаймамОстатки.Организация = &Организация   //Lazare 14.07.2022
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
			|	РасчетыПоКредитамИЗаймамОстатки.ОсновнойДолгОстаток КАК ОсновнойДолгОстаток,
			|	РасчетыПоКредитамИЗаймамОстатки.ОсновнойДолгВалОстаток КАК ОсновнойДолгВалОстаток
			|ПОМЕСТИТЬ ВТ_ОстаткиПрошлогоМесяца
			|ИЗ
			|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Остатки(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецМесяца, МЕСЯЦ, -1), МЕСЯЦ), ) КАК РасчетыПоКредитамИЗаймамОстатки
			|ГДЕ
			|	РасчетыПоКредитамИЗаймамОстатки.Организация = &Организация   //Lazare 14.07.2022
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
			|	РасчетыПоКредитамИЗаймамОбороты.Период КАК Период,
			|	РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгРасход КАК ОсновнойДолгРасход,
			|	РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгВалРасход КАК ОсновнойДолгВалРасход,
			|	ВЫБОР
			|		КОГДА ВТ_ОстаткиПрошлогоМесяца.ОсновнойДолгОстаток <> 0
			|			ТОГДА КурсыВалютСрезПоследних.Курс
			|		ИНАЧЕ ВЫБОР
			|				КОГДА РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгВалРасход = 0
			|					ТОГДА 0
			|				ИНАЧЕ РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгРасход / РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгВалРасход
			|			КОНЕЦ
			|	КОНЕЦ КАК Курс,
			|	ВТ_ОстаткиТекущегоМесяца.ОсновнойДолгОстаток КАК ОсновнойДолгОстаток,
			|	ВТ_ОстаткиТекущегоМесяца.ОсновнойДолгВалОстаток КАК ОсновнойДолгВалОстаток,
			|	КурсыВалютСрезПоследних.Курс КАК КурсПрошлогоМесяца
			|ИЗ
			|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Обороты(
			|			,
			|			&КонецМесяца,
			|			День,
			|			ДоговорКредитаЗайма В
			|				(ВЫБРАТЬ
			|					Остатки.ДоговорКредитаЗайма
			|				ИЗ
			|					ВТ_Остатки КАК Остатки)) КАК РасчетыПоКредитамИЗаймамОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецМесяца, МЕСЯЦ, -1), МЕСЯЦ), ) КАК КурсыВалютСрезПоследних
			|		ПО РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма.ВалютаРасчетов = КурсыВалютСрезПоследних.Валюта
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиПрошлогоМесяца КАК ВТ_ОстаткиПрошлогоМесяца
			|		ПО РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма = ВТ_ОстаткиПрошлогоМесяца.ДоговорКредитаЗайма
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_ОстаткиТекущегоМесяца
			|		ПО РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма = ВТ_ОстаткиТекущегоМесяца.ДоговорКредитаЗайма
			|ГДЕ
			|	РасчетыПоКредитамИЗаймамОбороты.Организация = &Организация  //Lazare 14.07.2022
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДоговорКредитаЗайма,
			|	Период";
			
			
			РезультатЗапроса = Запрос.Выполнить();
			ТаблицаВзятияКредитов = РезультатЗапроса.Выгрузить();
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
			|	РасчетыПоКредитамИЗаймамОбороты.Период КАК Период,
			|	РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгПриход,
			|	РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгВалПриход,
			|	ВЫБОР
			|		КОГДА РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгВалПриход = 0
			|			ТОГДА 0
			|		ИНАЧЕ РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгПриход / РасчетыПоКредитамИЗаймамОбороты.ОсновнойДолгВалПриход
			|	КОНЕЦ КАК Курс,
			|	КурсыВалютСрезПоследних.Курс КАК КурсНаКонецМесяца,
			|	РасчетыПоКредитамИЗаймамОбороты.Контрагент,
			|	РасчетыПоКредитамИЗаймамОбороты.Организация,
			|	РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма.ВалютаРасчетов КАК Валюта,
			|	РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма.СчетУчетаРегл КАК СчетУчетаРегл
			// Kuzmich, 09.12.2024, (ONESOFT-3668) Переоценка процента кредитов и заполнение "проекта" в регистре "расчеты с кредитами и займами"
			|	, РасчетыПоКредитамИЗаймамОбороты.Проект
			// Kuzmich, 09.12.2024, (ONESOFT-3668) Переоценка процента кредитов и заполнение "проекта" в регистре "расчеты с кредитами и займами"
			// Kuzmich, 12.12.2024, (ONESOFT-3680) Не зполняется вид договора кредитов в проводках закрытия месяца
			|	, РасчетыПоКредитамИЗаймамОбороты.ВидДоговора
			// Kuzmich, 12.12.2024, (ONESOFT-3680) Не зполняется вид договора кредитов в проводках закрытия месяца
			|ИЗ
			|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Обороты(
			|			&НачалоМесяца,
			|			&КонецМесяца,
			|			День,
			|			ДоговорКредитаЗайма В
			|				(ВЫБРАТЬ
			|					Остатки.ДоговорКредитаЗайма
			|				ИЗ
			|					ВТ_Остатки КАК Остатки)) КАК РасчетыПоКредитамИЗаймамОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецМесяца, ) КАК КурсыВалютСрезПоследних
			|		ПО РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма.ВалютаРасчетов = КурсыВалютСрезПоследних.Валюта
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДоговорКредитаЗайма,
			|	Период
			|ИТОГИ ПО
			|	ДоговорКредитаЗайма";
			
			РезультатЗапроса = Запрос.Выполнить();
			
			СтруктураОтраженияКурсовыхРазницРегл = РегламентированныйУчетСервер.ПолучитьСтруктуруОтраженияКурсовыхРазниц2(Дата, Организация);
			
			Запрос.УстановитьПараметр("ДатаКон", ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод);
			Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
			Запрос.УстановитьПараметр("КурсоваяРазница", );
			
			ВыборкаПоДоговорамКредитов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоДоговорамКредитов.Следующий() Цикл
				
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("ДоговорКредитаЗайма", ВыборкаПоДоговорамКредитов.ДоговорКредитаЗайма);
				СтрокиПоступления = ТаблицаВзятияКредитов.НайтиСтроки(ПараметрыОтбора);
				
				Если СтрокиПоступления.Количество() > 0 Тогда
					ВыборкаЗакрытиеКредита = ВыборкаПоДоговорамКредитов.Выбрать();
					КоличествоИтераций = ВыборкаЗакрытиеКредита.Количество();
					Итератор = 0;
					Пока ВыборкаЗакрытиеКредита.Следующий() Цикл
						
						Итератор = Итератор + 1;
						
						Если СтрокиПоступления[0].ОсновнойДолгВалОстаток = 0 Тогда 
							Сумма = ВыборкаЗакрытиеКредита.ОсновнойДолгВалПриход * ВыборкаЗакрытиеКредита.Курс;//СтрокиПоступления[0].Курс;
						Иначе
							Сумма = ВыборкаЗакрытиеКредита.ОсновнойДолгВалПриход * СтрокиПоступления[0].Курс;
						КонецЕсли;
						
						Если Сумма = 0 И СтрокиПоступления[0].ОсновнойДолгВалОстаток <> 0 Тогда
							
							Продолжить;
							
						КонецЕсли; 
						
						Если СтрокиПоступления[0].ОсновнойДолгВалОстаток = 0 Тогда
							КурсоваяРазница = СтрокиПоступления[0].ОсновнойДолгОстаток;
							//КурсоваяРазница = ВыборкаЗакрытиеКредита.ОсновнойДолгПриход - Сумма;
						Иначе
							КурсоваяРазница = ВыборкаЗакрытиеКредита.ОсновнойДолгПриход - Сумма;
						КонецЕсли;
						
						Если Итератор = 1 И СтрокиПоступления[0].ОсновнойДолгВалОстаток = 0 Тогда 
							НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
							
							ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗакрытиеКредита);
							НоваяСтрока.Период = КонецМесяца(Дата);
							//НоваяСтрока.Сумма = КурсоваяРазница;
							НоваяСтрока.Сумма = ?(КурсоваяРазница < 0, -КурсоваяРазница, КурсоваяРазница);
							НоваяСтрока.Содержание = НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница кредиты';en='The exchange rate difference Loans'");
							
							Если КурсоваяРазница < 0 Тогда
								
								//Если СтрокиПоступления[0].ОсновнойДолгВалОстаток = 0 Тогда 
								//	НоваяСтрока.СчетДт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
								//	НоваяСтрока.СчетКт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
								//ИНАЧЕ
								НоваяСтрока.СчетДт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
								НоваяСтрока.СчетКт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;
								//КонецЕсли;
								
							Иначе
								
								НоваяСтрока.СчетДт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
								НоваяСтрока.СчетКт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
								
							КонецЕсли;
							
							Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
								НоваяСтрока.ВалютаДт = ВыборкаЗакрытиеКредита.Валюта;
							Иначе
								НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
							КонецЕсли; 
							
							Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
								НоваяСтрока.ВалютаКт = ВыборкаЗакрытиеКредита.Валюта;
							Иначе
								НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
							КонецЕсли; 
							
							БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаЗакрытиеКредита.Валюта);
							БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Контрагенты", ВыборкаЗакрытиеКредита.Контрагент);
							БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "КонтрагентыСотрудники", ВыборкаЗакрытиеКредита.Контрагент); //+++ Дмгг
							БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "ДоговорыКредитовИЗаймов", ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма);
							
							БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаЗакрытиеКредита.Валюта);
							БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Контрагенты", ВыборкаЗакрытиеКредита.Контрагент);
							БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "КонтрагентыСотрудники", ВыборкаЗакрытиеКредита.Контрагент); //+++ Дмгг
							БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "ДоговорыКредитовИЗаймов", ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма);
							
							
							НоваяСтрокаРасчетыПоКредитамИЗаймам = НаборЗаписейРасчетыПоКредитамИЗаймам.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрокаРасчетыПоКредитамИЗаймам, ВыборкаЗакрытиеКредита);
							НоваяСтрокаРасчетыПоКредитамИЗаймам.ВидДвижения = ВидДвиженияНакопления.Расход;
							НоваяСтрокаРасчетыПоКредитамИЗаймам.ОсновнойДолг = КурсоваяРазница;
							НоваяСтрокаРасчетыПоКредитамИЗаймам.ОсновнойДолгВал = 0;
							НоваяСтрокаРасчетыПоКредитамИЗаймам.Период = КонецМесяца(Дата);
							НоваяСтрокаРасчетыПоКредитамИЗаймам.СодержаниеПроводки = НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница кредиты остаток';en='The exchange rate difference balance of the loan'");
							НоваяСтрокаРасчетыПоКредитамИЗаймам.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ЗакрытиеМесяца;
							//ИначеЕсли  Итератор <> 1 И СтрокиПоступления[0].ОсновнойДолгВалОстаток <> 0 Тогда 
							//	НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
							//	
							//	ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗакрытиеКредита);
							//	НоваяСтрока.Период = КонецМесяца(Дата);
							//	НоваяСтрока.Сумма = КурсоваяРазница;
							//	НоваяСтрока.Содержание = НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница кредиты';en='The exchange rate difference Loans'");
							//	
							//	Если КурсоваяРазница < 0 Тогда
							//		
							//		Если СтрокиПоступления[0].ОсновнойДолгВалОстаток = 0 Тогда 
							//			НоваяСтрока.СчетДт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
							//			НоваяСтрока.СчетКт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
							//		ИНАЧЕ
							//			НоваяСтрока.СчетДт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
							//			НоваяСтрока.СчетКт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;
							//		КонецЕсли;
							//		
							//	Иначе
							//		
							//		НоваяСтрока.СчетДт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
							//		НоваяСтрока.СчетКт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
							//		
							//	КонецЕсли;
							//	
							//	Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
							//		НоваяСтрока.ВалютаДт = ВыборкаЗакрытиеКредита.Валюта;
							//	Иначе
							//		НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
							//	КонецЕсли; 
							//	
							//	Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
							//		НоваяСтрока.ВалютаКт = ВыборкаЗакрытиеКредита.Валюта;
							//	Иначе
							//		НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
							//	КонецЕсли; 
							//	
							//	БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаЗакрытиеКредита.Валюта);
							//	БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Контрагенты", ВыборкаЗакрытиеКредита.Контрагент);
							//	БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "ДоговорыКредитовИЗаймов", ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма);
							//	
							//	БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаЗакрытиеКредита.Валюта);
							//	БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Контрагенты", ВыборкаЗакрытиеКредита.Контрагент);
							//	БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "ДоговорыКредитовИЗаймов", ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма);
							//	
							//	НоваяСтрокаРасчетыПоКредитамИЗаймам = НаборЗаписейРасчетыПоКредитамИЗаймам.Добавить();
							//	ЗаполнитьЗначенияСвойств(НоваяСтрокаРасчетыПоКредитамИЗаймам, ВыборкаЗакрытиеКредита);
							//	НоваяСтрокаРасчетыПоКредитамИЗаймам.ВидДвижения = ВидДвиженияНакопления.Расход;
							//	НоваяСтрокаРасчетыПоКредитамИЗаймам.ОсновнойДолг = КурсоваяРазница;
							//	НоваяСтрокаРасчетыПоКредитамИЗаймам.ОсновнойДолгВал = 0;
							//	НоваяСтрокаРасчетыПоКредитамИЗаймам.Период = КонецМесяца(Дата);
							//	НоваяСтрокаРасчетыПоКредитамИЗаймам.СодержаниеПроводки = НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница кредиты остаток';en='The exchange rate difference balance of the loan'");
							//	НоваяСтрокаРасчетыПоКредитамИЗаймам.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ЗакрытиеМесяца;
						КонецЕсли;
						
						//НоваяСтрока.Период = КонецМесяца(Дата);
						//ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗакрытиеКредита);
						//НоваяСтрока.Период = КонецМесяца(Дата);
						//НоваяСтрока.Сумма = КурсоваяРазница;
						//НоваяСтрока.Содержание = НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница кредиты';en='The exchange rate difference Loans'");
						
						
						НоваяСтрокаОтчетПоКурсовымРазницам = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
						НоваяСтрокаДоходыИРасходы = НаборЗаписейДоходыИРасходы.Добавить();
						//ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
						
						
						Если КурсоваяРазница < 0 Тогда
							
							//Если СтрокиПоступления[0].ОсновнойДолгВалОстаток = 0 Тогда 
							//	НоваяСтрока.СчетДт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
							//	НоваяСтрока.СчетКт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
							//ИНАЧЕ
							//	НоваяСтрока.СчетДт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
							//	НоваяСтрока.СчетКт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;
							//КонецЕсли;
							
							НоваяСтрокаОтчетПоКурсовымРазницам.Сумма = -КурсоваяРазница;
							НоваяСтрокаОтчетПоКурсовымРазницам.СуммаДоходов = -КурсоваяРазница;
							
							НоваяСтрокаДоходыИРасходы.СчетУчетаРегл = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;
							НоваяСтрокаДоходыИРасходы.СчетУчета = ПланыСчетов.Управленческий.ПрочиеДоходы;
							НоваяСтрокаДоходыИРасходы.СуммаДоходов = -КурсоваяРазница;
							
						Иначе
							
							//НоваяСтрока.СчетДт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
							//НоваяСтрока.СчетКт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
							
							НоваяСтрокаОтчетПоКурсовымРазницам.Сумма = КурсоваяРазница;
							НоваяСтрокаОтчетПоКурсовымРазницам.СуммаРасходов = КурсоваяРазница;
							
							НоваяСтрокаДоходыИРасходы.СчетУчетаРегл = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
							НоваяСтрокаДоходыИРасходы.СчетУчета = ПланыСчетов.Управленческий.ПрочиеРасходы;
							НоваяСтрокаДоходыИРасходы.СуммаРасходов = КурсоваяРазница;
							
						КонецЕсли; 
						
						НоваяСтрокаДоходыИРасходы.Период = КонецМесяца(Дата);
						НоваяСтрокаДоходыИРасходы.Организация = Организация;
						НоваяСтрокаДоходыИРасходы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
						НоваяСтрокаДоходыИРасходы.СодержаниеПроводки = НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница кредиты';en='The exchange rate difference Loans'");
						
						
						НоваяСтрокаОтчетПоКурсовымРазницам.Период = КонецМесяца(Дата);
						НоваяСтрокаОтчетПоКурсовымРазницам.Организация = Организация;
						НоваяСтрокаОтчетПоКурсовымРазницам.Валюта = ВыборкаЗакрытиеКредита.Валюта;
						//ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
						
						НоваяСтрокаОтчетПоКурсовымРазницам.Аналитика =
						""
						+ ВыборкаЗакрытиеКредита.Контрагент
						+ " / "
						+ ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма;
						//+ " / "
						//+ ВыборкаДетальныеЗаписи.Документ
						//+ " / "
						//+ ВыборкаДетальныеЗаписи.Заказ;
						НоваяСтрокаОтчетПоКурсовымРазницам.Раздел = "Расчеты по кредитам и займам";
						
						
						//Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
						//	НоваяСтрока.ВалютаДт = ВыборкаЗакрытиеКредита.Валюта;
						//Иначе
						//	НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
						//КонецЕсли; 
						//
						//Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
						//	НоваяСтрока.ВалютаКт = ВыборкаЗакрытиеКредита.Валюта;
						//Иначе
						//	НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
						//КонецЕсли; 
						//
						//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаЗакрытиеКредита.Валюта);
						//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Контрагенты", ВыборкаЗакрытиеКредита.Контрагент);
						//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "ДоговорыКредитовИЗаймов", ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма);
						//
						//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаЗакрытиеКредита.Валюта);
						//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Контрагенты", ВыборкаЗакрытиеКредита.Контрагент);
						//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "ДоговорыКредитовИЗаймов", ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма);
						//
					КонецЦикла; 
				КонецЕсли; 
				
			КонецЦикла;
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасчетыПоКредитамИЗаймамОстатки.Организация,
			|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма,
			|	РасчетыПоКредитамИЗаймамОстатки.Контрагент,
			|	-РасчетыПоКредитамИЗаймамОстатки.ОсновнойДолгОстаток КАК ОсновнойДолгОстаток,
			|	-РасчетыПоКредитамИЗаймамОстатки.ОсновнойДолгВалОстаток КАК ОсновнойДолгВалОстаток,
			|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма.СчетУчетаРегл КАК СчетУчетаРегл,
			|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма.ВалютаРасчетов КАК Валюта,
			|	ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность,1) КАК КурсВалюты
			// Kuzmich, 09.12.2024, (ONESOFT-3668) Переоценка процента кредитов и заполнение "проекта" в регистре "расчеты с кредитами и займами"
			|	, РасчетыПоКредитамИЗаймамОстатки.Проект
			// Kuzmich, 09.12.2024, (ONESOFT-3668) Переоценка процента кредитов и заполнение "проекта" в регистре "расчеты с кредитами и займами"
			// Kuzmich, 12.12.2024, (ONESOFT-3680) Не зполняется вид договора кредитов в проводках закрытия месяца
			|	, РасчетыПоКредитамИЗаймамОстатки.ВидДоговора
			// Kuzmich, 12.12.2024, (ONESOFT-3680) Не зполняется вид договора кредитов в проводках закрытия месяца
			|	
			|ИЗ
			|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Остатки(&ДатаКон, ) КАК РасчетыПоКредитамИЗаймамОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютСрезПоследних
			|		ПО РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма.ВалютаРасчетов = КурсыВалютСрезПоследних.Валюта
			|ГДЕ
			|	РасчетыПоКредитамИЗаймамОстатки.ОсновнойДолгОстаток < 0
			|	И РасчетыПоКредитамИЗаймамОстатки.ОсновнойДолгВалОстаток < 0";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("ДоговорКредитаЗайма", Выборка.ДоговорКредитаЗайма);
				СтрокиПоступления = ТаблицаВзятияКредитов.НайтиСтроки(ПараметрыОтбора);
				
				Если СтрокиПоступления.Количество() > 0 Тогда
					
					Сумма = Выборка.ОсновнойДолгОстаток;//Выборка.ОсновнойДолгВалОстаток * СтрокиПоступления[0].Курс;
					
					Если Сумма = 0 Тогда
						
						Продолжить;
						
					КонецЕсли; 
					
					КурсоваяРазница = (Выборка.ОсновнойДолгВалОстаток * Выборка.КурсВалюты) - Сумма;
					
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					НоваяСтрока.Период = КонецМесяца(Дата);
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
					
					НоваяСтрока.Содержание = НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница кредиты остаток';en='The exchange rate difference balance of the loan'");
					
					НоваяСтрокаОтчетПоКурсовымРазницам = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
					НоваяСтрокаДоходыИРасходы = НаборЗаписейДоходыИРасходы.Добавить();
					НоваяСтрокаРасчетыПоКредитамИЗаймам = НаборЗаписейРасчетыПоКредитамИЗаймам.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаРасчетыПоКредитамИЗаймам, Выборка);
					НоваяСтрокаРасчетыПоКредитамИЗаймам.ВидДвижения = ВидДвиженияНакопления.Расход;
					НоваяСтрокаРасчетыПоКредитамИЗаймам.ОсновнойДолг = КурсоваяРазница;
					НоваяСтрокаРасчетыПоКредитамИЗаймам.ОсновнойДолгВал = 0;
					НоваяСтрокаРасчетыПоКредитамИЗаймам.Период = КонецМесяца(Дата);
					НоваяСтрокаРасчетыПоКредитамИЗаймам.СодержаниеПроводки = НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница кредиты остаток';en='The exchange rate difference balance of the loan'");
					НоваяСтрокаРасчетыПоКредитамИЗаймам.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ЗакрытиеМесяца;
					
					Если КурсоваяРазница < 0 Тогда
						
						НоваяСтрока.Сумма = -КурсоваяРазница;
						
						НоваяСтрока.СчетДт = Выборка.СчетУчетаРегл;
						НоваяСтрока.СчетКт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;
						
						НоваяСтрокаОтчетПоКурсовымРазницам.Сумма = -КурсоваяРазница;
						НоваяСтрокаОтчетПоКурсовымРазницам.СуммаДоходов = -КурсоваяРазница;
						
						НоваяСтрокаДоходыИРасходы.СчетУчетаРегл = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;
						НоваяСтрокаДоходыИРасходы.СчетУчета = ПланыСчетов.Управленческий.ПрочиеДоходы;
						НоваяСтрокаДоходыИРасходы.СуммаДоходов = -КурсоваяРазница;
						
					Иначе
						
						НоваяСтрока.Сумма = КурсоваяРазница;
						
						НоваяСтрока.СчетДт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
						НоваяСтрока.СчетКт = Выборка.СчетУчетаРегл;
						
						НоваяСтрокаОтчетПоКурсовымРазницам.Сумма = КурсоваяРазница;
						НоваяСтрокаОтчетПоКурсовымРазницам.СуммаРасходов = КурсоваяРазница;
						
						НоваяСтрокаДоходыИРасходы.СчетУчетаРегл = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
						НоваяСтрокаДоходыИРасходы.СчетУчета = ПланыСчетов.Управленческий.ПрочиеРасходы;
						НоваяСтрокаДоходыИРасходы.СуммаРасходов = КурсоваяРазница;
						
					КонецЕсли; 
					
					НоваяСтрокаДоходыИРасходы.Период = КонецМесяца(Дата);
					НоваяСтрокаДоходыИРасходы.Организация = Организация;
					НоваяСтрокаДоходыИРасходы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
					НоваяСтрокаДоходыИРасходы.СодержаниеПроводки = НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница кредиты';en='The exchange rate difference Loans'");
					
					
					НоваяСтрокаОтчетПоКурсовымРазницам.Период = КонецМесяца(Дата);
					НоваяСтрокаОтчетПоКурсовымРазницам.Организация = Организация;
					НоваяСтрокаОтчетПоКурсовымРазницам.Валюта = Выборка.Валюта;
					//ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
					
					НоваяСтрокаОтчетПоКурсовымРазницам.Аналитика =
					""
					+ Выборка.Контрагент
					+ " / "
					+ Выборка.ДоговорКредитаЗайма;
					//+ " / "
					//+ ВыборкаДетальныеЗаписи.Документ
					//+ " / "
					//+ ВыборкаДетальныеЗаписи.Заказ;
					НоваяСтрокаОтчетПоКурсовымРазницам.Раздел = "Расчеты по кредитам и займам";
					
					
					Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
						НоваяСтрока.ВалютаДт = Выборка.Валюта;
					Иначе
						НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
					КонецЕсли; 
					
					Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
						НоваяСтрока.ВалютаКт = Выборка.Валюта;
					Иначе
						НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
					КонецЕсли; 
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", Выборка.Валюта);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Контрагенты", Выборка.Контрагент);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "КонтрагентыСотрудники", Выборка.Контрагент);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "ДоговорыКредитовИЗаймов", Выборка.ДоговорКредитаЗайма);
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", Выборка.Валюта);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Контрагенты", Выборка.Контрагент);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "КонтрагентыСотрудники", Выборка.Контрагент);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "ДоговорыКредитовИЗаймов", Выборка.ДоговорКредитаЗайма);
					
				КонецЕсли;
				
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЕсли; 
	
	//Малышев 2025-08-25 ONESOFT-4318 - закоментировал нижний код, т.к. он дублировался (перед ним)
	//_РасчетКурсовыхРазницПроценты = Истина;
	//Если _РасчетКурсовыхРазницПроценты Тогда
	//	
	//	// Расчеты по кредитам и займам
	//	Запрос = Новый Запрос;
	//	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	//	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
	//	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));
	//	Запрос.УстановитьПараметр("КонецМесяцаГраница", Новый Граница(КонецМесяца(Дата), ВидГраницы.Включая));
	//	
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма,
	//	|	РасчетыПоКредитамИЗаймамОстатки.ПроцентыОстаток,
	//	|	РасчетыПоКредитамИЗаймамОстатки.ПроцентыВалОстаток
	//	|ПОМЕСТИТЬ ВТ_ОстаткиПроценты
	//	|ИЗ
	//	|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Остатки(&КонецМесяцаГраница, ) КАК РасчетыПоКредитамИЗаймамОстатки
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма,
	//	|	РасчетыПоКредитамИЗаймамОстатки.ПроцентыОстаток,
	//	|	РасчетыПоКредитамИЗаймамОстатки.ПроцентыВалОстаток
	//	|ПОМЕСТИТЬ ВТ_ОстаткиПроцентыПрошлогоМесяца
	//	|ИЗ
	//	|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Остатки(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецМесяца, МЕСЯЦ, -1), МЕСЯЦ), ) КАК РасчетыПоКредитамИЗаймамОстатки
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
	//	|	РасчетыПоКредитамИЗаймамОбороты.Период КАК Период,
	//	|	РасчетыПоКредитамИЗаймамОбороты.ПроцентыРасход,
	//	|	РасчетыПоКредитамИЗаймамОбороты.ПроцентыВалРасход,
	//	|	ВЫБОР
	//	|		КОГДА ВТ_ОстаткиПроцентыПрошлогоМесяца.ПроцентыОстаток <> 0
	//	|			ТОГДА КурсыВалютСрезПоследних.Курс
	//	|		ИНАЧЕ ВЫБОР
	//	|				КОГДА РасчетыПоКредитамИЗаймамОбороты.ПроцентыВалРасход = 0
	//	|					ТОГДА 0
	//	|				ИНАЧЕ РасчетыПоКредитамИЗаймамОбороты.ПроцентыРасход / РасчетыПоКредитамИЗаймамОбороты.ПроцентыВалРасход
	//	|			КОНЕЦ
	//	|	КОНЕЦ КАК Курс,
	//	|	ВТ_ОстаткиПроцентыТекущегоМесяца.ПроцентыОстаток,
	//	|	ВТ_ОстаткиПроцентыТекущегоМесяца.ПроцентыВалОстаток,
	//	|	КурсыВалютСрезПоследних.Курс КАК КурсПрошлогоМесяца
	//	|ИЗ
	//	|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Обороты(
	//	|			,
	//	|			&КонецМесяца,
	//	|			День,
	//	|			ДоговорКредитаЗайма В
	//	|				(ВЫБРАТЬ
	//	|					Остатки.ДоговорКредитаЗайма
	//	|				ИЗ
	//	|					ВТ_ОстаткиПроценты КАК Остатки)) КАК РасчетыПоКредитамИЗаймамОбороты
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецМесяца, МЕСЯЦ, -1), МЕСЯЦ), ) КАК КурсыВалютСрезПоследних
	//	|		ПО РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма.ВалютаРасчетов = КурсыВалютСрезПоследних.Валюта
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиПроцентыПрошлогоМесяца КАК ВТ_ОстаткиПроцентыПрошлогоМесяца
	//	|		ПО РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма = ВТ_ОстаткиПроцентыПрошлогоМесяца.ДоговорКредитаЗайма
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиПроценты КАК ВТ_ОстаткиПроцентыТекущегоМесяца
	//	|		ПО РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма = ВТ_ОстаткиПроцентыТекущегоМесяца.ДоговорКредитаЗайма
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	ДоговорКредитаЗайма,
	//	|	Период";
	//	
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	ТаблицаВзятияКредитов = РезультатЗапроса.Выгрузить();
	//	
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма КАК ДоговорКредитаЗайма,
	//	|	РасчетыПоКредитамИЗаймамОбороты.Период КАК Период,
	//	|	РасчетыПоКредитамИЗаймамОбороты.ПроцентыПриход,
	//	|	РасчетыПоКредитамИЗаймамОбороты.ПроцентыВалПриход,
	//	|	ВЫБОР
	//	|		КОГДА РасчетыПоКредитамИЗаймамОбороты.ПроцентыВалПриход = 0
	//	|			ТОГДА 0
	//	|		ИНАЧЕ РасчетыПоКредитамИЗаймамОбороты.ПроцентыПриход / РасчетыПоКредитамИЗаймамОбороты.ПроцентыВалПриход
	//	|	КОНЕЦ КАК Курс,
	//	|	КурсыВалютСрезПоследних.Курс КАК КурсНаКонецМесяца,
	//	|	РасчетыПоКредитамИЗаймамОбороты.Контрагент,
	//	|	РасчетыПоКредитамИЗаймамОбороты.Организация,
	//	|	РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма.ВалютаРасчетов КАК Валюта,
	//	|	РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма.СчетУчетаПроцентовРегл КАК СчетУчетаРегл
	//	// Kuzmich, 09.12.2024, (ONESOFT-3668) Переоценка процента кредитов и заполнение "проекта" в регистре "расчеты с кредитами и займами"
	//	|	, РасчетыПоКредитамИЗаймамОбороты.Проект
	//	// Kuzmich, 09.12.2024, (ONESOFT-3668) Переоценка процента кредитов и заполнение "проекта" в регистре "расчеты с кредитами и займами"
	//	// Kuzmich, 12.12.2024, (ONESOFT-3680) Не зполняется вид договора кредитов в проводках закрытия месяца
	//	|	, РасчетыПоКредитамИЗаймамОбороты.ВидДоговора
	//	// Kuzmich, 12.12.2024, (ONESOFT-3680) Не зполняется вид договора кредитов в проводках закрытия месяца
	//	|ИЗ
	//	|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Обороты(
	//	|			&НачалоМесяца,
	//	|			&КонецМесяца,
	//	|			День,
	//	|			ДоговорКредитаЗайма В
	//	|				(ВЫБРАТЬ
	//	|					Остатки.ДоговорКредитаЗайма
	//	|				ИЗ
	//	|					ВТ_ОстаткиПроценты КАК Остатки)) КАК РасчетыПоКредитамИЗаймамОбороты
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&КонецМесяца, ) КАК КурсыВалютСрезПоследних
	//	|		ПО РасчетыПоКредитамИЗаймамОбороты.ДоговорКредитаЗайма.ВалютаРасчетов = КурсыВалютСрезПоследних.Валюта
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	ДоговорКредитаЗайма,
	//	|	Период
	//	|ИТОГИ ПО
	//	|	ДоговорКредитаЗайма";
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	СтруктураОтраженияКурсовыхРазницРегл = РегламентированныйУчетСервер.ПолучитьСтруктуруОтраженияКурсовыхРазниц2(Дата, Организация);
	//	
	//	Запрос.УстановитьПараметр("ДатаКон", ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод);
	//	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	//	Запрос.УстановитьПараметр("КурсоваяРазница", );
	//	
	//	ВыборкаПоДоговорамКредитов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//	Пока ВыборкаПоДоговорамКредитов.Следующий() Цикл
	//		
	//		ПараметрыОтбора = Новый Структура;
	//		ПараметрыОтбора.Вставить("ДоговорКредитаЗайма", ВыборкаПоДоговорамКредитов.ДоговорКредитаЗайма);
	//		СтрокиПоступления = ТаблицаВзятияКредитов.НайтиСтроки(ПараметрыОтбора);
	//		
	//		Если СтрокиПоступления.Количество() > 0 Тогда
	//			
	//			ВыборкаЗакрытиеКредита = ВыборкаПоДоговорамКредитов.Выбрать();
	//			КоличествоИтераций = ВыборкаЗакрытиеКредита.Количество();
	//			Итератор = 0;
	//			Пока ВыборкаЗакрытиеКредита.Следующий() Цикл
	//				
	//				Итератор = Итератор + 1;
	//				
	//				Если СтрокиПоступления[0].ПроцентыВалОстаток = 0 Тогда 
	//					Сумма = ВыборкаЗакрытиеКредита.ПроцентыВалПриход * ВыборкаЗакрытиеКредита.Курс;//СтрокиПоступления[0].Курс;
	//				Иначе
	//					Сумма = ВыборкаЗакрытиеКредита.ПроцентыВалПриход * СтрокиПоступления[0].Курс;
	//				КонецЕсли;
	//				
	//				Если Сумма = 0 И СтрокиПоступления[0].ПроцентыВалОстаток <> 0 Тогда
	//					
	//					Продолжить;
	//					
	//				КонецЕсли; 
	//				
	//				Если СтрокиПоступления[0].ПроцентыВалОстаток = 0 Тогда
	//					КурсоваяРазница = СтрокиПоступления[0].ПроцентыОстаток;
	//				Иначе
	//					КурсоваяРазница = ВыборкаЗакрытиеКредита.ПроцентыПриход - Сумма;
	//				КонецЕсли;
	//				
	//				Если Итератор = 1 И СтрокиПоступления[0].ПроцентыВалОстаток = 0 Тогда 
	//					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
	//					
	//					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗакрытиеКредита);
	//					НоваяСтрока.Период = КонецМесяца(Дата);
	//					НоваяСтрока.Сумма = КурсоваяРазница;
	//					НоваяСтрока.Содержание = НСтр("ka='დარიცხული პროცენტების საკურსო სხვაობა';ru='Курсовая разница проценты кредиты';en='Exchange difference-interest loans'");
	//					
	//					Если КурсоваяРазница < 0 Тогда
	//						
	//						Если СтрокиПоступления[0].ПроцентыВалОстаток = 0 Тогда 
	//							НоваяСтрока.СчетДт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
	//							НоваяСтрока.СчетКт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
	//						ИНАЧЕ
	//							НоваяСтрока.СчетДт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
	//							НоваяСтрока.СчетКт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;
	//						КонецЕсли;
	//						
	//					Иначе
	//						
	//						НоваяСтрока.СчетДт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
	//						НоваяСтрока.СчетКт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
	//						
	//					КонецЕсли;
	//					
	//					Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
	//						НоваяСтрока.ВалютаДт = ВыборкаЗакрытиеКредита.Валюта;
	//					Иначе
	//						НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
	//					КонецЕсли; 
	//					
	//					Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
	//						НоваяСтрока.ВалютаКт = ВыборкаЗакрытиеКредита.Валюта;
	//					Иначе
	//						НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
	//					КонецЕсли; 
	//					
	//					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаЗакрытиеКредита.Валюта);
	//					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Контрагенты", ВыборкаЗакрытиеКредита.Контрагент);
	//					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "КонтрагентыСотрудники", ВыборкаЗакрытиеКредита.Контрагент); //+++ Дмгг
	//					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "ДоговорыКредитовИЗаймов", ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма);
	//					
	//					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаЗакрытиеКредита.Валюта);
	//					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Контрагенты", ВыборкаЗакрытиеКредита.Контрагент);
	//					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "КонтрагентыСотрудники", ВыборкаЗакрытиеКредита.Контрагент); //+++ Дмгг
	//					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "ДоговорыКредитовИЗаймов", ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма);
	//					
	//					
	//					НоваяСтрокаРасчетыПоКредитамИЗаймам = НаборЗаписейРасчетыПоКредитамИЗаймам.Добавить();
	//					ЗаполнитьЗначенияСвойств(НоваяСтрокаРасчетыПоКредитамИЗаймам, ВыборкаЗакрытиеКредита);
	//					НоваяСтрокаРасчетыПоКредитамИЗаймам.ВидДвижения = ВидДвиженияНакопления.Расход;
	//					НоваяСтрокаРасчетыПоКредитамИЗаймам.Проценты = КурсоваяРазница;
	//					НоваяСтрокаРасчетыПоКредитамИЗаймам.ПроцентыВал = 0;
	//					НоваяСтрокаРасчетыПоКредитамИЗаймам.Период = КонецМесяца(Дата);
	//					НоваяСтрокаРасчетыПоКредитамИЗаймам.СодержаниеПроводки = НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница проценты кредиты';en='Exchange difference-interest loans'");
	//					НоваяСтрокаРасчетыПоКредитамИЗаймам.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ЗакрытиеМесяца;
	//				ИначеЕсли  Итератор <> 1 И СтрокиПоступления[0].ПроцентыВалОстаток <> 0 Тогда//И СтрокиПоступления[0].ОсновнойДолгВалОстаток <> 0 Тогда //+++ Дмгг
	//					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
	//					
	//					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗакрытиеКредита);
	//					НоваяСтрока.Период = КонецМесяца(Дата);
	//					НоваяСтрока.Сумма = КурсоваяРазница;
	//					НоваяСтрока.Содержание = НСтр("ka='დარიცხული პროცენტების საკურსო სხვაობა';ru='Курсовая разница проценты кредиты';en='Exchange difference-interest loans'");
	//					
	//					Если КурсоваяРазница < 0 Тогда
	//						
	//						Если СтрокиПоступления[0].ПроцентыВалОстаток <> 0 Тогда//СтрокиПоступления[0].ОсновнойДолгВалОстаток = 0 Тогда 
	//							НоваяСтрока.СчетДт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
	//							НоваяСтрока.СчетКт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
	//						ИНАЧЕ
	//							НоваяСтрока.СчетДт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
	//							НоваяСтрока.СчетКт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;
	//						КонецЕсли;
	//						
	//					Иначе
	//						
	//						НоваяСтрока.СчетДт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
	//						НоваяСтрока.СчетКт = ВыборкаЗакрытиеКредита.СчетУчетаРегл;
	//						
	//					КонецЕсли;
	//					
	//					Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
	//						НоваяСтрока.ВалютаДт = ВыборкаЗакрытиеКредита.Валюта;
	//					Иначе
	//						НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
	//					КонецЕсли; 
	//					
	//					Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
	//						НоваяСтрока.ВалютаКт = ВыборкаЗакрытиеКредита.Валюта;
	//					Иначе
	//						НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
	//					КонецЕсли; 
	//					
	//					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", ВыборкаЗакрытиеКредита.Валюта);
	//					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Контрагенты", ВыборкаЗакрытиеКредита.Контрагент);
	//					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "КонтрагентыСотрудники", ВыборкаЗакрытиеКредита.Контрагент); //+++ Дмгг
	//					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "ДоговорыКредитовИЗаймов", ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма);
	//					
	//					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", ВыборкаЗакрытиеКредита.Валюта);
	//					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Контрагенты", ВыборкаЗакрытиеКредита.Контрагент);
	//					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "КонтрагентыСотрудники", ВыборкаЗакрытиеКредита.Контрагент); //+++ Дмггк
	//					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "ДоговорыКредитовИЗаймов", ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма);
	//					
	//					НоваяСтрокаРасчетыПоКредитамИЗаймам = НаборЗаписейРасчетыПоКредитамИЗаймам.Добавить();
	//					ЗаполнитьЗначенияСвойств(НоваяСтрокаРасчетыПоКредитамИЗаймам, ВыборкаЗакрытиеКредита);
	//					НоваяСтрокаРасчетыПоКредитамИЗаймам.ВидДвижения = ВидДвиженияНакопления.Расход;
	//					НоваяСтрокаРасчетыПоКредитамИЗаймам.Проценты = КурсоваяРазница;
	//					НоваяСтрокаРасчетыПоКредитамИЗаймам.ПроцентыВал = 0;
	//					НоваяСтрокаРасчетыПоКредитамИЗаймам.Период = КонецМесяца(Дата);
	//					НоваяСтрокаРасчетыПоКредитамИЗаймам.СодержаниеПроводки = НСтр("ka='დარიცხული პროცენტების საკურსო სხვაობა';ru='Курсовая разница проценты кредиты остаток';en='The exchange rate difference interest loan balance'");
	//					НоваяСтрокаРасчетыПоКредитамИЗаймам.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ЗакрытиеМесяца;
	//				КонецЕсли;
	//				
	//				НоваяСтрокаОтчетПоКурсовымРазницам = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
	//				НоваяСтрокаДоходыИРасходы = НаборЗаписейДоходыИРасходы.Добавить();
	//				
	//				Если КурсоваяРазница < 0 Тогда
	//					
	//					НоваяСтрокаОтчетПоКурсовымРазницам.Сумма = -КурсоваяРазница;
	//					НоваяСтрокаОтчетПоКурсовымРазницам.СуммаДоходов = -КурсоваяРазница;
	//					
	//					НоваяСтрокаДоходыИРасходы.СчетУчетаРегл = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;
	//					НоваяСтрокаДоходыИРасходы.СчетУчета = ПланыСчетов.Управленческий.ПрочиеДоходы;
	//					НоваяСтрокаДоходыИРасходы.СуммаДоходов = -КурсоваяРазница;
	//					
	//				Иначе
	//					
	//					НоваяСтрокаОтчетПоКурсовымРазницам.Сумма = КурсоваяРазница;
	//					НоваяСтрокаОтчетПоКурсовымРазницам.СуммаРасходов = КурсоваяРазница;
	//					
	//					НоваяСтрокаДоходыИРасходы.СчетУчетаРегл = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
	//					НоваяСтрокаДоходыИРасходы.СчетУчета = ПланыСчетов.Управленческий.ПрочиеРасходы;
	//					НоваяСтрокаДоходыИРасходы.СуммаРасходов = КурсоваяРазница;
	//					
	//				КонецЕсли; 
	//				
	//				НоваяСтрокаДоходыИРасходы.Период = КонецМесяца(Дата);
	//				НоваяСтрокаДоходыИРасходы.Организация = Организация;
	//				НоваяСтрокаДоходыИРасходы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
	//				НоваяСтрокаДоходыИРасходы.СодержаниеПроводки = НСтр("ka='დარიცხული პროცენტების საკურსო სხვაობა';ru='Курсовая разница проценты кредиты';en='Exchange difference-interest loans'");
	//				
	//				
	//				НоваяСтрокаОтчетПоКурсовымРазницам.Период = КонецМесяца(Дата);
	//				НоваяСтрокаОтчетПоКурсовымРазницам.Организация = Организация;
	//				НоваяСтрокаОтчетПоКурсовымРазницам.Валюта = ВыборкаЗакрытиеКредита.Валюта;
	//				
	//				НоваяСтрокаОтчетПоКурсовымРазницам.Аналитика =
	//				""
	//				+ ВыборкаЗакрытиеКредита.Контрагент
	//				+ " / "
	//				+ ВыборкаЗакрытиеКредита.ДоговорКредитаЗайма;
	//				НоваяСтрокаОтчетПоКурсовымРазницам.Раздел = "Расчеты по кредитам и займам";
	//				
	//			КонецЦикла;	
	//		КонецЕсли; 
	//		
	//	КонецЦикла;
	//	
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	РасчетыПоКредитамИЗаймамОстатки.Организация,
	//	|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма,
	//	|	РасчетыПоКредитамИЗаймамОстатки.Контрагент,
	//	|	-РасчетыПоКредитамИЗаймамОстатки.ПроцентыОстаток КАК ПроцентыОстаток,
	//	|	-РасчетыПоКредитамИЗаймамОстатки.ПроцентыВалОстаток КАК ПроцентыВалОстаток,
	//	|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма.СчетУчетаПроцентовРегл КАК СчетУчетаПроцентовРегл,
	//	|	РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма.ВалютаРасчетов КАК Валюта,
	//	|	ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность,1) КАК КурсВалюты
	//	// Kuzmich, 09.12.2024, (ONESOFT-3668) Переоценка процента кредитов и заполнение "проекта" в регистре "расчеты с кредитами и займами"
	//	|	, РасчетыПоКредитамИЗаймамОстатки.Проект
	//	// Kuzmich, 09.12.2024, (ONESOFT-3668) Переоценка процента кредитов и заполнение "проекта" в регистре "расчеты с кредитами и займами"
	//	// Kuzmich, 12.12.2024, (ONESOFT-3680) Не зполняется вид договора кредитов в проводках закрытия месяца
	//	|	, РасчетыПоКредитамИЗаймамОстатки.ВидДоговора
	//	// Kuzmich, 12.12.2024, (ONESOFT-3680) Не зполняется вид договора кредитов в проводках закрытия месяца
	//	|ИЗ
	//	|	РегистрНакопления.РасчетыПоКредитамИЗаймам.Остатки(&ДатаКон, ) КАК РасчетыПоКредитамИЗаймамОстатки
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютСрезПоследних
	//	|		ПО РасчетыПоКредитамИЗаймамОстатки.ДоговорКредитаЗайма.ВалютаРасчетов = КурсыВалютСрезПоследних.Валюта
	//	|ГДЕ
	//	|	РасчетыПоКредитамИЗаймамОстатки.ПроцентыОстаток < 0
	//	|	И РасчетыПоКредитамИЗаймамОстатки.ПроцентыВалОстаток < 0";
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		
	//		ПараметрыОтбора = Новый Структура;
	//		ПараметрыОтбора.Вставить("ДоговорКредитаЗайма", Выборка.ДоговорКредитаЗайма);
	//		СтрокиПоступления = ТаблицаВзятияКредитов.НайтиСтроки(ПараметрыОтбора);
	//		
	//		Если СтрокиПоступления.Количество() > 0 Тогда
	//			
	//			Сумма = Выборка.ПроцентыОстаток;//Выборка.ОсновнойДолгВалОстаток * СтрокиПоступления[0].Курс;
	//			
	//			Если Сумма = 0 Тогда
	//				
	//				Продолжить;
	//				
	//			КонецЕсли; 
	//			
	//			КурсоваяРазница = (Выборка.ПроцентыВалОстаток * Выборка.КурсВалюты) - Сумма;
	//			
	//			НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
	//			НоваяСтрока.Период = КонецМесяца(Дата);
	//			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	//			
	//			НоваяСтрока.Содержание = НСтр("ka='დარიცხული პროცენტების საკურსო სხვაობა';ru='Курсовая разница кредиты остаток';en='The exchange rate difference balance of the loan'");
	//			
	//			НоваяСтрокаОтчетПоКурсовымРазницам = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
	//			НоваяСтрокаДоходыИРасходы = НаборЗаписейДоходыИРасходы.Добавить();
	//			НоваяСтрокаРасчетыПоКредитамИЗаймам = НаборЗаписейРасчетыПоКредитамИЗаймам.Добавить();
	//			ЗаполнитьЗначенияСвойств(НоваяСтрокаРасчетыПоКредитамИЗаймам, Выборка);
	//			НоваяСтрокаРасчетыПоКредитамИЗаймам.ВидДвижения = ВидДвиженияНакопления.Расход;
	//			НоваяСтрокаРасчетыПоКредитамИЗаймам.Проценты = КурсоваяРазница;
	//			НоваяСтрокаРасчетыПоКредитамИЗаймам.ПроцентыВал = 0;
	//			НоваяСтрокаРасчетыПоКредитамИЗаймам.Период = КонецМесяца(Дата);
	//			НоваяСтрокаРасчетыПоКредитамИЗаймам.СодержаниеПроводки = НСтр("ka='დარიცხული პროცენტების საკურსო სხვაობა';ru='Курсовая разница проценты кредиты остаток';en='The exchange rate difference interest loan balance'");
	//			НоваяСтрокаРасчетыПоКредитамИЗаймам.ХозяйственнаяОперация = Справочники.ХозяйственныеОперации.ЗакрытиеМесяца;
	//			
	//			Если КурсоваяРазница < 0 Тогда
	//				
	//				НоваяСтрока.Сумма = -КурсоваяРазница;
	//				
	//				НоваяСтрока.СчетДт = Выборка.СчетУчетаПроцентовРегл;
	//				НоваяСтрока.СчетКт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;
	//				
	//				НоваяСтрокаОтчетПоКурсовымРазницам.Сумма = -КурсоваяРазница;
	//				НоваяСтрокаОтчетПоКурсовымРазницам.СуммаДоходов = -КурсоваяРазница;
	//				
	//				НоваяСтрокаДоходыИРасходы.СчетУчетаРегл = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетПоложительнаяКурсоваяРазницаЗадолженность;
	//				НоваяСтрокаДоходыИРасходы.СчетУчета = ПланыСчетов.Управленческий.ПрочиеДоходы;
	//				НоваяСтрокаДоходыИРасходы.СуммаДоходов = -КурсоваяРазница;
	//				
	//			Иначе
	//				
	//				НоваяСтрока.Сумма = КурсоваяРазница;
	//				
	//				НоваяСтрока.СчетДт = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
	//				НоваяСтрока.СчетКт = Выборка.СчетУчетаПроцентовРегл;
	//				
	//				НоваяСтрокаОтчетПоКурсовымРазницам.Сумма = КурсоваяРазница;
	//				НоваяСтрокаОтчетПоКурсовымРазницам.СуммаРасходов = КурсоваяРазница;
	//				
	//				НоваяСтрокаДоходыИРасходы.СчетУчетаРегл = СтруктураОтраженияКурсовыхРазницРегл.СчетаКурсовыхРазниц.СчетОтрицательнаяКурсоваяРазницаЗадолженность;
	//				НоваяСтрокаДоходыИРасходы.СчетУчета = ПланыСчетов.Управленческий.ПрочиеРасходы;
	//				НоваяСтрокаДоходыИРасходы.СуммаРасходов = КурсоваяРазница;
	//				
	//			КонецЕсли; 
	//			
	//			НоваяСтрокаДоходыИРасходы.Период = КонецМесяца(Дата);
	//			НоваяСтрокаДоходыИРасходы.Организация = Организация;
	//			НоваяСтрокаДоходыИРасходы.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
	//			НоваяСтрокаДоходыИРасходы.СодержаниеПроводки = НСтр("ka='დარიცხული პროცენტების საკურსო სხვაობა';ru='Курсовая разница проценты кредиты';en='Exchange difference-interest loans'");
	//			
	//			
	//			НоваяСтрокаОтчетПоКурсовымРазницам.Период = КонецМесяца(Дата);
	//			НоваяСтрокаОтчетПоКурсовымРазницам.Организация = Организация;
	//			НоваяСтрокаОтчетПоКурсовымРазницам.Валюта = Выборка.Валюта;
	//			
	//			НоваяСтрокаОтчетПоКурсовымРазницам.Аналитика =
	//			""
	//			+ Выборка.Контрагент
	//			+ " / "
	//			+ Выборка.ДоговорКредитаЗайма;
	//			НоваяСтрокаОтчетПоКурсовымРазницам.Раздел = "Расчеты по кредитам и займам";
	//			
	//			
	//			Если ЗначениеЗаполнено(НоваяСтрока.СчетДт) И НоваяСтрока.СчетДт.Валютный Тогда
	//				НоваяСтрока.ВалютаДт = Выборка.Валюта;
	//			Иначе
	//				НоваяСтрока.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
	//			КонецЕсли; 
	//			
	//			Если ЗначениеЗаполнено(НоваяСтрока.СчетКт) И НоваяСтрока.СчетКт.Валютный Тогда
	//				НоваяСтрока.ВалютаКт = Выборка.Валюта;
	//			Иначе
	//				НоваяСтрока.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
	//			КонецЕсли; 
	//			
	//			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Валюты", Выборка.Валюта);
	//			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Контрагенты", Выборка.Контрагент);
	//			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "КонтрагентыСотрудники", Выборка.Контрагент); //+++ Дмгг
	//			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "ДоговорыКредитовИЗаймов", Выборка.ДоговорКредитаЗайма);
	//			
	//			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Валюты", Выборка.Валюта);
	//			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Контрагенты", Выборка.Контрагент);
	//			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "КонтрагентыСотрудники", Выборка.Контрагент); //+++ Дмгг
	//			БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "ДоговорыКредитовИЗаймов", Выборка.ДоговорКредитаЗайма);
	//			
	//		КонецЕсли;
	//		
	//	КонецЦикла; 
	//	
	//КонецЕсли;
	
	
	// Пишем оставшиеся записи.
	НаборЗаписейДенежныеСредства.Записать(Ложь);
	НаборЗаписейДенежныеСредстваВКассахККМ.Записать(Ложь);
	НаборЗаписейРасчетыСПерсоналом.Записать(Ложь);
	НаборЗаписейРасчетыСПодотчетниками.Записать(Ложь);
	НаборЗаписейРасчетыСПокупателями.Записать(Ложь);
	НаборЗаписейРасчетыСПоставщиками.Записать(Ложь);
	НаборЗаписейДоходыИРасходы.Записать(Ложь);
	ТаблицаЗаписей = НаборЗаписейОтчетПоКурсовымРазницам.Выгрузить();
	ТаблицаЗаписей.Свернуть("Период, Активность, Организация, Аналитика, Валюта, Раздел", "Сумма, СуммаДоходов, СуммаРасходов, СуммаОстаток, СуммаВалОстаток");
	НаборЗаписейОтчетПоКурсовымРазницам.Загрузить(ТаблицаЗаписей);
	НаборЗаписейОтчетПоКурсовымРазницам.Записать(Ложь);
	Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()) Тогда  //+++ Дмгг
		НаборЗаписейУправленческий.Записать(Ложь);
	КонецЕсли;  //--- Дмгг
	НаборЗаписейХозрасчетный.Записать(Ложь);
	НаборЗаписейРасчетыПоКредитамИЗаймам.Записать(Ложь);
	
КонецПроцедуры

Процедура РассчитатьКурсовыеРазницыПоКредитамИЗаймам(Отказ, ТаблицаОшибок)
	
	//// Создадим набор записей регистра сведений ОтчетПоКурсовымРазницам.
	//НаборЗаписейОтчетПоКурсовымРазницам = РегистрыСведений.ОтчетПоКурсовымРазницам.СоздатьНаборЗаписей();
	//НаборЗаписейОтчетПоКурсовымРазницам.Отбор.Регистратор.Установить(Ссылка);
	//// Создадим набор записей регистра бухгалтерии Хозрасчетный.
	//НаборЗаписейХозрасчетный = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	//НаборЗаписейХозрасчетный.Отбор.Регистратор.Установить(Ссылка);
	

	
	//НаборЗаписейХозрасчетный.Записать(Ложь);
	//ТаблицаЗаписей = НаборЗаписейОтчетПоКурсовымРазницам.Выгрузить();
	//ТаблицаЗаписей.Свернуть("Период, Активность, Организация, Аналитика, Валюта, Раздел", "Сумма, СуммаДоходов, СуммаРасходов, СуммаОстаток, СуммаВалОстаток");
	//НаборЗаписейОтчетПоКурсовымРазницам.Загрузить(ТаблицаЗаписей);
	//НаборЗаписейОтчетПоКурсовымРазницам.Записать(Ложь);
	
	
КонецПроцедуры
 

#КонецОбласти

#Область ПроцедурыИФункцииДляОбеспеченияПроведенияДокумента

// Добавляет дополнительные реквизиты, необходимые для проведения документа в
// переданную структуру.
//
// Параметры:
//  СтруктураДополнительныеСвойства - Структура дополнительных свойств документа.
//
Процедура ДобавитьРеквизитыВДополнительныеСвойстваДляПроведения(СтруктураДополнительныеСвойства)
	
	НачальнаяГраницаПериода = Новый Граница(НачалоМесяца(Дата), ВидГраницы.Включая);
	КонечнаяГраницаПериода = Новый Граница(КонецМесяца (Дата), ВидГраницы.Включая);
	НачальнаяДатаПериода = НачалоМесяца(Дата);
	КонечнаяДатаПериод   = КонецМесяца (Дата);
	
	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("ПустойСчет", ПланыСчетов.Управленческий.ПустаяСсылка());
	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("ПустойСчетРегл", ПланыСчетов.Хозрасчетный.ПустаяСсылка()); //+++ Дмгг
	
	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("НачальнаяГраницаПериода", НачальнаяГраницаПериода);
	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("КонечнаяГраницаПериода", КонечнаяГраницаПериода);
	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("НачальнаяДатаПериода", НачальнаяДатаПериода);
	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("КонечнаяДатаПериод", КонечнаяДатаПериод);
	
КонецПроцедуры // ДобавитьРеквизитыВДополнительныеСвойстваДляПроведения()

// Устанавливает свойство записывать для наборов записей документа в переданное
// значение.
//
// Параметры:
//  ФлагЗаписи   - Булево, флаг разрешения записи наборов записей.
//
Процедура УстановитьСвойстваНаборовЗаписейДокумента(ФлагЗаписи)
	
	Движения.УзлыКорректировкиСтоимостиСписания.Записывать = ФлагЗаписи;
	Движения.Запасы.Записывать = ФлагЗаписи;
	Движения.Продажи.Записывать = ФлагЗаписи;
	Движения.ДоходыИРасходы.Записывать = ФлагЗаписи;
	Движения.Управленческий.Записывать = ФлагЗаписи;
	Движения.ОшибкиЗакрытияМесяца.Записывать = ФлагЗаписи;
	Движения.ОтчетПоКурсовымРазницам.Записывать = ФлагЗаписи;
	
КонецПроцедуры // УстановитьСвойстваНаборовЗаписейДокумента()

// Сворачивает набор записей Доходы и расходы.
//
Процедура СвернутьНаборЗаписейДоходыИРасходы(НаборЗаписейРегистра)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоходыИРасходы.Период,
	|	ДоходыИРасходы.Активность,
	|	ДоходыИРасходы.Организация,
	|	ДоходыИРасходы.СтруктурнаяЕдиница,
	|	ДоходыИРасходы.НаправлениеДеятельности,
	|	ДоходыИРасходы.ЗаказПокупателя,
	|	ДоходыИРасходы.СчетУчета,
	|	ДоходыИРасходы.Аналитика,
	|	ДоходыИРасходы.Проект,  //Малышев 2024-06-18 ONESOFT-3227
	|	СУММА(ДоходыИРасходы.СуммаДоходов) КАК СуммаДоходов,
	|	СУММА(ДоходыИРасходы.СуммаРасходов) КАК СуммаРасходов,
	|	ДоходыИРасходы.СодержаниеПроводки,
	|	ДоходыИРасходы.СчетУчетаРегл
	|ИЗ
	|	РегистрНакопления.ДоходыИРасходы КАК ДоходыИРасходы
	|ГДЕ
	|	ДоходыИРасходы.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыИРасходы.Период,
	|	ДоходыИРасходы.Активность,
	|	ДоходыИРасходы.Организация,
	|	ДоходыИРасходы.СтруктурнаяЕдиница,
	|	ДоходыИРасходы.НаправлениеДеятельности,
	|	ДоходыИРасходы.ЗаказПокупателя,
	|	ДоходыИРасходы.СчетУчета,
	|	ДоходыИРасходы.Аналитика,
	|	ДоходыИРасходы.Проект,   //Малышев 2024-06-18 ONESOFT-3227
	|	ДоходыИРасходы.СодержаниеПроводки,
	|	ДоходыИРасходы.СчетУчетаРегл
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ДоходыИРасходы.СуммаДоходов) <> 0
	|		ИЛИ СУММА(ДоходыИРасходы.СуммаРасходов) <> 0)";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	ТаблицаЗаписейРегистра = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписейРегистра.Загрузить(ТаблицаЗаписейРегистра);
	
КонецПроцедуры // СвернутьНаборЗаписейДоходыИРасходы()

// Сворачивает набор записей Запасы.
//
Процедура СвернутьНаборЗаписейЗапасы(НаборЗаписейРегистра)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Запасы.Период,
	|	Запасы.Активность,
	|	Запасы.ВидДвижения,
	|	Запасы.Организация,
	|	Запасы.СтруктурнаяЕдиница,
	|	Запасы.СчетУчета,
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.Партия,
	|	Запасы.Проект,  //Малышев 2024-06-18 ONESOFT-3227
	|	Запасы.ЗаказПокупателя,
	|	СУММА(Запасы.Количество) КАК Количество,
	|	СУММА(Запасы.Сумма) КАК Сумма,
	|	Запасы.КоррСтруктурнаяЕдиница,
	|	Запасы.КоррСчетУчета,
	|	Запасы.КоррНоменклатура,
	|	Запасы.КоррХарактеристика,
	|	Запасы.КоррПартия,
	|	Запасы.КоррПроект, //Малышев 2024-06-18 ONESOFT-3227
	|	Запасы.КоррЗаказПокупателя,
	|	Запасы.Спецификация,
	|	Запасы.КоррСпецификация,
	|	Запасы.ЗаказПродажи,
	|	Запасы.Подразделение,
	|	Запасы.Ответственный,
	|	Запасы.ДокументПродажи,
	|	Запасы.СтавкаНДС,
	|	Запасы.ФиксированнаяСтоимость,
	|	Запасы.ЗатратыНаВыпуск,
	|	Запасы.Возврат,
	|	Запасы.СодержаниеПроводки,
	|	Запасы.ПеремещениеВРозницуСуммовойУчет,
	|	Запасы.СчетУчетаРегл,  
	//Малышев 2024-09-05 ONESOFT-3441 - закоментировал
	//Малышев 2024-06-18 (--
	//|	ВЫБОР 
	//|		КОГДА Запасы.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Значение(Перечисление.ТипыСтруктурныхЕдиниц.Склад) 
	//|			ТОГДА Значение(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	//|		ИНАЧЕ Запасы.Номенклатура.СчетУчетаЗатратРегл
	//|	КОНЕЦ КАК СчетУчетаЗатратРегл,
	//Малышев 2024-06-18 --)
	|	Запасы.КоррСчетУчетаРегл
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,Запасы.ДокументПоступления
	|	,Запасы.КоррДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	Запасы.Период,
	|	Запасы.Активность,
	|	Запасы.ВидДвижения,
	|	Запасы.Организация,
	|	Запасы.СтруктурнаяЕдиница,
	|	Запасы.СчетУчета,
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.Партия,
	|	Запасы.Проект,    //Малышев 2024-06-18 ONESOFT-3227
	|	Запасы.ЗаказПокупателя,
	|	Запасы.КоррСтруктурнаяЕдиница,
	|	Запасы.КоррСчетУчета,
	|	Запасы.КоррНоменклатура,
	|	Запасы.КоррХарактеристика,
	|	Запасы.КоррПартия,
	|	Запасы.КоррПроект,     //Малышев 2024-06-18 ONESOFT-3227
	|	Запасы.КоррЗаказПокупателя,
	|	Запасы.Спецификация,
	|	Запасы.КоррСпецификация,
	|	Запасы.ЗаказПродажи,
	|	Запасы.Подразделение,
	|	Запасы.Ответственный,
	|	Запасы.ДокументПродажи,
	|	Запасы.СтавкаНДС,
	|	Запасы.ФиксированнаяСтоимость,
	|	Запасы.ЗатратыНаВыпуск,
	|	Запасы.Возврат,
	|	Запасы.СодержаниеПроводки,
	|	Запасы.ПеремещениеВРозницуСуммовойУчет,
	|	Запасы.СчетУчетаРегл, 
	//Малышев 2024-09-05 ONESOFT-3441 - закоментировал
	////Малышев 2024-06-18 (--
	//|	ВЫБОР 
	//|		КОГДА Запасы.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Значение(Перечисление.ТипыСтруктурныхЕдиниц.Склад) 
	//|			ТОГДА Значение(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	//|		ИНАЧЕ Запасы.Номенклатура.СчетУчетаЗатратРегл
	//|	КОНЕЦ,
	////Малышев 2024-06-18 --)
	|	Запасы.КоррСчетУчетаРегл
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|	,Запасы.ДокументПоступления
	|	,Запасы.КоррДокументПоступления
	// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Запасы.Количество) <> 0
	|		ИЛИ СУММА(Запасы.Сумма) <> 0)";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	ТаблицаЗаписейРегистра = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписейРегистра.Загрузить(ТаблицаЗаписейРегистра); 
	
КонецПроцедуры // СвернутьНаборЗаписейЗапасы()

// Сворачивает набор записей Продажи.
//
Процедура СвернутьНаборЗаписейПродажи(НаборЗаписейРегистра)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Продажи.Период,
	|	Продажи.Активность,
	|	Продажи.Номенклатура,
	|	Продажи.Характеристика,
	|	Продажи.Партия,
	|	Продажи.Проект,   //Малышев 2024-06-18 ONESOFT-3227
	|	Продажи.Документ,
	|	Продажи.СтавкаНДС,
	|	Продажи.Организация,
	|	Продажи.ЗаказПокупателя,
	|	Продажи.Подразделение,
	|	Продажи.Ответственный,
	|	СУММА(Продажи.Количество) КАК Количество,
	|	СУММА(Продажи.Сумма) КАК Сумма,
	|	СУММА(Продажи.СуммаНДС) КАК СуммаНДС,
	|	СУММА(Продажи.Себестоимость) КАК Себестоимость
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Период,
	|	Продажи.Активность,
	|	Продажи.Номенклатура,
	|	Продажи.Характеристика,
	|	Продажи.Партия,
	|	Продажи.Проект,   //Малышев 2024-06-18 ONESOFT-3227
	|	Продажи.Документ,
	|	Продажи.СтавкаНДС,
	|	Продажи.Организация,
	|	Продажи.ЗаказПокупателя,
	|	Продажи.Подразделение,
	|	Продажи.Ответственный
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Продажи.Количество) <> 0
	|		ИЛИ СУММА(Продажи.Сумма) <> 0
	|		ИЛИ СУММА(Продажи.СуммаНДС) <> 0
	|		ИЛИ СУММА(Продажи.Себестоимость) <> 0)";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);

	ТаблицаЗаписейРегистра = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписейРегистра.Загрузить(ТаблицаЗаписейРегистра);
	
КонецПроцедуры // СвернутьНаборЗаписейПродажи()

// Сворачивает набор записей ФинансовыйРезультат.
//
Процедура СвернутьНаборЗаписейФинансовыйРезультат(НаборЗаписейРегистра)
			
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФинансовыйРезультат.Период,
	|	ФинансовыйРезультат.Активность,
	|	ФинансовыйРезультат.Организация,
	|	ФинансовыйРезультат.СтруктурнаяЕдиница,
	|	ФинансовыйРезультат.НаправлениеДеятельности,
	|	ФинансовыйРезультат.ЗаказПокупателя,
	|	ФинансовыйРезультат.СчетУчета,
	|	ФинансовыйРезультат.Аналитика,
	|	СУММА(ФинансовыйРезультат.СуммаДоходов) КАК СуммаДоходов,
	|	СУММА(ФинансовыйРезультат.СуммаРасходов) КАК СуммаРасходов,
	|	ФинансовыйРезультат.СодержаниеПроводки,
	|	ФинансовыйРезультат.СчетУчетаРегл
	|ИЗ
	|	РегистрНакопления.ФинансовыйРезультат КАК ФинансовыйРезультат
	|ГДЕ
	|	ФинансовыйРезультат.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ФинансовыйРезультат.Период,
	|	ФинансовыйРезультат.Активность,
	|	ФинансовыйРезультат.Организация,
	|	ФинансовыйРезультат.СтруктурнаяЕдиница,
	|	ФинансовыйРезультат.НаправлениеДеятельности,
	|	ФинансовыйРезультат.ЗаказПокупателя,
	|	ФинансовыйРезультат.СчетУчета,
	|	ФинансовыйРезультат.Аналитика,
	|	ФинансовыйРезультат.СодержаниеПроводки,
	|	ФинансовыйРезультат.СчетУчетаРегл
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ФинансовыйРезультат.СуммаДоходов) <> 0
	|		ИЛИ СУММА(ФинансовыйРезультат.СуммаРасходов) <> 0)";

	Запрос.УстановитьПараметр("Регистратор", Ссылка);

	ТаблицаЗаписейРегистра = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписейРегистра.Загрузить(ТаблицаЗаписейРегистра);

КонецПроцедуры // СвернутьНаборЗаписейФинансовыйРезультат()

// Сворачивает набор записей Управленческий.
//
Процедура СвернутьНаборЗаписейУправленческий(НаборЗаписейРегистра)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Управленческий.Период,
	|	Управленческий.Активность,
	|	Управленческий.СчетДт,
	|	Управленческий.СчетКт,
	|	Управленческий.Организация,
	|	Управленческий.СценарийПланирования,
	|	Управленческий.ВалютаДт,
	|	Управленческий.ВалютаКт,
	|	СУММА(Управленческий.Сумма) КАК Сумма,
	|	СУММА(Управленческий.СуммаВалДт) КАК СуммаВалДт,
	|	СУММА(Управленческий.СуммаВалКт) КАК СуммаВалКт,
	|	Управленческий.Содержание
	|ИЗ
	|	РегистрБухгалтерии.Управленческий КАК Управленческий
	|ГДЕ
	|	Управленческий.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	Управленческий.Период,
	|	Управленческий.Активность,
	|	Управленческий.СчетДт,
	|	Управленческий.СчетКт,
	|	Управленческий.Организация,
	|	Управленческий.СценарийПланирования,
	|	Управленческий.ВалютаДт,
	|	Управленческий.ВалютаКт,
	|	Управленческий.Содержание
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Управленческий.Сумма) <> 0
	|		ИЛИ СУММА(Управленческий.СуммаВалДт) <> 0
	|		ИЛИ СУММА(Управленческий.СуммаВалКт) <> 0)"; 

	Запрос.УстановитьПараметр("Регистратор", Ссылка);

	ТаблицаЗаписейРегистра = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписейРегистра.Загрузить(ТаблицаЗаписейРегистра);
	
КонецПроцедуры // СвернутьНаборЗаписейУправленческий()

// Сворачивает набор записей Хозрасчетный.
//
Процедура СвернутьНаборЗаписейХозрасчетный(НаборЗаписейРегистра)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Период КАК Период,
	|	Хозрасчетный.Активность КАК Активность,
	|	Хозрасчетный.СчетДт КАК СчетДт,
	|	Хозрасчетный.СчетКт КАК СчетКт,
	|	Хозрасчетный.Организация КАК Организация,
	|	Хозрасчетный.ВалютаДт КАК ВалютаДт,
	|	Хозрасчетный.ВалютаКт КАК ВалютаКт,
	|	СУММА(Хозрасчетный.Сумма) КАК Сумма,
	|	СУММА(Хозрасчетный.ВалютнаяСуммаДт) КАК ВалютнаяСуммаДт,
	|	СУММА(Хозрасчетный.ВалютнаяСуммаКт) КАК ВалютнаяСуммаКт,
	|	Хозрасчетный.Содержание КАК Содержание,
	|	Хозрасчетный.СубконтоДт1 КАК СубконтоДт1,
	|	Хозрасчетный.СубконтоДт2 КАК СубконтоДт2,
	|	Хозрасчетный.СубконтоДт3 КАК СубконтоДт3,
	|	Хозрасчетный.СубконтоКт1 КАК СубконтоКт1,
	|	Хозрасчетный.СубконтоКт2 КАК СубконтоКт2,
	|	Хозрасчетный.СубконтоКт3 КАК СубконтоКт3,
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоДт1, """") КАК ВидСубконтоДт1,
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоДт2, """") КАК ВидСубконтоДт2,
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоДт3, """") КАК ВидСубконтоДт3,
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоКт1, """") КАК ВидСубконтоКт1,
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоКт2, """") КАК ВидСубконтоКт2,
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоКт3, """") КАК ВидСубконтоКт3,
	|	СУММА(Хозрасчетный.КоличествоДт) КАК КоличествоДт,
	|	СУММА(Хозрасчетный.КоличествоКт) КАК КоличествоКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(, , Регистратор = &Регистратор, , ) КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	Хозрасчетный.Период,
	|	Хозрасчетный.Активность,
	|	Хозрасчетный.СчетДт,
	|	Хозрасчетный.СчетКт,
	|	Хозрасчетный.Организация,
	|	Хозрасчетный.ВалютаДт,
	|	Хозрасчетный.ВалютаКт,
	|	Хозрасчетный.Содержание,
	|	Хозрасчетный.СубконтоДт1,
	|	Хозрасчетный.СубконтоДт2,
	|	Хозрасчетный.СубконтоДт3,
	|	Хозрасчетный.СубконтоКт1,
	|	Хозрасчетный.СубконтоКт2,
	|	Хозрасчетный.СубконтоКт3,
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоДт2, """"),
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоДт3, """"),
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоКт1, """"),
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоКт2, """"),
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоКт3, """"),
	|	ЕСТЬNULL(Хозрасчетный.ВидСубконтоДт1, """")
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Хозрасчетный.Сумма) <> 0
	|		ИЛИ СУММА(Хозрасчетный.ВалютнаяСуммаДт) <> 0
	|		ИЛИ СУММА(Хозрасчетный.ВалютнаяСуммаКт) <> 0)"; 

	Запрос.УстановитьПараметр("Регистратор", Ссылка);

	ТаблицаЗаписейРегистра = Запрос.Выполнить().Выгрузить();
	
	//НаборЗаписейРегистра.Загрузить(ТаблицаЗаписейРегистра);
	Для Каждого Стр Из ТаблицаЗаписейРегистра Цикл
		
		НоваяСтрока = НаборЗаписейРегистра.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		
		Д = 1;
		Пока Д <= 3 Цикл
			Если Стр["ВидСубконтоДт" + Строка(Д)] <> "" Тогда 
				БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, Стр["ВидСубконтоДт" + Строка(Д)].ИмяПредопределенныхДанных, Стр["СубконтоДт" + Строка(Д)]);
			КонецЕсли;
			Д = Д + 1;
		КонецЦикла;
		
		К = 1;
		Пока К <= 3 Цикл
			Если Стр["ВидСубконтоКт" + Строка(К)] <> "" Тогда 
				БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, Стр["ВидСубконтоКт" + Строка(К)].ИмяПредопределенныхДанных, Стр["СубконтоКт" + Строка(К)]);
			КонецЕсли;
			К = К + 1;
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры // СвернутьНаборЗаписейХозрасчетный()

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаПроведения. Формирует движения
// документа по регистрам накопления и бухгалтерскому регистру.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	ДобавитьРеквизитыВДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	// Разрешение записи наборов записей.
	УстановитьСвойстваНаборовЗаписейДокумента(Истина);
	
	НаборЗаписейОшибкиЗакрытияМесяца = РегистрыСведений.ОшибкиЗакрытияМесяца.СоздатьНаборЗаписей();
	НаборЗаписейОшибкиЗакрытияМесяца.Отбор.Регистратор.Установить(Ссылка);
	ТаблицаОшибок = НаборЗаписейОшибкиЗакрытияМесяца.ВыгрузитьКолонки();
	
	// Расчет прямых затрат.
	Если РасчетПрямыхЗатрат Тогда
		РассчитатьСтоимостьВозвратов(); // предварительный расчет стоимости возвратов.
		РассчитатьФактическуюСебестоимостьВыпуска(Отказ, "РасчетПрямыхЗатрат", ТаблицаОшибок);
		РассчитатьСтоимостьВозвратов(); // окончательный расчет стоимости возвратов.
	КонецЕсли;
	
	// Распределение затрат.
	Если РаспределениеЗатрат Тогда
		РаспределитьЗатраты(Отказ, ТаблицаОшибок);
	КонецЕсли;
	
	// Расчет фактической себестоимости.
	Если РасчетФактическойСебестоимости Тогда
		РассчитатьСтоимостьВозвратов(); // предварительный расчет стоимости возвратов.
		РассчитатьФактическуюСебестоимостьВыпуска(Отказ, "РасчетФактическойСебестоимости", ТаблицаОшибок);
		РассчитатьСтоимостьВозвратов(); // окончательный расчет стоимости возвратов.
	КонецЕсли;
	
	// Расчет себестоимости в рознице суммовой учет.
	Если РасчетСебестоимостиВРозницеСуммовойУчет Тогда
		РассчитатьСебестоимостьВРозницеСуммовойУчет(Отказ, ТаблицаОшибок);
	КонецЕсли;
	
	// Расчет курсовых разниц.
	Если РасчетКурсовыхРазниц Тогда
		РассчитатьКурсовыеРазницы(Отказ, ТаблицаОшибок);
	КонецЕсли;
	
	// Расчет финансового результата.
	Если РасчетФинансовогоРезультата Тогда
		//РассчитатьФинансовыйРезультат(Отказ, ТаблицаОшибок);
		РассчитатьФинансовыйРезультатРегл(Отказ);
	КонецЕсли;
	
	Если ТаблицаОшибок.Количество() > 0 Тогда
		ТекстСообщения = НСтр("ka='კალენდარული თვის დახურვისას ფორმირებული იქნა გაფრთხილებები! დაწვრილებით, იხ. ანგარიშგებაში კალენდარული თვის დახურვის თაობაზე.';ru='При закрытии месяца были сформированы предупреждения! Подробнее см. в отчете о закрытии месяца.';en='At the close of the month were established warning! For details, see. In the closing months of the report.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	// Сворачивание наборов записей регистров.
	НаборЗаписейЗапасы = РегистрыНакопления.Запасы.СоздатьНаборЗаписей();
	НаборЗаписейЗапасы.Отбор.Регистратор.Установить(Ссылка);
	СвернутьНаборЗаписейЗапасы(НаборЗаписейЗапасы);
	НаборЗаписейЗапасы.Записать(Истина);
	
	НаборЗаписейДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей();
	НаборЗаписейДоходыИРасходы.Отбор.Регистратор.Установить(Ссылка);
	СвернутьНаборЗаписейДоходыИРасходы(НаборЗаписейДоходыИРасходы);
	НаборЗаписейДоходыИРасходы.Записать(Истина);
	
	НаборЗаписейПродажи = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
	НаборЗаписейПродажи.Отбор.Регистратор.Установить(Ссылка);
	СвернутьНаборЗаписейПродажи(НаборЗаписейПродажи);
	НаборЗаписейПродажи.Записать(Истина);
	
	НаборЗаписейФинансовыйРезультат = РегистрыНакопления.ФинансовыйРезультат.СоздатьНаборЗаписей();
	НаборЗаписейФинансовыйРезультат.Отбор.Регистратор.Установить(Ссылка);
	СвернутьНаборЗаписейФинансовыйРезультат(НаборЗаписейФинансовыйРезультат);
	НаборЗаписейФинансовыйРезультат.Записать(Истина);
	
	Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Дата) Тогда //+++ Дмгг
		НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
		НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
		СвернутьНаборЗаписейУправленческий(НаборЗаписейУправленческий);
		НаборЗаписейУправленческий.Записать(Ложь);
	КонецЕсли; //--- Дмгг
	
	НаборЗаписейХозрасчетный = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборЗаписейХозрасчетный.Отбор.Регистратор.Установить(Ссылка);
	СвернутьНаборЗаписейХозрасчетный(НаборЗаписейХозрасчетный);
	НаборЗаписейХозрасчетный.Записать(Истина);
	
	ТаблицаОшибок.Свернуть("Период, Регистратор, Активность, Организация, ВидОперации, ОписаниеОшибки, Аналитика");
	НаборЗаписейОшибкиЗакрытияМесяца.Загрузить(ТаблицаОшибок);
	НаборЗаписейОшибкиЗакрытияМесяца.Записать(Истина);
	
	// Запрет записи наборов записей.
	УстановитьСвойстваНаборовЗаписейДокумента(Ложь);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

#Область ХозяйственныеОперации

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ХозяйственнаяОперация = ХозяйственныеОперацииСерверПовтИсп.ПолучитьХозяйственнуюОперациюПоВидуОперацииДокумента(Неопределено, Ссылка);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
#Область ДополнительныйКодПоДокументуПоступления
// Костыль. Поптыка компенсации взаимных ошибок округления,
// связанных с введением ДокументПоступления в регистр запасы
Процедура КопменсацияВзаимныхОшибокОкругления()
	
	ДатаНач = ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода;
	ДатаКон = ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДвиженияПоРегиструЗапасы.НомерСтроки КАК НомерСтроки,
	|	ДвиженияПоРегиструЗапасы.ВидДвижения КАК ВидДвижения,
	|	ДвиженияПоРегиструЗапасы.Организация КАК Организация,
	|	ДвиженияПоРегиструЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ДвиженияПоРегиструЗапасы.СчетУчета КАК СчетУчета,
	|	ДвиженияПоРегиструЗапасы.Номенклатура КАК Номенклатура,
	|	ДвиженияПоРегиструЗапасы.Характеристика КАК Характеристика,
	|	ДвиженияПоРегиструЗапасы.Партия КАК Партия,
	|	ДвиженияПоРегиструЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ДвиженияПоРегиструЗапасы.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ДвиженияПоРегиструЗапасы.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	|	ДвиженияПоРегиструЗапасы.Проект КАК Проект,
	|	ДвиженияПоРегиструЗапасы.ДокументПоступления КАК ДокументПоступления,
	//|	ДвиженияПоРегиструЗапасы.Количество КАК Количество,
	//|	ДвиженияПоРегиструЗапасы.Сумма КАК Сумма,
	|	ДвиженияПоРегиструЗапасы.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
	|	ДвиженияПоРегиструЗапасы.КоррСчетУчета КАК КоррСчетУчета,
	|	ДвиженияПоРегиструЗапасы.КоррНоменклатура КАК КоррНоменклатура,
	|	ДвиженияПоРегиструЗапасы.КоррХарактеристика КАК КоррХарактеристика,
	|	ДвиженияПоРегиструЗапасы.КоррПартия КАК КоррПартия,
	|	ДвиженияПоРегиструЗапасы.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
	|	ДвиженияПоРегиструЗапасы.Спецификация КАК Спецификация,
	|	ДвиженияПоРегиструЗапасы.КоррСпецификация КАК КоррСпецификация,
	|	ДвиженияПоРегиструЗапасы.ЗаказПродажи КАК ЗаказПродажи,
	|	ДвиженияПоРегиструЗапасы.ДокументПродажи КАК ДокументПродажи,
	|	ДвиженияПоРегиструЗапасы.Подразделение КАК Подразделение,
	|	ДвиженияПоРегиструЗапасы.Ответственный КАК Ответственный,
	|	ДвиженияПоРегиструЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ДвиженияПоРегиструЗапасы.ФиксированнаяСтоимость КАК ФиксированнаяСтоимость,
	|	ДвиженияПоРегиструЗапасы.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
	|	ДвиженияПоРегиструЗапасы.Возврат КАК Возврат,
	|	ДвиженияПоРегиструЗапасы.СодержаниеПроводки КАК СодержаниеПроводки,
	|	ДвиженияПоРегиструЗапасы.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
	|	ДвиженияПоРегиструЗапасы.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДвиженияПоРегиструЗапасы.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл,
	|	ВЫБОР
	|		КОГДА &ЗакрыватьПоРеглПлануСчетов
	|			ТОГДА ДвиженияПоРегиструЗапасы.КоррСчетУчетаРегл.ТипСчета
	|		ИНАЧЕ ДвиженияПоРегиструЗапасы.КоррСчетУчета.ТипСчета
	|	КОНЕЦ КАК КоррСчетУчетаТипСчета,
	|	ДвиженияПоРегиструЗапасы.Резервирование КАК Резервирование,
	|	ДвиженияПоРегиструЗапасы.КоррПроект КАК КоррПроект,
	|	ДвиженияПоРегиструЗапасы.КоррДокументПоступления КАК КоррДокументПоступления
	|ПОМЕСТИТЬ ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы
	|ИЗ
	|	РегистрНакопления.Запасы КАК ДвиженияПоРегиструЗапасы
	|ГДЕ
	|	ДвиженияПоРегиструЗапасы.Регистратор = &Ссылка
	|	И ДвиженияПоРегиструЗапасы.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.НомерСтроки) КАК НомерСтроки,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.Организация КАК Организация,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.СчетУчета КАК СчетУчета,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.Номенклатура КАК Номенклатура,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.Характеристика КАК Характеристика,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.Партия КАК Партия,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.Проект КАК Проект,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.ДокументПоступления КАК ДокументПоступления
	|ПОМЕСТИТЬ ТЗ_МаксимальныеСтрокиДвижений
	|ИЗ
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы КАК ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.Организация,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.СтруктурнаяЕдиница,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.СчетУчета,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.Номенклатура,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.Характеристика,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.Партия,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.ЗаказПокупателя,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.СчетУчетаРегл,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.СчетУчетаЗатратРегл,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.Проект,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.ДокументПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ_МаксимальныеСтрокиДвижений.НомерСтроки КАК НомерСтроки,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.ВидДвижения КАК ВидДвижения,
	|	ТЗ_МаксимальныеСтрокиДвижений.Организация КАК Организация,
	|	ТЗ_МаксимальныеСтрокиДвижений.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТЗ_МаксимальныеСтрокиДвижений.СчетУчета КАК СчетУчета,
	|	ТЗ_МаксимальныеСтрокиДвижений.Номенклатура КАК Номенклатура,
	|	ТЗ_МаксимальныеСтрокиДвижений.Характеристика КАК Характеристика,
	|	ТЗ_МаксимальныеСтрокиДвижений.Партия КАК Партия,
	|	ТЗ_МаксимальныеСтрокиДвижений.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТЗ_МаксимальныеСтрокиДвижений.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ТЗ_МаксимальныеСтрокиДвижений.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	|	ТЗ_МаксимальныеСтрокиДвижений.Проект КАК Проект,
	|	ТЗ_МаксимальныеСтрокиДвижений.ДокументПоступления КАК ДокументПоступления,
	//|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.Количество КАК Количество,
	//|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.Сумма КАК Сумма,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.КоррСчетУчета КАК КоррСчетУчета,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.КоррНоменклатура КАК КоррНоменклатура,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.КоррХарактеристика КАК КоррХарактеристика,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.КоррПартия КАК КоррПартия,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.Спецификация КАК Спецификация,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.КоррСпецификация КАК КоррСпецификация,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.ЗаказПродажи КАК ЗаказПродажи,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.ДокументПродажи КАК ДокументПродажи,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.Подразделение КАК Подразделение,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.Ответственный КАК Ответственный,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.ФиксированнаяСтоимость КАК ФиксированнаяСтоимость,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.Возврат КАК Возврат,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.СодержаниеПроводки КАК СодержаниеПроводки,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.КоррСчетУчетаТипСчета КАК КоррСчетУчетаТипСчета,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.Резервирование КАК Резервирование,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.КоррПроект КАК КоррПроект,
	|	ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.КоррДокументПоступления КАК КоррДокументПоступления
	|ПОМЕСТИТЬ ТЗ_ВыбранныеДвиженияПоРегиструЗапасы
	|ИЗ
	|	ТЗ_МаксимальныеСтрокиДвижений КАК ТЗ_МаксимальныеСтрокиДвижений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы КАК ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы
	|		ПО ТЗ_МаксимальныеСтрокиДвижений.НомерСтроки = ТЗ_ТекущиеДвиженияДокументаПоРегиструЗапасы.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|	ЗапасыОстатки.СчетУчета.ТипСчета КАК СчетУчетаТипСчета,
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ЗапасыОстатки.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	|	ЗапасыОстатки.Проект КАК Проект,
	|	ЗапасыОстатки.ДокументПоступления КАК ДокументПоступления,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.КоррСчетУчета КАК КоррСчетУчета,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.КоррНоменклатура КАК КоррНоменклатура,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.КоррХарактеристика КАК КоррХарактеристика,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.КоррПартия КАК КоррПартия,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.Спецификация КАК Спецификация,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.КоррСпецификация КАК КоррСпецификация,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.ЗаказПродажи КАК ЗаказПродажи,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.ДокументПродажи КАК ДокументПродажи,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.Подразделение КАК Подразделение,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.Ответственный КАК Ответственный,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.ФиксированнаяСтоимость КАК ФиксированнаяСтоимость,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.Возврат КАК Возврат,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.СодержаниеПроводки КАК СодержаниеПроводки,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.КоррСчетУчетаТипСчета КАК КоррСчетУчетаТипСчета,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.Резервирование КАК Резервирование,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.КоррПроект КАК КоррПроект,
	|	ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.КоррДокументПоступления КАК КоррДокументПоступления,
	|	ЗапасыОстатки.КоличествоОстаток КАК Количество,
	|	ЗапасыОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(&ГраницаДатаКон, Организация = &Организация) КАК ЗапасыОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗ_ВыбранныеДвиженияПоРегиструЗапасы КАК ТЗ_ВыбранныеДвиженияПоРегиструЗапасы
	|		ПО ЗапасыОстатки.Организация = ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.Организация
	|		И ЗапасыОстатки.СтруктурнаяЕдиница = ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.СтруктурнаяЕдиница
	|		И ЗапасыОстатки.СчетУчета = ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.СчетУчета
	|		И ЗапасыОстатки.Номенклатура = ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.Номенклатура
	|		И ЗапасыОстатки.Характеристика = ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.Характеристика
	|		И ЗапасыОстатки.Партия = ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.Партия
	|		И ЗапасыОстатки.ЗаказПокупателя = ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.ЗаказПокупателя
	|		И ЗапасыОстатки.СчетУчетаРегл = ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.СчетУчетаРегл
	|		И ЗапасыОстатки.СчетУчетаЗатратРегл = ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.СчетУчетаЗатратРегл
	|		И ЗапасыОстатки.Проект = ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.Проект
	|		И ЗапасыОстатки.ДокументПоступления = ТЗ_ВыбранныеДвиженияПоРегиструЗапасы.ДокументПоступления
	|ГДЕ
	|	ЗапасыОстатки.КоличествоОстаток = 0
	|	И ЗапасыОстатки.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	// Тут, возможно, надо ставить МЕЖДУ -1 И 1
	|	И ЗапасыОстатки.СуммаОстаток МЕЖДУ -0.01 И 0.01";

	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ЗакрыватьПоРеглПлануСчетов", ИспользоватьТолькоРегламентированныйПланСчетов);
	Запрос.УстановитьПараметр("ГраницаДатаКон", Новый Граница(ДатаКон, ВидГраницы.Включая));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаОстатков = РезультатЗапроса.Выгрузить();
	
	Если ТаблицаОстатков.Количество()>0 Тогда
		
		СтруктураПоиска = Новый Структура("Организация,СтруктурнаяЕдиница,СчетУчета,Номенклатура,Характеристика,Партия,ЗаказПокупателя,СчетУчетаРегл,СчетУчетаЗатратРегл,Проект");
		
		// Сварачиваем без ДокументПоступления
		ТаблицаОстатковСвернутая = ТаблицаОстатков.Скопировать();
		ТаблицаОстатковСвернутая.Свернуть("Организация,СтруктурнаяЕдиница,СчетУчета,Номенклатура,Характеристика,Партия,ЗаказПокупателя,СчетУчетаРегл,СчетУчетаЗатратРегл,Проект","Сумма");
		
		Для каждого СтрокаТаблицаОстатковСвернутая Из ТаблицаОстатковСвернутая Цикл
		
			ТаблицаОстатковПлюс = ТаблицаОстатков.СкопироватьКолонки();
			ТаблицаОстатковМинус = ТаблицаОстатков.СкопироватьКолонки();
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска,СтрокаТаблицаОстатковСвернутая);
			
			МассивСтрокТаблицаОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураПоиска);
			Для каждого СтрокаМассивСтрокТаблицаОстатков Из МассивСтрокТаблицаОстатков Цикл
			
				Если СтрокаМассивСтрокТаблицаОстатков.Сумма>0 Тогда
				
					СтрокаТаблицаОстатковПлюс = ТаблицаОстатковПлюс.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицаОстатковПлюс,СтрокаМассивСтрокТаблицаОстатков);
					
				Иначе
					
					СтрокаТаблицаОстатковМинус = ТаблицаОстатковМинус.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицаОстатковМинус,СтрокаМассивСтрокТаблицаОстатков);
				
				КонецЕсли;
			
			КонецЦикла;
			
			Если ТаблицаОстатковПлюс.Количество()>0 И ТаблицаОстатковМинус.Количество()>0 Тогда
				
				// Создадим набор записей регистра накопления Учет запасов и затрат.
				НаборЗаписейЗапасы = РегистрыНакопления.Запасы.СоздатьНаборЗаписей();
				НаборЗаписейЗапасы.Отбор.Регистратор.Установить(Ссылка);
			
				Дельта = МИН(ТаблицаОстатковПлюс.Итог("Сумма"), -ТаблицаОстатковМинус.Итог("Сумма"));
				ДельтаПлюс = Дельта;
				ДельтаМинус = Дельта;
				
				Для каждого СтрокаТаблицаОстатковПлюс Из ТаблицаОстатковПлюс Цикл
				
					Если ДельтаПлюс<=0 Тогда
						Прервать;
					КонецЕсли;
					
					СуммаКомпенсации = МИН(СтрокаТаблицаОстатковПлюс.Сумма,ДельтаПлюс);
					
					Если СтрокаТаблицаОстатковПлюс.СчетУчетаТипСчета = Перечисления.ТипыСчетов.Запасы Тогда
						СодержаниеПроводки = НСтр("ka='მარაგების ჩამოწერა საწყობიდან';ru='Списание запасов со склада';en='Write-off of inventories from the warehouse'");
					Иначе
						Если ЗначениеЗаполнено(СтрокаТаблицаОстатковПлюс.Номенклатура) Тогда
							СодержаниеПроводки = НСтр("ka='ხარჯების ჩამოწერა';ru='Списание расходов';en='Write-off costs'");
						Иначе
							СодержаниеПроводки = НСтр("ka='საწარმოდან მარაგების ჩამოწერა';ru='Списание запасов из производства';en='The write-downs of production'");
						КонецЕсли;
					КонецЕсли;
					
					НоваяЗаписьЗапасы = НаборЗаписейЗапасы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяЗаписьЗапасы,СтрокаТаблицаОстатковПлюс);
					
					НоваяЗаписьЗапасы.ВидДвижения = ВидДвиженияНакопления.Расход;
					НоваяЗаписьЗапасы.Период = Дата;
					НоваяЗаписьЗапасы.СодержаниеПроводки = СодержаниеПроводки;
					НоваяЗаписьЗапасы.Сумма = СуммаКомпенсации;
					
					ДельтаПлюс = ДельтаПлюс - СуммаКомпенсации;
				
				КонецЦикла;
				
				Для каждого СтрокаТаблицаОстатковМинус Из ТаблицаОстатковМинус Цикл
				
					Если ДельтаМинус<=0 Тогда
						Прервать;
					КонецЕсли;
					
					СуммаКомпенсации = МИН(-СтрокаТаблицаОстатковМинус.Сумма,ДельтаМинус);
					
					Если СтрокаТаблицаОстатковМинус.КоррСчетУчетаТипСчета = Перечисления.ТипыСчетов.Запасы Тогда
						СодержаниеПроводки = НСтр("ka='საწყობში მარაგების შემოსავალში გატარება';ru='Оприходование запасов на склад';en='Posting inventory at the warehouse'");
					Иначе
						Если ЗначениеЗаполнено(СтрокаТаблицаОстатковМинус.Номенклатура) Тогда
							СодержаниеПроводки = НСтр("ka='ხარჯების შემოსვლა';ru='Поступление расходов';en='Admission costs'");
						Иначе
							СодержаниеПроводки = НСтр("ka='წარმოებაში მარაგების შემოსავალში აყვანა';ru='Оприходование запасов в производство';en='Posting inventory to production'");
						КонецЕсли;
					КонецЕсли;
					
					НоваяЗаписьЗапасы = НаборЗаписейЗапасы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяЗаписьЗапасы,СтрокаТаблицаОстатковМинус);
					
					НоваяЗаписьЗапасы.ВидДвижения = ВидДвиженияНакопления.Приход;
					НоваяЗаписьЗапасы.Период = Дата;
					НоваяЗаписьЗапасы.СодержаниеПроводки = СодержаниеПроводки;
					НоваяЗаписьЗапасы.Сумма = СуммаКомпенсации;
					
					ДельтаМинус = ДельтаМинус - СуммаКомпенсации;
				
				КонецЦикла;
				
				НаборЗаписейЗапасы.Записать(ЛОЖЬ);
				
			КонецЕсли;
		
		КонецЦикла; 
	
	КонецЕсли;

КонецПроцедуры
#КонецОбласти
// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости

// Kuzmich, 23.10.2025, (ONESOFT-4400) Отключение функционала усреднение остатков в конфигурации УНФ
#Область ОтключениеУсредненияОстатков
Процедура ОбработкаОшибокОкругленияТаблицаРаспределения_ОтключениеУсреднения(ТаблицаРаспределения)
	
	Если (ТипЗНЧ(ТаблицаРаспределения)=Тип("ТаблицаЗначений")) И (ТаблицаРаспределения.Количество()>0) Тогда
	
		ТаблицаРаспределенияСвернутая = ТаблицаРаспределения.Скопировать();
		//ТаблицаРаспределенияСвернутая.Свернуть("Организация,СчетУчета,Номенклатура,Характеристика,Партия,ЗаказПокупателя,СчетУчетаРегл,СчетУчетаЗатратРегл,Проект,ДокументПоступления","Сумма");
		// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
		ТаблицаРаспределенияСвернутая.Свернуть("Организация,СчетУчета,Номенклатура,Характеристика,Партия,ЗаказПокупателя,СчетУчетаРегл,СчетУчетаЗатратРегл,Проект,ДокументПоступления","Сумма,СуммаРасход");
		// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
		
		Для каждого СтрокаТаблицаРаспределенияСвернутая Из ТаблицаРаспределенияСвернутая Цикл
			
			СтараяСумма = СтрокаТаблицаРаспределенияСвернутая.Сумма;
			НоваяСумма = 0;
		
			СтрокаМаксимум = НЕОПРЕДЕЛЕНО;
			СуммаМаксимум = 0;
			СтрокаМинимум = НЕОПРЕДЕЛЕНО;
			СуммаМинимум = 9999999999;
			
			// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
			СтараяСуммаРасход = СтрокаТаблицаРаспределенияСвернутая.СуммаРасход;
			НоваяСуммаРасход = 0;
		
			СтрокаМаксимумРасход = НЕОПРЕДЕЛЕНО;
			СуммаМаксимумРасход = 0;
			СтрокаМинимумРасход = НЕОПРЕДЕЛЕНО;
			СуммаМинимумРасход = 9999999999;
			// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
			
			СтруктураПоиска = Новый Структура("Организация,СчетУчета,Номенклатура,Характеристика,Партия,ЗаказПокупателя,СчетУчетаРегл,СчетУчетаЗатратРегл,Проект,ДокументПоступления", 
			СтрокаТаблицаРаспределенияСвернутая.Организация,СтрокаТаблицаРаспределенияСвернутая.СчетУчета,
			СтрокаТаблицаРаспределенияСвернутая.Номенклатура,СтрокаТаблицаРаспределенияСвернутая.Характеристика,СтрокаТаблицаРаспределенияСвернутая.Партия,
			СтрокаТаблицаРаспределенияСвернутая.ЗаказПокупателя,СтрокаТаблицаРаспределенияСвернутая.СчетУчетаРегл,
			СтрокаТаблицаРаспределенияСвернутая.СчетУчетаЗатратРегл,СтрокаТаблицаРаспределенияСвернутая.Проект,СтрокаТаблицаРаспределенияСвернутая.ДокументПоступления);
			
			НайденныеСтроки = ТаблицаРаспределения.НайтиСтроки(СтруктураПоиска);
			Для каждого СтрокаНайденныеСтроки Из НайденныеСтроки Цикл
			
				СтрокаНайденныеСтроки.Сумма = ОКР(СтрокаНайденныеСтроки.Сумма,2,РежимОкругления.Окр15как20);
				НоваяСумма = НоваяСумма + СтрокаНайденныеСтроки.Сумма;
				
				Если СтрокаНайденныеСтроки.Сумма>СуммаМаксимум Тогда
				
					СуммаМаксимум = СтрокаНайденныеСтроки.Сумма;
					СтрокаМаксимум = СтрокаНайденныеСтроки;
				
				КонецЕсли;
				
				Если СтрокаНайденныеСтроки.Сумма<СуммаМинимум Тогда
				
					СуммаМинимум = СтрокаНайденныеСтроки.Сумма;
					СтрокаМинимум = СтрокаНайденныеСтроки;
				
				КонецЕсли;
				
				// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
				СтрокаНайденныеСтроки.СуммаРасход = ОКР(СтрокаНайденныеСтроки.СуммаРасход,2,РежимОкругления.Окр15как20);
				НоваяСуммаРасход = НоваяСуммаРасход + СтрокаНайденныеСтроки.СуммаРасход;
				
				Если СтрокаНайденныеСтроки.СуммаРасход>СуммаМаксимумРасход Тогда
				
					СуммаМаксимумРасход = СтрокаНайденныеСтроки.СуммаРасход;
					СтрокаМаксимумРасход = СтрокаНайденныеСтроки;
				
				КонецЕсли;
				
				Если СтрокаНайденныеСтроки.СуммаРасход<СуммаМинимумРасход Тогда
				
					СуммаМинимумРасход = СтрокаНайденныеСтроки.СуммаРасход;
					СтрокаМинимумРасход = СтрокаНайденныеСтроки;
				
				КонецЕсли
				// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
			
			КонецЦикла;
			
			Дельта = СтараяСумма - НоваяСумма;
			
			Если Дельта>0 Тогда
			
				СтрокаМинимум.Сумма = СтрокаМинимум.Сумма + Дельта;
				
			ИначеЕсли Дельта<0 Тогда
			
				СтрокаМаксимум.Сумма = СтрокаМаксимум.Сумма + Дельта;
			
			КонецЕсли;
			
			// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
			ДельтаРасход = СтараяСуммаРасход - НоваяСуммаРасход;
			
			Если ДельтаРасход>0 Тогда
			
				СтрокаМинимумРасход.СуммаРасход = СтрокаМинимумРасход.СуммаРасход + ДельтаРасход;
				
			ИначеЕсли ДельтаРасход<0 Тогда
			
				СтрокаМаксимумРасход.СуммаРасход = СтрокаМаксимумРасход.СуммаРасход + ДельтаРасход;
			
			КонецЕсли;
			// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
		
		КонецЦикла;
	
	КонецЕсли;	

КонецПроцедуры

Процедура СформироватьКорректирующиеДвиженияПоРегиструУчетаЗатрат_ОтключениеУсреднения(ТаблицаРаспределения)
	
	Если НЕ(ТипЗНЧ(ТаблицаРаспределения)=Тип("ТаблицаЗначений"))Тогда
		Возврат;
	ИначеЕсли  НЕ(ТаблицаРаспределения.Количество()>0) ТОГДА
		Возврат;
	КонецЕсли;
	
	// Создадим набор записей регистра накопления Учет запасов и затрат.
	НаборЗаписейЗапасы = РегистрыНакопления.Запасы.СоздатьНаборЗаписей();
	НаборЗаписейЗапасы.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Продажи.
	НаборЗаписейПродажи = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
	НаборЗаписейПродажи.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления УчетДоходовИРасходов.
	НаборЗаписейДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей();
	НаборЗаписейДоходыИРасходы.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления СуммовойУчетВРознице.
	НаборЗаписейСуммовойУчетВРознице = РегистрыНакопления.СуммовойУчетВРознице.СоздатьНаборЗаписей();
	НаборЗаписейСуммовойУчетВРознице.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Управленческий.
	НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
	НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Хозрасчетный.
	НаборЗаписейХозрасчетный = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборЗаписейХозрасчетный.Отбор.Регистратор.Установить(Ссылка);
	
	СтруктураПараметровРегл = РегламентированныйУчетСервер.ПолучитьСтруктуруСчетовУчета(ДополнительныеСвойства.ДляПроведения.Организация, ДополнительныеСвойства.ДляПроведения.Дата);
	Если СтруктураПараметровРегл.Выбран() Тогда
		СчетПрочиеДоходыРегл = СтруктураПараметровРегл.СчетПрочихДоходов;
		СчетПрочиеРасходыРегл = СтруктураПараметровРегл.СчетПрочихРасходов;
	Иначе
		СчетПрочиеДоходыРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
		СчетПрочиеРасходыРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	КонецЕсли;
	
	Для Каждого ВыборкаДетальныеЗаписи ИЗ ТаблицаРаспределения Цикл
		
		// Сделаем проверку, на случай, если есть не закрытые кассовые смены.
		Если ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ЧекККМ")
			ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
			Продолжить;
		КонецЕсли;
		
		// Посчитаем суммы перемещения и корректировки.
		СуммаКорректировки = ВыборкаДетальныеЗаписи.Сумма;
		
		//Если Окр(СуммаКорректировки, 2) <> 0 Тогда
		// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
		Если (СуммаКорректировки <= -0.01) ИЛИ (СуммаКорректировки >= 0.01) Тогда
		// Kuzmich, 26.01.2025, (ONESOFT-3713) Закрытие Месяца - Расчет фактической себестоимости
			
			// Движения по регистру Учет запасов и затрат.
			СформироватьДвиженияПоРегиструУчетаЗатрат(
				НаборЗаписейЗапасы,
				НаборЗаписейУправленческий,
				НаборЗаписейХозрасчетный,
				ВыборкаДетальныеЗаписи,
				СуммаКорректировки,
				Ложь
			);
			
			Если ВыборкаДетальныеЗаписи.КоррСчетУчета = ДополнительныеСвойства.ДляПроведения.ПустойСчет
				ИЛИ ВыборкаДетальныеЗаписи.КоррСчетУчетаРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка() Тогда
				
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДокументПродажи)
				   И ((ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.РасходнаяНакладная")
					 И ВыборкаДетальныеЗаписи.ДокументПродажи.ВидОперации <> Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.АктВыполненныхРабот")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ОтчетКомиссионера")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ЗаказПокупателя")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ОтчетОПереработке")) Тогда
					
					// Движения по регистру Продажи.
					НоваяСтрока = НаборЗаписейПродажи.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПродажи;
					НоваяСтрока.Подразделение = ВыборкаДетальныеЗаписи.Подразделение;
					НоваяСтрока.Ответственный = ВыборкаДетальныеЗаписи.Ответственный;
					НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
					НоваяСтрока.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
					НоваяСтрока.Партия = ВыборкаДетальныеЗаписи.Партия;
					НоваяСтрока.Проект = ВыборкаДетальныеЗаписи.Проект;  //Малышев 2024-06-19   ONESOFT-3227
					НоваяСтрока.Документ = ВыборкаДетальныеЗаписи.ДокументПродажи;
					НоваяСтрока.СтавкаНДС = ВыборкаДетальныеЗаписи.СтавкаНДС;
					НоваяСтрока.Себестоимость = СуммаКорректировки;
					
					// Движения по регистру ДоходыИРасходы.
					НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.Подразделение;
					НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПродажи;
					НоваяСтрока.НаправлениеДеятельности = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажи;
					НоваяСтрока.СчетУчета = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж;
					НоваяСтрока.СчетУчетаРегл = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл;
					НоваяСтрока.Проект = ВыборкаДетальныеЗаписи.Проект;       //Малышев 2024-06-19   ONESOFT-3227
					НоваяСтрока.СуммаРасходов = СуммаКорректировки;
					НоваяСтрока.СодержаниеПроводки = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					НоваяСтрока.Содержание = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					// Движения по регистру Хозрасчетный.
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
					НоваяСтрока.Содержание = НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов';en='reflection expenditure'");
					НоваяСтрока.Сумма = СуммаКорректировки;
										
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Проекты", ВыборкаДетальныеЗаписи.Проект); //Малышев 2024-06-19   ONESOFT-3227
					                             
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
                    БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Проекты", ВыборкаДетальныеЗаписи.Проект); //Малышев 2024-06-19   ONESOFT-3227
					
					
				ИначеЕсли ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДокументПродажи)
						И ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.РасходнаяНакладная")
						И ВыборкаДетальныеЗаписи.ДокументПродажи.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику Тогда
						
					// Движения по регистру Доходы и расходы.
					НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
					НоваяСтрока.Период = ДополнительныеСвойства.ДляПроведения.Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = Неопределено;
					НоваяСтрока.ЗаказПокупателя = Неопределено;
					НоваяСтрока.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
					
					Если СуммаКорректировки < 0 Тогда
						НоваяСтрока.СчетУчета = ПланыСчетов.Управленческий.ПрочиеРасходы;
						НоваяСтрока.СчетУчетаРегл = СчетПрочиеРасходыРегл;
						НоваяСтрока.СуммаРасходов = СуммаКорректировки;
						НоваяСтрока.СодержаниеПроводки = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					Иначе
						НоваяСтрока.СчетУчета = ПланыСчетов.Управленческий.ПрочиеДоходы;
						НоваяСтрока.СчетУчетаРегл = СчетПрочиеДоходыРегл;
						НоваяСтрока.СуммаДоходов = СуммаКорректировки;
						НоваяСтрока.СодержаниеПроводки = НСтр("ka='სხვა შემოსავლები';ru='Прочие доходы';en='Other income'");
					Конецесли;
					НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Номенклатура;
					НоваяСтрока.Проект = ВыборкаДетальныеЗаписи.Проект;   //Малышев 2024-06-19   ONESOFT-3227
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					
					Если СуммаКорректировки < 0 Тогда
						НоваяСтрока.СчетДт = ПланыСчетов.Управленческий.ПрочиеРасходы;
						НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
						НоваяСтрока.Сумма = - СуммаКорректировки;
						НоваяСтрока.Содержание = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					Иначе
						НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчета;
						НоваяСтрока.СчетКт = ПланыСчетов.Управленческий.ПрочиеДоходы;
						НоваяСтрока.Сумма = СуммаКорректировки;
						НоваяСтрока.Содержание = НСтр("ka='სხვა შემოსავლები';ru='Прочие доходы';en='Other income'");
					КонецЕсли;
					
					// Движения по регистру Хозрасчетный.
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
										
					Если СуммаКорректировки < 0 Тогда
						НоваяСтрока.СчетДт = СчетПрочиеРасходыРегл;
						НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
						НоваяСтрока.Сумма = - СуммаКорректировки;
						НоваяСтрока.Содержание = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					Иначе
						НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
						НоваяСтрока.СчетКт = СчетПрочиеДоходыРегл;
						НоваяСтрока.Сумма = СуммаКорректировки;
						НоваяСтрока.Содержание = НСтр("ka='სხვა შემოსავლები';ru='Прочие доходы';en='Other income'");
					КонецЕсли;
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Проекты", ВыборкаДетальныеЗаписи.Проект); //Малышев 2024-06-19   ONESOFT-3227
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Проекты", ВыборкаДетальныеЗаписи.Проект); //Малышев 2024-06-19   ONESOFT-3227
					
				ИначеЕсли ВыборкаДетальныеЗаписи.ПеремещениеВРозницуСуммовойУчет Тогда
					
					// Движения по регистру СуммовойУчетВРознице.
					НоваяСтрока = НаборЗаписейСуммовойУчетВРознице.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница;
					НоваяСтрока.Валюта = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница.РозничныйВидЦен.ВалютаЦены;
					НоваяСтрока.СодержаниеПроводки = НСтр("ka='საცალო ვაჭრობაში გადაადგილება';ru='Перемещение в розницу';en='Moving into retail'");
					НоваяСтрока.Себестоимость = СуммаКорректировки;
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница.СчетУчетаВРознице;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					НоваяСтрока.Содержание = НСтр("ka='საცალო ვაჭრობაში გადაადგილება';ru='Перемещение в розницу';en='Moving into retail'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					// Движения по регистру Хозрасчетный.
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница.СчетУчетаВРозницеРегл;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
					НоваяСтрока.Содержание = НСтр("ka='საცალო ვაჭრობაში გადაადგილება';ru='Перемещение в розницу';en='Moving into retail'");
					НоваяСтрока.Сумма = СуммаКорректировки;
										
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Проекты", ВыборкаДетальныеЗаписи.Проект); //Малышев 2024-06-19   ONESOFT-3227
						
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Проекты", ВыборкаДетальныеЗаписи.Проект); //Малышев 2024-06-19   ONESOFT-3227
						
				ИначеЕсли ВыборкаДетальныеЗаписи.СчетУчетаСписанияТипСчета = Перечисления.ТипыСчетов.ПрочиеРасходы
					  ИЛИ ВыборкаДетальныеЗаписи.СчетУчетаСписанияТипСчета = Перечисления.ТипыСчетов.Расходы
					  ИЛИ РегламентированныйУчетСервер.СчетЯвляетсяРасходным(ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл) Тогда
					
					// Движения по регистру Доходы и расходы.
					НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
					НоваяСтрока.Период = ДополнительныеСвойства.ДляПроведения.Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.СтруктурнаяЕдиницаПолучатель;
					
					Если ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ПеремещениеЗапасов")
					   И ВыборкаДетальныеЗаписи.СчетУчетаСписанияТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
						НоваяСтрока.НаправлениеДеятельности = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиСписания;
						НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПокупателя;
					Иначе
						НоваяСтрока.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
					КонецЕсли;
					
					НоваяСтрока.СчетУчета = ВыборкаДетальныеЗаписи.СчетУчетаСписания;
					НоваяСтрока.СчетУчетаРегл = ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл;
					НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Номенклатура;
					НоваяСтрока.Проект = ВыборкаДетальныеЗаписи.Проект;   //Малышев 2024-06-19   ONESOFT-3227
					НоваяСтрока.СуммаРасходов = СуммаКорректировки;
					НоваяСтрока.СодержаниеПроводки = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаСписания;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					НоваяСтрока.Содержание = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
					// Движения по регистру Хозрасчетный.
					НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
					НоваяСтрока.Содержание = НСтр("ka='სხვა ხარჯები';ru='Прочие расходы';en='other expenses'");
					НоваяСтрока.Сумма = СуммаКорректировки;
										
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Подразделение),ВыборкаДетальныеЗаписи.Подразделение,ВыборкаДетальныеЗаписи.СтруктурнаяЕдиницаПолучатель));
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Проекты", ВыборкаДетальныеЗаписи.Проект); //Малышев 2024-06-19   ONESOFT-3227
					
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Подразделение),ВыборкаДетальныеЗаписи.Подразделение,ВыборкаДетальныеЗаписи.СтруктурнаяЕдиницаПолучатель));//ВыборкаДетальныеЗаписи.Подразделение);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Проекты", ВыборкаДетальныеЗаписи.Проект); //Малышев 2024-06-19   ONESOFT-3227
					
				Иначе
					
					//+++ Дмгг
					//// Движения по регистру Управленческий.
					//НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					//НоваяСтрока.Период = Дата;
					//НоваяСтрока.Регистратор = Ссылка;
					//НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					//НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					//НоваяСтрока.СчетДт = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СчетУчетаСписания),ВыборкаДетальныеЗаписи.СчетУчетаСписания,ВыборкаДетальныеЗаписи.СчетУчета);
					//НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					//НоваяСтрока.Содержание = НСтр("ka='მარაგების ჩამოწერა თავისუფალ ანგარიშზე';ru='Списание запасов на произвольный счет';en='The write-downs on an arbitrary score'");
					//НоваяСтрока.Сумма = СуммаКорректировки;
					//
					//// Движения по регистру Хозрасчетный.
					//НоваяСтрока = НаборЗаписейХозрасчетный.Добавить();
					//НоваяСтрока.Период = Дата;
					//НоваяСтрока.Регистратор = Ссылка;
					//НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					//НоваяСтрока.СчетДт = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл),ВыборкаДетальныеЗаписи.СчетУчетаСписанияРегл,ВыборкаДетальныеЗаписи.СчетУчетаРегл);;
					//НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчетаРегл;
					//НоваяСтрока.Содержание = НСтр("ka='მარაგების ჩამოწერა თავისუფალ ანგარიშზე';ru='Списание запасов на произвольный счет';en='The write-downs on an arbitrary score'");
					//НоваяСтрока.Сумма = СуммаКорректировки;
					//
					//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					//
					//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
					//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Подразделения", ВыборкаДетальныеЗаписи.Подразделение);
					//БухгалтерскийУчет.УстановитьСубконто(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, "Склады", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
					//--- Дмгг
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Пишем оставшиеся записи Учет запасов и затрат.
	НаборЗаписейЗапасы.Записать(Ложь);
	
	// Пишем оставшиеся записи Продажи.
	НаборЗаписейПродажи.Записать(Ложь);
	
	// Пишем оставшиеся записи Учет доходов и расходов.
	НаборЗаписейДоходыИРасходы.Записать(Ложь);
	
	// Пишем оставшиеся записи Суммовой учет в рознице.
	НаборЗаписейСуммовойУчетВРознице.Записать(Ложь);
	
	// Пишем оставшиеся записи Управленческий.
	Если НЕ ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()) Тогда  //+++ Дмгг
		НаборЗаписейУправленческий.Записать(Ложь);
	КонецЕсли;  //--- Дмгг
	
	// Пишем оставшиеся записи Хозрасчетный.
	НаборЗаписейХозрасчетный.Записать(Ложь);
	
КонецПроцедуры

Процедура РассчитатьФактическуюСебестоимостьВыпуска_ОтключениеУсреднения(Отказ, ВидОперации, ТаблицаОшибок)
	
	УчетСебестоимостиВРазрезеОрганизации = ДополнительныеСвойства.УчетнаяПолитика.УчетСебестоимостиВРазрезеОрганизации;
	
	// 1.Перенос затрат на остатки
	Запрос = Новый Запрос();
	
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНач", ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("ДатаКон", ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод);
	Запрос.УстановитьПараметр("ДатаКонМоментВремени", Ссылка.МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированныйПланСчетов", ДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	Запрос.УстановитьПараметр("ЗакрыватьПоРеглПлануСчетов", ДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	Запрос.УстановитьПараметр("УчетСебестоимостиВРазрезеОрганизации", УчетСебестоимостиВРазрезеОрганизации);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетЗатрат.Организация КАК Организация,
		|	УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	УчетЗатрат.СчетУчета КАК СчетУчета,
		|	УчетЗатрат.Номенклатура КАК Номенклатура,
		|	УчетЗатрат.Характеристика КАК Характеристика,
		|	УчетЗатрат.Партия КАК Партия,
		|	УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
		|	УчетЗатрат.СчетУчетаРегл КАК СчетУчетаРегл,
		|	УчетЗатрат.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	УчетЗатрат.Проект КАК Проект,
		|	УчетЗатрат.ДокументПоступления КАК ДокументПоступления,
		|	УчетЗатрат.Сумма КАК Сумма,
		|	УчетЗатрат.Спецификация КАК Спецификация,
		|	УчетЗатрат.КоррСпецификация КАК КоррСпецификация,
		|	УчетЗатрат.ДокументПродажи КАК ДокументПродажи,
		|	УчетЗатрат.ЗаказПродажи КАК ЗаказПродажи,
		|	УчетЗатрат.Подразделение КАК Подразделение,
		|	УчетЗатрат.Ответственный КАК Ответственный,
		|	УчетЗатрат.СтавкаНДС КАК СтавкаНДС,
		|	УчетЗатрат.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
		|	УчетЗатрат.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
		|	ВЫБОР
		|		КОГДА &ЗакрыватьПоРеглПлануСчетов
		|			ТОГДА УчетЗатрат.СчетУчетаРегл.ТипСчета
		|		ИНАЧЕ УчетЗатрат.СчетУчета.ТипСчета
		|	КОНЕЦ КАК СчетУчетаТипСчета,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
		|			ТОГДА ВЫРАЗИТЬ(УчетЗатрат.ДокументПродажи КАК Документ.СписаниеЗапасов).Корреспонденция
		|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
		|			ТОГДА ВЫРАЗИТЬ(УчетЗатрат.ДокументПродажи КАК Документ.ПересортицаЗапасов).Корреспонденция
		|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
		|			ТОГДА ВЫРАЗИТЬ(УчетЗатрат.ДокументПродажи КАК Документ.ПеремещениеЗапасов).СчетЗатрат
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК СчетУчетаСписания,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
		|			ТОГДА ВЫРАЗИТЬ(УчетЗатрат.ДокументПродажи КАК Документ.СписаниеЗапасов).КорреспонденцияРегл
		|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
		|			ТОГДА ВЫРАЗИТЬ(УчетЗатрат.ДокументПродажи КАК Документ.ПересортицаЗапасов).КорреспонденцияРегл
		|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
		|			ТОГДА ВЫРАЗИТЬ(УчетЗатрат.ДокументПродажи КАК Документ.ПеремещениеЗапасов).СчетЗатратРегл
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК СчетУчетаСписанияРегл,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
		|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
		|			ТОГДА ВЫБОР
		|					КОГДА &ЗакрыватьПоРеглПлануСчетов
		|						ТОГДА УчетЗатрат.ДокументПродажи.КорреспонденцияРегл.ТипСчета
		|					ИНАЧЕ УчетЗатрат.ДокументПродажи.Корреспонденция.ТипСчета
		|				КОНЕЦ
		|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
		|			ТОГДА ВЫБОР
		|					КОГДА &ЗакрыватьПоРеглПлануСчетов
		|						ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатратРегл.ТипСчета
		|					ИНАЧЕ УчетЗатрат.ДокументПродажи.СчетЗатрат.ТипСчета
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК СчетУчетаСписанияТипСчета,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
		|			ТОГДА УчетЗатрат.ДокументПродажи.НаправлениеДеятельности
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК НаправлениеДеятельностиСписания,
		|	ВЫБОР
		|		КОГДА УчетЗатрат.ПеремещениеВРозницуСуммовойУчет
		|			ТОГДА ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПриходнаяНакладная)
		|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
		|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
		|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
		|					ИНАЧЕ НЕОПРЕДЕЛЕНО
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК РозничнаяСтруктурнаяЕдиница,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
		|			ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
		|		ИНАЧЕ УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
		|	КОНЕЦ КАК СтруктурнаяЕдиницаПолучатель,
		|	УчетЗатрат.Номенклатура.КатегорияНоменклатуры КАК НоменклатураКатегорияНоменклатуры,
		|	УчетЗатрат.Номенклатура.НаправлениеДеятельности КАК НаправлениеДеятельностиПродажи,
		|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
		|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
		|	ВЫБОР
		|		КОГДА &ЗакрыватьПоРеглПлануСчетов
		|			ТОГДА УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл.ТипСчета
		|		ИНАЧЕ УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета
		|	КОНЕЦ КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета
		|ПОМЕСТИТЬ РаспределениеЗатрат
		|ИЗ
		|	РегистрНакопления.Запасы КАК УчетЗатрат
		|ГДЕ
		|	УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И УчетЗатрат.Организация = &Организация
		|	И УчетЗатрат.Регистратор ССЫЛКА Документ.РаспределениеЗатрат
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РаспределениеЗатрат.Организация КАК Организация,
		|	РаспределениеЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	РаспределениеЗатрат.СчетУчета КАК СчетУчета,
		|	РаспределениеЗатрат.Номенклатура КАК Номенклатура,
		|	РаспределениеЗатрат.Характеристика КАК Характеристика,
		|	РаспределениеЗатрат.Партия КАК Партия,
		|	РаспределениеЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
		|	РаспределениеЗатрат.СчетУчетаРегл КАК СчетУчетаРегл,
		|	РаспределениеЗатрат.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	РаспределениеЗатрат.Проект КАК Проект,
		|	РаспределениеЗатрат.ДокументПоступления КАК ДокументПоступления,
		|	СУММА(РаспределениеЗатрат.Сумма) КАК Сумма
		|ПОМЕСТИТЬ РаспределениеЗатратСгруппированные
		|ИЗ
		|	РаспределениеЗатрат КАК РаспределениеЗатрат
		|
		|СГРУППИРОВАТЬ ПО
		|	РаспределениеЗатрат.Организация,
		|	РаспределениеЗатрат.СтруктурнаяЕдиница,
		|	РаспределениеЗатрат.СчетУчета,
		|	РаспределениеЗатрат.Номенклатура,
		|	РаспределениеЗатрат.Характеристика,
		|	РаспределениеЗатрат.Партия,
		|	РаспределениеЗатрат.ЗаказПокупателя,
		|	РаспределениеЗатрат.СчетУчетаРегл,
		|	РаспределениеЗатрат.СчетУчетаЗатратРегл,
		|	РаспределениеЗатрат.Проект,
		|	РаспределениеЗатрат.ДокументПоступления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапасыОстатки.Организация КАК Организация,
		|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
		|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыОстатки.Характеристика КАК Характеристика,
		|	ЗапасыОстатки.Партия КАК Партия,
		|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
		|	ЗапасыОстатки.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	ЗапасыОстатки.Проект КАК Проект,
		|	ЗапасыОстатки.ДокументПоступления КАК ДокументПоступления,
		|	ЗапасыОстатки.СуммаОстаток КАК СуммаОстаток
		|ПОМЕСТИТЬ РаспределениеЗатратОстатки
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			&ДатаКонМоментВремени,
		|			(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя, СчетУчетаРегл, СчетУчетаЗатратРегл, Проект, ДокументПоступления) В
		|				(ВЫБРАТЬ
		|					РаспределениеЗатрат.Организация КАК Организация,
		|					РаспределениеЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|					РаспределениеЗатрат.СчетУчета КАК СчетУчета,
		|					РаспределениеЗатрат.Номенклатура КАК Номенклатура,
		|					РаспределениеЗатрат.Характеристика КАК Характеристика,
		|					РаспределениеЗатрат.Партия КАК Партия,
		|					РаспределениеЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
		|					РаспределениеЗатрат.СчетУчетаРегл КАК СчетУчетаРегл,
		|					РаспределениеЗатрат.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|					РаспределениеЗатрат.Проект КАК Проект,
		|					РаспределениеЗатрат.ДокументПоступления КАК ДокументПоступления
		|				ИЗ
		|					РаспределениеЗатрат)) КАК ЗапасыОстатки
		|ГДЕ
		|	ЕСТЬNULL(ЗапасыОстатки.СуммаОстаток, 0) > 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РаспределениеЗатрат.Организация КАК Организация,
		|	РаспределениеЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	РаспределениеЗатрат.СчетУчета КАК СчетУчета,
		|	РаспределениеЗатрат.Номенклатура КАК Номенклатура,
		|	РаспределениеЗатрат.Характеристика КАК Характеристика,
		|	РаспределениеЗатрат.Партия КАК Партия,
		|	РаспределениеЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
		|	РаспределениеЗатрат.СчетУчетаРегл КАК СчетУчетаРегл,
		|	РаспределениеЗатрат.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	РаспределениеЗатрат.Проект КАК Проект,
		|	РаспределениеЗатрат.ДокументПоступления КАК ДокументПоступления,
		|	СУММА(ВЫРАЗИТЬ( (ВЫБОР
		|			КОГДА ЕСТЬNULL(РаспределениеЗатратОстатки.СуммаОстаток, 0) > 0
		|				ТОГДА ЕСТЬNULL(РаспределениеЗатратОстатки.СуммаОстаток, 0) * (РаспределениеЗатрат.Сумма / РаспределениеЗатратСгруппированные.Сумма)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ЧИСЛО(38, 28))) КАК Сумма,
		|	РаспределениеЗатрат.Спецификация КАК Спецификация,
		|	РаспределениеЗатрат.КоррСпецификация КАК КоррСпецификация,
		|	РаспределениеЗатрат.ДокументПродажи КАК ДокументПродажи,
		|	РаспределениеЗатрат.ЗаказПродажи КАК ЗаказПродажи,
		|	РаспределениеЗатрат.Подразделение КАК Подразделение,
		|	РаспределениеЗатрат.Ответственный КАК Ответственный,
		|	РаспределениеЗатрат.СтавкаНДС КАК СтавкаНДС,
		|	РаспределениеЗатрат.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
		|	РаспределениеЗатрат.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
		|	РаспределениеЗатрат.СчетУчетаТипСчета КАК СчетУчетаТипСчета,
		|	РаспределениеЗатрат.СчетУчетаСписания КАК СчетУчетаСписания,
		|	РаспределениеЗатрат.СчетУчетаСписанияРегл КАК СчетУчетаСписанияРегл,
		|	РаспределениеЗатрат.СчетУчетаСписанияТипСчета КАК СчетУчетаСписанияТипСчета,
		|	РаспределениеЗатрат.НаправлениеДеятельностиСписания КАК НаправлениеДеятельностиСписания,
		|	РаспределениеЗатрат.РозничнаяСтруктурнаяЕдиница КАК РозничнаяСтруктурнаяЕдиница,
		|	РаспределениеЗатрат.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
		|	РаспределениеЗатрат.НоменклатураКатегорияНоменклатуры КАК НоменклатураКатегорияНоменклатуры,
		|	РаспределениеЗатрат.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельностиПродажи,
		|	РаспределениеЗатрат.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
		|	РаспределениеЗатрат.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
		|	РаспределениеЗатрат.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета
		|ПОМЕСТИТЬ Затраты
		|ИЗ
		|	РаспределениеЗатрат КАК РаспределениеЗатрат
		|		ЛЕВОЕ СОЕДИНЕНИЕ РаспределениеЗатратОстатки КАК РаспределениеЗатратОстатки
		|		ПО РаспределениеЗатрат.Организация = РаспределениеЗатратОстатки.Организация
		|			И РаспределениеЗатрат.СтруктурнаяЕдиница = РаспределениеЗатратОстатки.СтруктурнаяЕдиница
		|			И РаспределениеЗатрат.СчетУчета = РаспределениеЗатратОстатки.СчетУчета
		|			И РаспределениеЗатрат.Номенклатура = РаспределениеЗатратОстатки.Номенклатура
		|			И РаспределениеЗатрат.Характеристика = РаспределениеЗатратОстатки.Характеристика
		|			И РаспределениеЗатрат.Партия = РаспределениеЗатратОстатки.Партия
		|			И РаспределениеЗатрат.ЗаказПокупателя = РаспределениеЗатратОстатки.ЗаказПокупателя
		|			И РаспределениеЗатрат.СчетУчетаРегл = РаспределениеЗатратОстатки.СчетУчетаРегл
		|			И РаспределениеЗатрат.СчетУчетаЗатратРегл = РаспределениеЗатратОстатки.СчетУчетаЗатратРегл
		|			И РаспределениеЗатрат.Проект = РаспределениеЗатратОстатки.Проект
		|			И РаспределениеЗатрат.ДокументПоступления = РаспределениеЗатратОстатки.ДокументПоступления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РаспределениеЗатратСгруппированные КАК РаспределениеЗатратСгруппированные
		|		ПО РаспределениеЗатрат.Организация = РаспределениеЗатратСгруппированные.Организация
		|			И РаспределениеЗатрат.СтруктурнаяЕдиница = РаспределениеЗатратСгруппированные.СтруктурнаяЕдиница
		|			И РаспределениеЗатрат.СчетУчета = РаспределениеЗатратСгруппированные.СчетУчета
		|			И РаспределениеЗатрат.Номенклатура = РаспределениеЗатратСгруппированные.Номенклатура
		|			И РаспределениеЗатрат.Характеристика = РаспределениеЗатратСгруппированные.Характеристика
		|			И РаспределениеЗатрат.Партия = РаспределениеЗатратСгруппированные.Партия
		|			И РаспределениеЗатрат.ЗаказПокупателя = РаспределениеЗатратСгруппированные.ЗаказПокупателя
		|			И РаспределениеЗатрат.СчетУчетаРегл = РаспределениеЗатратСгруппированные.СчетУчетаРегл
		|			И РаспределениеЗатрат.СчетУчетаЗатратРегл = РаспределениеЗатратСгруппированные.СчетУчетаЗатратРегл
		|			И РаспределениеЗатрат.Проект = РаспределениеЗатратСгруппированные.Проект
		|			И РаспределениеЗатрат.ДокументПоступления = РаспределениеЗатратСгруппированные.ДокументПоступления
		|
		|СГРУППИРОВАТЬ ПО
		|	РаспределениеЗатрат.Организация,
		|	РаспределениеЗатрат.СтруктурнаяЕдиница,
		|	РаспределениеЗатрат.СчетУчета,
		|	РаспределениеЗатрат.Номенклатура,
		|	РаспределениеЗатрат.Характеристика,
		|	РаспределениеЗатрат.Партия,
		|	РаспределениеЗатрат.ЗаказПокупателя,
		|	РаспределениеЗатрат.СчетУчетаРегл,
		|	РаспределениеЗатрат.СчетУчетаЗатратРегл,
		|	РаспределениеЗатрат.Проект,
		|	РаспределениеЗатрат.ДокументПоступления,
		|	РаспределениеЗатрат.Спецификация,
		|	РаспределениеЗатрат.КоррСпецификация,
		|	РаспределениеЗатрат.ДокументПродажи,
		|	РаспределениеЗатрат.ЗаказПродажи,
		|	РаспределениеЗатрат.Подразделение,
		|	РаспределениеЗатрат.Ответственный,
		|	РаспределениеЗатрат.СтавкаНДС,
		|	РаспределениеЗатрат.ЗатратыНаВыпуск,
		|	РаспределениеЗатрат.ПеремещениеВРозницуСуммовойУчет,
		|	РаспределениеЗатрат.СчетУчетаТипСчета,
		|	РаспределениеЗатрат.СчетУчетаСписания,
		|	РаспределениеЗатрат.СчетУчетаСписанияРегл,
		|	РаспределениеЗатрат.СчетУчетаСписанияТипСчета,
		|	РаспределениеЗатрат.НаправлениеДеятельностиСписания,
		|	РаспределениеЗатрат.РозничнаяСтруктурнаяЕдиница,
		|	РаспределениеЗатрат.СтруктурнаяЕдиницаПолучатель,
		|	РаспределениеЗатрат.НоменклатураКатегорияНоменклатуры,
		|	РаспределениеЗатрат.НаправлениеДеятельностиПродажи,
		|	РаспределениеЗатрат.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
		|	РаспределениеЗатрат.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
		|	РаспределениеЗатрат.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ЗапасыОстаткиИОбороты.Организация КАК Организация,
		//|	ЗапасыОстаткиИОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		//|	ЗапасыОстаткиИОбороты.СчетУчета КАК СчетУчета,
		//|	ЗапасыОстаткиИОбороты.Номенклатура КАК Номенклатура,
		//|	ЗапасыОстаткиИОбороты.Характеристика КАК Характеристика,
		//|	ЗапасыОстаткиИОбороты.Партия КАК Партия,
		//|	ЗапасыОстаткиИОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
		//|	ЗапасыОстаткиИОбороты.СчетУчетаРегл КАК СчетУчетаРегл,
		//|	ЗапасыОстаткиИОбороты.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		//|	ЗапасыОстаткиИОбороты.Проект КАК Проект,
		//|	ЗапасыОстаткиИОбороты.ДокументПоступления КАК ДокументПоступления,
		//|	ЗапасыОстаткиИОбороты.СуммаНачальныйОстаток КАК Сумма
		//// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
		//|	,ЗапасыОстаткиИОбороты.КоличествоНачальныйОстаток КАК Количество
		//// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
		//|ПОМЕСТИТЬ БазаРаспределенияПодробно
		//|ИЗ
		//|	РегистрНакопления.Запасы.ОстаткиИОбороты(
		//|			&ДатаНач,
		//|			&ДатаКон,
		//|			,
		//|			,
		//|			(
		//|				Организация, 
		////|				СтруктурнаяЕдиница, 
		////|				СчетУчета, 
		//|				Номенклатура, 
		//|				Характеристика, 
		//|				Партия, 
		//|				ЗаказПокупателя, 
		////|				СчетУчетаРегл, 
		////|				СчетУчетаЗатратРегл, 
		//|				Проект, 
		//|				ДокументПоступления
		//|			) В
		//|					(ВЫБРАТЬ
		//|						Затраты.Организация,
		////|						Затраты.СтруктурнаяЕдиница,
		////|						Затраты.СчетУчета,
		//|						Затраты.Номенклатура,
		//|						Затраты.Характеристика,
		//|						Затраты.Партия,
		//|						Затраты.ЗаказПокупателя,
		////|						Затраты.СчетУчетаРегл,
		////|						Затраты.СчетУчетаЗатратРегл,
		//|						Затраты.Проект,
		//|						Затраты.ДокументПоступления
		//|					ИЗ
		//|						Затраты)
		//|				И ВЫБОР
		//|					КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
		//|						ТОГДА НЕ СчетУчетаРегл В
		//|									(ВЫБРАТЬ
		//|										Затраты.СчетУчетаРегл
		//|									ИЗ
		//|										Затраты)
		//|					ИНАЧЕ НЕ СчетУчета В
		//|								(ВЫБРАТЬ
		//|									Затраты.СчетУчета
		//|								ИЗ
		//|									Затраты)
		//|				КОНЕЦ) КАК ЗапасыОстаткиИОбороты
		//|ГДЕ
		////|	ЗапасыОстаткиИОбороты.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
		//|	НЕ ЗапасыОстаткиИОбороты.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение)
		//|	
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		|ВЫБРАТЬ
		|	Запасы.Организация КАК Организация,
		|	Запасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	Запасы.СчетУчета КАК СчетУчета,
		|	Запасы.Номенклатура КАК Номенклатура,
		|	Запасы.Характеристика КАК Характеристика,
		|	Запасы.Партия КАК Партия,
		|	Запасы.ЗаказПокупателя КАК ЗаказПокупателя,
		|	Запасы.СчетУчетаРегл КАК СчетУчетаРегл,
		|	Запасы.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	Запасы.Проект КАК Проект,
		|	Запасы.ДокументПоступления КАК ДокументПоступления,
		|	Запасы.Сумма КАК Сумма
		// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
		|	,Запасы.Количество КАК Количество
		|ПОМЕСТИТЬ БазаРаспределенияПодробно
		// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
		|ИЗ
		|	РегистрНакопления.Запасы КАК Запасы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Затраты КАК Затраты
		|			ПО Запасы.Организация = Затраты.Организация
		//|			И Запасы.СтруктурнаяЕдиница = Затраты.СтруктурнаяЕдиница
		//|			И Запасы.СчетУчета = Затраты.СчетУчета
		|			И Запасы.Номенклатура = Затраты.Номенклатура
		|			И Запасы.Характеристика = Затраты.Характеристика
		|			И Запасы.Партия = Затраты.Партия
		|			И Запасы.ЗаказПокупателя = Затраты.ЗаказПокупателя
		//|			И Запасы.СчетУчетаРегл = Затраты.СчетУчетаРегл
		//|			И Запасы.СчетУчетаЗатратРегл = Затраты.СчетУчетаЗатратРегл
		|			И Запасы.Проект = Затраты.Проект
		|			И Запасы.ДокументПоступления = Затраты.ДокументПоступления
		|			И НЕ (ВЫБОР
		|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
		|					ТОГДА Запасы.СчетУчетаРегл = Затраты.СчетУчетаРегл
		|				ИНАЧЕ Запасы.СчетУчета = Затраты.СчетУчета
		|			КОНЕЦ)
		|
		|ГДЕ
		|	Запасы.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И (
		|		(Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И НЕ Запасы.Возврат)
		|		ИЛИ 
		|		(Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И Запасы.Возврат)
		|		)
		|	И Запасы.Организация = &Организация
		|	И НЕ (Запасы.Регистратор = &Ссылка)
		|	И НЕ (Запасы.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БазаРаспределенияПодробно.Организация КАК Организация,
		|	БазаРаспределенияПодробно.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	БазаРаспределенияПодробно.СчетУчета КАК СчетУчета,
		|	БазаРаспределенияПодробно.Номенклатура КАК Номенклатура,
		|	БазаРаспределенияПодробно.Характеристика КАК Характеристика,
		|	БазаРаспределенияПодробно.Партия КАК Партия,
		|	БазаРаспределенияПодробно.ЗаказПокупателя КАК ЗаказПокупателя,
		|	БазаРаспределенияПодробно.СчетУчетаРегл КАК СчетУчетаРегл,
		|	БазаРаспределенияПодробно.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	БазаРаспределенияПодробно.Проект КАК Проект,
		|	БазаРаспределенияПодробно.ДокументПоступления КАК ДокументПоступления,
		// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
		|	СУММА(БазаРаспределенияПодробно.Количество) КАК Количество,
		// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
		|	СУММА(БазаРаспределенияПодробно.Сумма) КАК Сумма
		|ПОМЕСТИТЬ БазаРаспределения
		|ИЗ
		|	БазаРаспределенияПодробно КАК БазаРаспределенияПодробно
		|
		|СГРУППИРОВАТЬ ПО
		|	БазаРаспределенияПодробно.Организация,
		|	БазаРаспределенияПодробно.СтруктурнаяЕдиница,
		|	БазаРаспределенияПодробно.СчетУчета,
		|	БазаРаспределенияПодробно.Номенклатура,
		|	БазаРаспределенияПодробно.Характеристика,
		|	БазаРаспределенияПодробно.Партия,
		|	БазаРаспределенияПодробно.ЗаказПокупателя,
		|	БазаРаспределенияПодробно.СчетУчетаРегл,
		|	БазаРаспределенияПодробно.СчетУчетаЗатратРегл,
		|	БазаРаспределенияПодробно.Проект,
		|	БазаРаспределенияПодробно.ДокументПоступления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БазаРаспределения.Организация КАК Организация,
		|	БазаРаспределения.СчетУчета КАК СчетУчета,
		|	БазаРаспределения.Номенклатура КАК Номенклатура,
		|	БазаРаспределения.Характеристика КАК Характеристика,
		|	БазаРаспределения.Партия КАК Партия,
		|	БазаРаспределения.ЗаказПокупателя КАК ЗаказПокупателя,
		|	БазаРаспределения.СчетУчетаРегл КАК СчетУчетаРегл,
		|	БазаРаспределения.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	БазаРаспределения.Проект КАК Проект,
		|	БазаРаспределения.ДокументПоступления КАК ДокументПоступления,
		// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
		|	СУММА(БазаРаспределения.Количество) КАК ОбщееКоличество,
		// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
		|	СУММА(БазаРаспределения.Сумма) КАК ОбщаяСумма
		|ПОМЕСТИТЬ БазаРаспределенияБезСкладов
		|ИЗ
		|	БазаРаспределения КАК БазаРаспределения
		|
		|СГРУППИРОВАТЬ ПО
		|	БазаРаспределения.Организация,
		|	БазаРаспределения.СчетУчета,
		|	БазаРаспределения.Номенклатура,
		|	БазаРаспределения.Характеристика,
		|	БазаРаспределения.Партия,
		|	БазаРаспределения.ЗаказПокупателя,
		|	БазаРаспределения.СчетУчетаРегл,
		|	БазаРаспределения.СчетУчетаЗатратРегл,
		|	БазаРаспределения.Проект,
		|	БазаРаспределения.ДокументПоступления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&УчетСебестоимостиВРазрезеОрганизации КАК УчетСебестоимостиВРазрезеОрганизации,
		|	Затраты.Организация КАК Организация,
		|	Затраты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	Затраты.СчетУчета КАК СчетУчета,
		|	Затраты.Номенклатура КАК Номенклатура,
		|	Затраты.Характеристика КАК Характеристика,
		|	Затраты.Партия КАК Партия,
		|	Затраты.ЗаказПокупателя КАК ЗаказПокупателя,
		|	Затраты.СчетУчетаРегл КАК СчетУчетаРегл,
		|	Затраты.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	Затраты.Проект КАК Проект,
		|	Затраты.ДокументПоступления КАК ДокументПоступления,
		|	БазаРаспределения.СтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
		|	БазаРаспределения.СчетУчета КАК КоррСчетУчета,
		|	БазаРаспределения.Номенклатура КАК КоррНоменклатура,
		|	БазаРаспределения.Характеристика КАК КоррХарактеристика,
		|	БазаРаспределения.Партия КАК КоррПартия,
		|	БазаРаспределения.ЗаказПокупателя КАК КоррЗаказПокупателя,
		|	БазаРаспределения.СчетУчетаРегл КАК КоррСчетУчетаРегл,
		|	БазаРаспределения.Проект КАК КоррПроект,
		|	БазаРаспределения.ДокументПоступления КАК КоррДокументПоступления,
		//|	0 КАК Количество,
		//|	Затраты.Сумма * (БазаРаспределения.Сумма / БазаРаспределенияБезСкладов.ОбщаяСумма) КАК Сумма,
		// Kuzmich, 21.11.2025, (ONESOFT-4531) Закрытие месяца - ошибка в распределённых расходах
		|	СУММА(0) КАК Количество,
		|	СУММА(ВЫРАЗИТЬ(Затраты.Сумма * (БазаРаспределения.Сумма / БазаРаспределенияБезСкладов.ОбщаяСумма) КАК ЧИСЛО(38, 28))) КАК Сумма,
		// Kuzmich, 21.11.2025, (ONESOFT-4531) Закрытие месяца - ошибка в распределённых расходах
		|	ВЫБОР 
		|		КОГДА &ЗакрыватьПоРеглПлануСчетов
		|			ТОГДА БазаРаспределения.СчетУчетаРегл.ТипСчета
		|		ИНАЧЕ БазаРаспределения.СчетУчета.ТипСчета
		|	КОНЕЦ КАК КоррСчетУчетаТипСчета,
		|	Затраты.Спецификация КАК Спецификация,
		|	Затраты.КоррСпецификация КАК КоррСпецификация,
		|	Затраты.ДокументПродажи КАК ДокументПродажи,
		|	Затраты.ЗаказПродажи КАК ЗаказПродажи,
		|	Затраты.Подразделение КАК Подразделение,
		|	Затраты.Ответственный КАК Ответственный,
		|	Затраты.СтавкаНДС КАК СтавкаНДС,
		|	Затраты.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
		|	Затраты.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
		|	Затраты.СчетУчетаТипСчета КАК СчетУчетаТипСчета,
		|	Затраты.СчетУчетаСписания КАК СчетУчетаСписания,
		|	Затраты.СчетУчетаСписанияРегл КАК СчетУчетаСписанияРегл,
		|	Затраты.СчетУчетаСписанияТипСчета КАК СчетУчетаСписанияТипСчета,
		|	Затраты.НаправлениеДеятельностиСписания КАК НаправлениеДеятельностиСписания,
		|	Затраты.РозничнаяСтруктурнаяЕдиница КАК РозничнаяСтруктурнаяЕдиница,
		|	Затраты.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
		|	Затраты.НоменклатураКатегорияНоменклатуры КАК НоменклатураКатегорияНоменклатуры,
		|	Затраты.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельностиПродажи,
		|	Затраты.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
		|	Затраты.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
		|	Затраты.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета
		// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
		|ПОМЕСТИТЬ ТаблицаРаспределенияНачальнаяПРЕД
		// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
		|ИЗ
		|	БазаРаспределения КАК БазаРаспределения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Затраты КАК Затраты
		|		ПО БазаРаспределения.Организация = Затраты.Организация
		|			И БазаРаспределения.Номенклатура = Затраты.Номенклатура
		|			И БазаРаспределения.Характеристика = Затраты.Характеристика
		|			И БазаРаспределения.Партия = Затраты.Партия
		|			И БазаРаспределения.ЗаказПокупателя = Затраты.ЗаказПокупателя
		|			И БазаРаспределения.Проект = Затраты.Проект
		|			И БазаРаспределения.ДокументПоступления = Затраты.ДокументПоступления
		|		ЛЕВОЕ СОЕДИНЕНИЕ БазаРаспределенияБезСкладов КАК БазаРаспределенияБезСкладов
		|		ПО БазаРаспределения.Организация = БазаРаспределенияБезСкладов.Организация
		|			И (ВЫБОР
		|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
		|					ТОГДА БазаРаспределения.СчетУчетаРегл = БазаРаспределенияБезСкладов.СчетУчетаРегл
		|				ИНАЧЕ БазаРаспределения.СчетУчета = БазаРаспределенияБезСкладов.СчетУчета
		|			КОНЕЦ)
		|			И БазаРаспределения.Номенклатура = БазаРаспределенияБезСкладов.Номенклатура
		|			И БазаРаспределения.Характеристика = БазаРаспределенияБезСкладов.Характеристика
		|			И БазаРаспределения.Партия = БазаРаспределенияБезСкладов.Партия
		|			И БазаРаспределения.ЗаказПокупателя = БазаРаспределенияБезСкладов.ЗаказПокупателя
		|			И БазаРаспределения.Проект = БазаРаспределенияБезСкладов.Проект
		|			И БазаРаспределения.ДокументПоступления = БазаРаспределенияБезСкладов.ДокументПоступления
		// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
		// Kuzmich, 21.11.2025, (ONESOFT-4531) Закрытие месяца - ошибка в распределённых расходах
		|
		|СГРУППИРОВАТЬ ПО
		|	Затраты.Организация,
		|	Затраты.СтруктурнаяЕдиница,
		|	Затраты.СчетУчета,
		|	Затраты.Номенклатура,
		|	Затраты.Характеристика,
		|	Затраты.Партия,
		|	Затраты.ЗаказПокупателя,
		|	Затраты.СчетУчетаРегл,
		|	Затраты.СчетУчетаЗатратРегл,
		|	Затраты.Проект,
		|	Затраты.ДокументПоступления,
		|	БазаРаспределения.СтруктурнаяЕдиница,
		|	БазаРаспределения.СчетУчета,
		|	БазаРаспределения.Номенклатура,
		|	БазаРаспределения.Характеристика,
		|	БазаРаспределения.Партия,
		|	БазаРаспределения.ЗаказПокупателя,
		|	БазаРаспределения.СчетУчетаРегл,
		|	БазаРаспределения.Проект,
		|	БазаРаспределения.ДокументПоступления,
		|	Затраты.Спецификация,
		|	Затраты.КоррСпецификация,
		|	Затраты.ДокументПродажи,
		|	Затраты.ЗаказПродажи,
		|	Затраты.Подразделение,
		|	Затраты.Ответственный,
		|	Затраты.СтавкаНДС,
		|	Затраты.ЗатратыНаВыпуск,
		|	Затраты.ПеремещениеВРозницуСуммовойУчет,
		|	Затраты.СчетУчетаТипСчета,
		|	Затраты.СчетУчетаСписания,
		|	Затраты.СчетУчетаСписанияРегл,
		|	Затраты.СчетУчетаСписанияТипСчета,
		|	Затраты.НаправлениеДеятельностиСписания,
		|	Затраты.РозничнаяСтруктурнаяЕдиница,
		|	Затраты.СтруктурнаяЕдиницаПолучатель,
		|	Затраты.НоменклатураКатегорияНоменклатуры,
		|	Затраты.НаправлениеДеятельностиПродажи,
		|	Затраты.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
		|	Затраты.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
		|	Затраты.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета,
		|	ВЫБОР
		|		КОГДА &ЗакрыватьПоРеглПлануСчетов
		|			ТОГДА БазаРаспределения.СчетУчетаРегл.ТипСчета
		|		ИНАЧЕ БазаРаспределения.СчетУчета.ТипСчета
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления,
		|	КоррСтруктурнаяЕдиница,
		|	КоррСчетУчета,
		|	КоррНоменклатура,
		|	КоррХарактеристика,
		|	КоррПартия,
		|	КоррЗаказПокупателя,
		|	КоррСчетУчетаРегл,
		|	КоррПроект,
		|	КоррДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаРаспределенияНачальнаяПРЕД.Организация КАК Организация,
		//|	ТаблицаРаспределенияНачальнаяПРЕД.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррСчетУчета КАК КоррСчетУчета,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррНоменклатура КАК КоррНоменклатура,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррХарактеристика КАК КоррХарактеристика,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррПартия КАК КоррПартия,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррПроект КАК КоррПроект,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррДокументПоступления КАК КоррДокументПоступления,
		|	СУММА(ТаблицаРаспределенияНачальнаяПРЕД.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ТаблицаРаспределенияНачальнаяСвернутаяКорр
		|ИЗ ТаблицаРаспределенияНачальнаяПРЕД КАК ТаблицаРаспределенияНачальнаяПРЕД
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаРаспределенияНачальнаяПРЕД.Организация,
		//|	ТаблицаРаспределенияНачальнаяПРЕД.СчетУчетаЗатратРегл,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррСтруктурнаяЕдиница,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррСчетУчета,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррНоменклатура,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррХарактеристика,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррПартия,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррЗаказПокупателя,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррСчетУчетаРегл,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррПроект,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррДокументПоступления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	КоррСтруктурнаяЕдиница,
		|	КоррСчетУчета,
		|	КоррНоменклатура,
		|	КоррХарактеристика,
		|	КоррПартия,
		|	КоррЗаказПокупателя,
		|	КоррСчетУчетаРегл,
		|	КоррПроект,
		|	КоррДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаРаспределенияНачальнаяПРЕД.УчетСебестоимостиВРазрезеОрганизации КАК УчетСебестоимостиВРазрезеОрганизации,
		|	ТаблицаРаспределенияНачальнаяПРЕД.Организация КАК Организация,
		|	ТаблицаРаспределенияНачальнаяПРЕД.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаРаспределенияНачальнаяПРЕД.СчетУчета КАК СчетУчета,
		|	ТаблицаРаспределенияНачальнаяПРЕД.Номенклатура КАК Номенклатура,
		|	ТаблицаРаспределенияНачальнаяПРЕД.Характеристика КАК Характеристика,
		|	ТаблицаРаспределенияНачальнаяПРЕД.Партия КАК Партия,
		|	ТаблицаРаспределенияНачальнаяПРЕД.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ТаблицаРаспределенияНачальнаяПРЕД.СчетУчетаРегл КАК СчетУчетаРегл,
		|	ТаблицаРаспределенияНачальнаяПРЕД.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	ТаблицаРаспределенияНачальнаяПРЕД.Проект КАК Проект,
		|	ТаблицаРаспределенияНачальнаяПРЕД.ДокументПоступления КАК ДокументПоступления,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррСчетУчета КАК КоррСчетУчета,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррНоменклатура КАК КоррНоменклатура,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррХарактеристика КАК КоррХарактеристика,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррПартия КАК КоррПартия,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррПроект КАК КоррПроект,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррДокументПоступления КАК КоррДокументПоступления,
		|	ТаблицаРаспределенияНачальнаяПРЕД.Количество КАК Количество,
		|	ТаблицаРаспределенияНачальнаяПРЕД.Сумма КАК Сумма,
		|	ВЫРАЗИТЬ(ВЫБОР 
		|		КОГДА ЕСТЬNULL(ТаблицаРаспределенияНачальнаяСвернутаяКорр.Сумма,0)=0
		|			ТОГДА 0
		|		ИНАЧЕ ТаблицаРаспределенияНачальнаяПРЕД.Сумма / ТаблицаРаспределенияНачальнаяСвернутаяКорр.Сумма
		|	КОНЕЦ КАК ЧИСЛО(38, 28)) КАК КоэффициентКорр,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррСчетУчетаТипСчета КАК КоррСчетУчетаТипСчета,
		|	ТаблицаРаспределенияНачальнаяПРЕД.Спецификация КАК Спецификация,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррСпецификация КАК КоррСпецификация,
		|	ТаблицаРаспределенияНачальнаяПРЕД.ДокументПродажи КАК ДокументПродажи,
		|	ТаблицаРаспределенияНачальнаяПРЕД.ЗаказПродажи КАК ЗаказПродажи,
		|	ТаблицаРаспределенияНачальнаяПРЕД.Подразделение КАК Подразделение,
		|	ТаблицаРаспределенияНачальнаяПРЕД.Ответственный КАК Ответственный,
		|	ТаблицаРаспределенияНачальнаяПРЕД.СтавкаНДС КАК СтавкаНДС,
		|	ТаблицаРаспределенияНачальнаяПРЕД.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
		|	ТаблицаРаспределенияНачальнаяПРЕД.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
		|	ТаблицаРаспределенияНачальнаяПРЕД.СчетУчетаТипСчета КАК СчетУчетаТипСчета,
		|	ТаблицаРаспределенияНачальнаяПРЕД.СчетУчетаСписания КАК СчетУчетаСписания,
		|	ТаблицаРаспределенияНачальнаяПРЕД.СчетУчетаСписанияРегл КАК СчетУчетаСписанияРегл,
		|	ТаблицаРаспределенияНачальнаяПРЕД.СчетУчетаСписанияТипСчета КАК СчетУчетаСписанияТипСчета,
		|	ТаблицаРаспределенияНачальнаяПРЕД.НаправлениеДеятельностиСписания КАК НаправлениеДеятельностиСписания,
		|	ТаблицаРаспределенияНачальнаяПРЕД.РозничнаяСтруктурнаяЕдиница КАК РозничнаяСтруктурнаяЕдиница,
		|	ТаблицаРаспределенияНачальнаяПРЕД.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
		|	ТаблицаРаспределенияНачальнаяПРЕД.НоменклатураКатегорияНоменклатуры КАК НоменклатураКатегорияНоменклатуры,
		|	ТаблицаРаспределенияНачальнаяПРЕД.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельностиПродажи,
		|	ТаблицаРаспределенияНачальнаяПРЕД.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
		|	ТаблицаРаспределенияНачальнаяПРЕД.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
		|	ТаблицаРаспределенияНачальнаяПРЕД.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета
		|ПОМЕСТИТЬ ТаблицаРаспределенияНачальная
		|ИЗ ТаблицаРаспределенияНачальнаяПРЕД КАК ТаблицаРаспределенияНачальнаяПРЕД
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРаспределенияНачальнаяСвернутаяКорр КАК ТаблицаРаспределенияНачальнаяСвернутаяКорр
		|			ПО ТаблицаРаспределенияНачальнаяПРЕД.Организация = ТаблицаРаспределенияНачальнаяСвернутаяКорр.Организация
		|			И ТаблицаРаспределенияНачальнаяПРЕД.КоррСтруктурнаяЕдиница = ТаблицаРаспределенияНачальнаяСвернутаяКорр.КоррСтруктурнаяЕдиница
		|			И ТаблицаРаспределенияНачальнаяПРЕД.КоррСчетУчета = ТаблицаРаспределенияНачальнаяСвернутаяКорр.КоррСчетУчета
		|			И ТаблицаРаспределенияНачальнаяПРЕД.КоррНоменклатура = ТаблицаРаспределенияНачальнаяСвернутаяКорр.КоррНоменклатура
		|			И ТаблицаРаспределенияНачальнаяПРЕД.КоррХарактеристика = ТаблицаРаспределенияНачальнаяСвернутаяКорр.КоррХарактеристика
		|			И ТаблицаРаспределенияНачальнаяПРЕД.КоррПартия = ТаблицаРаспределенияНачальнаяСвернутаяКорр.КоррПартия
		|			И ТаблицаРаспределенияНачальнаяПРЕД.КоррЗаказПокупателя = ТаблицаРаспределенияНачальнаяСвернутаяКорр.КоррЗаказПокупателя
		|			И ТаблицаРаспределенияНачальнаяПРЕД.КоррСчетУчетаРегл = ТаблицаРаспределенияНачальнаяСвернутаяКорр.КоррСчетУчетаРегл
		//|			И ТаблицаРаспределенияНачальнаяПРЕД.КоррСчетУчетаЗатратРегл = ТаблицаРаспределенияНачальнаяСвернутаяКорр.СчетУчетаЗатратРегл
		|			И ТаблицаРаспределенияНачальнаяПРЕД.КоррПроект = ТаблицаРаспределенияНачальнаяСвернутаяКорр.КоррПроект
		|			И ТаблицаРаспределенияНачальнаяПРЕД.КоррДокументПоступления = ТаблицаРаспределенияНачальнаяСвернутаяКорр.КоррДокументПоступления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления,
		|	КоррСтруктурнаяЕдиница,
		|	КоррСчетУчета,
		|	КоррНоменклатура,
		|	КоррХарактеристика,
		|	КоррПартия,
		|	КоррЗаказПокупателя,
		|	КоррСчетУчетаРегл,
		|	КоррПроект,
		|	КоррДокументПоступления
		|;
		|
		// Kuzmich, 21.11.2025, (ONESOFT-4531) Закрытие месяца - ошибка в распределённых расходах
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Запасы.Организация КАК Организация,
		|	Запасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	Запасы.СчетУчета КАК СчетУчета,
		|	Запасы.Номенклатура КАК Номенклатура,
		|	Запасы.Характеристика КАК Характеристика,
		|	Запасы.Партия КАК Партия,
		|	Запасы.ЗаказПокупателя КАК ЗаказПокупателя,
		|	Запасы.СчетУчетаРегл КАК СчетУчетаРегл,
		|	Запасы.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	Запасы.Проект КАК Проект,
		|	Запасы.ДокументПоступления КАК ДокументПоступления,
		|	Запасы.Количество КАК Количество,
		|	Запасы.Сумма КАК Сумма
		|ПОМЕСТИТЬ Расходы 
		|ИЗ
		|	РегистрНакопления.Запасы КАК Запасы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Затраты КАК Затраты
		|			ПО Запасы.Организация = Затраты.Организация
		//|			И Запасы.СтруктурнаяЕдиница = Затраты.СтруктурнаяЕдиница
		//|			И Запасы.СчетУчета = Затраты.СчетУчета
		|			И Запасы.Номенклатура = Затраты.Номенклатура
		|			И Запасы.Характеристика = Затраты.Характеристика
		|			И Запасы.Партия = Затраты.Партия
		|			И Запасы.ЗаказПокупателя = Затраты.ЗаказПокупателя
		//|			И Запасы.СчетУчетаРегл = Затраты.СчетУчетаРегл
		//|			И Запасы.СчетУчетаЗатратРегл = Затраты.СчетУчетаЗатратРегл
		|			И Запасы.Проект = Затраты.Проект
		|			И Запасы.ДокументПоступления = Затраты.ДокументПоступления
		|			И НЕ (ВЫБОР
		|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
		|					ТОГДА Запасы.СчетУчетаРегл = Затраты.СчетУчетаРегл
		|				ИНАЧЕ Запасы.СчетУчета = Затраты.СчетУчета
		|			КОНЕЦ)
		|
		|ГДЕ
		|	Запасы.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И (
		|		(Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И НЕ Запасы.Возврат)
		|		ИЛИ 
		|		(Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И Запасы.Возврат)
		|		)
		|	И Запасы.Организация = &Организация
		|	И НЕ (Запасы.Регистратор = &Ссылка)
		|	И НЕ (Запасы.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Расходы.Организация КАК Организация,
		|	Расходы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	Расходы.СчетУчета КАК СчетУчета,
		|	Расходы.Номенклатура КАК Номенклатура,
		|	Расходы.Характеристика КАК Характеристика,
		|	Расходы.Партия КАК Партия,
		|	Расходы.ЗаказПокупателя КАК ЗаказПокупателя,
		|	Расходы.СчетУчетаРегл КАК СчетУчетаРегл,
		//|	Расходы.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл, // в нашем алгоритме не используется, что с этим делать непонятно
		|	Расходы.Проект КАК Проект,
		|	Расходы.ДокументПоступления КАК ДокументПоступления,
		|	СУММА(Расходы.Количество) КАК Количество,
		|	СУММА(Расходы.Сумма) КАК Сумма
		|ПОМЕСТИТЬ РасходыБезСчетУчетаЗатратРегл
		|ИЗ Расходы КАК Расходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Расходы.Организация,
		|	Расходы.СтруктурнаяЕдиница,
		|	Расходы.СчетУчета,
		|	Расходы.Номенклатура,
		|	Расходы.Характеристика,
		|	Расходы.Партия,
		|	Расходы.ЗаказПокупателя,
		|	Расходы.СчетУчетаРегл,
		//|	Расходы.СчетУчетаЗатратРегл,
		|	Расходы.Проект,
		|	Расходы.ДокументПоступления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БазаРаспределения.Организация КАК Организация,
		|	БазаРаспределения.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	БазаРаспределения.СчетУчета КАК СчетУчета,
		|	БазаРаспределения.Номенклатура КАК Номенклатура,
		|	БазаРаспределения.Характеристика КАК Характеристика,
		|	БазаРаспределения.Партия КАК Партия,
		|	БазаРаспределения.ЗаказПокупателя КАК ЗаказПокупателя,
		|	БазаРаспределения.СчетУчетаРегл КАК СчетУчетаРегл,
		//|	БазаРаспределения.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл, // в нашем алгоритме не используется, что с этим делать непонятно
		|	БазаРаспределения.Проект КАК Проект,
		|	БазаРаспределения.ДокументПоступления КАК ДокументПоступления,
		|	СУММА(БазаРаспределения.Количество) КАК Количество,
		|	СУММА(БазаРаспределения.Сумма) КАК Сумма
		|ПОМЕСТИТЬ БазаРаспределенияБезСчетУчетаЗатратРегл
		|ИЗ БазаРаспределения КАК БазаРаспределения
		|
		|СГРУППИРОВАТЬ ПО
		|	БазаРаспределения.Организация,
		|	БазаРаспределения.СтруктурнаяЕдиница,
		|	БазаРаспределения.СчетУчета,
		|	БазаРаспределения.Номенклатура,
		|	БазаРаспределения.Характеристика,
		|	БазаРаспределения.Партия,
		|	БазаРаспределения.ЗаказПокупателя,
		|	БазаРаспределения.СчетУчетаРегл,
		//|	БазаРаспределения.СчетУчетаЗатратРегл,
		|	БазаРаспределения.Проект,
		|	БазаРаспределения.ДокументПоступления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасходыБезСчетУчетаЗатратРегл.Организация КАК Организация,
		|	РасходыБезСчетУчетаЗатратРегл.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	РасходыБезСчетУчетаЗатратРегл.СчетУчета КАК СчетУчета,
		|	РасходыБезСчетУчетаЗатратРегл.Номенклатура КАК Номенклатура,
		|	РасходыБезСчетУчетаЗатратРегл.Характеристика КАК Характеристика,
		|	РасходыБезСчетУчетаЗатратРегл.Партия КАК Партия,
		|	РасходыБезСчетУчетаЗатратРегл.ЗаказПокупателя КАК ЗаказПокупателя,
		|	РасходыБезСчетУчетаЗатратРегл.СчетУчетаРегл КАК СчетУчетаРегл,
		//|	РасходыБезСчетУчетаЗатратРегл.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл, // в нашем алгоритме не используется, что с этим делать непонятно
		|	РасходыБезСчетУчетаЗатратРегл.Проект КАК Проект,
		|	РасходыБезСчетУчетаЗатратРегл.ДокументПоступления КАК ДокументПоступления,
		//|	ТаблицаРаспределенияНачальная.Сумма * РасходыБезСчетУчетаЗатратРегл.Количество / БазаРаспределенияБезСчетУчетаЗатратРегл.Количество КАК Сумма
		// Kuzmich, 21.11.2025, (ONESOFT-4531) Закрытие месяца - ошибка в распределённых расходах
		|	СУММА(ВЫРАЗИТЬ(ВЫБОР 
		|		КОГДА ЕСТЬNULL(БазаРаспределенияБезСчетУчетаЗатратРегл.Количество,0)=0
		|			ТОГДА 0
		|		ИНАЧЕ ТаблицаРаспределенияНачальная.Сумма * РасходыБезСчетУчетаЗатратРегл.Количество / БазаРаспределенияБезСчетУчетаЗатратРегл.Количество
		|	КОНЕЦ КАК ЧИСЛО(38, 28))) КАК Сумма
		// Kuzmich, 21.11.2025, (ONESOFT-4531) Закрытие месяца - ошибка в распределённых расходах
		|ПОМЕСТИТЬ ЗатратыНаРасходы
		|ИЗ РасходыБезСчетУчетаЗатратРегл КАК РасходыБезСчетУчетаЗатратРегл
		|		ЛЕВОЕ СОЕДИНЕНИЕ БазаРаспределенияБезСчетУчетаЗатратРегл КАК БазаРаспределенияБезСчетУчетаЗатратРегл
		|			ПО РасходыБезСчетУчетаЗатратРегл.Организация = БазаРаспределенияБезСчетУчетаЗатратРегл.Организация 
		|			И РасходыБезСчетУчетаЗатратРегл.СтруктурнаяЕдиница = БазаРаспределенияБезСчетУчетаЗатратРегл.СтруктурнаяЕдиница
		|			И РасходыБезСчетУчетаЗатратРегл.СчетУчета = БазаРаспределенияБезСчетУчетаЗатратРегл.СчетУчета
		|			И РасходыБезСчетУчетаЗатратРегл.Номенклатура = БазаРаспределенияБезСчетУчетаЗатратРегл.Номенклатура
		|			И РасходыБезСчетУчетаЗатратРегл.Характеристика = БазаРаспределенияБезСчетУчетаЗатратРегл.Характеристика
		|			И РасходыБезСчетУчетаЗатратРегл.Партия = БазаРаспределенияБезСчетУчетаЗатратРегл.Партия
		|			И РасходыБезСчетУчетаЗатратРегл.ЗаказПокупателя = БазаРаспределенияБезСчетУчетаЗатратРегл.ЗаказПокупателя
		|			И РасходыБезСчетУчетаЗатратРегл.СчетУчетаРегл = БазаРаспределенияБезСчетУчетаЗатратРегл.СчетУчетаРегл
		//|			И РасходыБезСчетУчетаЗатратРегл.СчетУчетаЗатратРегл = БазаРаспределенияБезСчетУчетаЗатратРегл.СчетУчетаЗатратРегл
		|			И РасходыБезСчетУчетаЗатратРегл.Проект = БазаРаспределенияБезСчетУчетаЗатратРегл.Проект
		|			И РасходыБезСчетУчетаЗатратРегл.ДокументПоступления = БазаРаспределенияБезСчетУчетаЗатратРегл.ДокументПоступления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРаспределенияНачальная КАК ТаблицаРаспределенияНачальная
		|			ПО РасходыБезСчетУчетаЗатратРегл.Организация = ТаблицаРаспределенияНачальная.Организация
		|			И РасходыБезСчетУчетаЗатратРегл.СтруктурнаяЕдиница = ТаблицаРаспределенияНачальная.КоррСтруктурнаяЕдиница
		|			И РасходыБезСчетУчетаЗатратРегл.СчетУчета = ТаблицаРаспределенияНачальная.КоррСчетУчета
		|			И РасходыБезСчетУчетаЗатратРегл.Номенклатура = ТаблицаРаспределенияНачальная.КоррНоменклатура
		|			И РасходыБезСчетУчетаЗатратРегл.Характеристика = ТаблицаРаспределенияНачальная.КоррХарактеристика
		|			И РасходыБезСчетУчетаЗатратРегл.Партия = ТаблицаРаспределенияНачальная.КоррПартия
		|			И РасходыБезСчетУчетаЗатратРегл.ЗаказПокупателя = ТаблицаРаспределенияНачальная.КоррЗаказПокупателя
		|			И РасходыБезСчетУчетаЗатратРегл.СчетУчетаРегл = ТаблицаРаспределенияНачальная.КоррСчетУчетаРегл
		//|			И РасходыБезСчетУчетаЗатратРегл.СчетУчетаЗатратРегл = ТаблицаРаспределенияНачальная.СчетУчетаЗатратРегл
		|			И РасходыБезСчетУчетаЗатратРегл.Проект = ТаблицаРаспределенияНачальная.КоррПроект
		|			И РасходыБезСчетУчетаЗатратРегл.ДокументПоступления = ТаблицаРаспределенияНачальная.КоррДокументПоступления
		// Kuzmich, 21.11.2025, (ONESOFT-4531) Закрытие месяца - ошибка в распределённых расходах
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходыБезСчетУчетаЗатратРегл.Организация,
		|	РасходыБезСчетУчетаЗатратРегл.СтруктурнаяЕдиница,
		|	РасходыБезСчетУчетаЗатратРегл.СчетУчета,
		|	РасходыБезСчетУчетаЗатратРегл.Номенклатура,
		|	РасходыБезСчетУчетаЗатратРегл.Характеристика,
		|	РасходыБезСчетУчетаЗатратРегл.Партия,
		|	РасходыБезСчетУчетаЗатратРегл.ЗаказПокупателя,
		|	РасходыБезСчетУчетаЗатратРегл.СчетУчетаРегл,
		|	РасходыБезСчетУчетаЗатратРегл.Проект,
		|	РасходыБезСчетУчетаЗатратРегл.ДокументПоступления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления
		// Kuzmich, 21.11.2025, (ONESOFT-4531) Закрытие месяца - ошибка в распределённых расходах
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаРаспределенияНачальная.УчетСебестоимостиВРазрезеОрганизации КАК УчетСебестоимостиВРазрезеОрганизации,
		|	ТаблицаРаспределенияНачальная.Организация КАК Организация,
		|	ТаблицаРаспределенияНачальная.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаРаспределенияНачальная.СчетУчета КАК СчетУчета,
		|	ТаблицаРаспределенияНачальная.Номенклатура КАК Номенклатура,
		|	ТаблицаРаспределенияНачальная.Характеристика КАК Характеристика,
		|	ТаблицаРаспределенияНачальная.Партия КАК Партия,
		|	ТаблицаРаспределенияНачальная.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ТаблицаРаспределенияНачальная.СчетУчетаРегл КАК СчетУчетаРегл,
		|	ТаблицаРаспределенияНачальная.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	ТаблицаРаспределенияНачальная.Проект КАК Проект,
		|	ТаблицаРаспределенияНачальная.ДокументПоступления КАК ДокументПоступления,
		|	ТаблицаРаспределенияНачальная.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
		|	ТаблицаРаспределенияНачальная.КоррСчетУчета КАК КоррСчетУчета,
		|	ТаблицаРаспределенияНачальная.КоррНоменклатура КАК КоррНоменклатура,
		|	ТаблицаРаспределенияНачальная.КоррХарактеристика КАК КоррХарактеристика,
		|	ТаблицаРаспределенияНачальная.КоррПартия КАК КоррПартия,
		|	ТаблицаРаспределенияНачальная.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
		|	ТаблицаРаспределенияНачальная.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл,
		|	ТаблицаРаспределенияНачальная.КоррПроект КАК КоррПроект,
		|	ТаблицаРаспределенияНачальная.КоррДокументПоступления КАК КоррДокументПоступления,
		|	0 КАК Количество,
		|	ТаблицаРаспределенияНачальная.Сумма КАК Сумма,
		//|	ЕСТЬNULL(ЗатратыНаРасходы.Сумма, 0) * ТаблицаРаспределенияНачальная.КоэффициентКорр КАК СуммаРасход,
		// Kuzmich, 23.12.2025, (ONESOFT-4595) «Закрытие месяца — пропорциональное распределение расходов»
		|	ВЫРАЗИТЬ(ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗатратыНаРасходы.Сумма, 0) * ТаблицаРаспределенияНачальная.КоэффициентКорр > ТаблицаРаспределенияНачальная.Сумма * ТаблицаРаспределенияНачальная.КоэффициентКорр
		|			И ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) > 0
		|			ТОГДА ТаблицаРаспределенияНачальная.Сумма * ТаблицаРаспределенияНачальная.КоэффициентКорр
		|		ИНАЧЕ ЕСТЬNULL(ЗатратыНаРасходы.Сумма, 0) * ТаблицаРаспределенияНачальная.КоэффициентКорр
		|	КОНЕЦ КАК ЧИСЛО(38, 28)) КАК СуммаРасход,
		// Kuzmich, 23.12.2025, (ONESOFT-4595) «Закрытие месяца — пропорциональное распределение расходов»
		|	ТаблицаРаспределенияНачальная.КоррСчетУчетаТипСчета КАК КоррСчетУчетаТипСчета,
		|	ТаблицаРаспределенияНачальная.Спецификация КАК Спецификация,
		|	ТаблицаРаспределенияНачальная.КоррСпецификация КАК КоррСпецификация,
		|	ТаблицаРаспределенияНачальная.ДокументПродажи КАК ДокументПродажи,
		|	ТаблицаРаспределенияНачальная.ЗаказПродажи КАК ЗаказПродажи,
		|	ТаблицаРаспределенияНачальная.Подразделение КАК Подразделение,
		|	ТаблицаРаспределенияНачальная.Ответственный КАК Ответственный,
		|	ТаблицаРаспределенияНачальная.СтавкаНДС КАК СтавкаНДС,
		|	ТаблицаРаспределенияНачальная.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
		|	ТаблицаРаспределенияНачальная.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
		|	ТаблицаРаспределенияНачальная.СчетУчетаТипСчета КАК СчетУчетаТипСчета,
		|	ТаблицаРаспределенияНачальная.СчетУчетаСписания КАК СчетУчетаСписания,
		|	ТаблицаРаспределенияНачальная.СчетУчетаСписанияРегл КАК СчетУчетаСписанияРегл,
		|	ТаблицаРаспределенияНачальная.СчетУчетаСписанияТипСчета КАК СчетУчетаСписанияТипСчета,
		|	ТаблицаРаспределенияНачальная.НаправлениеДеятельностиСписания КАК НаправлениеДеятельностиСписания,
		|	ТаблицаРаспределенияНачальная.РозничнаяСтруктурнаяЕдиница КАК РозничнаяСтруктурнаяЕдиница,
		|	ТаблицаРаспределенияНачальная.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
		|	ТаблицаРаспределенияНачальная.НоменклатураКатегорияНоменклатуры КАК НоменклатураКатегорияНоменклатуры,
		|	ТаблицаРаспределенияНачальная.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельностиПродажи,
		|	ТаблицаРаспределенияНачальная.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
		|	ТаблицаРаспределенияНачальная.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
		|	ТаблицаРаспределенияНачальная.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета
		|ИЗ ТаблицаРаспределенияНачальная КАК ТаблицаРаспределенияНачальная
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗатратыНаРасходы КАК ЗатратыНаРасходы
		|			ПО ТаблицаРаспределенияНачальная.Организация = ЗатратыНаРасходы.Организация
		|			И ТаблицаРаспределенияНачальная.КоррСтруктурнаяЕдиница = ЗатратыНаРасходы.СтруктурнаяЕдиница
		|			И ТаблицаРаспределенияНачальная.КоррСчетУчета = ЗатратыНаРасходы.СчетУчета
		|			И ТаблицаРаспределенияНачальная.КоррНоменклатура = ЗатратыНаРасходы.Номенклатура
		|			И ТаблицаРаспределенияНачальная.КоррХарактеристика = ЗатратыНаРасходы.Характеристика
		|			И ТаблицаРаспределенияНачальная.КоррПартия = ЗатратыНаРасходы.Партия
		|			И ТаблицаРаспределенияНачальная.КоррЗаказПокупателя = ЗатратыНаРасходы.ЗаказПокупателя
		|			И ТаблицаРаспределенияНачальная.КоррСчетУчетаРегл = ЗатратыНаРасходы.СчетУчетаРегл
		//|			И ТаблицаРаспределенияНачальная.КоррСчетУчетаЗатратРегл = ЗатратыНаРасходы.СчетУчетаЗатратРегл
		|			И ТаблицаРаспределенияНачальная.КоррПроект = ЗатратыНаРасходы.Проект
		|			И ТаблицаРаспределенияНачальная.КоррДокументПоступления = ЗатратыНаРасходы.ДокументПоступления
		// Kuzmich, 23.12.2025, (ONESOFT-4595) «Закрытие месяца — пропорциональное распределение расходов»
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(&ДатаКонМоментВремени,) КАК ЗапасыОстатки
		|			ПО ТаблицаРаспределенияНачальная.Организация = ЗапасыОстатки.Организация
		|			И ТаблицаРаспределенияНачальная.КоррСтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
		|			И ТаблицаРаспределенияНачальная.КоррСчетУчета = ЗапасыОстатки.СчетУчета
		|			И ТаблицаРаспределенияНачальная.КоррНоменклатура = ЗапасыОстатки.Номенклатура
		|			И ТаблицаРаспределенияНачальная.КоррХарактеристика = ЗапасыОстатки.Характеристика
		|			И ТаблицаРаспределенияНачальная.КоррПартия = ЗапасыОстатки.Партия
		|			И ТаблицаРаспределенияНачальная.КоррЗаказПокупателя = ЗапасыОстатки.ЗаказПокупателя
		|			И ТаблицаРаспределенияНачальная.КоррСчетУчетаРегл = ЗапасыОстатки.СчетУчетаРегл
		//|			И ТаблицаРаспределенияНачальная.КоррСчетУчетаЗатратРегл = ЗапасыОстатки.СчетУчетаЗатратРегл
		|			И ТаблицаРаспределенияНачальная.КоррПроект = ЗапасыОстатки.Проект
		|			И ТаблицаРаспределенияНачальная.КоррДокументПоступления = ЗапасыОстатки.ДокументПоступления
		// Kuzmich, 23.12.2025, (ONESOFT-4595) «Закрытие месяца — пропорциональное распределение расходов»
		|";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаРаспределения = РезультатЗапроса.Выгрузить();
	
	ОбработкаОшибокОкругленияТаблицаРаспределения_ОтключениеУсреднения(ТаблицаРаспределения);
	
	СформироватьКорректирующиеДвиженияПоРегиструУчетаЗатрат_ОтключениеУсреднения(ТаблицаРаспределения);
	
	// 2.Запоминаем текущую базу распределения как новые затраты в регистре УзлыКорректировкиСтоимостиСписания
	// И запускаем рекурсивный цикл распределения затрат по расходам.
	НоваяТаблицаРаспределения = ТаблицаРаспределения.Скопировать();
	//НоваяТаблицаРаспределения.Свернуть("Организация,КоррСтруктурнаяЕдиница,КоррСчетУчета,КоррНоменклатура,КоррХарактеристика,КоррПартия,КоррЗаказПокупателя,КоррСчетУчетаРегл,КоррПроект,КоррДокументПоступления","Сумма");
	// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
	НоваяТаблицаРаспределения.Свернуть("Организация,КоррСтруктурнаяЕдиница,КоррСчетУчета,КоррНоменклатура,КоррХарактеристика,КоррПартия,КоррЗаказПокупателя,КоррСчетУчетаРегл,КоррПроект,КоррДокументПоступления,СчетУчетаЗатратРегл","СуммаРасход");
	// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
	
	НоваяТаблицаРаспределения.Колонки.КоррСтруктурнаяЕдиница.Имя = "СтруктурнаяЕдиница";
	НоваяТаблицаРаспределения.Колонки.КоррСчетУчета.Имя = "СчетУчета";
	НоваяТаблицаРаспределения.Колонки.КоррНоменклатура.Имя = "Номенклатура";
	НоваяТаблицаРаспределения.Колонки.КоррХарактеристика.Имя = "Характеристика";
	НоваяТаблицаРаспределения.Колонки.КоррПартия.Имя = "Партия";
	НоваяТаблицаРаспределения.Колонки.КоррЗаказПокупателя.Имя = "ЗаказПокупателя";
	НоваяТаблицаРаспределения.Колонки.КоррСчетУчетаРегл.Имя = "СчетУчетаРегл";
	НоваяТаблицаРаспределения.Колонки.КоррПроект.Имя = "Проект";
	НоваяТаблицаРаспределения.Колонки.КоррДокументПоступления.Имя = "ДокументПоступления";
	// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
	НоваяТаблицаРаспределения.Колонки.СуммаРасход.Имя = "Сумма";
	// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
		
	Если НоваяТаблицаРаспределения.Количество()>0 Тогда
		
		НомерУзла = 0;
		
		НаборЗаписей = РегистрыСведений.УзлыКорректировкиСтоимостиСписания.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписей.Записать(Истина);
		Для Каждого СтрокаНоваяТаблицаРаспределения ИЗ НоваяТаблицаРаспределения Цикл
			НомерУзла = НомерУзла + 1;
			НовыйУзел = НаборЗаписей.Добавить();
			НовыйУзел.НомерУзла = НомерУзла;
			НовыйУзел.Регистратор = Ссылка;
			НовыйУзел.Период = Дата;
			ЗаполнитьЗначенияСвойств(НовыйУзел, СтрокаНоваяТаблицаРаспределения);
		КонецЦикла;
		НаборЗаписей.Записать(Ложь);
		
		РаспределитьЗатратыНаФактическуюСебестоимостьВыпускаПоРсходам_ОтключениеУсреднения(Отказ, НоваяТаблицаРаспределения, ВидОперации, ТаблицаОшибок)
	
	КонецЕсли;
	
	РаспределитьСуммыБезКоличества_ОтключениеУсреднения(ВидОперации, ТаблицаОшибок);// Kuzmich, 28.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи, исправление ошибок округления на SQL
	
КонецПроцедуры

Процедура РаспределитьЗатратыНаФактическуюСебестоимостьВыпускаПоРсходам_ОтключениеУсреднения(Отказ, ТаблицаРаспределения, ВидОперации, ТаблицаОшибок)

	УчетСебестоимостиВРазрезеОрганизации = ДополнительныеСвойства.УчетнаяПолитика.УчетСебестоимостиВРазрезеОрганизации;
	
	// 1.Уничтожим временные таблицы.
	Запрос = Новый Запрос();
	Запрос.Текст = "УНИЧТОЖИТЬ РаспределениеЗатрат; УНИЧТОЖИТЬ Затраты; УНИЧТОЖИТЬ БазаРаспределенияПодробно; УНИЧТОЖИТЬ БазаРаспределения; УНИЧТОЖИТЬ БазаРаспределенияБезСкладов;
	// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
	|УНИЧТОЖИТЬ ТаблицаРаспределенияНачальнаяПРЕД;
	|УНИЧТОЖИТЬ ТаблицаРаспределенияНачальнаяСвернутаяКорр;
	|УНИЧТОЖИТЬ ТаблицаРаспределенияНачальная;
	|УНИЧТОЖИТЬ Расходы;
	|УНИЧТОЖИТЬ РасходыБезСчетУчетаЗатратРегл;
	|УНИЧТОЖИТЬ БазаРаспределенияБезСчетУчетаЗатратРегл;
	|УНИЧТОЖИТЬ ЗатратыНаРасходы;";
	// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.ВыполнитьПакет();
	
	// 2.Перенос затрат на остатки
	Запрос = Новый Запрос();
	
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНач", ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("ДатаКон", ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод);
	// Kuzmich, 23.12.2025, (ONESOFT-4595) «Закрытие месяца — пропорциональное распределение расходов»
	Запрос.УстановитьПараметр("ДатаКонМоментВремени", Ссылка.МоментВремени());
	// Kuzmich, 23.12.2025, (ONESOFT-4595) «Закрытие месяца — пропорциональное распределение расходов»
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированныйПланСчетов", ДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	Запрос.УстановитьПараметр("ЗакрыватьПоРеглПлануСчетов", ДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);
	Запрос.УстановитьПараметр("УчетСебестоимостиВРазрезеОрганизации", УчетСебестоимостиВРазрезеОрганизации);
	Запрос.УстановитьПараметр("ТаблицаРаспределения", ТаблицаРаспределения);
	
	Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	УчетЗатрат.Организация КАК Организация,
		//|	УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		//|	УчетЗатрат.СчетУчета КАК СчетУчета,
		//|	УчетЗатрат.Номенклатура КАК Номенклатура,
		//|	УчетЗатрат.Характеристика КАК Характеристика,
		//|	УчетЗатрат.Партия КАК Партия,
		//|	УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
		//|	УчетЗатрат.СчетУчетаРегл КАК СчетУчетаРегл,
		//|	УчетЗатрат.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		//|	УчетЗатрат.Проект КАК Проект,
		//|	УчетЗатрат.ДокументПоступления КАК ДокументПоступления,
		//|	УчетЗатрат.Сумма КАК Сумма
		//|ПОМЕСТИТЬ РаспределениеЗатрат
		//|ИЗ
		//|	РегистрНакопления.Запасы КАК УчетЗатрат
		//|ГДЕ
		//|	УчетЗатрат.Регистратор = &Ссылка
		//|	И УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		//|	И УчетЗатрат.Организация = &Организация
		//|;
		// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
		"ВЫБРАТЬ
		|	ТаблицаРаспределения.Организация КАК Организация,
		|	ТаблицаРаспределения.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ВЫРАЗИТЬ(ТаблицаРаспределения.СчетУчета КАК ПланСчетов.Управленческий) КАК СчетУчета,
		|	ТаблицаРаспределения.Номенклатура КАК Номенклатура,
		|	ТаблицаРаспределения.Характеристика КАК Характеристика,
		|	ТаблицаРаспределения.Партия КАК Партия,
		|	ТаблицаРаспределения.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ВЫРАЗИТЬ(ТаблицаРаспределения.СчетУчетаРегл КАК ПланСчетов.Хозрасчетный) КАК СчетУчетаРегл,
		|	ВЫРАЗИТЬ(ТаблицаРаспределения.СчетУчетаЗатратРегл КАК ПланСчетов.Хозрасчетный) КАК СчетУчетаЗатратРегл,
		|	ТаблицаРаспределения.Проект КАК Проект,
		|	ТаблицаРаспределения.ДокументПоступления КАК ДокументПоступления,
		|	ТаблицаРаспределения.Сумма КАК Сумма
		|ПОМЕСТИТЬ РаспределениеЗатрат
		|ИЗ
		|	&ТаблицаРаспределения КАК ТаблицаРаспределения
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РаспределениеЗатрат.Организация КАК Организация,
		|	РаспределениеЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	РаспределениеЗатрат.СчетУчета КАК СчетУчета,
		|	РаспределениеЗатрат.Номенклатура КАК Номенклатура,
		|	РаспределениеЗатрат.Характеристика КАК Характеристика,
		|	РаспределениеЗатрат.Партия КАК Партия,
		|	РаспределениеЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
		|	РаспределениеЗатрат.СчетУчетаРегл КАК СчетУчетаРегл,
		|	РаспределениеЗатрат.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	РаспределениеЗатрат.Проект КАК Проект,
		|	РаспределениеЗатрат.ДокументПоступления КАК ДокументПоступления,
		|	СУММА(РаспределениеЗатрат.Сумма) КАК Сумма
		|ПОМЕСТИТЬ Затраты
		|ИЗ
		|	РаспределениеЗатрат КАК РаспределениеЗатрат
		|
		|СГРУППИРОВАТЬ ПО
		|	РаспределениеЗатрат.Организация,
		|	РаспределениеЗатрат.СтруктурнаяЕдиница,
		|	РаспределениеЗатрат.СчетУчета,
		|	РаспределениеЗатрат.Номенклатура,
		|	РаспределениеЗатрат.Характеристика,
		|	РаспределениеЗатрат.Партия,
		|	РаспределениеЗатрат.ЗаказПокупателя,
		|	РаспределениеЗатрат.СчетУчетаРегл,
		|	РаспределениеЗатрат.СчетУчетаЗатратРегл,
		|	РаспределениеЗатрат.Проект,
		|	РаспределениеЗатрат.ДокументПоступления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Запасы.Организация КАК Организация,
		|	Запасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	Запасы.СчетУчета КАК СчетУчета,
		|	Запасы.Номенклатура КАК Номенклатура,
		|	Запасы.Характеристика КАК Характеристика,
		|	Запасы.Партия КАК Партия,
		|	Запасы.ЗаказПокупателя КАК ЗаказПокупателя,
		|	Запасы.СчетУчетаРегл КАК СчетУчетаРегл,
		|	Запасы.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	Запасы.Проект КАК Проект,
		|	Запасы.ДокументПоступления КАК ДокументПоступления,
		|	Запасы.Количество КАК Количество,
		|	Запасы.Сумма КАК Сумма,
		|	Запасы.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
		|	Запасы.КоррСчетУчета КАК КоррСчетУчета,
		|	Запасы.КоррНоменклатура КАК КоррНоменклатура,
		|	Запасы.КоррХарактеристика КАК КоррХарактеристика,
		|	Запасы.КоррПартия КАК КоррПартия,
		|	Запасы.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
		|	Запасы.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл,
		|	Запасы.КоррПроект КАК КоррПроект,
		|	Запасы.КоррДокументПоступления КАК КоррДокументПоступления,
		|	Запасы.Спецификация КАК Спецификация,
		|	Запасы.КоррСпецификация КАК КоррСпецификация,
		|	Запасы.ДокументПродажи КАК ДокументПродажи,
		|	Запасы.ЗаказПродажи КАК ЗаказПродажи,
		|	Запасы.Подразделение КАК Подразделение,
		|	Запасы.Ответственный КАК Ответственный,
		|	Запасы.СтавкаНДС КАК СтавкаНДС,
		|	Запасы.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
		|	Запасы.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет
		|ПОМЕСТИТЬ БазаРаспределенияПодробно
		|ИЗ
		|	РегистрНакопления.Запасы КАК Запасы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Затраты КАК Затраты
		|		ПО Запасы.Организация = Затраты.Организация
		|			И Запасы.СтруктурнаяЕдиница = Затраты.СтруктурнаяЕдиница
		|			И Запасы.Номенклатура = Затраты.Номенклатура
		|			И Запасы.Характеристика = Затраты.Характеристика
		|			И Запасы.Партия = Затраты.Партия
		|			И Запасы.ЗаказПокупателя = Затраты.ЗаказПокупателя
		|			И Запасы.Проект = Затраты.Проект
		|			И Запасы.ДокументПоступления = Затраты.ДокументПоступления
		|			И (ВЫБОР
		|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
		|					ТОГДА Запасы.СчетУчетаРегл = Затраты.СчетУчетаРегл
		|				ИНАЧЕ Запасы.СчетУчета = Затраты.СчетУчета
		|			КОНЕЦ)
		|ГДЕ
		|	Запасы.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И (Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И НЕ Запасы.Возврат
		|			ИЛИ Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И Запасы.Возврат)
		|	И Запасы.Организация = &Организация
		|	И НЕ Запасы.ФиксированнаяСтоимость
		|	И НЕ Запасы.Регистратор = &Ссылка
		|	И НЕ Запасы.Номенклатура = Запасы.КоррНоменклатура
		|	И НЕ (Запасы.КоррНоменклатура, Запасы.КоррСтруктурнаяЕдиница, Запасы.КоррСчетУчета, Запасы.КоррХарактеристика, Запасы.КоррПартия, Запасы.КоррЗаказПокупателя, Запасы.КоррСчетУчетаРегл, Запасы.КоррПроект, Запасы.КоррДокументПоступления) В
		|				(ВЫБРАТЬ
		|					УзлыКорректировкиСтоимостиСписания.Номенклатура,
		|					УзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница,
		|					УзлыКорректировкиСтоимостиСписания.СчетУчета,
		|					УзлыКорректировкиСтоимостиСписания.Характеристика,
		|					УзлыКорректировкиСтоимостиСписания.Партия,
		|					УзлыКорректировкиСтоимостиСписания.ЗаказПокупателя,
		|					УзлыКорректировкиСтоимостиСписания.СчетУчетаРегл,
		|					УзлыКорректировкиСтоимостиСписания.Проект,
		|					УзлыКорректировкиСтоимостиСписания.ДокументПоступления
		|				ИЗ
		|					РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
		|				ГДЕ
		|					УзлыКорректировкиСтоимостиСписания.Регистратор = &Ссылка)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления,
		|	КоррСтруктурнаяЕдиница,
		|	КоррСчетУчета,
		|	КоррНоменклатура,
		|	КоррХарактеристика,
		|	КоррПартия,
		|	КоррЗаказПокупателя,
		|	КоррСчетУчетаРегл,
		|	КоррПроект,
		|	КоррДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БазаРаспределенияПодробно.Организация КАК Организация,
		|	БазаРаспределенияПодробно.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	БазаРаспределенияПодробно.СчетУчета КАК СчетУчета,
		|	БазаРаспределенияПодробно.Номенклатура КАК Номенклатура,
		|	БазаРаспределенияПодробно.Характеристика КАК Характеристика,
		|	БазаРаспределенияПодробно.Партия КАК Партия,
		|	БазаРаспределенияПодробно.ЗаказПокупателя КАК ЗаказПокупателя,
		|	БазаРаспределенияПодробно.СчетУчетаРегл КАК СчетУчетаРегл,
		|	БазаРаспределенияПодробно.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	БазаРаспределенияПодробно.Проект КАК Проект,
		|	БазаРаспределенияПодробно.ДокументПоступления КАК ДокументПоступления,
		|	СУММА(БазаРаспределенияПодробно.Количество) КАК Количество,
		|	СУММА(БазаРаспределенияПодробно.Сумма) КАК Сумма,
		|	БазаРаспределенияПодробно.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
		|	БазаРаспределенияПодробно.КоррСчетУчета КАК КоррСчетУчета,
		|	БазаРаспределенияПодробно.КоррНоменклатура КАК КоррНоменклатура,
		|	БазаРаспределенияПодробно.КоррХарактеристика КАК КоррХарактеристика,
		|	БазаРаспределенияПодробно.КоррПартия КАК КоррПартия,
		|	БазаРаспределенияПодробно.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
		|	БазаРаспределенияПодробно.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл,
		|	БазаРаспределенияПодробно.КоррПроект КАК КоррПроект,
		|	БазаРаспределенияПодробно.КоррДокументПоступления КАК КоррДокументПоступления,
		|	БазаРаспределенияПодробно.Спецификация КАК Спецификация,
		|	БазаРаспределенияПодробно.КоррСпецификация КАК КоррСпецификация,
		|	БазаРаспределенияПодробно.ДокументПродажи КАК ДокументПродажи,
		|	БазаРаспределенияПодробно.ЗаказПродажи КАК ЗаказПродажи,
		|	БазаРаспределенияПодробно.Подразделение КАК Подразделение,
		|	БазаРаспределенияПодробно.Ответственный КАК Ответственный,
		|	БазаРаспределенияПодробно.СтавкаНДС КАК СтавкаНДС,
		|	БазаРаспределенияПодробно.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
		|	БазаРаспределенияПодробно.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет
		|ПОМЕСТИТЬ БазаРаспределения
		|ИЗ
		|	БазаРаспределенияПодробно КАК БазаРаспределенияПодробно
		|
		|СГРУППИРОВАТЬ ПО
		|	БазаРаспределенияПодробно.Организация,
		|	БазаРаспределенияПодробно.СтруктурнаяЕдиница,
		|	БазаРаспределенияПодробно.СчетУчета,
		|	БазаРаспределенияПодробно.Номенклатура,
		|	БазаРаспределенияПодробно.Характеристика,
		|	БазаРаспределенияПодробно.Партия,
		|	БазаРаспределенияПодробно.ЗаказПокупателя,
		|	БазаРаспределенияПодробно.СчетУчетаРегл,
		|	БазаРаспределенияПодробно.СчетУчетаЗатратРегл,
		|	БазаРаспределенияПодробно.Проект,
		|	БазаРаспределенияПодробно.ДокументПоступления,
		|	БазаРаспределенияПодробно.КоррСтруктурнаяЕдиница,
		|	БазаРаспределенияПодробно.КоррСчетУчета,
		|	БазаРаспределенияПодробно.КоррНоменклатура,
		|	БазаРаспределенияПодробно.КоррХарактеристика,
		|	БазаРаспределенияПодробно.КоррПартия,
		|	БазаРаспределенияПодробно.КоррЗаказПокупателя,
		|	БазаРаспределенияПодробно.КоррСчетУчетаРегл,
		|	БазаРаспределенияПодробно.КоррПроект,
		|	БазаРаспределенияПодробно.КоррДокументПоступления,
		|	БазаРаспределенияПодробно.Спецификация,
		|	БазаРаспределенияПодробно.КоррСпецификация,
		|	БазаРаспределенияПодробно.ДокументПродажи,
		|	БазаРаспределенияПодробно.ЗаказПродажи,
		|	БазаРаспределенияПодробно.Подразделение,
		|	БазаРаспределенияПодробно.Ответственный,
		|	БазаРаспределенияПодробно.СтавкаНДС,
		|	БазаРаспределенияПодробно.ЗатратыНаВыпуск,
		|	БазаРаспределенияПодробно.ПеремещениеВРозницуСуммовойУчет
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления,
		|	КоррСтруктурнаяЕдиница,
		|	КоррСчетУчета,
		|	КоррНоменклатура,
		|	КоррХарактеристика,
		|	КоррПартия,
		|	КоррЗаказПокупателя,
		|	КоррСчетУчетаРегл,
		|	КоррПроект,
		|	КоррДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БазаРаспределения.Организация КАК Организация,
		|	БазаРаспределения.СчетУчета КАК СчетУчета,
		|	БазаРаспределения.Номенклатура КАК Номенклатура,
		|	БазаРаспределения.Характеристика КАК Характеристика,
		|	БазаРаспределения.Партия КАК Партия,
		|	БазаРаспределения.ЗаказПокупателя КАК ЗаказПокупателя,
		|	БазаРаспределения.СчетУчетаРегл КАК СчетУчетаРегл,
		|	БазаРаспределения.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	БазаРаспределения.Проект КАК Проект,
		|	БазаРаспределения.ДокументПоступления КАК ДокументПоступления,
		|	СУММА(БазаРаспределения.Количество) КАК ОбщееКоличество,
		|	СУММА(БазаРаспределения.Сумма) КАК ОбщаяСумма
		|ПОМЕСТИТЬ БазаРаспределенияБезСкладов
		|ИЗ
		|	БазаРаспределения КАК БазаРаспределения
		|
		|СГРУППИРОВАТЬ ПО
		|	БазаРаспределения.Организация,
		|	БазаРаспределения.СчетУчета,
		|	БазаРаспределения.Номенклатура,
		|	БазаРаспределения.Характеристика,
		|	БазаРаспределения.Партия,
		|	БазаРаспределения.ЗаказПокупателя,
		|	БазаРаспределения.СчетУчетаРегл,
		|	БазаРаспределения.СчетУчетаЗатратРегл,
		|	БазаРаспределения.Проект,
		|	БазаРаспределения.ДокументПоступления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&УчетСебестоимостиВРазрезеОрганизации КАК УчетСебестоимостиВРазрезеОрганизации,
		|	Затраты.Организация КАК Организация,
		|	Затраты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	Затраты.СчетУчета КАК СчетУчета,
		|	Затраты.Номенклатура КАК Номенклатура,
		|	Затраты.Характеристика КАК Характеристика,
		|	Затраты.Партия КАК Партия,
		|	Затраты.ЗаказПокупателя КАК ЗаказПокупателя,
		|	Затраты.СчетУчетаРегл КАК СчетУчетаРегл,
		|	Затраты.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	Затраты.Проект КАК Проект,
		|	Затраты.ДокументПоступления КАК ДокументПоступления,
		|	БазаРаспределения.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
		|	БазаРаспределения.КоррСчетУчета КАК КоррСчетУчета,
		|	БазаРаспределения.КоррНоменклатура КАК КоррНоменклатура,
		|	БазаРаспределения.КоррХарактеристика КАК КоррХарактеристика,
		|	БазаРаспределения.КоррПартия КАК КоррПартия,
		|	БазаРаспределения.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
		|	БазаРаспределения.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл,
		|	БазаРаспределения.КоррПроект КАК КоррПроект,
		|	БазаРаспределения.КоррДокументПоступления КАК КоррДокументПоступления,
		|	СУММА(0) КАК Количество,
		|	СУММА(ВЫРАЗИТЬ(Затраты.Сумма * (БазаРаспределения.Сумма / БазаРаспределенияБезСкладов.ОбщаяСумма) КАК ЧИСЛО(38, 28))) КАК Сумма,
		|	ВЫБОР
		|		КОГДА &ЗакрыватьПоРеглПлануСчетов
		|			ТОГДА БазаРаспределения.КоррСчетУчетаРегл.ТипСчета
		|		ИНАЧЕ БазаРаспределения.КоррСчетУчета.ТипСчета
		|	КОНЕЦ КАК КоррСчетУчетаТипСчета,
		|	БазаРаспределения.Спецификация КАК Спецификация,
		|	БазаРаспределения.КоррСпецификация КАК КоррСпецификация,
		|	БазаРаспределения.ДокументПродажи КАК ДокументПродажи,
		|	БазаРаспределения.ЗаказПродажи КАК ЗаказПродажи,
		|	БазаРаспределения.Подразделение КАК Подразделение,
		|	БазаРаспределения.Ответственный КАК Ответственный,
		|	БазаРаспределения.СтавкаНДС КАК СтавкаНДС,
		|	БазаРаспределения.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
		|	БазаРаспределения.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
		|	ВЫБОР
		|		КОГДА &ЗакрыватьПоРеглПлануСчетов
		|			ТОГДА Затраты.СчетУчетаРегл.ТипСчета
		|		ИНАЧЕ Затраты.СчетУчета.ТипСчета
		|	КОНЕЦ КАК СчетУчетаТипСчета,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
		|			ТОГДА ВЫРАЗИТЬ(БазаРаспределения.ДокументПродажи КАК Документ.СписаниеЗапасов).Корреспонденция
		|		КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
		|			ТОГДА ВЫРАЗИТЬ(БазаРаспределения.ДокументПродажи КАК Документ.ПересортицаЗапасов).Корреспонденция
		|		КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
		|			ТОГДА ВЫРАЗИТЬ(БазаРаспределения.ДокументПродажи КАК Документ.ПеремещениеЗапасов).СчетЗатрат
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК СчетУчетаСписания,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
		|			ТОГДА ВЫРАЗИТЬ(БазаРаспределения.ДокументПродажи КАК Документ.СписаниеЗапасов).КорреспонденцияРегл
		|		КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
		|			ТОГДА ВЫРАЗИТЬ(БазаРаспределения.ДокументПродажи КАК Документ.ПересортицаЗапасов).КорреспонденцияРегл
		|		КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
		|			ТОГДА ВЫРАЗИТЬ(БазаРаспределения.ДокументПродажи КАК Документ.ПеремещениеЗапасов).СчетЗатратРегл
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК СчетУчетаСписанияРегл,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
		|				ИЛИ ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
		|			ТОГДА ВЫБОР
		|					КОГДА &ЗакрыватьПоРеглПлануСчетов
		|						ТОГДА БазаРаспределения.ДокументПродажи.КорреспонденцияРегл.ТипСчета
		|					ИНАЧЕ БазаРаспределения.ДокументПродажи.Корреспонденция.ТипСчета
		|				КОНЕЦ
		|		КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
		|			ТОГДА ВЫБОР
		|					КОГДА &ЗакрыватьПоРеглПлануСчетов
		|						ТОГДА БазаРаспределения.ДокументПродажи.СчетЗатратРегл.ТипСчета
		|					ИНАЧЕ БазаРаспределения.ДокументПродажи.СчетЗатрат.ТипСчета
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК СчетУчетаСписанияТипСчета,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
		|			ТОГДА БазаРаспределения.ДокументПродажи.НаправлениеДеятельности
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК НаправлениеДеятельностиСписания,
		|	ВЫБОР
		|		КОГДА БазаРаспределения.ПеремещениеВРозницуСуммовойУчет
		|			ТОГДА ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.ПриходнаяНакладная)
		|						ТОГДА БазаРаспределения.ДокументПродажи.СтруктурнаяЕдиница
		|					КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
		|						ТОГДА БазаРаспределения.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
		|					ИНАЧЕ НЕОПРЕДЕЛЕНО
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК РозничнаяСтруктурнаяЕдиница,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
		|			ТОГДА БазаРаспределения.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
		|		ИНАЧЕ БазаРаспределения.ДокументПродажи.СтруктурнаяЕдиница
		|	КОНЕЦ КАК СтруктурнаяЕдиницаПолучатель,
		|	БазаРаспределения.Номенклатура.КатегорияНоменклатуры КАК НоменклатураКатегорияНоменклатуры,
		|	БазаРаспределения.Номенклатура.НаправлениеДеятельности КАК НаправлениеДеятельностиПродажи,
		|	БазаРаспределения.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
		|	БазаРаспределения.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
		|	ВЫБОР
		|		КОГДА &ЗакрыватьПоРеглПлануСчетов
		|			ТОГДА БазаРаспределения.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл.ТипСчета
		|		ИНАЧЕ БазаРаспределения.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета
		|	КОНЕЦ КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета
		|ПОМЕСТИТЬ ТаблицаРаспределенияНачальнаяПРЕД
		|ИЗ
		|	БазаРаспределения КАК БазаРаспределения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Затраты КАК Затраты
		|		ПО БазаРаспределения.Организация = Затраты.Организация
		|			И БазаРаспределения.СтруктурнаяЕдиница = Затраты.СтруктурнаяЕдиница
		|			И БазаРаспределения.Номенклатура = Затраты.Номенклатура
		|			И БазаРаспределения.Характеристика = Затраты.Характеристика
		|			И БазаРаспределения.Партия = Затраты.Партия
		|			И БазаРаспределения.ЗаказПокупателя = Затраты.ЗаказПокупателя
		|			И БазаРаспределения.Проект = Затраты.Проект
		|			И БазаРаспределения.ДокументПоступления = Затраты.ДокументПоступления
		|		ЛЕВОЕ СОЕДИНЕНИЕ БазаРаспределенияБезСкладов КАК БазаРаспределенияБезСкладов
		|		ПО БазаРаспределения.Организация = БазаРаспределенияБезСкладов.Организация
		|			И (ВЫБОР
		|				КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
		|					ТОГДА БазаРаспределения.СчетУчетаРегл = БазаРаспределенияБезСкладов.СчетУчетаРегл
		|				ИНАЧЕ БазаРаспределения.СчетУчета = БазаРаспределенияБезСкладов.СчетУчета
		|			КОНЕЦ)
		|			И БазаРаспределения.Номенклатура = БазаРаспределенияБезСкладов.Номенклатура
		|			И БазаРаспределения.Характеристика = БазаРаспределенияБезСкладов.Характеристика
		|			И БазаРаспределения.Партия = БазаРаспределенияБезСкладов.Партия
		|			И БазаРаспределения.ЗаказПокупателя = БазаРаспределенияБезСкладов.ЗаказПокупателя
		|			И БазаРаспределения.Проект = БазаРаспределенияБезСкладов.Проект
		|			И БазаРаспределения.ДокументПоступления = БазаРаспределенияБезСкладов.ДокументПоступления
		// Kuzmich, 21.11.2025, (ONESOFT-4531) Закрытие месяца - ошибка в распределённых расходах
		|
		|СГРУППИРОВАТЬ ПО
		|	Затраты.Организация,
		|	Затраты.СтруктурнаяЕдиница,
		|	Затраты.СчетУчета,
		|	Затраты.Номенклатура,
		|	Затраты.Характеристика,
		|	Затраты.Партия,
		|	Затраты.ЗаказПокупателя,
		|	Затраты.СчетУчетаРегл,
		|	Затраты.СчетУчетаЗатратРегл,
		|	Затраты.Проект,
		|	Затраты.ДокументПоступления,
		|	БазаРаспределения.КоррСтруктурнаяЕдиница,
		|	БазаРаспределения.КоррСчетУчета,
		|	БазаРаспределения.КоррНоменклатура,
		|	БазаРаспределения.КоррХарактеристика,
		|	БазаРаспределения.КоррПартия,
		|	БазаРаспределения.КоррЗаказПокупателя,
		|	БазаРаспределения.КоррСчетУчетаРегл,
		|	БазаРаспределения.КоррПроект,
		|	БазаРаспределения.КоррДокументПоступления,
		|	ВЫБОР
		|		КОГДА &ЗакрыватьПоРеглПлануСчетов
		|			ТОГДА БазаРаспределения.КоррСчетУчетаРегл.ТипСчета
		|		ИНАЧЕ БазаРаспределения.КоррСчетУчета.ТипСчета
		|	КОНЕЦ,
		|	БазаРаспределения.Спецификация,
		|	БазаРаспределения.КоррСпецификация,
		|	БазаРаспределения.ДокументПродажи,
		|	БазаРаспределения.ЗаказПродажи,
		|	БазаРаспределения.Подразделение,
		|	БазаРаспределения.Ответственный,
		|	БазаРаспределения.СтавкаНДС,
		|	БазаРаспределения.ЗатратыНаВыпуск,
		|	БазаРаспределения.ПеремещениеВРозницуСуммовойУчет,
		|	ВЫБОР
		|		КОГДА &ЗакрыватьПоРеглПлануСчетов
		|			ТОГДА Затраты.СчетУчетаРегл.ТипСчета
		|		ИНАЧЕ Затраты.СчетУчета.ТипСчета
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
		|			ТОГДА ВЫРАЗИТЬ(БазаРаспределения.ДокументПродажи КАК Документ.СписаниеЗапасов).Корреспонденция
		|		КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
		|			ТОГДА ВЫРАЗИТЬ(БазаРаспределения.ДокументПродажи КАК Документ.ПересортицаЗапасов).Корреспонденция
		|		КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
		|			ТОГДА ВЫРАЗИТЬ(БазаРаспределения.ДокументПродажи КАК Документ.ПеремещениеЗапасов).СчетЗатрат
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
		|			ТОГДА ВЫРАЗИТЬ(БазаРаспределения.ДокументПродажи КАК Документ.СписаниеЗапасов).КорреспонденцияРегл
		|		КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
		|			ТОГДА ВЫРАЗИТЬ(БазаРаспределения.ДокументПродажи КАК Документ.ПересортицаЗапасов).КорреспонденцияРегл
		|		КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
		|			ТОГДА ВЫРАЗИТЬ(БазаРаспределения.ДокументПродажи КАК Документ.ПеремещениеЗапасов).СчетЗатратРегл
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
		|				ИЛИ ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
		|			ТОГДА ВЫБОР
		|					КОГДА &ЗакрыватьПоРеглПлануСчетов
		|						ТОГДА БазаРаспределения.ДокументПродажи.КорреспонденцияРегл.ТипСчета
		|					ИНАЧЕ БазаРаспределения.ДокументПродажи.Корреспонденция.ТипСчета
		|				КОНЕЦ
		|		КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
		|			ТОГДА ВЫБОР
		|					КОГДА &ЗакрыватьПоРеглПлануСчетов
		|						ТОГДА БазаРаспределения.ДокументПродажи.СчетЗатратРегл.ТипСчета
		|					ИНАЧЕ БазаРаспределения.ДокументПродажи.СчетЗатрат.ТипСчета
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
		|			ТОГДА БазаРаспределения.ДокументПродажи.НаправлениеДеятельности
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БазаРаспределения.ПеремещениеВРозницуСуммовойУчет
		|			ТОГДА ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.ПриходнаяНакладная)
		|						ТОГДА БазаРаспределения.ДокументПродажи.СтруктурнаяЕдиница
		|					КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
		|						ТОГДА БазаРаспределения.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
		|					ИНАЧЕ НЕОПРЕДЕЛЕНО
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БазаРаспределения.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
		|			ТОГДА БазаРаспределения.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
		|		ИНАЧЕ БазаРаспределения.ДокументПродажи.СтруктурнаяЕдиница
		|	КОНЕЦ,
		|	БазаРаспределения.Номенклатура.КатегорияНоменклатуры,
		|	БазаРаспределения.Номенклатура.НаправлениеДеятельности,
		|	БазаРаспределения.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж,
		|	БазаРаспределения.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл,
		|	ВЫБОР
		|		КОГДА &ЗакрыватьПоРеглПлануСчетов
		|			ТОГДА БазаРаспределения.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл.ТипСчета
		|		ИНАЧЕ БазаРаспределения.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления,
		|	КоррСтруктурнаяЕдиница,
		|	КоррСчетУчета,
		|	КоррНоменклатура,
		|	КоррХарактеристика,
		|	КоррПартия,
		|	КоррЗаказПокупателя,
		|	КоррСчетУчетаРегл,
		|	КоррПроект,
		|	КоррДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаРаспределенияНачальнаяПРЕД.Организация КАК Организация,
		//|	ТаблицаРаспределенияНачальнаяПРЕД.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррСчетУчета КАК КоррСчетУчета,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррНоменклатура КАК КоррНоменклатура,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррХарактеристика КАК КоррХарактеристика,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррПартия КАК КоррПартия,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррПроект КАК КоррПроект,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррДокументПоступления КАК КоррДокументПоступления,
		|	СУММА(ТаблицаРаспределенияНачальнаяПРЕД.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ТаблицаРаспределенияНачальнаяСвернутаяКорр
		|ИЗ ТаблицаРаспределенияНачальнаяПРЕД КАК ТаблицаРаспределенияНачальнаяПРЕД
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаРаспределенияНачальнаяПРЕД.Организация,
		//|	ТаблицаРаспределенияНачальнаяПРЕД.СчетУчетаЗатратРегл,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррСтруктурнаяЕдиница,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррСчетУчета,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррНоменклатура,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррХарактеристика,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррПартия,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррЗаказПокупателя,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррСчетУчетаРегл,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррПроект,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррДокументПоступления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	КоррСтруктурнаяЕдиница,
		|	КоррСчетУчета,
		|	КоррНоменклатура,
		|	КоррХарактеристика,
		|	КоррПартия,
		|	КоррЗаказПокупателя,
		|	КоррСчетУчетаРегл,
		|	КоррПроект,
		|	КоррДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаРаспределенияНачальнаяПРЕД.УчетСебестоимостиВРазрезеОрганизации КАК УчетСебестоимостиВРазрезеОрганизации,
		|	ТаблицаРаспределенияНачальнаяПРЕД.Организация КАК Организация,
		|	ТаблицаРаспределенияНачальнаяПРЕД.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаРаспределенияНачальнаяПРЕД.СчетУчета КАК СчетУчета,
		|	ТаблицаРаспределенияНачальнаяПРЕД.Номенклатура КАК Номенклатура,
		|	ТаблицаРаспределенияНачальнаяПРЕД.Характеристика КАК Характеристика,
		|	ТаблицаРаспределенияНачальнаяПРЕД.Партия КАК Партия,
		|	ТаблицаРаспределенияНачальнаяПРЕД.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ТаблицаРаспределенияНачальнаяПРЕД.СчетУчетаРегл КАК СчетУчетаРегл,
		|	ТаблицаРаспределенияНачальнаяПРЕД.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	ТаблицаРаспределенияНачальнаяПРЕД.Проект КАК Проект,
		|	ТаблицаРаспределенияНачальнаяПРЕД.ДокументПоступления КАК ДокументПоступления,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррСчетУчета КАК КоррСчетУчета,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррНоменклатура КАК КоррНоменклатура,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррХарактеристика КАК КоррХарактеристика,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррПартия КАК КоррПартия,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррПроект КАК КоррПроект,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррДокументПоступления КАК КоррДокументПоступления,
		|	ТаблицаРаспределенияНачальнаяПРЕД.Количество КАК Количество,
		|	ТаблицаРаспределенияНачальнаяПРЕД.Сумма КАК Сумма,
		|	ВЫРАЗИТЬ(ВЫБОР 
		|		КОГДА ЕСТЬNULL(ТаблицаРаспределенияНачальнаяСвернутаяКорр.Сумма,0)=0
		|			ТОГДА 0
		|		ИНАЧЕ ТаблицаРаспределенияНачальнаяПРЕД.Сумма / ТаблицаРаспределенияНачальнаяСвернутаяКорр.Сумма
		|	КОНЕЦ КАК ЧИСЛО(38, 28)) КАК КоэффициентКорр,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррСчетУчетаТипСчета КАК КоррСчетУчетаТипСчета,
		|	ТаблицаРаспределенияНачальнаяПРЕД.Спецификация КАК Спецификация,
		|	ТаблицаРаспределенияНачальнаяПРЕД.КоррСпецификация КАК КоррСпецификация,
		|	ТаблицаРаспределенияНачальнаяПРЕД.ДокументПродажи КАК ДокументПродажи,
		|	ТаблицаРаспределенияНачальнаяПРЕД.ЗаказПродажи КАК ЗаказПродажи,
		|	ТаблицаРаспределенияНачальнаяПРЕД.Подразделение КАК Подразделение,
		|	ТаблицаРаспределенияНачальнаяПРЕД.Ответственный КАК Ответственный,
		|	ТаблицаРаспределенияНачальнаяПРЕД.СтавкаНДС КАК СтавкаНДС,
		|	ТаблицаРаспределенияНачальнаяПРЕД.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
		|	ТаблицаРаспределенияНачальнаяПРЕД.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
		|	ТаблицаРаспределенияНачальнаяПРЕД.СчетУчетаТипСчета КАК СчетУчетаТипСчета,
		|	ТаблицаРаспределенияНачальнаяПРЕД.СчетУчетаСписания КАК СчетУчетаСписания,
		|	ТаблицаРаспределенияНачальнаяПРЕД.СчетУчетаСписанияРегл КАК СчетУчетаСписанияРегл,
		|	ТаблицаРаспределенияНачальнаяПРЕД.СчетУчетаСписанияТипСчета КАК СчетУчетаСписанияТипСчета,
		|	ТаблицаРаспределенияНачальнаяПРЕД.НаправлениеДеятельностиСписания КАК НаправлениеДеятельностиСписания,
		|	ТаблицаРаспределенияНачальнаяПРЕД.РозничнаяСтруктурнаяЕдиница КАК РозничнаяСтруктурнаяЕдиница,
		|	ТаблицаРаспределенияНачальнаяПРЕД.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
		|	ТаблицаРаспределенияНачальнаяПРЕД.НоменклатураКатегорияНоменклатуры КАК НоменклатураКатегорияНоменклатуры,
		|	ТаблицаРаспределенияНачальнаяПРЕД.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельностиПродажи,
		|	ТаблицаРаспределенияНачальнаяПРЕД.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
		|	ТаблицаРаспределенияНачальнаяПРЕД.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
		|	ТаблицаРаспределенияНачальнаяПРЕД.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета
		|ПОМЕСТИТЬ ТаблицаРаспределенияНачальная
		|ИЗ ТаблицаРаспределенияНачальнаяПРЕД КАК ТаблицаРаспределенияНачальнаяПРЕД
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРаспределенияНачальнаяСвернутаяКорр КАК ТаблицаРаспределенияНачальнаяСвернутаяКорр
		|			ПО ТаблицаРаспределенияНачальнаяПРЕД.Организация = ТаблицаРаспределенияНачальнаяСвернутаяКорр.Организация
		|			И ТаблицаРаспределенияНачальнаяПРЕД.КоррСтруктурнаяЕдиница = ТаблицаРаспределенияНачальнаяСвернутаяКорр.КоррСтруктурнаяЕдиница
		|			И ТаблицаРаспределенияНачальнаяПРЕД.КоррСчетУчета = ТаблицаРаспределенияНачальнаяСвернутаяКорр.КоррСчетУчета
		|			И ТаблицаРаспределенияНачальнаяПРЕД.КоррНоменклатура = ТаблицаРаспределенияНачальнаяСвернутаяКорр.КоррНоменклатура
		|			И ТаблицаРаспределенияНачальнаяПРЕД.КоррХарактеристика = ТаблицаРаспределенияНачальнаяСвернутаяКорр.КоррХарактеристика
		|			И ТаблицаРаспределенияНачальнаяПРЕД.КоррПартия = ТаблицаРаспределенияНачальнаяСвернутаяКорр.КоррПартия
		|			И ТаблицаРаспределенияНачальнаяПРЕД.КоррЗаказПокупателя = ТаблицаРаспределенияНачальнаяСвернутаяКорр.КоррЗаказПокупателя
		|			И ТаблицаРаспределенияНачальнаяПРЕД.КоррСчетУчетаРегл = ТаблицаРаспределенияНачальнаяСвернутаяКорр.КоррСчетУчетаРегл
		//|			И ТаблицаРаспределенияНачальнаяПРЕД.КоррСчетУчетаЗатратРегл = ТаблицаРаспределенияНачальнаяСвернутаяКорр.СчетУчетаЗатратРегл
		|			И ТаблицаРаспределенияНачальнаяПРЕД.КоррПроект = ТаблицаРаспределенияНачальнаяСвернутаяКорр.КоррПроект
		|			И ТаблицаРаспределенияНачальнаяПРЕД.КоррДокументПоступления = ТаблицаРаспределенияНачальнаяСвернутаяКорр.КоррДокументПоступления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления,
		|	КоррСтруктурнаяЕдиница,
		|	КоррСчетУчета,
		|	КоррНоменклатура,
		|	КоррХарактеристика,
		|	КоррПартия,
		|	КоррЗаказПокупателя,
		|	КоррСчетУчетаРегл,
		|	КоррПроект,
		|	КоррДокументПоступления
		|;
		|
		// Kuzmich, 21.11.2025, (ONESOFT-4531) Закрытие месяца - ошибка в распределённых расходах
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Запасы.Организация КАК Организация,
		|	Запасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	Запасы.СчетУчета КАК СчетУчета,
		|	Запасы.Номенклатура КАК Номенклатура,
		|	Запасы.Характеристика КАК Характеристика,
		|	Запасы.Партия КАК Партия,
		|	Запасы.ЗаказПокупателя КАК ЗаказПокупателя,
		|	Запасы.СчетУчетаРегл КАК СчетУчетаРегл,
		|	Запасы.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	Запасы.Проект КАК Проект,
		|	Запасы.ДокументПоступления КАК ДокументПоступления,
		|	Запасы.Количество КАК Количество,
		|	Запасы.Сумма КАК Сумма
		|ПОМЕСТИТЬ Расходы
		|ИЗ
		|	РегистрНакопления.Запасы КАК Запасы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Затраты КАК Затраты
		|		ПО Запасы.Организация = Затраты.Организация
		|			И Запасы.Номенклатура = Затраты.Номенклатура
		|			И Запасы.Характеристика = Затраты.Характеристика
		|			И Запасы.Партия = Затраты.Партия
		|			И Запасы.ЗаказПокупателя = Затраты.ЗаказПокупателя
		|			И Запасы.Проект = Затраты.Проект
		|			И Запасы.ДокументПоступления = Затраты.ДокументПоступления
		|			И (НЕ ВЫБОР
		|					КОГДА &ИспользоватьТолькоРегламентированныйПланСчетов
		|						ТОГДА Запасы.СчетУчетаРегл = Затраты.СчетУчетаРегл
		|					ИНАЧЕ Запасы.СчетУчета = Затраты.СчетУчета
		|				КОНЕЦ)
		|ГДЕ
		|	Запасы.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И (Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И НЕ Запасы.Возврат
		|			ИЛИ Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И Запасы.Возврат)
		|	И Запасы.Организация = &Организация
		|	И НЕ Запасы.Регистратор = &Ссылка
		|	И НЕ Запасы.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Расходы.Организация КАК Организация,
		|	Расходы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	Расходы.СчетУчета КАК СчетУчета,
		|	Расходы.Номенклатура КАК Номенклатура,
		|	Расходы.Характеристика КАК Характеристика,
		|	Расходы.Партия КАК Партия,
		|	Расходы.ЗаказПокупателя КАК ЗаказПокупателя,
		|	Расходы.СчетУчетаРегл КАК СчетУчетаРегл,
		|	Расходы.Проект КАК Проект,
		|	Расходы.ДокументПоступления КАК ДокументПоступления,
		|	СУММА(Расходы.Количество) КАК Количество,
		|	СУММА(Расходы.Сумма) КАК Сумма
		|ПОМЕСТИТЬ РасходыБезСчетУчетаЗатратРегл
		|ИЗ
		|	Расходы КАК Расходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Расходы.Организация,
		|	Расходы.СтруктурнаяЕдиница,
		|	Расходы.СчетУчета,
		|	Расходы.Номенклатура,
		|	Расходы.Характеристика,
		|	Расходы.Партия,
		|	Расходы.ЗаказПокупателя,
		|	Расходы.СчетУчетаРегл,
		|	Расходы.Проект,
		|	Расходы.ДокументПоступления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БазаРаспределения.Организация КАК Организация,
		|	БазаРаспределения.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	БазаРаспределения.СчетУчета КАК СчетУчета,
		|	БазаРаспределения.Номенклатура КАК Номенклатура,
		|	БазаРаспределения.Характеристика КАК Характеристика,
		|	БазаРаспределения.Партия КАК Партия,
		|	БазаРаспределения.ЗаказПокупателя КАК ЗаказПокупателя,
		|	БазаРаспределения.СчетУчетаРегл КАК СчетУчетаРегл,
		|	БазаРаспределения.Проект КАК Проект,
		|	БазаРаспределения.ДокументПоступления КАК ДокументПоступления,
		|	СУММА(БазаРаспределения.Количество) КАК Количество,
		|	СУММА(БазаРаспределения.Сумма) КАК Сумма
		|ПОМЕСТИТЬ БазаРаспределенияБезСчетУчетаЗатратРегл
		|ИЗ
		|	БазаРаспределения КАК БазаРаспределения
		|
		|СГРУППИРОВАТЬ ПО
		|	БазаРаспределения.Организация,
		|	БазаРаспределения.СтруктурнаяЕдиница,
		|	БазаРаспределения.СчетУчета,
		|	БазаРаспределения.Номенклатура,
		|	БазаРаспределения.Характеристика,
		|	БазаРаспределения.Партия,
		|	БазаРаспределения.ЗаказПокупателя,
		|	БазаРаспределения.СчетУчетаРегл,
		|	БазаРаспределения.Проект,
		|	БазаРаспределения.ДокументПоступления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасходыБезСчетУчетаЗатратРегл.Организация КАК Организация,
		|	РасходыБезСчетУчетаЗатратРегл.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	РасходыБезСчетУчетаЗатратРегл.СчетУчета КАК СчетУчета,
		|	РасходыБезСчетУчетаЗатратРегл.Номенклатура КАК Номенклатура,
		|	РасходыБезСчетУчетаЗатратРегл.Характеристика КАК Характеристика,
		|	РасходыБезСчетУчетаЗатратРегл.Партия КАК Партия,
		|	РасходыБезСчетУчетаЗатратРегл.ЗаказПокупателя КАК ЗаказПокупателя,
		|	РасходыБезСчетУчетаЗатратРегл.СчетУчетаРегл КАК СчетУчетаРегл,
		|	РасходыБезСчетУчетаЗатратРегл.Проект КАК Проект,
		|	РасходыБезСчетУчетаЗатратРегл.ДокументПоступления КАК ДокументПоступления,
		//|	ТаблицаРаспределенияНачальная.Сумма * РасходыБезСчетУчетаЗатратРегл.Количество / БазаРаспределенияБезСчетУчетаЗатратРегл.Количество КАК Сумма
		// Kuzmich, 21.11.2025, (ONESOFT-4531) Закрытие месяца - ошибка в распределённых расходах
		|	СУММА(ВЫРАЗИТЬ(ВЫБОР 
		|		КОГДА ЕСТЬNULL(БазаРаспределенияБезСчетУчетаЗатратРегл.Количество,0)=0
		|			ТОГДА 0
		|		ИНАЧЕ ТаблицаРаспределенияНачальная.Сумма * РасходыБезСчетУчетаЗатратРегл.Количество / БазаРаспределенияБезСчетУчетаЗатратРегл.Количество
		|	КОНЕЦ КАК ЧИСЛО(38, 28))) КАК Сумма
		// Kuzmich, 21.11.2025, (ONESOFT-4531) Закрытие месяца - ошибка в распределённых расходах
		|ПОМЕСТИТЬ ЗатратыНаРасходы
		|ИЗ
		|	РасходыБезСчетУчетаЗатратРегл КАК РасходыБезСчетУчетаЗатратРегл
		|		ЛЕВОЕ СОЕДИНЕНИЕ БазаРаспределенияБезСчетУчетаЗатратРегл КАК БазаРаспределенияБезСчетУчетаЗатратРегл
		|		ПО РасходыБезСчетУчетаЗатратРегл.Организация = БазаРаспределенияБезСчетУчетаЗатратРегл.Организация
		|			И РасходыБезСчетУчетаЗатратРегл.СтруктурнаяЕдиница = БазаРаспределенияБезСчетУчетаЗатратРегл.СтруктурнаяЕдиница
		|			И РасходыБезСчетУчетаЗатратРегл.СчетУчета = БазаРаспределенияБезСчетУчетаЗатратРегл.СчетУчета
		|			И РасходыБезСчетУчетаЗатратРегл.Номенклатура = БазаРаспределенияБезСчетУчетаЗатратРегл.Номенклатура
		|			И РасходыБезСчетУчетаЗатратРегл.Характеристика = БазаРаспределенияБезСчетУчетаЗатратРегл.Характеристика
		|			И РасходыБезСчетУчетаЗатратРегл.Партия = БазаРаспределенияБезСчетУчетаЗатратРегл.Партия
		|			И РасходыБезСчетУчетаЗатратРегл.ЗаказПокупателя = БазаРаспределенияБезСчетУчетаЗатратРегл.ЗаказПокупателя
		|			И РасходыБезСчетУчетаЗатратРегл.СчетУчетаРегл = БазаРаспределенияБезСчетУчетаЗатратРегл.СчетУчетаРегл
		|			И РасходыБезСчетУчетаЗатратРегл.Проект = БазаРаспределенияБезСчетУчетаЗатратРегл.Проект
		|			И РасходыБезСчетУчетаЗатратРегл.ДокументПоступления = БазаРаспределенияБезСчетУчетаЗатратРегл.ДокументПоступления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРаспределенияНачальная КАК ТаблицаРаспределенияНачальная
		|		ПО РасходыБезСчетУчетаЗатратРегл.Организация = ТаблицаРаспределенияНачальная.Организация
		|			И РасходыБезСчетУчетаЗатратРегл.СтруктурнаяЕдиница = ТаблицаРаспределенияНачальная.КоррСтруктурнаяЕдиница
		|			И РасходыБезСчетУчетаЗатратРегл.СчетУчета = ТаблицаРаспределенияНачальная.КоррСчетУчета
		|			И РасходыБезСчетУчетаЗатратРегл.Номенклатура = ТаблицаРаспределенияНачальная.КоррНоменклатура
		|			И РасходыБезСчетУчетаЗатратРегл.Характеристика = ТаблицаРаспределенияНачальная.КоррХарактеристика
		|			И РасходыБезСчетУчетаЗатратРегл.Партия = ТаблицаРаспределенияНачальная.КоррПартия
		|			И РасходыБезСчетУчетаЗатратРегл.ЗаказПокупателя = ТаблицаРаспределенияНачальная.КоррЗаказПокупателя
		|			И РасходыБезСчетУчетаЗатратРегл.СчетУчетаРегл = ТаблицаРаспределенияНачальная.КоррСчетУчетаРегл
		|			И РасходыБезСчетУчетаЗатратРегл.Проект = ТаблицаРаспределенияНачальная.КоррПроект
		|			И РасходыБезСчетУчетаЗатратРегл.ДокументПоступления = ТаблицаРаспределенияНачальная.КоррДокументПоступления
		// Kuzmich, 21.11.2025, (ONESOFT-4531) Закрытие месяца - ошибка в распределённых расходах
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходыБезСчетУчетаЗатратРегл.Организация,
		|	РасходыБезСчетУчетаЗатратРегл.СтруктурнаяЕдиница,
		|	РасходыБезСчетУчетаЗатратРегл.СчетУчета,
		|	РасходыБезСчетУчетаЗатратРегл.Номенклатура,
		|	РасходыБезСчетУчетаЗатратРегл.Характеристика,
		|	РасходыБезСчетУчетаЗатратРегл.Партия,
		|	РасходыБезСчетУчетаЗатратРегл.ЗаказПокупателя,
		|	РасходыБезСчетУчетаЗатратРегл.СчетУчетаРегл,
		|	РасходыБезСчетУчетаЗатратРегл.Проект,
		|	РасходыБезСчетУчетаЗатратРегл.ДокументПоступления
		// Kuzmich, 21.11.2025, (ONESOFT-4531) Закрытие месяца - ошибка в распределённых расходах
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаРаспределенияНачальная.УчетСебестоимостиВРазрезеОрганизации КАК УчетСебестоимостиВРазрезеОрганизации,
		|	ТаблицаРаспределенияНачальная.Организация КАК Организация,
		|	ТаблицаРаспределенияНачальная.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаРаспределенияНачальная.СчетУчета КАК СчетУчета,
		|	ТаблицаРаспределенияНачальная.Номенклатура КАК Номенклатура,
		|	ТаблицаРаспределенияНачальная.Характеристика КАК Характеристика,
		|	ТаблицаРаспределенияНачальная.Партия КАК Партия,
		|	ТаблицаРаспределенияНачальная.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ТаблицаРаспределенияНачальная.СчетУчетаРегл КАК СчетУчетаРегл,
		|	ТаблицаРаспределенияНачальная.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	ТаблицаРаспределенияНачальная.Проект КАК Проект,
		|	ТаблицаРаспределенияНачальная.ДокументПоступления КАК ДокументПоступления,
		|	ТаблицаРаспределенияНачальная.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
		|	ТаблицаРаспределенияНачальная.КоррСчетУчета КАК КоррСчетУчета,
		|	ТаблицаРаспределенияНачальная.КоррНоменклатура КАК КоррНоменклатура,
		|	ТаблицаРаспределенияНачальная.КоррХарактеристика КАК КоррХарактеристика,
		|	ТаблицаРаспределенияНачальная.КоррПартия КАК КоррПартия,
		|	ТаблицаРаспределенияНачальная.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
		|	ТаблицаРаспределенияНачальная.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл,
		|	ТаблицаРаспределенияНачальная.КоррПроект КАК КоррПроект,
		|	ТаблицаРаспределенияНачальная.КоррДокументПоступления КАК КоррДокументПоступления,
		|	0 КАК Количество,
		|	ТаблицаРаспределенияНачальная.Сумма КАК Сумма,
		//|	ВЫРАЗИТЬ(ЕСТЬNULL(ЗатратыНаРасходы.Сумма, 0) * ТаблицаРаспределенияНачальная.КоэффициентКорр КАК ЧИСЛО(38, 28)) КАК СуммаРасход,
		// Kuzmich, 23.12.2025, (ONESOFT-4595) «Закрытие месяца — пропорциональное распределение расходов»
		|	ВЫРАЗИТЬ(ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗатратыНаРасходы.Сумма, 0) * ТаблицаРаспределенияНачальная.КоэффициентКорр > ТаблицаРаспределенияНачальная.Сумма * ТаблицаРаспределенияНачальная.КоэффициентКорр
		|			И ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) > 0
		|			ТОГДА ТаблицаРаспределенияНачальная.Сумма * ТаблицаРаспределенияНачальная.КоэффициентКорр
		|		ИНАЧЕ ЕСТЬNULL(ЗатратыНаРасходы.Сумма, 0) * ТаблицаРаспределенияНачальная.КоэффициентКорр
		|	КОНЕЦ КАК ЧИСЛО(38, 28)) КАК СуммаРасход,
		// Kuzmich, 23.12.2025, (ONESOFT-4595) «Закрытие месяца — пропорциональное распределение расходов»
		|	ТаблицаРаспределенияНачальная.КоррСчетУчетаТипСчета КАК КоррСчетУчетаТипСчета,
		|	ТаблицаРаспределенияНачальная.Спецификация КАК Спецификация,
		|	ТаблицаРаспределенияНачальная.КоррСпецификация КАК КоррСпецификация,
		|	ТаблицаРаспределенияНачальная.ДокументПродажи КАК ДокументПродажи,
		|	ТаблицаРаспределенияНачальная.ЗаказПродажи КАК ЗаказПродажи,
		|	ТаблицаРаспределенияНачальная.Подразделение КАК Подразделение,
		|	ТаблицаРаспределенияНачальная.Ответственный КАК Ответственный,
		|	ТаблицаРаспределенияНачальная.СтавкаНДС КАК СтавкаНДС,
		|	ТаблицаРаспределенияНачальная.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
		|	ТаблицаРаспределенияНачальная.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
		|	ТаблицаРаспределенияНачальная.СчетУчетаТипСчета КАК СчетУчетаТипСчета,
		|	ТаблицаРаспределенияНачальная.СчетУчетаСписания КАК СчетУчетаСписания,
		|	ТаблицаРаспределенияНачальная.СчетУчетаСписанияРегл КАК СчетУчетаСписанияРегл,
		|	ТаблицаРаспределенияНачальная.СчетУчетаСписанияТипСчета КАК СчетУчетаСписанияТипСчета,
		|	ТаблицаРаспределенияНачальная.НаправлениеДеятельностиСписания КАК НаправлениеДеятельностиСписания,
		|	ТаблицаРаспределенияНачальная.РозничнаяСтруктурнаяЕдиница КАК РозничнаяСтруктурнаяЕдиница,
		|	ТаблицаРаспределенияНачальная.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
		|	ТаблицаРаспределенияНачальная.НоменклатураКатегорияНоменклатуры КАК НоменклатураКатегорияНоменклатуры,
		|	ТаблицаРаспределенияНачальная.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельностиПродажи,
		|	ТаблицаРаспределенияНачальная.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
		|	ТаблицаРаспределенияНачальная.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
		|	ТаблицаРаспределенияНачальная.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета
		|ИЗ
		|	ТаблицаРаспределенияНачальная КАК ТаблицаРаспределенияНачальная
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗатратыНаРасходы КАК ЗатратыНаРасходы
		|		ПО ТаблицаРаспределенияНачальная.Организация = ЗатратыНаРасходы.Организация
		|			И ТаблицаРаспределенияНачальная.КоррСтруктурнаяЕдиница = ЗатратыНаРасходы.СтруктурнаяЕдиница
		|			И ТаблицаРаспределенияНачальная.КоррСчетУчета = ЗатратыНаРасходы.СчетУчета
		|			И ТаблицаРаспределенияНачальная.КоррНоменклатура = ЗатратыНаРасходы.Номенклатура
		|			И ТаблицаРаспределенияНачальная.КоррХарактеристика = ЗатратыНаРасходы.Характеристика
		|			И ТаблицаРаспределенияНачальная.КоррПартия = ЗатратыНаРасходы.Партия
		|			И ТаблицаРаспределенияНачальная.КоррЗаказПокупателя = ЗатратыНаРасходы.ЗаказПокупателя
		|			И ТаблицаРаспределенияНачальная.КоррСчетУчетаРегл = ЗатратыНаРасходы.СчетУчетаРегл
		|			И ТаблицаРаспределенияНачальная.КоррПроект = ЗатратыНаРасходы.Проект
		|			И ТаблицаРаспределенияНачальная.КоррДокументПоступления = ЗатратыНаРасходы.ДокументПоступления
		// Kuzmich, 23.12.2025, (ONESOFT-4595) «Закрытие месяца — пропорциональное распределение расходов»
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(&ДатаКонМоментВремени,) КАК ЗапасыОстатки
		|			ПО ТаблицаРаспределенияНачальная.Организация = ЗапасыОстатки.Организация
		|			И ТаблицаРаспределенияНачальная.КоррСтруктурнаяЕдиница = ЗапасыОстатки.СтруктурнаяЕдиница
		|			И ТаблицаРаспределенияНачальная.КоррСчетУчета = ЗапасыОстатки.СчетУчета
		|			И ТаблицаРаспределенияНачальная.КоррНоменклатура = ЗапасыОстатки.Номенклатура
		|			И ТаблицаРаспределенияНачальная.КоррХарактеристика = ЗапасыОстатки.Характеристика
		|			И ТаблицаРаспределенияНачальная.КоррПартия = ЗапасыОстатки.Партия
		|			И ТаблицаРаспределенияНачальная.КоррЗаказПокупателя = ЗапасыОстатки.ЗаказПокупателя
		|			И ТаблицаРаспределенияНачальная.КоррСчетУчетаРегл = ЗапасыОстатки.СчетУчетаРегл
		//|			И ТаблицаРаспределенияНачальная.КоррСчетУчетаЗатратРегл = ЗапасыОстатки.СчетУчетаЗатратРегл
		|			И ТаблицаРаспределенияНачальная.КоррПроект = ЗапасыОстатки.Проект
		|			И ТаблицаРаспределенияНачальная.КоррДокументПоступления = ЗапасыОстатки.ДокументПоступления
		// Kuzmich, 23.12.2025, (ONESOFT-4595) «Закрытие месяца — пропорциональное распределение расходов»
		|";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаРаспределения = РезультатЗапроса.Выгрузить();
	
	ОбработкаОшибокОкругленияТаблицаРаспределения_ОтключениеУсреднения(ТаблицаРаспределения);
	
	СформироватьКорректирующиеДвиженияПоРегиструУчетаЗатрат_ОтключениеУсреднения(ТаблицаРаспределения);
	
	// 3.Запоминаем текущую базу распределения как новые затраты в регистре УзлыКорректировкиСтоимостиСписания
	// И продолжаем рекурсивный цикл распределения затрат по расходам.
	НоваяТаблицаРаспределения = ТаблицаРаспределения.Скопировать();
	//НоваяТаблицаРаспределения.Свернуть("Организация,КоррСтруктурнаяЕдиница,КоррСчетУчета,КоррНоменклатура,КоррХарактеристика,КоррПартия,КоррЗаказПокупателя,КоррСчетУчетаРегл,КоррПроект,КоррДокументПоступления","Сумма");
	// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
	НоваяТаблицаРаспределения.Свернуть("Организация,КоррСтруктурнаяЕдиница,КоррСчетУчета,КоррНоменклатура,КоррХарактеристика,КоррПартия,КоррЗаказПокупателя,КоррСчетУчетаРегл,КоррПроект,КоррДокументПоступления,СчетУчетаЗатратРегл","СуммаРасход");
	// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
	
	НоваяТаблицаРаспределения.Колонки.КоррСтруктурнаяЕдиница.Имя = "СтруктурнаяЕдиница";
	НоваяТаблицаРаспределения.Колонки.КоррСчетУчета.Имя = "СчетУчета";
	НоваяТаблицаРаспределения.Колонки.КоррНоменклатура.Имя = "Номенклатура";
	НоваяТаблицаРаспределения.Колонки.КоррХарактеристика.Имя = "Характеристика";
	НоваяТаблицаРаспределения.Колонки.КоррПартия.Имя = "Партия";
	НоваяТаблицаРаспределения.Колонки.КоррЗаказПокупателя.Имя = "ЗаказПокупателя";
	НоваяТаблицаРаспределения.Колонки.КоррСчетУчетаРегл.Имя = "СчетУчетаРегл";
	НоваяТаблицаРаспределения.Колонки.КоррПроект.Имя = "Проект";
	НоваяТаблицаРаспределения.Колонки.КоррДокументПоступления.Имя = "ДокументПоступления";
	// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
	НоваяТаблицаРаспределения.Колонки.СуммаРасход.Имя = "Сумма";
	// Kuzmich, 18.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи
	
	МассивДляУдаленияСтрок = Новый Массив();
	
	Для Каждого СтрокаНоваяТаблицаРаспределения ИЗ НоваяТаблицаРаспределения Цикл
	
		Если НЕ(ЗначениеЗаполнено(СтрокаНоваяТаблицаРаспределения.СтруктурнаяЕдиница))
			ИЛИ НЕ(ЗначениеЗаполнено(СтрокаНоваяТаблицаРаспределения.Номенклатура))
			ИЛИ СтрокаНоваяТаблицаРаспределения.Сумма=0
			Тогда
		
			МассивДляУдаленияСтрок.Добавить(СтрокаНоваяТаблицаРаспределения);
		
		КонецЕсли;
	
	КонецЦикла;
	
	Для каждого СтрокаМассивДляУдаленияСтрок Из МассивДляУдаленияСтрок Цикл
	
		НоваяТаблицаРаспределения.Удалить(СтрокаМассивДляУдаленияСтрок);
	
	КонецЦикла;
	
	Если НоваяТаблицаРаспределения.Количество()>0 Тогда		
		
		НомерУзла = 0; 
		ЗапросПоУзлам = Новый Запрос;
		ЗапросПоУзлам.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(УзлыКорректировкиСтоимостиСписания.НомерУзла) КАК НомерУзла
		|ИЗ
		|	РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
		|ГДЕ
		|	УзлыКорректировкиСтоимостиСписания.Регистратор = &Ссылка";
		
		ЗапросПоУзлам.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапросаЗапросПоУзлам = ЗапросПоУзлам.Выполнить();
		
		ВыборкаДетальныеЗаписиЗапросПоУзлам = РезультатЗапросаЗапросПоУзлам.Выбрать();
		
		Если ВыборкаДетальныеЗаписиЗапросПоУзлам.Следующий() Тогда
			НомерУзла = ВыборкаДетальныеЗаписиЗапросПоУзлам.НомерУзла;
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.УзлыКорректировкиСтоимостиСписания.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписей.Записать(Истина);
		Для Каждого СтрокаНоваяТаблицаРаспределения ИЗ НоваяТаблицаРаспределения Цикл
			НомерУзла = НомерУзла + 1;
			НовыйУзел = НаборЗаписей.Добавить();
			НовыйУзел.НомерУзла = НомерУзла;
			НовыйУзел.Регистратор = Ссылка;
			НовыйУзел.Период = Дата;
			ЗаполнитьЗначенияСвойств(НовыйУзел, СтрокаНоваяТаблицаРаспределения);
		КонецЦикла;
		НаборЗаписей.Записать(Ложь);
		
		РаспределитьЗатратыНаФактическуюСебестоимостьВыпускаПоРсходам_ОтключениеУсреднения(Отказ, НоваяТаблицаРаспределения, ВидОперации, ТаблицаОшибок)
	
	КонецЕсли;

КонецПроцедуры
// Kuzmich, 28.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи, исправление ошибок округления на SQL
// Процедура распределения зависших сумм без количества (ошибки округления).
//
//
Процедура РаспределитьСуммыБезКоличества_ОтключениеУсреднения(ВидОперации, ТаблицаОшибок)
	
	УчетСебестоимостиВРазрезеОрганизации = ДополнительныеСвойства.УчетнаяПолитика.УчетСебестоимостиВРазрезеОрганизации;
	
	ДатаНач = ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода;
	ДатаКон = ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериод;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	//Запрос.УстановитьПараметр("ЗакрыватьПоРеглПлануСчетов", ИспользоватьТолькоРегламентированныйПланСчетов);
	Запрос.УстановитьПараметр("УчетСебестоимостиВРазрезеОрганизации", УчетСебестоимостиВРазрезеОрганизации);	
	Запрос.УстановитьПараметр("ГраницаДатаКон", Новый Граница(ДатаКон, ВидГраницы.Включая));
	//Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапасыОстатки.Организация КАК Организация,
		|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
		|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыОстатки.Характеристика КАК Характеристика,
		|	ЗапасыОстатки.Партия КАК Партия,
		|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ЗапасыОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
		//|	ЗапасыОстатки.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
		|	ЗапасыОстатки.Проект КАК Проект,
		|	ЗапасыОстатки.ДокументПоступления КАК ДокументПоступления,
		|	ВЫБОР
		|		КОГДА (ЗапасыОстатки.Номенклатура.НаправлениеДеятельности ЕСТЬ NULL) ИЛИ (ЗапасыОстатки.Номенклатура.НаправлениеДеятельности = НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ОсновноеНаправление)
		|		ИНАЧЕ ЗапасыОстатки.Номенклатура.НаправлениеДеятельности
		|	КОНЕЦ НаправлениеДеятельности,
		|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ЗапасыОстатки.СуммаОстаток) КАК СуммаОстаток
		|ПОМЕСТИТЬ УчетЗатратОстаткиПРЕД
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(&ГраницаДатаКон, Организация = &Организация И НЕ(Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))) КАК ЗапасыОстатки
		|ГДЕ
		|	ЗапасыОстатки.КоличествоОстаток = 0
		|	И ЗапасыОстатки.СуммаОстаток МЕЖДУ -1 И 1
		//|	И ЗапасыОстатки.СуммаОстаток <> 0
		//|	ВЫБОР
		//|		КОГДА &ЗакрыватьПоРеглПлануСчетов
		//|			ТОГДА ЗапасыОстатки.СчетУчетаРегл.ТипСчета
		//|		ИНАЧЕ ЗапасыОстатки.СчетУчета.ТипСчета
		//|	КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Запасы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыОстатки.Организация,
		|	ЗапасыОстатки.СтруктурнаяЕдиница,
		|	ЗапасыОстатки.СчетУчета,
		|	ЗапасыОстатки.Номенклатура,
		|	ЗапасыОстатки.Характеристика,
		|	ЗапасыОстатки.Партия,
		|	ЗапасыОстатки.ЗаказПокупателя,
		|	ЗапасыОстатки.СчетУчетаРегл,
		//|	ЗапасыОстатки.СчетУчетаЗатратРегл,
		|	ЗапасыОстатки.ДокументПоступления ,
		|	ЗапасыОстатки.Проект,
		|	ВЫБОР
		|		КОГДА (ЗапасыОстатки.Номенклатура.НаправлениеДеятельности ЕСТЬ NULL) ИЛИ (ЗапасыОстатки.Номенклатура.НаправлениеДеятельности = НЕОПРЕДЕЛЕНО)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ОсновноеНаправление)
		|		ИНАЧЕ ЗапасыОстатки.Номенклатура.НаправлениеДеятельности
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		//|	СчетУчетаЗатратРегл,
		|	Проект,
		|	ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МИНИМУМ(Запасы.Регистратор) КАК Регистратор,
		|	Запасы.Организация КАК Организация,
		|	Запасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	Запасы.СчетУчета КАК СчетУчета,
		|	Запасы.Номенклатура КАК Номенклатура,
		|	Запасы.Характеристика КАК Характеристика,
		|	Запасы.Партия КАК Партия,
		|	Запасы.ЗаказПокупателя КАК ЗаказПокупателя,
		|	Запасы.СчетУчетаРегл КАК СчетУчетаРегл,
		|	Запасы.Проект КАК Проект,
		|	Запасы.ДокументПоступления КАК ДокументПоступления
		|ПОМЕСТИТЬ ЗапасыДвиженияРасходРегистратор
		|ИЗ
		|	РегистрНакопления.Запасы КАК Запасы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УчетЗатратОстаткиПРЕД КАК УчетЗатратОстатки
		|		ПО Запасы.Организация = УчетЗатратОстатки.Организация
		|			И Запасы.СтруктурнаяЕдиница = УчетЗатратОстатки.СтруктурнаяЕдиница
		|			И Запасы.Номенклатура = УчетЗатратОстатки.Номенклатура
		|			И Запасы.Характеристика = УчетЗатратОстатки.Характеристика
		|			И Запасы.Партия = УчетЗатратОстатки.Партия
		|			И Запасы.ЗаказПокупателя = УчетЗатратОстатки.ЗаказПокупателя
		|			И Запасы.Проект = УчетЗатратОстатки.Проект
		|			И Запасы.ДокументПоступления = УчетЗатратОстатки.ДокументПоступления
		|ГДЕ
		|	Запасы.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И Запасы.Организация = &Организация
		|	И НЕ Запасы.ФиксированнаяСтоимость
		|	И (Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И НЕ Запасы.Возврат
		|			ИЛИ Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И Запасы.Возврат)
		|	И НЕ Запасы.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И (Запасы.КоррСчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
		|			ИЛИ Запасы.КоррСчетУчетаРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
		|			ИЛИ Запасы.КоррСчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
		|			ИЛИ Запасы.КоррСчетУчетаРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты))
		|
		|СГРУППИРОВАТЬ ПО
		|	Запасы.Организация,
		|	Запасы.СтруктурнаяЕдиница,
		|	Запасы.СчетУчета,
		|	Запасы.Номенклатура,
		|	Запасы.Характеристика,
		|	Запасы.Партия,
		|	Запасы.ЗаказПокупателя,
		|	Запасы.СчетУчетаРегл,
		|	Запасы.Проект,
		|	Запасы.ДокументПоступления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	СтруктурнаяЕдиница,
		|	СчетУчета,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	СчетУчетаРегл,
		|	Проект,
		|	ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Запасы.Регистратор КАК Регистратор,
		|	Запасы.Организация КАК Организация,
		|	Запасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	Запасы.СчетУчета КАК СчетУчета,
		|	Запасы.Номенклатура КАК Номенклатура,
		|	Запасы.Характеристика КАК Характеристика,
		|	Запасы.Партия КАК Партия,
		|	Запасы.ЗаказПокупателя КАК ЗаказПокупателя,
		|	Запасы.СчетУчетаРегл КАК СчетУчетаРегл,
		|	Запасы.Проект КАК Проект,
		|	Запасы.ДокументПоступления КАК ДокументПоступления,
		|	МИНИМУМ(Запасы.КоррСтруктурнаяЕдиница) КАК КоррСтруктурнаяЕдиница,
		|	МИНИМУМ(Запасы.КоррСчетУчета) КАК КоррСчетУчета,
		|	МИНИМУМ(Запасы.КоррСчетУчетаРегл) КАК КоррСчетУчетаРегл,
		|	МИНИМУМ(Запасы.КоррПроект) КАК КоррПроект
		|ПОМЕСТИТЬ ЗапасыДвиженияРасходКоррСчета
		|ИЗ
		|	РегистрНакопления.Запасы КАК Запасы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УчетЗатратОстаткиПРЕД КАК УчетЗатратОстатки
		|		ПО Запасы.Организация = УчетЗатратОстатки.Организация
		|			И Запасы.СтруктурнаяЕдиница = УчетЗатратОстатки.СтруктурнаяЕдиница
		|			И Запасы.Номенклатура = УчетЗатратОстатки.Номенклатура
		|			И Запасы.Характеристика = УчетЗатратОстатки.Характеристика
		|			И Запасы.Партия = УчетЗатратОстатки.Партия
		|			И Запасы.ЗаказПокупателя = УчетЗатратОстатки.ЗаказПокупателя
		|			И Запасы.Проект = УчетЗатратОстатки.Проект
		|			И Запасы.ДокументПоступления = УчетЗатратОстатки.ДокументПоступления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗапасыДвиженияРасходРегистратор КАК ЗапасыДвиженияРасходРегистратор
		|		ПО Запасы.Организация = ЗапасыДвиженияРасходРегистратор.Организация
		|			И Запасы.СтруктурнаяЕдиница = ЗапасыДвиженияРасходРегистратор.СтруктурнаяЕдиница
		|			И Запасы.Номенклатура = ЗапасыДвиженияРасходРегистратор.Номенклатура
		|			И Запасы.Характеристика = ЗапасыДвиженияРасходРегистратор.Характеристика
		|			И Запасы.Партия = ЗапасыДвиженияРасходРегистратор.Партия
		|			И Запасы.ЗаказПокупателя = ЗапасыДвиженияРасходРегистратор.ЗаказПокупателя
		|			И Запасы.Проект = ЗапасыДвиженияРасходРегистратор.Проект
		|			И Запасы.ДокументПоступления = ЗапасыДвиженияРасходРегистратор.ДокументПоступления
		|			И Запасы.Регистратор = ЗапасыДвиженияРасходРегистратор.Регистратор
		|ГДЕ
		|	Запасы.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И Запасы.Организация = &Организация
		|	И НЕ Запасы.ФиксированнаяСтоимость
		|	И (Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И НЕ Запасы.Возврат
		|			ИЛИ Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И Запасы.Возврат)
		|	И НЕ Запасы.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И (Запасы.КоррСчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
		|			ИЛИ Запасы.КоррСчетУчетаРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
		|			ИЛИ Запасы.КоррСчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
		|			ИЛИ Запасы.КоррСчетУчетаРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты))
		|
		|СГРУППИРОВАТЬ ПО
		|	Запасы.Регистратор,
		|	Запасы.Организация,
		|	Запасы.СтруктурнаяЕдиница,
		|	Запасы.СчетУчета,
		|	Запасы.Номенклатура,
		|	Запасы.Характеристика,
		|	Запасы.Партия,
		|	Запасы.ЗаказПокупателя,
		|	Запасы.СчетУчетаРегл,
		|	Запасы.Проект,
		|	Запасы.ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УчетЗатратОстатки.Организация КАК Организация,
		|	УчетЗатратОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	УчетЗатратОстатки.СчетУчета КАК СчетУчета,
		|	УчетЗатратОстатки.Номенклатура КАК Номенклатура,
		|	УчетЗатратОстатки.Характеристика КАК Характеристика,
		|	УчетЗатратОстатки.Партия КАК Партия,
		|	УчетЗатратОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
		|	УчетЗатратОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
		|	УчетЗатратОстатки.Проект КАК Проект,
		|	УчетЗатратОстатки.ДокументПоступления КАК ДокументПоступления,
		|	УчетЗатратОстатки.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	УчетЗатратОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	УчетЗатратОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ЗапасыДвиженияРасходКоррСчета.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
		|	ЗапасыДвиженияРасходКоррСчета.КоррСчетУчета КАК КоррСчетУчета,
		|	ЗапасыДвиженияРасходКоррСчета.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл,
		|	ЗапасыДвиженияРасходКоррСчета.КоррПроект КАК КоррПроект
		|ПОМЕСТИТЬ УчетЗатратОстатки
		|ИЗ
		|	УчетЗатратОстаткиПРЕД КАК УчетЗатратОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗапасыДвиженияРасходКоррСчета КАК ЗапасыДвиженияРасходКоррСчета
		|		ПО УчетЗатратОстатки.Организация = ЗапасыДвиженияРасходКоррСчета.Организация
		|			И УчетЗатратОстатки.СтруктурнаяЕдиница = ЗапасыДвиженияРасходКоррСчета.СтруктурнаяЕдиница
		|			И УчетЗатратОстатки.Номенклатура = ЗапасыДвиженияРасходКоррСчета.Номенклатура
		|			И УчетЗатратОстатки.Характеристика = ЗапасыДвиженияРасходКоррСчета.Характеристика
		|			И УчетЗатратОстатки.Партия = ЗапасыДвиженияРасходКоррСчета.Партия
		|			И УчетЗатратОстатки.ЗаказПокупателя = ЗапасыДвиженияРасходКоррСчета.ЗаказПокупателя
		|			И УчетЗатратОстатки.Проект = ЗапасыДвиженияРасходКоррСчета.Проект
		|			И УчетЗатратОстатки.ДокументПоступления = ЗапасыДвиженияРасходКоррСчета.ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ДоходыИРасходы.Регистратор) КАК Регистратор,
		|	Запасы.Организация КАК Организация,
		|	Запасы.Номенклатура КАК Номенклатура,
		|	Запасы.Характеристика КАК Характеристика,
		|	Запасы.Партия КАК Партия,
		|	Запасы.ЗаказПокупателя КАК ЗаказПокупателя,
		|	Запасы.Проект КАК Проект,
		|	Запасы.ДокументПоступления КАК ДокументПоступления
		|ПОМЕСТИТЬ ДоходыИРасходыРегистратор
		|ИЗ
		|	РегистрНакопления.ДоходыИРасходы КАК ДоходыИРасходы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы КАК Запасы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ УчетЗатратОстатки КАК УчетЗатратОстатки
		|			ПО Запасы.Организация = УчетЗатратОстатки.Организация
		|				И Запасы.СтруктурнаяЕдиница = УчетЗатратОстатки.СтруктурнаяЕдиница
		|				И Запасы.Номенклатура = УчетЗатратОстатки.Номенклатура
		|				И Запасы.Характеристика = УчетЗатратОстатки.Характеристика
		|				И Запасы.Партия = УчетЗатратОстатки.Партия
		|				И Запасы.ЗаказПокупателя = УчетЗатратОстатки.ЗаказПокупателя
		|				И Запасы.Проект = УчетЗатратОстатки.Проект
		|				И Запасы.ДокументПоступления = УчетЗатратОстатки.ДокументПоступления
		|				И (Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|						И НЕ Запасы.Возврат
		|					ИЛИ Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|						И Запасы.Возврат)
		|		ПО (Запасы.Регистратор = ДоходыИРасходы.Регистратор)
		|			И (Запасы.Организация = ДоходыИРасходы.Организация)
		|			И (Запасы.Номенклатура = ДоходыИРасходы.Аналитика)
		|			И (Запасы.Проект = ДоходыИРасходы.Проект)
		|			И (ДоходыИРасходы.СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
		|				ИЛИ ДоходыИРасходы.СчетУчетаРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы))
		|			И (ДоходыИРасходы.СуммаРасходов <> 0)
		|ГДЕ
		|	Запасы.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|СГРУППИРОВАТЬ ПО
		|	Запасы.Организация,
		|	Запасы.Номенклатура,
		|	Запасы.Характеристика,
		|	Запасы.Партия,
		|	Запасы.ЗаказПокупателя,
		|	Запасы.Проект,
		|	Запасы.ДокументПоступления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	Проект,
		|	ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыИРасходы.Регистратор КАК Регистратор,
		|	МИНИМУМ(ДоходыИРасходы.СчетУчета) КАК СчетУчета,
		|	МИНИМУМ(ДоходыИРасходы.СчетУчетаРегл) КАК СчетУчетаРегл,
		|	МИНИМУМ(ДоходыИРасходы.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиница,
		|	ДоходыИРасходыРегистратор.Организация КАК Организация,
		|	ДоходыИРасходыРегистратор.Номенклатура КАК Номенклатура,
		|	ДоходыИРасходыРегистратор.Характеристика КАК Характеристика,
		|	ДоходыИРасходыРегистратор.Партия КАК Партия,
		|	ДоходыИРасходыРегистратор.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ДоходыИРасходыРегистратор.Проект КАК Проект,
		|	ДоходыИРасходыРегистратор.ДокументПоступления КАК ДокументПоступления
		|ПОМЕСТИТЬ ДоходыИРасходы
		|ИЗ
		|	РегистрНакопления.ДоходыИРасходы КАК ДоходыИРасходы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДоходыИРасходыРегистратор КАК ДоходыИРасходыРегистратор
		|			ПО ДоходыИРасходы.Регистратор = ДоходыИРасходыРегистратор.Регистратор
		|			И (ДоходыИРасходы.Организация = ДоходыИРасходыРегистратор.Организация)
		|			И (ДоходыИРасходы.Аналитика = ДоходыИРасходыРегистратор.Номенклатура)
		|			И (ДоходыИРасходы.Проект = ДоходыИРасходыРегистратор.Проект)
		|			И (ДоходыИРасходы.СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
		|				ИЛИ ДоходыИРасходы.СчетУчетаРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы))
		|			И (ДоходыИРасходы.СуммаРасходов <> 0)
		|			
		|СГРУППИРОВАТЬ ПО
		|	ДоходыИРасходы.Регистратор,
		|	ДоходыИРасходыРегистратор.Организация,
		|	ДоходыИРасходыРегистратор.Номенклатура,
		|	ДоходыИРасходыРегистратор.Характеристика,
		|	ДоходыИРасходыРегистратор.Партия,
		|	ДоходыИРасходыРегистратор.ЗаказПокупателя,
		|	ДоходыИРасходыРегистратор.Проект,
		|	ДоходыИРасходыРегистратор.ДокументПоступления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор,
		|	СчетУчета,
		|	СчетУчетаРегл,
		|	СтруктурнаяЕдиница,
		|	Организация,
		|	Номенклатура,
		|	Характеристика,
		|	Партия,
		|	ЗаказПокупателя,
		|	Проект,
		|	ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&УчетСебестоимостиВРазрезеОрганизации КАК УчетСебестоимостиВРазрезеОрганизации,
		|	УчетЗатратОстатки.Организация КАК Организация,
		|	УчетЗатратОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	УчетЗатратОстатки.СчетУчета КАК СчетУчета,
		|	УчетЗатратОстатки.СчетУчета.ТипСчета КАК СчетУчетаТипСчета,
		|	УчетЗатратОстатки.Номенклатура КАК Номенклатура,
		|	УчетЗатратОстатки.Характеристика КАК Характеристика,
		|	УчетЗатратОстатки.Партия КАК Партия, 
		|	УчетЗатратОстатки.Проект КАК Проект,      
		|	УчетЗатратОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
		|	УчетЗатратОстатки.СуммаОстаток КАК Сумма,
		|	ЕСТЬNULL(ДоходыИРасходы.СтруктурнаяЕдиница, УчетЗатратОстатки.КоррСтруктурнаяЕдиница) КАК КоррСтруктурнаяЕдиница,
		|	НЕОПРЕДЕЛЕНО КАК Спецификация, 
		|	НЕОПРЕДЕЛЕНО КАК КоррСпецификация,
		|	ЕСТЬNULL(ДоходыИРасходы.СчетУчета, УчетЗатратОстатки.КоррСчетУчета) КАК КоррСчетУчета,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ДоходыИРасходы.СчетУчета, УчетЗатратОстатки.КоррСчетУчета) КАК ПланСчетов.Управленческий).ТипСчета КАК КоррСчетУчетаТипСчета,
		|	УчетЗатратОстатки.Номенклатура КАК КоррНоменклатура,
		|	УчетЗатратОстатки.Характеристика КАК КоррХарактеристика,
		|	УчетЗатратОстатки.Партия КАК КоррПартия,
		|	ЕСТЬNULL(ДоходыИРасходы.Проект, УчетЗатратОстатки.КоррПроект) КАК КоррПроект,      
		|	УчетЗатратОстатки.ЗаказПокупателя КАК КоррЗаказПокупателя,
		|	НЕОПРЕДЕЛЕНО КАК ДокументПродажи,
		|	НЕОПРЕДЕЛЕНО КАК ЗаказПродажи,
		|	НЕОПРЕДЕЛЕНО КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК Ответственный,
		|	НЕОПРЕДЕЛЕНО КАК СтавкаНДС,
		|	ЛОЖЬ КАК ЗатратыНаВыпуск,
		|	УчетЗатратОстатки.Номенклатура.КатегорияНоменклатуры КАК НоменклатураКатегорияНоменклатуры,
		//|	УчетЗатратОстатки.НаправлениеДеятельности КАК НаправлениеДеятельностиПродажи,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиПродажи,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиСписания,
		//|	УчетЗатратОстатки.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
		//|	УчетЗатратОстатки.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета, 
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета,
		|	НЕОПРЕДЕЛЕНО КАК СчетУчетаСписания,
		|	НЕОПРЕДЕЛЕНО КАК СчетУчетаСписанияРегл,
		|	НЕОПРЕДЕЛЕНО КАК СчетУчетаСписанияТипСчета,
		|	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиницаПолучатель,
		|	ЛОЖЬ КАК ПеремещениеВРозницуСуммовойУчет,
		|	НЕОПРЕДЕЛЕНО КАК РозничнаяСтруктурнаяЕдиница,
		|	УчетЗатратОстатки.СчетУчетаРегл КАК СчетУчетаРегл,
		|	ЕСТЬNULL(ДоходыИРасходы.СчетУчетаРегл, УчетЗатратОстатки.КоррСчетУчетаРегл) КАК КоррСчетУчетаРегл,
		//|	УчетЗатратОстатки.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
		|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
		|	УчетЗатратОстатки.ДокументПоступления КАК ДокументПоступления,
		|	НЕОПРЕДЕЛЕНО КАК КоррДокументПоступления
		|ПОМЕСТИТЬ РезультатПРЕД
		|ИЗ
		|	УчетЗатратОстатки КАК УчетЗатратОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДоходыИРасходы КАК ДоходыИРасходы
		|			ПО ДоходыИРасходы.Организация = УчетЗатратОстатки.Организация
		//|			И ДоходыИРасходы.СтруктурнаяЕдиница = УчетЗатратОстатки.СтруктурнаяЕдиница
		|			И ДоходыИРасходы.Номенклатура = УчетЗатратОстатки.Номенклатура
		|			И ДоходыИРасходы.Характеристика = УчетЗатратОстатки.Характеристика
		|			И ДоходыИРасходы.Партия = УчетЗатратОстатки.Партия
		|			И ДоходыИРасходы.ЗаказПокупателя = УчетЗатратОстатки.ЗаказПокупателя
		|			И ДоходыИРасходы.Проект = УчетЗатратОстатки.Проект
		|			И ДоходыИРасходы.ДокументПоступления = УчетЗатратОстатки.ДокументПоступления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезультатПРЕД.УчетСебестоимостиВРазрезеОрганизации КАК УчетСебестоимостиВРазрезеОрганизации,
		|	РезультатПРЕД.Организация КАК Организация,
		|	РезультатПРЕД.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	РезультатПРЕД.СчетУчета КАК СчетУчета,
		|	РезультатПРЕД.СчетУчетаТипСчета КАК СчетУчетаТипСчета,
		|	РезультатПРЕД.Номенклатура КАК Номенклатура,
		|	РезультатПРЕД.Характеристика КАК Характеристика,
		|	РезультатПРЕД.Партия КАК Партия,
		|	РезультатПРЕД.Проект КАК Проект,
		|	РезультатПРЕД.ЗаказПокупателя КАК ЗаказПокупателя,
		|	РезультатПРЕД.Сумма КАК Сумма,
		|	РезультатПРЕД.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
		|	РезультатПРЕД.Спецификация КАК Спецификация,
		|	РезультатПРЕД.КоррСпецификация КАК КоррСпецификация,
		|	РезультатПРЕД.КоррСчетУчета КАК КоррСчетУчета,
		|	РезультатПРЕД.КоррСчетУчетаТипСчета КАК КоррСчетУчетаТипСчета,
		|	РезультатПРЕД.КоррНоменклатура КАК КоррНоменклатура,
		|	РезультатПРЕД.КоррХарактеристика КАК КоррХарактеристика,
		|	РезультатПРЕД.КоррПартия КАК КоррПартия,
		|	РезультатПРЕД.КоррПроект КАК КоррПроект,
		|	РезультатПРЕД.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
		|	РезультатПРЕД.ДокументПродажи КАК ДокументПродажи,
		|	РезультатПРЕД.ЗаказПродажи КАК ЗаказПродажи,
		|	РезультатПРЕД.Подразделение КАК Подразделение,
		|	РезультатПРЕД.Ответственный КАК Ответственный,
		|	РезультатПРЕД.СтавкаНДС КАК СтавкаНДС,
		|	РезультатПРЕД.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
		|	РезультатПРЕД.НоменклатураКатегорияНоменклатуры КАК НоменклатураКатегорияНоменклатуры,
		|	РезультатПРЕД.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельностиПродажи,
		|	РезультатПРЕД.НаправлениеДеятельностиСписания КАК НаправлениеДеятельностиСписания,
		|	РезультатПРЕД.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
		|	РезультатПРЕД.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета,
		|	РезультатПРЕД.СчетУчетаСписания КАК СчетУчетаСписания,
		|	РезультатПРЕД.СчетУчетаСписанияРегл КАК СчетУчетаСписанияРегл,
		|	РезультатПРЕД.СчетУчетаСписанияТипСчета КАК СчетУчетаСписанияТипСчета,
		|	РезультатПРЕД.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
		|	РезультатПРЕД.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
		|	РезультатПРЕД.РозничнаяСтруктурнаяЕдиница КАК РозничнаяСтруктурнаяЕдиница,
		|	РезультатПРЕД.СчетУчетаРегл КАК СчетУчетаРегл,
		|	РезультатПРЕД.КоррСчетУчетаРегл КАК КоррСчетУчетаРегл,
		|	РезультатПРЕД.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажРегл,
		|	РезультатПРЕД.ДокументПоступления КАК ДокументПоступления,
		|	РезультатПРЕД.КоррДокументПоступления КАК КоррДокументПоступления
		|ИЗ
		|	РезультатПРЕД КАК РезультатПРЕД
		|ГДЕ
		|	НЕ(
		|	(РезультатПРЕД.КоррСчетУчета ЕСТЬ NULL) ИЛИ (РезультатПРЕД.КоррСчетУчета = НЕОПРЕДЕЛЕНО) ИЛИ (РезультатПРЕД.КоррСчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка))
		|	)
		|	ИЛИ
		|	НЕ(
		|	(РезультатПРЕД.КоррСчетУчетаРегл ЕСТЬ NULL) ИЛИ (РезультатПРЕД.КоррСчетУчетаРегл = НЕОПРЕДЕЛЕНО) ИЛИ (РезультатПРЕД.КоррСчетУчетаРегл = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка))
		|	)
	    |";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаРаспределения = РезультатЗапроса.Выгрузить();
		
	СформироватьКорректирующиеДвиженияПоРегиструУчетаЗатрат_ОтключениеУсреднения(ТаблицаРаспределения);
	
КонецПроцедуры // РаспределитьСуммыБезКоличества()
// Kuzmich, 28.11.2025, (ONESOFT-4515) Закрытие месяца - распределение накладных (прямих) расходов на расходы пропорционально списанию/продажи, исправление ошибок округления на SQL
#КонецОбласти
// Kuzmich, 23.10.2025, (ONESOFT-4400) Отключение функционала усреднение остатков в конфигурации УНФ

//ЗакрыватьПоРеглПлануСчетов = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьРегламентированныйПланСчетов")
//								И ЭтотОбъект.Дата > УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ДатаНачалаИспользованияРеглПланаСчетов");
ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата),Дата,ТекущаяДата()));//+++ Дмгг
#КонецЕсли
