
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресСтруктурыВХранилище = Параметры.АдресСтруктурыВХранилище;
	СтруктураЗаполнения = ПолучитьИзВременногоХранилища(АдресСтруктурыВХранилище);
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураЗаполнения);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПодборВХранилище()
	
	СтруктураВозврата = Новый Структура("ВидНачисленияУдержания, ВидНалогаНДФЛ, СчетДоходовБП, ТолькоНеЗаполеные, ВидУдержанияПФ", ВидНачисленияУдержания, ВидНалогаНДФЛ, СчетДоходовБП, ТолькоНеЗаполеные, ВидУдержанияПФ);
	ПоместитьВоВременноеХранилище(СтруктураВозврата, АдресСтруктурыВХранилище);
	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	Отказ = Ложь;
	
	//ПроверитьЗаполнениеРеквизитовФормы(Отказ);
	
	Если НЕ Отказ Тогда
		ЗаписатьПодборВХранилище();
		Закрыть(КодВозвратаДиалога.OK);
	КонецЕсли;
	
КонецПроцедуры