
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Параметры.Свойство("НачалоПериода") Тогда
		
		НачалоПериода = Параметры["НачалоПериода"];
		УстановитьПараметрНаСервере("НачалоПериода", НачалоПериода);
		
	КонецЕсли;
	
	Если Параметры.Свойство("КонецПериода") Тогда
		
		КонецПериода = Параметры["КонецПериода"];
		УстановитьПараметрНаСервере("КонецПериода", КонецПериода);
		
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда
		
		Организация = Параметры["Организация"];
		УстановитьПараметрНаСервере("Организация", Организация);
		
	Иначе
		
		ВызватьИсключение НСтр("ka='Открытие отчета предусмотрено только из документа ""Закрытие месяца"".';ru='Открытие отчета предусмотрено только из документа ""Закрытие месяца"".'");
		
	КонецЕсли;
	
	Если Параметры.Свойство("ДатаФормирования") Тогда
		
		Организация = Параметры["ДатаФормирования"];
		УстановитьПараметрНаСервере("ДатаФормирования", Организация);
		
	КонецЕсли;
	
	Элементы.ОсновнаяКоманднаяПанель.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрНаСервере(ИмяПараметра, ЗначениеПараметра)
	
	НастройкаКомпоновки = Отчет.КомпоновщикНастроек.Настройки;
	НайденнаяНастройка= НастройкаКомпоновки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	
	Если НЕ НайденнаяНастройка = Неопределено Тогда
		
		ЭлементПользовательскойНастройки = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
			НайденнаяНастройка.ИдентификаторПользовательскойНастройки
		);
		ЭлементПользовательскойНастройки.Использование = Истина;
		ЭлементПользовательскойНастройки.Значение = ЗначениеПараметра;
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьПараметрНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СкомпоноватьРезультат();
	
КонецПроцедуры

