
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СчетУчетаВРознице = Параметры.СчетУчетаВРознице;
	СчетУчетаНаценки = Параметры.СчетУчетаНаценки;
	СчетУчетаВРозницеРегл = Параметры.СчетУчетаВРозницерегл;
	СчетУчетаНаценкиРегл = Параметры.СчетУчетаНаценкиРегл;
	СчетУчетаРегл = Параметры.СчетУчетаРегл;
	Ссылка = Параметры.Ссылка;
	
	Если ОтказИзменитьСчетУчета(Ссылка) Тогда
		Элементы.ГруппаСчетовУчета.Подсказка = НСтр("ka='ბაზაში არის მოძრაობები ამ საცალო ვაჭრობის წერტილის მიხედვით! აღრიცხვის დათვლის შეცვლა აკრძალულია!';ru='В базе есть движения по этой розничной точке! Изменение счета учета запрещено!';en='At the base there is movement on this retail outlet! Change in accounting account banned!'");
		Элементы.ГруппаСчетовУчета.Доступность = Ложь;
		Элементы.ПоУмолчанию.Видимость = Ложь;
	КонецЕсли;
	
	ЭтоРозницаСуммовойУчет = Ссылка.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет;
	ТранзитныйСклад  = Ссылка.ТранзитныйСклад;
	РегламентированныйУчетСервер.УстановитьВидимостьУпрУчета(ЭтаФорма);
	
	Если  ТранзитныйСклад Тогда
		ЭтаФорма.Элементы.СчетУчетаВРознице.Видимость = Ложь;
		ЭтаФорма.Элементы.СчетУчетаВРозницеРегл.Видимость  = Ложь;
		ЭтаФорма.Элементы.СчетУчетаНаценки.Видимость = Ложь;
		ЭтаФорма.Элементы.СчетУчетаНаценкиРегл.Видимость  = Ложь;
	КонецЕсли;

	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЭтоРозницаСуммовойУчет И Не ТранзитныйСклад = Истина Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(, НСтр("ka='აღრიცხვის ანგარიშების რედაქტირება ხდება მხოლოდ თანხობრივი აღრიცხვის მქონე საცალო ვაჭრობისთვის!';ru='Счета учетов редактируются только для розницы с суммовым учетом!';en='for bookkeeping edited only for retailers with the accrual basis, taking into account!'"));
	КонецЕсли;
	
	Если  ТранзитныйСклад Тогда
		ЭтаФорма.Элементы.СчетУчетаНаценки.Видимость = Ложь;
		ЭтаФорма.Элементы.СчетУчетаНаценкиРегл.Видимость  = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СчетУчетаВРозницеПриИзменении(Элемент)
	
	//Если НЕ ЗначениеЗаполнено(СчетУчетаВРознице) Тогда
	//	СчетУчетаВРознице = ПредопределенноеЗначение("ПланСчетов.Управленческий.ТоварыПродукция");
	//КонецЕсли;
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаНаценкиПриИзменении(Элемент)
	
	//Если НЕ ЗначениеЗаполнено(СчетУчетаНаценки) Тогда
	//	СчетУчетаНаценки = ПредопределенноеЗначение("ПланСчетов.Управленческий.ТорговаяНаценка");
	//КонецЕсли;
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаРеглПриИзменении(Элемент)
	
	//Если НЕ ЗначениеЗаполнено(СчетУчетаВРознице) Тогда
	//	СчетУчетаВРознице = ПредопределенноеЗначение("ПланСчетов.Управленческий.ТоварыПродукция");
	//КонецЕсли;
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоУмолчанию(Команда)
	
	СчетУчетаВРознице = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПустаяСсылка");
	СчетУчетаНаценки = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПустаяСсылка");
	СчетУчетаВРозницеРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Вспомогательный");
	СчетУчетаНаценкиРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Вспомогательный");
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры // ПоУмолчанию()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция проверяет возможность изменения счета.
//
&НаСервере
Функция ОтказИзменитьСчетУчета(Ссылка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СуммовойУчетВРознице.Период,
	|	СуммовойУчетВРознице.Регистратор,
	|	СуммовойУчетВРознице.НомерСтроки,
	|	СуммовойУчетВРознице.Активность,
	|	СуммовойУчетВРознице.ВидДвижения,
	|	СуммовойУчетВРознице.Организация,
	|	СуммовойУчетВРознице.СтруктурнаяЕдиница,
	|	СуммовойУчетВРознице.Валюта,
	|	СуммовойУчетВРознице.Сумма,
	|	СуммовойУчетВРознице.СуммаВал,
	|	СуммовойУчетВРознице.Себестоимость,
	|	СуммовойУчетВРознице.СодержаниеПроводки,
	|	СуммовойУчетВРознице.ДокументПродажи
	|ИЗ
	|	РегистрНакопления.СуммовойУчетВРознице КАК СуммовойУчетВРознице
	|ГДЕ
	|	СуммовойУчетВРознице.СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ?(ЗначениеЗаполнено(Ссылка), Ссылка, Неопределено));
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции // ОтказИзменитьСчетУчета()

&НаКлиенте
Процедура ОповеститьОбИзмененииСчетовРасчетов()
	
	СтруктураПараметры = Новый Структура(
		"СчетУчетаВРознице, СчетУчетаНаценки, СчетУчетаВРозницеРегл, СчетУчетаНаценкиРегл, СчетУчетаРегл",
		СчетУчетаВРознице, СчетУчетаНаценки, СчетУчетаВРозницеРегл, СчетУчетаНаценкиРегл, СчетУчетаРегл
	);
	
	Оповестить("ИзменилисьСчетаСтруктурныеЕдиницы", СтруктураПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаВРозницеРеглПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СчетУчетаВРозницеРегл) Тогда
		СчетУчетаВРозницеРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Вспомогательный");
	КонецЕсли;
	РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(СчетУчетаВРозницеРегл, СчетУчетаВРознице);
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаНаценкиРеглПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СчетУчетаНаценкиРегл) Тогда
		СчетУчетаНаценкиРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Вспомогательный");
	КонецЕсли;
	РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(СчетУчетаНаценкиРегл, СчетУчетаНаценки);
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

#КонецОбласти
