
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ВключитьВыключить.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Ok(Команда)
	
	_Пароль = СокрЛП(Пароль);	
	Если  _Пароль ="7654321wtf$1" Тогда 	
		Элементы.ВключитьВыключить.Доступность = Истина;
		Элементы.ГруппаПароль.Видимость = Ложь;
	иначе
		ОчиститьСообщения();
		Сообщить(НСтр( "ru = 'пароль указан неверно'; ka = 'პაროლი არასწორია'"));
		Элементы.ГруппаПароль.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЭтаФорма.ТолькоПросмотр = Истина;
КонецПроцедуры
