#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец") И ТипЗнч(Параметры.Отбор.Владелец) = Тип("СправочникСсылка.Номенклатура") Тогда
		// Если задана связь параметров выбора по значению номенклатуры,
		// то дополним параметры выбора отбором по владельцу - номенклатурной группе.
		
		Номенклатура 		  = Параметры.Отбор.Владелец;
		КатегорияНоменклатуры = Параметры.Отбор.Владелец.КатегорияНоменклатуры;
		
		ТекстСообщения = "";
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			ТекстСообщения = НСтр("ka='ნომენკლატურა არ არის შევსებული!';ru='Не заполнена номенклатура!';en='Not full range!'");
		ИначеЕсли Параметры.Свойство("ЭтоПриходныйДокумент") И Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
			ТекстСообщения = НСтр("ka='გარეშე კონტრაგენტების მომსახურებებისთვის მახასიათებლების მიხედვით აღრიცხვა არ წარმოებს!';ru='Для услуг сторонних контрагентов не ведется учет по характеристикам!';en='For third-party suppliers of services do not keep records on the characteristics!'");
		ИначеЕсли НЕ Номенклатура.ИспользоватьХарактеристики Тогда
			ТекстСообщения = НСтр("ka='ნომენკლატურისთვის არ წარმოებს აღრიცხვა მახასიათებლების მიხედვით!';ru='Для номенклатуры не ведется учет по характеристикам!';en='For nomenclature not keep records on the characteristics!'");
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		
		МассивОтбора = Новый Массив;
		МассивОтбора.Добавить(Номенклатура);
		МассивОтбора.Добавить(КатегорияНоменклатуры);
		
		Параметры.Отбор.Вставить("Владелец", МассивОтбора);
		
	КонецЕсли;
	
	Параметры.Отбор.Вставить("ИспользуетсяВдокументах", ИСТИНА); // Kuzmich, 02.07.2021
	
КонецПроцедуры // ОбработкаПолученияДанныхВыбора()

#КонецОбласти

#Область ИнтерфейсПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли