#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("НоменклатураСсылка") Тогда
			
			Владелец = ДанныеЗаполнения.НоменклатураСсылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка И ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
		Возврат;
	КонецЕсли;
	
	КатегорииНоменклатурыСервер.ПроверкаЗаполненияСвойствПередЗаписью(ЭтотОбъект, Отказ);
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//ПодольскийАИ #УникальностьХарактеристи 21.02.2023 {
	ПроверитьУникальностьХарактеристик(Отказ);
	//ПодольскийАИ #УникальностьХарактеристи 21.02.2023 }
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка И ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.Номенклатура") Тогда
		Категория = Владелец.КатегорияНоменклатуры;
	ИначеЕсли ТипЗнч(Владелец) = Тип("СправочникСсылка.КатегорииНоменклатуры") Тогда
		Категория = Владелец;
	КонецЕсли;
	КатегорииНоменклатурыСервер.ПроверкаЗаполненияСвойствПриЗаписи(ЭтотОбъект, Категория, Отказ);
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//ПодольскийАИ #УникальностьХарактеристи 21.02.2023 {
Процедура ПроверитьУникальностьХарактеристик(Отказ) 

	ЕстьПроверка = Константы.ИспользоватьУникальностьХарактеристикиПоВладельцу.Получить();
	Если Не ЕстьПроверка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	(&ВладелецНоменклатура
		|				И ТИПЗНАЧЕНИЯ(ХарактеристикиНоменклатуры.Владелец) = ТИП(Справочник.Номенклатура)
		|				И ВЫРАЗИТЬ(ХарактеристикиНоменклатуры.Владелец КАК Справочник.Номенклатура) = &Владелец
		|			ИЛИ НЕ &ВладелецНоменклатура
		|				И ТИПЗНАЧЕНИЯ(ХарактеристикиНоменклатуры.Владелец) = ТИП(Справочник.КатегорииНоменклатуры)
		|				И ВЫРАЗИТЬ(ХарактеристикиНоменклатуры.Владелец КАК Справочник.КатегорииНоменклатуры) = &Владелец)
		|			И ХарактеристикиНоменклатуры.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ВладелецНоменклатура", ТипЗнч(Владелец) = Тип("СправочникСсылка.Номенклатура"));
	Запрос.УстановитьПараметр("Наименование", Наименование);
	РезультатЗапроса = Запрос.Выполнить();
	
	Отказ = Не РезультатЗапроса.Пустой() И Ссылка.Пустая();
	Если Не Отказ И Не Ссылка.Пустая() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Отказ = Не Выборка.Ссылка = Ссылка;
			Если Отказ Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если Отказ Тогда
		Сообщение = Новый СообщениеПользователю;
		ТекстСообщения = НСтр("ru = 'Характеристика с наименованием ""%1"" у владельца ""%2"" уже существует.
                               |Не удалось записать элемент!'; 
							   |ka = 'Характеристика с наименованием ""%1"" у владельца ""%2"" уже существует.
                               |Не удалось записать элемент!'");
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
														ЭтотОбъект.Наименование, Строка(Владелец));
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

//ПодольскийАИ #УникальностьХарактеристи 21.02.2023 }

#КонецОбласти

#КонецЕсли