
&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ОчиститьСообщения();
	ПарольВерные = ПроверитьПароль();
	Элементы.ФункционалТранспортныхСредств.Доступность = ПарольВерные;
	Если НЕ ПарольВерные Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСТР("ka='პაროლი არასწორია!';ru='Пароль неверный!'");
		Сообщение.Поле =  "Пароль";
		Сообщение.Сообщить();
	КонецЕсли;                                                                            
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ПарольВерные Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСТР("ka='პაროლი არასწორია!';ru='Пароль неверный!'");
		Сообщение.Поле =  "Пароль";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

Функция ПроверитьПароль()
	
	Если Пароль = "dd228" Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции	
