
&НаКлиенте
Процедура ТаблицаСубконтоВидСубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элементы.ТаблицаСубконтоВидСубконто.СписокВыбора.Очистить();
	ТекущиеДанные = Элементы.ТаблицаСубконто.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(СчетУчета) Тогда
	
		СписокСубконто = ПолучитьСписокВидовСубконтоСчета(СчетУчета);
		Для каждого ТекЭлемент Из СписокСубконто Цикл
		
			Элементы.ТаблицаСубконтоВидСубконто.СписокВыбора.Добавить(ТекЭлемент.Значение);
		
		КонецЦикла; 
	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокВидовСубконтоСчета(СчетУчета)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетУчета", СчетУчета);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХозрасчетныйВидыСубконто.НомерСтроки КАК НомерСтроки,
	|	ХозрасчетныйВидыСубконто.ВидСубконто КАК ВидСубконто,
	|	ХозрасчетныйВидыСубконто.ВидСубконто.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	ХозрасчетныйВидыСубконто.ВидСубконто.Наименование КАК Наименование,
	|	ХозрасчетныйВидыСубконто.ВидСубконто.ТипЗначения КАК ТипЗначения
	|ИЗ
	|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
	|ГДЕ
	|	ХозрасчетныйВидыСубконто.Ссылка = &СчетУчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	СписокСубконто = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		СписокСубконто.Добавить(Выборка.ВидСубконто);	
	
	КонецЦикла;
	Возврат СписокСубконто;
	
КонецФункции // ПолучитьСписокВидовСубконтоСчета()


&НаКлиенте
Процедура ТаблицаСубконтоВидСубконтоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаСубконто.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
	
		ТекущиеДанные.НомерСубконто = Неопределено;
		ТекущиеДанные.ИмяСубконто = Неопределено;
		ТекущиеДанные.ЗначениеСубконто = Неопределено;
		ТекущиеДанные.ВидСравнения = Неопределено;
		ТекущиеДанные.ЗначениеСубконтоСписок.Очистить();
		ДанныеСубконто = ПолучитьТипыЗначенийСубконто(ТекущиеДанные.ВидСубконто, СчетУчета);
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеСубконто);
		Элементы.ТаблицаСубконтоЗначениеСубконто.ОграничениеТипа = ДанныеСубконто.ТипЗначения;
		ТекущиеДанные.ЗначениеСубконтоСписок.ТипЗначения = ДанныеСубконто.ТипЗначения;
	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипыЗначенийСубконто(ВидСубконто, СчетУчета)
	
	СтруктураДанныхСубконто = Новый Структура("НомерСубконто, ВидСубконто, ИмяСубконто, ТипЗначения"); 
	Если ЗначениеЗаполнено(ВидСубконто) И ЗначениеЗаполнено(СчетУчета) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйВидыСубконто.НомерСтроки КАК НомерСубконто,
		|	ХозрасчетныйВидыСубконто.ВидСубконто КАК ВидСубконто,
		|	ХозрасчетныйВидыСубконто.ВидСубконто.ИмяПредопределенныхДанных КАК ИмяСубконто,
		|	ХозрасчетныйВидыСубконто.ВидСубконто.ТипЗначения КАК ТипЗначения
		|ИЗ
		|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
		|ГДЕ
		|	ХозрасчетныйВидыСубконто.Ссылка = &СчетУчета
		|	И ХозрасчетныйВидыСубконто.ВидСубконто = &ВидСубконто";
		
		Запрос.УстановитьПараметр("СчетУчета", СчетУчета);
		Запрос.УстановитьПараметр("ВидСубконто", ВидСубконто);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
		
			ЗаполнитьЗначенияСвойств(СтруктураДанныхСубконто, Выборка);	
		
		КонецЕсли; 
		
		
		Возврат СтруктураДанныхСубконто;
		
	КонецЕсли; 

КонецФункции // ПолучитьТипыЗначенийСубконто()

&НаКлиенте
Процедура ТаблицаСубконтоСчетУчетаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаСубконто.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
	
		ТекущиеДанные.НомерСубконто = Неопределено;
		ТекущиеДанные.ИмяСубконто = Неопределено;
		ТекущиеДанные.ВидСубконто = Неопределено;
		ТекущиеДанные.ЗначениеСубконто = Неопределено;
		ТекущиеДанные.ВидСравнения = Неопределено;
		ТекущиеДанные.ЗначениеСубконтоСписок.Очистить();
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСубконтоЗначениеСубконтоСписокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаСубконто.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
	
		//ТекущиеДанные.ЗначениеСубконто = Неопределено;
		//ТекущиеДанные.ВидСравнения = Неопределено;
		ТекущиеДанные.ЗначениеСубконтоСписок.Очистить();
		ТекущиеДанные.ЗначениеСубконтоСписок.ТипЗначения = ПолучитьТипыЗначенийСубконто(ТекущиеДанные.ВидСубконто, СчетУчета).ТипЗначения;
		//СтандартнаяОбработка = Ложь;
		//ДанныеВыбора = ПолучитьДанныеВыбораДляСпискаЗначений(ТекущиеДанные.ВидСубконто);
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеВыбораДляСпискаЗначений(ВидСубконто)

	ОТТипыЗначенийСубконто = ВидСубконто.ТипЗначения;
	Типы = ОТТипыЗначенийСубконто.Типы();
	ТекстЗапроса = "";
	Для каждого ТекущийТип Из Типы Цикл
	
		
		ЭтоСправочник = Ложь;
		ЭтоДокумент = Ложь;
		МД = Метаданные.НайтиПоТипу(ТекущийТип);
		Если Справочники.ТипВсеСсылки().СодержитТип(ТекущийТип) Тогда
		
			ЭтоСправочник = Истина;		
		
		ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТекущийТип) Тогда
		
			ЭтоДокумент = Истина;
			
		Иначе 
			
			Продолжить;
		
		КонецЕсли; 
		ТекстЗапроса = ТекстЗапроса + ?(ПустаяСтрока(ТекстЗапроса), "", Символы.ПС + "ОБЪЕДИНИТЬ" + Символы.ПС) + "ВЫБРАТЬ " + Символы.ПС + "ТекТаблица.Ссылка КАК Ссылка"
				+ Символы.ПС + "ИЗ "+ ?(ЭтоСправочник, "Справочник.", "Документ.") + Метаданные.НайтиПоТипу(ТекущийТип).Имя + " КАК ТекТаблица";
						
	
	КонецЦикла;
	
	СписокДанных = Новый СписокЗначений;
	Если Не ПустаяСтрока(ТекстЗапроса) Тогда
	
		Запрос = Новый Запрос(ТекстЗапроса);
		СписокДанных.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	КонецЕсли;
	Возврат СписокДанных;

КонецФункции // ПолучитьДанныеВыбораДляСпискаЗначений()

&НаКлиенте
Процедура ТаблицаСубконтоВидСравненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаСубконто.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
	
		ТекущиеДанные.ЗначениеСубконто = Неопределено;
		ТекущиеДанные.ЗначениеСубконтоСписок.Очистить();
		ТекущиеДанные.ЗначениеВСписке = ТекущиеДанные.ВидСравнения = ПредопределенноеЗначение("ВидСравнения.НеВСписке")
		ИЛИ ТекущиеДанные.ВидСравнения = ПредопределенноеЗначение("ВидСравнения.ВСписке")
		ИЛИ ТекущиеДанные.ВидСравнения = ПредопределенноеЗначение("ВидСравнения.ВИерархии")
		ИЛИ ТекущиеДанные.ВидСравнения = ПредопределенноеЗначение("ВидСравнения.ВСпискеПоИерархии")
		ИЛИ ТекущиеДанные.ВидСравнения = ПредопределенноеЗначение("ВидСравнения.НеВСписке")
		ИЛИ ТекущиеДанные.ВидСравнения = ПредопределенноеЗначение("ВидСравнения.НеВИерархии");
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаПриИзменении(Элемент)
	
	Для каждого ТекущиеДанные Из ТаблицаСубконто Цикл
	
		ТекущиеДанные.НомерСубконто = Неопределено;
		ТекущиеДанные.ИмяСубконто = Неопределено;
		ТекущиеДанные.ВидСубконто = Неопределено;
		ТекущиеДанные.ЗначениеСубконто = Неопределено;
		ТекущиеДанные.ВидСравнения = Неопределено;
		ТекущиеДанные.ЗначениеСубконтоСписок.Очистить();
	
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура КонвертироватьВ_JSONНаСервере()

	ТаблицаНастроек = РеквизитФормыВЗначение("ТаблицаСубконто");
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, ТаблицаНастроек);
	ТекстJSON = ЗаписьJSON.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КонвертироватьВ_JSON(Команда)
	КонвертироватьВ_JSONНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьОбъектИз_JSONНаСервере()
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	Результат = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON, Тип("ТаблицаЗначений"));
	Если ТипЗнч(Результат) = Тип("ТаблицаЗначений") Тогда
	
		ТаблицаСубконто.Очистить();
		ТаблицаСубконто.Загрузить(Результат);
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьОбъектИз_JSON(Команда)
	ПрочитатьОбъектИз_JSONНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	
	КонвертироватьВ_JSONНаСервере();
	ДанныеОтборов = Новый Структура("ИдентификаторСтроки, ТекстJSON");
	ЗаполнитьЗначенияСвойств(ДанныеОтборов, ЭтотОбъект);
	Закрыть(ДанныеОтборов);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "СчетУчета, ТекстJSON, ИдентификаторСтроки");
	Если Не ПустаяСтрока(ТекстJSON) Тогда
	
		ПрочитатьОбъектИз_JSONНаСервере();	
	
	КонецЕсли; 
	
КонецПроцедуры
 
 
 
