
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавитьОтсутствующиеНастройки();
	
	Если Параметры.Свойство("Родитель") Тогда 
		
		ОтборРодитель = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборРодитель.РежимОтображения =  РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ОтборРодитель.Использование = Истина;
		ОтборРодитель.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборРодитель.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Родитель");
		ОтборРодитель.ПравоеЗначение = Параметры.Родитель;
		
	Иначе
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОтсутствующиеНастройки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПредопределенныеЭлементыДляРасширений.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ЗначенияПредопределенныхЭлементовДляРасширений.Настройка = ПредопределенныеЭлементыДляРасширений.Ссылка
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Присутствует
		|ИЗ
		|	ПланВидовХарактеристик.ПредопределенныеЭлементыДляРасширений КАК ПредопределенныеЭлементыДляРасширений
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПредопределенныхЭлементовДляРасширений КАК ЗначенияПредопределенныхЭлементовДляРасширений
		|		ПО ПредопределенныеЭлементыДляРасширений.Ссылка = ЗначенияПредопределенныхЭлементовДляРасширений.Настройка
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ЗначенияПредопределенныхЭлементовДляРасширений.Настройка = ПредопределенныеЭлементыДляРасширений.Ссылка
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ = ЛОЖЬ
		|	И ПредопределенныеЭлементыДляРасширений.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ЗначенияПредопределенныхЭлементовДляРасширений.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Настройка = ВыборкаДетальныеЗаписи.Ссылка;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
