
//Паганини_
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.НоменклатурнаяГруппа = УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("КатегорииНоменклатуры", "БезКатегории");
	Объект.ЕдиницаИзмерения	    = УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("КлассификаторЕдиницИзмерения", "шт");
	Объект.СтавкаНДС			= УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("СтавкиНДС", "НДС18");
	Объект.СчетУчетаЗапасов		= ПланыСчетов.Управленческий.СырьеИМатериалы;
	Объект.СчетУчетаЗапасовРегл	= ПланыСчетов.Хозрасчетный.Товары;
	Объект.СчетУчетаЗатрат		= ПланыСчетов.Управленческий.НезавершенноеПроизводство;
	Объект.СчетУчетаЗатратРегл	= РегламентированныйУчетСервер.ПолучитьСчетПоНомеру("1630");
	Объект.МетодОценки			= Перечисления.МетодОценкиЗапасов.ПоСредней;
	Объект.ВидЦен				= Справочники.ВидыЦен.Учетная;
КонецПроцедуры
//_Паганини

//////////////////////////////////////////////////////
// Работа с файлом для загрузки
//

&НаКлиенте
Процедура ВыбратьФайл(Интерактивно)
	Объект.АдресВременногоХранилища = "";
	Если ПоместитьФайл(Объект.АдресВременногоХранилища, Объект.ИмяФайлаДанных, ПутьКФайлу, Интерактивно, УникальныйИдентификатор) Тогда		
		Объект.ИмяФайлаДанных = ПутьКФайлу;
		ПолучитьСтраницыФайла();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Паганини_
	ВыбратьФайл(Истина);
	//Режим = РежимДиалогаВыбораФайла.Открытие;
	//ДиалогВыбораФайла = Новый ДиалогВыбораФайла(Режим);
	//ДиалогВыбораФайла.ПолноеИмяФайла = Элемент.ТекстРедактирования;
	//ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	//ДиалогВыбораФайла.Заголовок = "Выберите файл заявки";
	//
	//ДиалогВыбораФайла.Фильтр = "(*.xlsx;*.xls)|*.xlsx;*.xls|";
	//Если ДиалогВыбораФайла.Выбрать() Тогда
	//	ПутьКФайлу = ДиалогВыбораФайла.ВыбранныеФайлы[0];
	//	Объект.АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлу));
	//	Объект.ИмяФайлаДанных = ПутьКФайлу;
	//	ПолучитьСтраницыФайла();
	//Иначе
	//	Предупреждение("Файл не выбран!");
	//	ТекущийЭлемент = Элементы.ПутьКФайлу;
	//КонецЕсли;
	//_Паганини
КонецПроцедуры




&НаСервере
Процедура ПолучитьСтраницыФайла()
	СтраницыИзФайла.Очистить();
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Таблица = ОбработкаОбъект.ПолучитьПереченьСтраниц(СтраницыИзФайла);
КонецПроцедуры


//////////////////////////////////////////////////////
// Обработка данных
//

&НаКлиенте
Процедура ОбработкаДанных(Команда)
		
	//Паганини_
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	//_Паганини
	ОбработкаДанныхСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаДанныхСервер()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ОбработкаОбъект.ОбработкаДанныхИзФайла(СтраницыИзФайла);
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьШаблонФайла(Команда)
	АдресХранилища = ПоместитьВоВременноеХранилище("", ЭтаФорма.УникальныйИдентификатор);
	ВерсияФорматаФайла = СгенерироватьШаблонФайлаСервер(АдресХранилища);
	ПолучитьФайл(АдресХранилища,"шаблон.xls" + ?(ВерсияФорматаФайла < 13, "", "x"), Истина);
КонецПроцедуры

&НаСервере
Функция СгенерироватьШаблонФайлаСервер(АдресХранилища)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Резлультат = ОбработкаОбъект.СгенерироватьШаблонДляФайлаИмпорта(АдресХранилища);
	
Возврат Резлультат;
КонецФункции

