#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	//НастройкиОтчета.ИспользоватьСравнение = Истина;
	//НастройкиОтчета.ИспользоватьПериодичность = Истина;
	
	//НастройкиОтчета.Вставить("Теги", НСТР("ka='ხელფასი';ru='Зарплата';en='Salary'"));
	//НастройкиОтчета.Вставить("Рекомендуемый", Истина);
	//НастройкиОтчета.Вставить("ИмяМакетаОбразца", "ОбразецОсновной");
	
	//НастройкиВариантов["Основной"].Рекомендуемый = Истина;
	
	ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов);
	УстановитьТегиВариантов(НастройкиВариантов);
	ДобавитьОписанияСвязанныхПолей(НастройкиВариантов);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//ДатаКон = ?(СхемаКомпоновкиДанных.Параметры.СтПериод.Значение.ДатаОкончания = Дата(1,1,1), Дата(2999,1,1), СхемаКомпоновкиДанных.Параметры.СтПериод.Значение.ДатаОкончания);
	//СхемаКомпоновкиДанных.Параметры.ДатаОкончания.Значение = ДатаКон;
	//СхемаКомпоновкиДанных.Параметры.Период.Значение = ДатаКон;
	
	ОтчетыУНФ.ПриКомпоновкеРезультата(КомпоновщикНастроек, СхемаКомпоновкиДанных, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПредопределенныеВариантыОформления(НастройкиВариантов)
	
	Для Каждого НастройкиТекВарианта Из НастройкиВариантов Цикл
		НастройкиТекВарианта.Значение.Теги = НСтр("ka='Зарплата,Налоги,Льготы,Заказы,Номенклатура,Продажи';ru='Зарплата,Налоги,Льготы,Заказы,Номенклатура,Продажи'");
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьТегиВариантов(НастройкиВариантов)
	
	НастройкиВариантов["Основной"].Теги = НСтр("ka='ხელფასი';ru='Зарплата';en='Salary'");
	
КонецПроцедуры

Процедура ДобавитьОписанияСвязанныхПолей(НастройкиВариантов)
	
	//ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["Основной"].СвязанныеПоля, "Контрагент", "Справочник.Контрагенты");
	
КонецПроцедуры
 
#КонецОбласти 

ЭтоОтчетУНФ = Истина;

#КонецЕсли
