
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(ИСТИНА);
	
	ФИФО_в_ЗакрытииМесяца = Константы.ОтключениеУсредненияСебестоимостиВЗакритииМесяца.Получить();
	
	УстановитьПривилегированныйРежим(ИСТИНА);
	
	ТекущееЗначение = Формат(ФИФО_в_ЗакрытииМесяца,"ДЛФ=; ДП='НЕ ИСПОЛЬЗУЕТСЯ'");
	
	Если ЗначениеЗаполнено(ФИФО_в_ЗакрытииМесяца) Тогда
		
		Год_ФИФО_в_ЗакрытииМесяца = ГОД(ФИФО_в_ЗакрытииМесяца);
		Месяц_ФИФО_в_ЗакрытииМесяца = МЕСЯЦ(ФИФО_в_ЗакрытииМесяца);
		
		ФормаГод = Год_ФИФО_в_ЗакрытииМесяца - 2000;
		
		Если Месяц_ФИФО_в_ЗакрытииМесяца = 1 Тогда
		
			ФормаМесяц = "Январь";
			
		ИначеЕсли Месяц_ФИФО_в_ЗакрытииМесяца = 2 Тогда
		
			ФормаМесяц = "Февраль";
			
		ИначеЕсли Месяц_ФИФО_в_ЗакрытииМесяца = 3 Тогда
		
			ФормаМесяц = "Март";
			
		ИначеЕсли Месяц_ФИФО_в_ЗакрытииМесяца = 4 Тогда
		
			ФормаМесяц = "Апрель";
			
		ИначеЕсли Месяц_ФИФО_в_ЗакрытииМесяца = 5 Тогда
		
			ФормаМесяц = "Май";
			
		ИначеЕсли Месяц_ФИФО_в_ЗакрытииМесяца = 6 Тогда
		
			ФормаМесяц = "Июнь";
			
		ИначеЕсли Месяц_ФИФО_в_ЗакрытииМесяца = 7 Тогда
		
			ФормаМесяц = "Июль";
			
		ИначеЕсли Месяц_ФИФО_в_ЗакрытииМесяца = 8 Тогда
		
			ФормаМесяц = "Август";
			
		ИначеЕсли Месяц_ФИФО_в_ЗакрытииМесяца = 9 Тогда
		
			ФормаМесяц = "Сентябрь";
			
		ИначеЕсли Месяц_ФИФО_в_ЗакрытииМесяца = 10 Тогда
		
			ФормаМесяц = "Октябрь";
			
		ИначеЕсли Месяц_ФИФО_в_ЗакрытииМесяца = 11 Тогда
		
			ФормаМесяц = "Ноябрь";
			
		ИначеЕсли Месяц_ФИФО_в_ЗакрытииМесяца = 12 Тогда
		
			ФормаМесяц = "Декабрь";
			
		Иначе
			
			ФормаМесяц = "Не используется";
		
		КонецЕсли;
	
	Иначе
		
		ФормаМесяц = "Не используется";
		ФормаГод = 0;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеКонстанты()
	
	УстановитьПривилегированныйРежим(ИСТИНА);
	
	Если ФормаМесяц = "Не используется" Тогда
	
		Константы.ОтключениеУсредненияСебестоимостиВЗакритииМесяца.Установить(НЕОПРЕДЕЛЕНО);
		
	Иначе
		
		Если ФормаМесяц = "Январь" Тогда
		
			Месяц_ФИФО_в_ЗакрытииМесяца = 1;
			
		ИначеЕсли ФормаМесяц = "Февраль" Тогда
		
			Месяц_ФИФО_в_ЗакрытииМесяца = 2;
			
		ИначеЕсли ФормаМесяц = "Март" Тогда
		
			Месяц_ФИФО_в_ЗакрытииМесяца = 3;
			
		ИначеЕсли ФормаМесяц = "Апрель" Тогда
		
			Месяц_ФИФО_в_ЗакрытииМесяца = 4;
			
		ИначеЕсли ФормаМесяц = "Май" Тогда
		
			Месяц_ФИФО_в_ЗакрытииМесяца = 5;
			
		ИначеЕсли ФормаМесяц = "Июнь" Тогда
		
			Месяц_ФИФО_в_ЗакрытииМесяца = 6;
			
		ИначеЕсли ФормаМесяц = "Июль" Тогда
		
			Месяц_ФИФО_в_ЗакрытииМесяца = 7;
			
		ИначеЕсли ФормаМесяц = "Август" Тогда
		
			Месяц_ФИФО_в_ЗакрытииМесяца = 8;
			
		ИначеЕсли ФормаМесяц = "Сентябрь" Тогда
		
			Месяц_ФИФО_в_ЗакрытииМесяца = 9;
			
		ИначеЕсли ФормаМесяц = "Октябрь" Тогда
		
			Месяц_ФИФО_в_ЗакрытииМесяца = 10;
			
		ИначеЕсли ФормаМесяц = "Ноябрь" Тогда
		
			Месяц_ФИФО_в_ЗакрытииМесяца = 11;
			
		ИначеЕсли ФормаМесяц = "Декабрь" Тогда
		
			Месяц_ФИФО_в_ЗакрытииМесяца = 12;
		
		КонецЕсли;
		
		ДатаДляУстановкиВКонстанту = Дата(2000+ФормаГод,Месяц_ФИФО_в_ЗакрытииМесяца,1,0,0,0);
		Константы.ОтключениеУсредненияСебестоимостиВЗакритииМесяца.Установить(ДатаДляУстановкиВКонстанту);
	
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(ИСТИНА);
	
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	
	УстановитьЗначениеКонстанты();
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры
