#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Процедура заполняет справочник сегментов по умолчанию
//
Процедура ЗаполнитьПоставляемыеИсточникиПривлеченияПокупателей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИсточникиПривлеченияПокупателей.Ссылка КАК Источник
		|ИЗ
		|	Справочник.ИсточникиПривлеченияПокупателей КАК ИсточникиПривлеченияПокупателей";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// 1. Сайт
	Источник = Справочники.ИсточникиПривлеченияПокупателей.СоздатьЭлемент();
	Источник.УстановитьНовыйКод();
	Источник.Наименование = НСтр("ka='საიტი';ru='Сайт'");
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Источник);
	
	// 2. E-mail
	Источник = Справочники.ИсточникиПривлеченияПокупателей.СоздатьЭлемент();
	Источник.УстановитьНовыйКод();
	Источник.Наименование = НСтр("ka='e-mail';ru='E-mail'");
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Источник);
	
	// 3. Звонок
	Источник = Справочники.ИсточникиПривлеченияПокупателей.СоздатьЭлемент();
	Источник.УстановитьНовыйКод();
	Источник.Наименование = НСтр("ka='ზარი';ru='Звонок'");
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Источник);
	
	// 4. Выставка
	Источник = Справочники.ИсточникиПривлеченияПокупателей.СоздатьЭлемент();
	Источник.УстановитьНовыйКод();
	Источник.Наименование = НСтр("ka='გამოფენა';ru='Выставка'");
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Источник);
	
	// 5. Рекламная кампания
	Источник = Справочники.ИсточникиПривлеченияПокупателей.СоздатьЭлемент();
	Источник.УстановитьНовыйКод();
	Источник.Наименование = НСтр("ka='სარეკლამო კომპანია';ru='Рекламная кампания'");
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Источник);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли