
Перем ИспользоватьТолькоРегламентированныйПланСчетов Экспорт; //+++ Дмгг

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.КомплектацияВА.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьПараметрыВнеоборотныхАктивов(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьСостоянияВнеоборотныхАктивов(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьВнеоборотныеАктивы(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
	//Документы.СписаниеВА.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
	Если Не Отказ Тогда 
		
		УстановитьПервоначальнуюСтоимостьВСправочнике();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперации = Перечисления.ВидыОперацийКомплектацииВА.Комплектация Тогда 
		
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СтоимостьПослеПроведения"));
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийКомплектацииВА.Разукомплектация Тогда
		
		РазницаСуммТаблицСтоимость = Стоимость - ДекомплектующиеВА.Итог("ПервоначальнаяСтоимость") - СтоимостьПослеПроведения;
		РазницаСуммТаблицАсотризация = Амортизация - ДекомплектующиеВА.Итог("Амортизация") - АмортизацияПослеПроведения;
		РазницаСуммТаблицАмортизацияТекМеся = АмортизацияЗаМесяц - ДекомплектующиеВА.Итог("АмортизацияЗаМесяц") - АмортизацияЗаМесяцПослеПровледения;
		
		Если РазницаСуммТаблицСтоимость <> 0 Тогда
			
			ТекстСообщения = НСтр("ka='ჩამოწერილი ძ/ს ღირებულება არ უდრის მიღებული ძ/ს ღირებულებას!';ru='Стоимость декомплектуемого имущества не равна распределенной!';en='Cost dekomplektuemogo property is not distributed!'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			,
			ТекстСообщения,
			Неопределено,
			Неопределено,
			Неопределено,
			Отказ
			);
			
		КонецЕсли;
		
		Если РазницаСуммТаблицАсотризация <> 0 Тогда
			
			ТекстСообщения = НСтр("ka='დაგროვილი ამორტიზაციის თანხა არ უდრის მიღებულ ძ/ს ზე გადანაწილებულ თანხას!';ru='Амортизация декомплектуемого имущества не равна распределенной!';en='Depreciation dekomplektuemogo property is not distributed!'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			,
			ТекстСообщения,
			Неопределено,
			Неопределено,
			Неопределено,
			Отказ
			);
			
		КонецЕсли;
		
		Если РазницаСуммТаблицАмортизацияТекМеся <> 0 Тогда
			
			ТекстСообщения = НСтр("ka='მიმდინარე ამორტიზაციის თანხა არ უდრის მიღებულ ძ/ს ზე გადანაწილებულ თანხას!';ru='Амортизация текущего месяца декомплектуемого имущества не равна распределенной!';en='Depreciation of the current month dekomplektuemogo property is not distributed!'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			,
			ТекстСообщения,
			Неопределено,
			Неопределено,
			Неопределено,
			Отказ
			);
			
		КонецЕсли;
		
		Если Не НеСписывать Тогда 
			
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СтоимостьПослеПроведения"));
			
		КонецЕсли;
		
	КонецЕсли;
	
	//+++ Дмгг
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Дата);
	Если ИспользоватьТолькоРегламентированныйПланСчетов Тогда 
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ДекомплектующиеВА.СчетЗатрат");
	Иначе
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ДекомплектующиеВА.СчетЗатратРегл");
	КонецЕсли;
	
	Если Имущество.СпособАмортизации <> Перечисления.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка Тогда
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ГодовойПроцентАмортизацииДляУменьшенногоОстатка");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ЛиквидационнаяСтоимостьДляУменьшенногоОстатка");
	КонецЕсли;
	//--- Дмгг
	
КонецПроцедуры

Процедура РаспределитьСтоимостьИАмортизацию() Экспорт
	
	
	ИсхСуммаСтоимость = 0;
	ИсхСуммаАмортизация = 0;
	ИсхСуммаАмортизацияТекМесяц = 0;
	БазаРаспределения = ДекомплектующиеВА.Итог("ДоляСтоимости");
	БазаРаспределенияСтоимость= БазаРаспределения;//?(НеСписывать, БазаРаспределения + ДоляСтоимости, БазаРаспределения);
	БазаРаспределенияАмортизация = БазаРаспределения;
	БазаРаспределенияАмортизацияТекМесяц = БазаРаспределения;
	ВсегоСтоимость = Стоимость - СтоимостьПослеПроведения;
	ВсегоАмотризация = Амортизация - АмортизацияПослеПроведения;
	ВсегоАмотризацияТекМесяц = АмортизацияЗаМесяц - АмортизацияЗаМесяцПослеПровледения;
	
	Для Каждого СтрокаОС Из ДекомплектующиеВА Цикл
		
		СтрокаОС.ПервоначальнаяСтоимость = ?(БазаРаспределенияСтоимость <> 0, Окр((ВсегоСтоимость - ИсхСуммаСтоимость) * СтрокаОС.ДоляСтоимости / БазаРаспределенияСтоимость, 2, 1),0);
		БазаРаспределенияСтоимость = БазаРаспределенияСтоимость - СтрокаОС.ДоляСтоимости;
		ИсхСуммаСтоимость = ИсхСуммаСтоимость + СтрокаОС.ПервоначальнаяСтоимость;
		
		СтрокаОС.Амортизация = ?(БазаРаспределенияАмортизация <> 0, Окр((ВсегоАмотризация - ИсхСуммаАмортизация) * СтрокаОС.ДоляСтоимости / БазаРаспределенияАмортизация, 2, 1),0);
		БазаРаспределенияАмортизация = БазаРаспределенияАмортизация - СтрокаОС.ДоляСтоимости;
		ИсхСуммаАмортизация = ИсхСуммаАмортизация + СтрокаОС.Амортизация;
		
		СтрокаОС.АмортизацияЗаМесяц = ?(БазаРаспределенияАмортизацияТекМесяц <> 0, Окр((ВсегоАмотризацияТекМесяц - ИсхСуммаАмортизацияТекМесяц) * СтрокаОС.ДоляСтоимости / БазаРаспределенияАмортизацияТекМесяц, 2, 1),0);
		БазаРаспределенияАмортизацияТекМесяц = БазаРаспределенияАмортизацияТекМесяц - СтрокаОС.ДоляСтоимости;
		ИсхСуммаАмортизацияТекМесяц = ИсхСуммаАмортизацияТекМесяц + СтрокаОС.АмортизацияЗаМесяц;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьПервоначальнуюСтоимостьВСправочнике()
	
	Если ВидОперации = Перечисления.ВидыОперацийКомплектацииВА.Комплектация Тогда 
		
		СправочникОбъект = Имущество.ПолучитьОбъект();
		
		СправочникОбъект.НачальнаяСтоимость = КомплектующиеВА.Итог("Стоимость");
		
		Попытка
			СправочникОбъект.Записать();
		Исключение
			Сообщить(НСтр("ru = 'Не удалось установить начальную стоимость имуществу"+Имущество.Наименование+"'; ka = 'ვერ დახდა ძირითადი საშუალების საწყისი ღირებულების დადგენა"+Имущество.Наименование+"'"));
		КонецПопытки;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийКомплектацииВА.Разукомплектация Тогда 
		
		Для Каждого Строк Из ДекомплектующиеВА Цикл 
			
			СправочникОбъект = Строк.ВнеоборотныйАктив.ПолучитьОбъект();
			
			СправочникОбъект.НачальнаяСтоимость = Строк.ПервоначальнаяСтоимость;
			
			Попытка
				СправочникОбъект.Записать();
			Исключение
				Сообщить(НСтр("ru = 'Не удалось установить начальную стоимость имуществу"+Строк.ВнеоборотныйАктив.Наименование+"'; ka = 'ვერ დახდა ძირითადი საშუალების საწყისი ღირებულების დადგენა"+Строк.ВнеоборотныйАктив.Наименование+"'"));
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата),Дата,ТекущаяДата()));//+++ Дмгг