#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем ИспользоватьТолькоРегламентированногоПланаСчетов Экспорт;
#Область ПрограммныйИнтерфейс

// Функция рассчитывает сумму документа.
//
Функция ПолучитьСуммуДокумента() Экспорт

	СуммаНачислено	= НачисленияУдержания.Итог("Сумма");
	СуммаДокумента	= СуммаНачислено;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СуммаНачислено",	СуммаНачислено);
	СтруктураВозврата.Вставить("СуммаДокумента",	СуммаДокумента);
	
	Возврат СтруктураВозврата;
	
КонецФункции // ПолучитьСуммуДокумента()

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СтруктураСумм  = ПолучитьСуммуДокумента();
	СуммаДокумента	= СтруктураСумм.СуммаДокумента;
	//СуммаНДФЛ		= СтруктураСумм.СуммаНДФЛ;
	//СуммаПФ			= СтруктураСумм.СуммаПФ;
	
	Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности.Получить() Тогда
		
		Для каждого СтрокаНачисленияУдержания из НачисленияУдержания Цикл
			
			Если НЕ ИспользоватьТолькоРегламентированногоПланаСчетов Тогда //+++ Дмгг
				
				Если СтрокаНачисленияУдержания.СчетЗатрат.ТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
					
					СтрокаНачисленияУдержания.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
					
				КонецЕсли;	
			//+++ Дмгг	
			Иначе
				
				Если СтрокаНачисленияУдержания.СчетЗатрат.ТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
					
					СтрокаНачисленияУдержания.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
					
				КонецЕсли;
				
			КонецЕсли;
			//--- Дмгг
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры // ПередЗаписью()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОдноразовыеНачисленияНачисленияУдержания.Ссылка КАК Регистратор,
		|	ОдноразовыеНачисленияНачисленияУдержания.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
		|	ОдноразовыеНачисленияНачисленияУдержания.Ссылка.Организация КАК Организация,
		|	ОдноразовыеНачисленияНачисленияУдержания.Сотрудник КАК Сотрудник,
		|	ОдноразовыеНачисленияНачисленияУдержания.ВидОдноразовогоНачисления КАК ВидНачисленияУдержания,
		|	ОдноразовыеНачисленияНачисленияУдержания.Ссылка.ВалютаДокумента КАК Валюта,
		|	ОдноразовыеНачисленияНачисленияУдержания.Сумма КАК Сумма
		|ИЗ
		|	Документ.ОдноразовыеНачисления.НачисленияУдержания КАК ОдноразовыеНачисленияНачисленияУдержания
		|ГДЕ
		|	ОдноразовыеНачисленияНачисленияУдержания.Ссылка = &Ссылка
		|	И ОдноразовыеНачисленияНачисленияУдержания.Сумма > 0";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		НаборЗаписей = РегистрыСведений.ОдноразовыеНачисления.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись,ВыборкаДетальныеЗаписи);
		КонецЦикла;
		
		НаборЗаписей.Записать();
	
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	НаборЗаписей = РегистрыСведений.ОдноразовыеНачисления.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Записать();
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) //+++ Дмгг
	
	Если НЕ РасчетПоБонуснымБаллам Тогда
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "БазаРасчетаПоБонуснымБаллам");
	КонецЕсли;
	
	Если НЕ ПочасоваяСтавкаЗарплаты Тогда
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "КоличествоРабочихЧасов");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "КоличествоРабочихДней");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
ИспользоватьТолькоРегламентированногоПланаСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата),Дата,ТекущаяДата())); //+++ Дмгг
#КонецЕсли