
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтавкаНДС18 = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС18"));
	
	Полученный						= Истина;
	Удаленная				        = Истина;
	ВнутреннееПеремещение 			= Истина;
	РеализацияСТранспортировкой		= Истина;
	РеализацияБезТранспортировки	= Истина;
	Дистрибуция 					= Ложь;
	ВозвратПокупателяПокупателю 	= Истина;
	Аванс					= Ложь;
	
	ДатаКон 			= ТекущаяДата();
	ДатаНач 			= ДатаКон - 86400*2;
	НациональнаяВалюта 	= УправлениеНебольшойФирмойПовтИсп.ПолучитьНациональнуюВалюту();
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		Пользователи.ТекущийПользователь(),
		"ОсновнаяОрганизация");
		Если НЕ ЗначениеЗаполнено(Организация) Тогда
			Организация = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.Организации.ОсновнаяОрганизация");
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьСоответствиеНоменклатуры();
	УчетЦенКонтрагентов = ПолучитьФункциональнуюОпцию("УчетЦенКонтрагентов");
	
	Элементы.ТоварныеНакладныеНаПортале.ОтборСтрок = Новый ФиксированнаяСтруктура("Полученный", Ложь);
	Элементы.ТоварныеНакладныеНаПортале1.ОтборСтрок = Новый ФиксированнаяСтруктура("Полученный", Истина);
	
КонецПроцедуры
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьСоответствиеНоменклатуры();
КонецПроцедуры
&НаКлиенте
Процедура ДатаНачПриИзменении(Элемент)
	
	ДанныеНеСоответствуютФильтру = Истина;
	УстановитьТекстПодсказки();
	
КонецПроцедуры
&НаКлиенте
Процедура ДатаКонПриИзменении(Элемент)
	
	ДанныеНеСоответствуютФильтру = Истина;
	УстановитьТекстПодсказки();
	
КонецПроцедуры
&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
	
	ДанныеНеСоответствуютФильтру = Истина;
	УстановитьТекстПодсказки();
	
КонецПроцедуры
&НаКлиенте
Процедура ТоварныеНакладныеНаПорталеКонтрагентПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТоварныеНакладныеНаПортале.ТекущиеДанные;
	ПоставщикПокупатель = УправлениеНебольшойФирмойСервер.ЗначенияРеквизитовОбъекта(ТекДанные.Контрагент, "Поставщик,Покупатель");
	ТекДанные.Поставщик		= ПоставщикПокупатель.Поставщик;
	ТекДанные.Покупатель	= ПоставщикПокупатель.Покупатель;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	ОчиститьСообщения();
	ОбновитьДанныеНаСервере();
	
КонецПроцедуры
&НаСервере
Процедура ОбновитьДанныеНаСервере()
	
	Объект.ТоварныеНакладныеНаПортале.Очистить();
	Объект.ТоварыНаПортале.Очистить();
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Сообщить(НСтр("en='Do not fill in the ""Organization""';ka='არ არის შევსებული შევსებული ველი ""ორგანიზაცია"".';ru='Не заполнен поле ""Организация""'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаКон) Тогда
		ДатаКон = ТекущаяДата();
		Возврат;
	КонецЕсли;
		
	Колво = 0;
	ТаблицаНакладных		= Объект.ТоварныеНакладныеНаПортале.Выгрузить();
	ТаблицаТоварыНакладных	= Объект.ТоварыНаПортале.Выгрузить();
	
		
	ТаблицаНакладных.Очистить();
	ТаблицаТоварыНакладных.Очистить();
	
	Если Отправленный Тогда
		
		СформироватьТаблицуШапкаRS(Истина);
		СтруктураНД = ПолучитьСтруктуруЭлНакладных();
		
		
		//მიღებული
		ДанныеПриниятихНакладных = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьПолученныеНД(СтруктураНД,ТаблицаНакладных,Ложь);//ქუდი
		Если НЕ ДанныеПриниятихНакладных = Неопределено Тогда
			Объект.ТоварныеНакладныеНаПортале.Загрузить(ДанныеПриниятихНакладных);
			Для Каждого Стр Из Объект.ТоварныеНакладныеНаПортале Цикл 
				СформироватьТаблицуШапкаRSТовары(Стр.ID,Стр.INV_NUMBER,Стр.parentInvoiceID);
				СтруктураНД = ПолучитьСтруктуруЭлНакладных();
				ДанныеПриниятихТоваров = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьПолученныеНДТовары(СтруктураНД,ТаблицаТоварыНакладных,Ложь);
				Для Каждого Стрка Из ДанныеПриниятихТоваров Цикл 				
					НовСтр = Объект.ТоварыНаПортале.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр,Стрка);
					Стр.QUANTITY = Стр.QUANTITY + Стрка.QUANTITY;
				КонецЦикла;	
				ТаблицаТоварыНакладных.Очистить();
			КонецЦикла;
		КонецЕсли;
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ЗаполнитьСписокНД("გაგზავნილი", Объект.ТоварныеНакладныеНаПортале, Организация);
		
	КонецЕсли;
	
	ТаблицаНакладных.Очистить();				
	
	Если Полученный Тогда
		
		СформироватьТаблицуШапкаRS(Ложь);	
		СтруктураНД = ПолучитьСтруктуруЭлНакладных();
		ДанныеПриниятихНакладных = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьПолученныеНД(СтруктураНД,ТаблицаНакладных,Истина);//ქუდი
		Если НЕ ДанныеПриниятихНакладных = Неопределено Тогда
			Для Каждого Строка Из ДанныеПриниятихНакладных Цикл
				НоваяСтрока = Объект.ТоварныеНакладныеНаПортале.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
			КонецЦикла;	
			Для Каждого Стр Из Объект.ТоварныеНакладныеНаПортале Цикл 
				Если Не Стр.Полученный Тогда
					Продолжить;
				КонецЕсли;	
				СформироватьТаблицуШапкаRSТовары(Стр.ID,Стр.INV_NUMBER,Стр.parentInvoiceID);
				СтруктураНД = ПолучитьСтруктуруЭлНакладных();
				ДанныеПриниятихТоваров = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьПолученныеНДТовары(СтруктураНД,ТаблицаТоварыНакладных,Истина);
				Для Каждого Стрка Из ДанныеПриниятихТоваров Цикл 				
					НовСтр = Объект.ТоварыНаПортале.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр,Стрка);
					Стр.QUANTITY = Стр.QUANTITY + Стрка.QUANTITY;
				КонецЦикла;	
				ТаблицаТоварыНакладных.Очистить();
			КонецЦикла;
		КонецЕсли;	
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ЗаполнитьСписокНД("მიღებული", Объект.ТоварныеНакладныеНаПортале, Организация);
		
	КонецЕсли;
	////დოკუმენტებისთვის სტატუსების მინიჭება
	СтрокиСДокументами = Объект.ТоварныеНакладныеНаПортале.НайтиСтроки(Новый Структура("ДокументПревязан", Истина));
	Если СтрокиСДокументами.Количество() > 0 Тогда
		
		ТаблицаТоваров = Объект.ТоварыНаПортале.Выгрузить();
		ТаблицаТоваров.Свернуть("ID, INVOICE_ID", "AMOUNT, QUANTITY,  VAT_AMOUNT");
		
		Для Каждого СтрокаСДок ИЗ СтрокиСДокументами Цикл
			
			НайденныеСтрокиТоваров = ТаблицаТоваров.НайтиСтроки(Новый Структура("INVOICE_ID", СтрокаСДок.ID));
			
			Если НайденныеСтрокиТоваров.Количество() > 0 Тогда
				СтрокаТ = НайденныеСтрокиТоваров[0];
				Если СтрокаСДок.INV_TYPE_NAME = Перечисления.РС_ТипыНД.ВнутреннееПеремещение ИЛИ СтрокаСДок.INV_TYPE_NAME = Перечисления.РС_ТипыНД.Дистрибуция Тогда
					Если СтрокаТ.QUANTITY = СтрокаСДок.КоличествоДокумента Тогда
						СтрокаСДок.СтатусСинхронизации = "სრულად სინქრონიზირებული";
					Иначе
						СтрокаСДок.СтатусСинхронизации = "ნაწილობრივ სინქრონიზირებული";
						СтрокаСДок.РасшифровкаСтатуса = СтрокаСДок.РасшифровкаСтатуса + "განსხვავდება რაოდენობა. RS: " + СтрокаТ.QUANTITY + ", დოკუმენტი: " + СтрокаСДок.КоличествоДокумента + ";";
					КонецЕсли;
				Иначе
					Если СтрокаТ.VAT_AMOUNT = СтрокаСДок.СуммаНДСДокумента И СтрокаТ.AMOUNT = СтрокаСДок.СуммаДокумента И СтрокаТ.QUANTITY = СтрокаСДок.КоличествоДокумента Тогда
						Если СтрокаСДок.ЕстьУслугиВДокументе И НЕ СтрокаСДок.ЕстьТоварыВДокументе Тогда
							СтрокаСДок.СтатусСинхронизации = "ჩამოწერილი მომსახურებაში";
						ИначеЕсли СтрокаСДок.ЕстьУслугиВДокументе Тогда
							СтрокаСДок.СтатусСинхронизации = "ნაწილობრივ ჩამოწერილი მომსახურებაში";
						Иначе
							СтрокаСДок.СтатусСинхронизации = "სრულად სინქრონიზირებული";
						КонецЕсли;
					Иначе
						СтрокаСДок.СтатусСинхронизации = "ნაწილობრივ სინქრონიზირებული";
						Если НЕ СтрокаТ.AMOUNT = СтрокаСДок.СуммаДокумента Тогда
							СтрокаСДок.РасшифровкаСтатуса = "განსხვავდება თანხა. RS: " + СтрокаТ.AMOUNT + ", დოკუმენტი: " + СтрокаСДок.СуммаДокумента + "; ";
						КонецЕсли;
						Если НЕ СтрокаТ.VAT_AMOUNT = СтрокаСДок.СуммаНДСДокумента Тогда
							СтрокаСДок.РасшифровкаСтатуса = СтрокаСДок.РасшифровкаСтатуса + "განსხვავდება დღგ-ს თანხა. RS: " + СтрокаТ.VAT_AMOUNT + ", დოკუმენტი: " + СтрокаСДок.СуммаНДСДокумента + "; ";
						КонецЕсли;
						Если НЕ СтрокаТ.QUANTITY = СтрокаСДок.КоличествоДокумента Тогда
							СтрокаСДок.РасшифровкаСтатуса = СтрокаСДок.РасшифровкаСтатуса + "განსხვავდება რაოდენობა. RS: " + СтрокаТ.QUANTITY + ", დოკუმენტი: " + СтрокаСДок.КоличествоДокумента + "; ";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	СтрокиСПустымиДокументами =  Объект.ТоварныеНакладныеНаПортале.НайтиСтроки(Новый Структура("ДокументПревязан", Ложь));
	Для Каждого СтрокаПуст ИЗ СтрокиСПустымиДокументами Цикл
		СтрокаПуст.СтатусСинхронизации = "არსებობს მხოლოდ პორტალზე";
	КонецЦикла;
	//
	ЗаполнитьНоменклатуруПолученные_НаСервере();
	ЗаполнитьНоменклатуруОтправленные_НаСервере();
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ЗаполнитьСписок_Контрагентов(Объект.ТоварныеНакладныеНаПортале);	
	ДанныеНеСоответствуютФильтру = Ложь;
	
КонецПроцедуры

&НаСервере
Функция СформироватьТаблицуШапкаRS(Полученный)  
	
	Объект.ШапкаRS.Очистить();
	
	//INV_CATEGORY
	СтрШапкаRS = Объект.ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "INV_TYPE"; 
	СтрШапкаRS.ЗначениеПараметраRS = ПолучитьКодКатегории(); 
	
	//MAXIMUM_ROWS
	СтрШапкаRS = Объект.ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "MAXIMUM_ROWS"; 
	СтрШапкаRS.ЗначениеПараметраRS = 0;
	
	
	//SELLER_ACTION
	СтрШапкаRS = Объект.ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "ACTION"; 
	СтрШапкаRS.ЗначениеПараметраRS = ПолучитьКодСтатуса(); 
	
	//TYPE
	СтрШапкаRS = Объект.ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TYPE"; 
	СтрШапкаRS.ЗначениеПараметраRS = ?(Полученный,10,20);
	 
	
	//OPERATION_DATE
	СтрШапкаRS = Объект.ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS =  "CREATE_DATE"; 
	СтрШапкаRS.ЗначениеПараметраRS = Формат(ДатаНач, "ДФ='dd-MM-yyyy'") + ?(ЗначениеЗаполнено(ДатаКон), ":" + Формат(ДатаКон, "ДФ='dd-MM-yyyy'"),"");	   
	
	//TIN_SELLER
	Если ЗначениеЗаполнено(Контрагент.ИНН) Тогда	
		СтрШапкаRS = Объект.ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "SELLER"; 
		СтрШапкаRS.ЗначениеПараметраRS =  Контрагент.ИНН;  
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СформироватьТаблицуШапкаRSТовары(InvoiceID,InvoiceNumber,parentInvoiceID)  
	
	Объект.ШапкаRS.Очистить();
	
	//ID
	СтрШапкаRS = Объект.ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "InvoiceID"; 
	СтрШапкаRS.ЗначениеПараметраRS = Число(InvoiceID);
	
	//ID
	СтрШапкаRS = Объект.ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "InvoiceNumber"; 
	СтрШапкаRS.ЗначениеПараметраRS = Число(?(ЗначениеЗаполнено(InvoiceNumber),InvoiceNumber,0));
	
	//ID
	СтрШапкаRS = Объект.ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "parentInvoiceID"; 
	СтрШапкаRS.ЗначениеПараметраRS = parentInvoiceID;
		
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруЭлНакладных() 
	
	СтруктураТН = Новый Структура;	
	СтруктураТН.Вставить("Организация",		Организация);
	СтруктураТН.Вставить("ТаблицаШапкаRS",	Объект.ШапкаRS.Выгрузить());

	Возврат СтруктураТН;

КонецФункции

&НаСервере
Функция ПолучитьКодКатегории()
	
	itypes = "";
	
	Если ВнутреннееПеремещение 			Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",1", "1"); КонецЕсли;//1 გადაადგილება
	Если РеализацияСТранспортировкой 	Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",2", "2"); КонецЕсли;//2 რეალიზაცია ტრანსპორტირებით
	Если РеализацияБезТранспортировки 	Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",3", "3"); КонецЕсли;//3 რეალიზაცია ტრანსპორტირების გარეშე
	Если Дистрибуция 					Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",4", "4"); КонецЕсли;//4 დისტრიბუცია
	Если ВозвратПокупателяПокупателю 	Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",5", "5"); КонецЕсли;//5 უკან დაბრუნება
	Если Аванс 					        Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",6", "6"); КонецЕсли;//6 ავანსი	
	
	Возврат itypes;
	
КонецФункции

&НаСервере
Функция ПолучитьКодСтатуса()
	
	itypes = "";
	
	Если Удаленная 			   Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",1", "1"); КонецЕсли;//1 წაშლილი
	Если Сохраненая 	       Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",2", "2"); КонецЕсли;//2 შენახული
	Если Активная 	           Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",3", "3"); КонецЕсли;//3 აქტიური
	Если Утвержденная 		   Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",4", "4"); КонецЕсли;//4 დადასტურებული
	Если Отклонено 	           Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",5", "5"); КонецЕсли;//5 უარყოფილი
	Если ОтмененоЗапрос 	   Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",6", "6"); КонецЕсли;//6 გაუქმების მოთხოვნა	
	Если ОтмененоУтвержденная  Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",7", "7"); КонецЕсли;//7 გაუქმებული დადასტურებული	
    Если Коректирован 		   Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",8,9,10", "8,9,10"); КонецЕсли;//8,9,10 კორექტირებული	
    Если Шаблон 			   Тогда itypes = ?(ЗначениеЗаполнено(itypes), itypes + ",6", "6"); КонецЕсли;//11 შაბლონი	
	
	Возврат itypes;
	
КонецФункции


&НаКлиенте
Процедура СоздатьНакладные(Команда)
	
	ОчиститьСообщения();
	Если ДанныеНеСоответствуютФильтру Тогда 
		Возврат;
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	СоздатьДокументы_НаСервере(ЕстьОшибки);
	Если НЕ ЕстьОшибки Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаСозданныеДокументы;
		ЗаполнитьНоменклатуруПолученные_НаСервере();
		ЗаполнитьНоменклатуруОтправленные_НаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументы_НаСервере(ЕстьОшибки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтруктурныеЕдиницыКонтактнаяИнформация.Представление КАК Адрес,
		|	СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка КАК Склад
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы.КонтактнаяИнформация КАК СтруктурныеЕдиницыКонтактнаяИнформация
		|ГДЕ
		|	СтруктурныеЕдиницыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы)
		|	И СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)";
	ТаблицаСкладов = Запрос.Выполнить().Выгрузить();
	
	ПроверитьПередСозданиемДокументов(ЕстьОшибки);
	
	//ТаблицаКонтрагентов = Новый ТаблицаЗначений;
	//ТаблицаКонтрагентов.Колонки.Добавить("Контрагент",	Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	//ТаблицаКонтрагентов.Колонки.Добавить("ИНН", 			Новый ОписаниеТипов("Строка", , , ,Новый КвалификаторыСтроки(13)));
	//ТаблицаКонтрагентов.Колонки.Добавить("Поставщик", 	Новый ОписаниеТипов("Булево"));
	//ТаблицаКонтрагентов.Колонки.Добавить("Покупатель", 	Новый ОписаниеТипов("Булево"));
	
	СчетаУчета = РегламентированныйУчетСервер.ПолучитьСчетаКонтрагентаПоУмолчанию();
	
	СоздатьДокументы_Полученные_НаСервере(ТаблицаСкладов, 	ЕстьОшибки, СчетаУчета);
	СоздатьДокументы_Отправленные_НаСервере(ТаблицаСкладов, ЕстьОшибки, СчетаУчета);
	
КонецПроцедуры

Функция ПолучитьКонтрагентПоСтроке(Строка,СчетаУчета)
	
	Если ЗначениеЗаполнено(Строка) Тогда
		Индекс    = Найти(Строка, "(");
		ИндексКон = Найти(Строка, ")");
		ИНН = Сред(Строка, Индекс+1, ИндексКон - Индекс-1);
		Наименование = Лев(Строка,Индекс-1);
		Если Не ЗначениеЗаполнено(ИНН) Тогда
			Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		Иначе
			Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН",ИНН);
		КонецЕсли;		
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
		КонтрагентОбъект.Наименование	= Наименование;
		КонтрагентОбъект.ИНН			= ИНН;
		КонтрагентОбъект.Поставщик		= Истина;
		Если СтрДлина(ИНН) = 9 Тогда
			КонтрагентОбъект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
		Иначе
			КонтрагентОбъект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
		КонецЕсли;
		//ЗаполнитьЗначенияСвойств(КонтрагентОбъект, СчетаУчета);
		КонтрагентОбъект.Заполнить(Неопределено);
		КонтрагентОбъект.Записать();
		Возврат КонтрагентОбъект.Ссылка;
	Иначе
		Возврат Контрагент;
	КонецЕсли;
	
КонецФункции	

Функция ПолучитьВодительПоСтроке(Строка)
	
	Если ЗначениеЗаполнено(Строка) Тогда
		Индекс    = Найти(Строка, "(");
		ИндексКон = Найти(Строка, ")");
		ИНН = Сред(Строка, Индекс+1, ИндексКон - Индекс-1);
		Наименование = Лев(Строка,Индекс-1);
		Если Не ЗначениеЗаполнено(ИНН) Тогда
			Водитель = Справочники.ФизическиеЛица.ПустаяСсылка();
		Иначе
			Водитель = Справочники.ФизическиеЛица.НайтиПоРеквизиту("ИНН",ИНН);
		КонецЕсли;		
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Водитель) Тогда
		ВодительОбъект = Справочники.ФизическиеЛица.СоздатьЭлемент();
		ВодительОбъект.Наименование	= Наименование;
		ВодительОбъект.ИНН			= ИНН;
		ВодительОбъект.Заполнить(Неопределено);
		ВодительОбъект.Записать();
		Возврат ВодительОбъект.Ссылка;
	Иначе
		Возврат Водитель;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура СоздатьДокументы_Полученные_НаСервере(ТаблицаСкладов, 	ЕстьОшибки, СчетаУчета)
	
	ОтмеченныеСтроки = Объект.ТоварныеНакладныеНаПортале.НайтиСтроки(Новый Структура("Флаг, ЕстьОшибки, Полученный", Истина, Ложь, Истина));
	Для Каждого СтрокаТТН Из ОтмеченныеСтроки Цикл
		//Создать документ
		Если СтрокаТТН.INV_TYPE_NAME = Перечисления.РС_ТипыНД.ВнутреннееПеремещение Тогда
			ДокОбъект = Документы.ПеремещениеЗапасов.СоздатьДокумент();
			ДокОбъект.ВидОперации	= Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение;
		ИначеЕсли СтрокаТТН.INV_TYPE_NAME = Перечисления.РС_ТипыНД.ВозвратОтПокупателя Тогда
			ДокОбъект = Документы.РасходнаяНакладная.СоздатьДокумент();
			ДокОбъект.ВидОперации				= Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику;
			Если ЗначениеЗаполнено(СтрокаТТН.Контрагент) Тогда
				ДокОбъект.Контрагент				= СтрокаТТН.Контрагент;
			Иначе
				Если СоздатьНовыйКонтрагентЕслиНеНайден Тогда				
					СтрокаТТН.Контрагент = ПолучитьКонтрагентПоСтроке(СтрокаТТН.BUYER,СчетаУчета);
					ДокОбъект.Контрагент = СтрокаТТН.Контрагент;			
				КонецЕсли;
			КонецЕсли;
			ДокОбъект.Договор 	 				= ДокОбъект.Контрагент.ДоговорПоУмолчанию;
			ДокОбъект.ВалютаДокумента	 		= НациональнаяВалюта;
		Иначе
			ДокОбъект = Документы.ПриходнаяНакладная.СоздатьДокумент();
			ДокОбъект.ВидОперации				= Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика;
			Если ЗначениеЗаполнено(СтрокаТТН.Контрагент) Тогда
				ДокОбъект.Контрагент				= СтрокаТТН.Контрагент;
			Иначе
				Если СоздатьНовыйКонтрагентЕслиНеНайден Тогда
					СтрокаТТН.Контрагент = ПолучитьКонтрагентПоСтроке(СтрокаТТН.BUYER,СчетаУчета);
					ДокОбъект.Контрагент = СтрокаТТН.Контрагент;
				КонецЕсли;
			КонецЕсли;
			ДокОбъект.Договор 	 				= ДокОбъект.Контрагент.ДоговорПоУмолчанию;
			ДокОбъект.ВалютаДокумента	 		= НациональнаяВалюта;
			Если УчетЦенКонтрагентов Тогда
				ДокОбъект.ВидЦенКонтрагента 	    	= ДокОбъект.Договор.ВидЦенКонтрагента;
				ДокОбъект.РегистрироватьЦеныПоставщика	= Истина;
			КонецЕсли;
		КонецЕсли;
		
		//Шапка
		ДокОбъект.Дата 						= СтрокаТТН.OPERATION_DATE;
		ДокОбъект.Организация 				= Организация;
		ДокОбъект.Заполнить(Неопределено);
		Если СтрокаТТН.INV_TYPE_NAME = Перечисления.РС_ТипыНД.ВнутреннееПеремещение Тогда
			Если ЗначениеЗаполнено(СтрокаТТН.TRANS_START_ADDRESS) Тогда
				СтрокаСклада =  ТаблицаСкладов.Найти(СтрокаТТН.TRANS_START_ADDRESS, "Адрес");
				Если ЗначениеЗаполнено(СтрокаСклада) Тогда
					ДокОбъект.СтруктурнаяЕдиница	= СтрокаСклада.Склад;
				Иначе
					ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
				КонецЕсли;
			Иначе
				ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаТТН.TRANS_END_ADDRESS) Тогда
				СтрокаСклада =  ТаблицаСкладов.Найти(СтрокаТТН.TRANS_END_ADDRESS, "Адрес");
				Если ЗначениеЗаполнено(СтрокаСклада) Тогда
					ДокОбъект.СтруктурнаяЕдиницаПолучатель	= СтрокаСклада.Склад;
				Иначе
					ДокОбъект.СтруктурнаяЕдиницаПолучатель	= Неопределено;
				КонецЕсли;
			Иначе
				ДокОбъект.СтруктурнаяЕдиницаПолучатель	= Неопределено;
			КонецЕсли;
		ИначеЕсли СтрокаТТН.INV_TYPE_NAME = Перечисления.РС_ТипыНД.ВозвратОтПокупателя Тогда
			Если ЗначениеЗаполнено(СтрокаТТН.TRANS_START_ADDRESS) Тогда
				СтрокаСклада =  ТаблицаСкладов.Найти(СтрокаТТН.TRANS_START_ADDRESS, "Адрес");
				Если ЗначениеЗаполнено(СтрокаСклада) Тогда
					ДокОбъект.СтруктурнаяЕдиница	= СтрокаСклада.Склад;
				Иначе
					ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
				КонецЕсли;
			Иначе
				ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(СтрокаТТН.TRANS_END_ADDRESS) Тогда
				СтрокаСклада =  ТаблицаСкладов.Найти(СтрокаТТН.TRANS_END_ADDRESS, "Адрес");
				Если ЗначениеЗаполнено(СтрокаСклада) Тогда
					ДокОбъект.СтруктурнаяЕдиница	= СтрокаСклада.Склад;
				Иначе
					ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
				КонецЕсли;
			Иначе
				ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
			КонецЕсли;
		КонецЕсли;
		ДокОбъект.УстановитьНовыйНомер();
		//შესაცველია
		ДокОбъект.НомерСФ	 				= СтрокаТТН.INV_NUMBER;
		ДокОбъект.IDСФ						= СтрокаТТН.ID;
		//ДокОбъект.СтатусТТН   			  = СтрокаТТН.СтатусТН;
		//ДокОбъект.ДатаНачалаТранспортировки = СтрокаТТН.BEGIN_DATE;

		//Запасы-Услуги
		СтрокиТоваров = Объект.ТоварыНаПортале.НайтиСтроки(Новый Структура("INVOICE_ID",СтрокаТТН.ID));
		ЕстьУслуга	= Ложь;
		ЕстьТовар	= Ложь;
		Если СтрокаТТН.INV_TYPE_NAME = Перечисления.РС_ТипыНД.ВнутреннееПеремещение Тогда
			Для Каждого СтрокаТовары Из СтрокиТоваров Цикл
				НоваяСтрокаТЧ = ДокОбъект.Запасы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТовары);
				НоваяСтрокаТЧ.СтранаПроисхождения 	= НоваяСтрокаТЧ.Номенклатура.СтранаПроисхождения;
				НоваяСтрокаТЧ.НомерГТД			  	= Неопределено;
				НоваяСтрокаТЧ.Количество		  	= СтрокаТовары.QUANTITY;
				
				РегистрыСведений.ТоварыПоставщиковВТТН.ЗаписатьВРегистрТоварыПоставщиковНД(СтрокаТовары);
			КонецЦикла;
		ИначеЕсли СтрокаТТН.INV_TYPE_NAME = Перечисления.РС_ТипыНД.ВозвратОтПокупателя Тогда
			СтавкаНДСПоУмолчанию = Неопределено;
			Если      ДокОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
				СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
			ИначеЕсли ДокОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НаЭкспорт Тогда
				СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
			КонецЕсли;
			Для Каждого СтрокаТовары Из СтрокиТоваров Цикл
				НоваяСтрокаТЧ = ДокОбъект.Запасы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТовары);
				НоваяСтрокаТЧ.СтранаПроисхождения 	= НоваяСтрокаТЧ.Номенклатура.СтранаПроисхождения;
				НоваяСтрокаТЧ.НомерГТД			  	= Неопределено;
				НоваяСтрокаТЧ.Количество		  	= СтрокаТовары.QUANTITY;
				НоваяСтрокаТЧ.Цена				  	= ?(СтрокаТовары.QUANTITY = 0, 0, СтрокаТовары.AMOUNT/СтрокаТовары.QUANTITY);
				НоваяСтрокаТЧ.Сумма				 	= СтрокаТовары.AMOUNT;
				Если ЗначениеЗаполнено(СтавкаНДСПоУмолчанию) Тогда
					НоваяСтрокаТЧ.СтавкаНДС 	= СтавкаНДСПоУмолчанию;
				Иначе
					Если СтрокаТовары.VAT_TYPE = 1 Тогда 
						НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС0");
					ИначеЕсли СтрокаТовары.VAT_TYPE = 2 Тогда 
						НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("БезНДС");
					Иначе 
						НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС18");
					КонецЕсли;
				КонецЕсли;
				РассчитатьСуммуВСтрокеТабличнойЧасти(ДокОбъект,НоваяСтрокаТЧ);
				
				РегистрыСведений.ТоварыПоставщиковВТТН.ЗаписатьВРегистрТоварыПоставщиковНД(СтрокаТовары);
			КонецЦикла;
		Иначе
			СтавкаНДСПоУмолчанию = Неопределено;
			Если      ДокОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
				СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
			ИначеЕсли ДокОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НаЭкспорт Тогда
				СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
			КонецЕсли;
			Для Каждого СтрокаТовары Из СтрокиТоваров Цикл
				Если СтрокаТовары.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
					НоваяСтрокаТЧ = ДокОбъект.Расходы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТовары);
					Если Не ЗначениеЗаполнено(ОсновноеПодразделение) Тогда
						ОсновноеПодразделение = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
					КонецЕсли;
					НоваяСтрокаТЧ.СтруктурнаяЕдиница = ОсновноеПодразделение;
					ЕстьУслуга	= Истина;
				Иначе
					НоваяСтрокаТЧ = ДокОбъект.Запасы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТовары);
					НоваяСтрокаТЧ.СтранаПроисхождения 				= СтрокаТовары.Номенклатура.СтранаПроисхождения;
					НоваяСтрокаТЧ.НеобходимостьВводаАкцизнойМарки	= НоваяСтрокаТЧ.Номенклатура.ВидАлкогольнойПродукции.Маркируемый;
					НоваяСтрокаТЧ.НомерГТД			  				= Неопределено;
					ЕстьТовар	= Истина;
				КонецЕсли;
				НоваяСтрокаТЧ.Содержание			= СтрокаТовары.GOODS_NAME;
				НоваяСтрокаТЧ.Количество		  	= СтрокаТовары.QUANTITY;
				НоваяСтрокаТЧ.Цена				  	= ?(СтрокаТовары.QUANTITY = 0, 0, СтрокаТовары.AMOUNT/СтрокаТовары.QUANTITY);
				НоваяСтрокаТЧ.Сумма				 	= СтрокаТовары.AMOUNT;
				Если ЗначениеЗаполнено(СтавкаНДСПоУмолчанию) Тогда
					НоваяСтрокаТЧ.СтавкаНДС 	= СтавкаНДСПоУмолчанию;
				Иначе
					Если СтрокаТовары.VAT_TYPE = 1 Тогда 
						НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС0");
					ИначеЕсли СтрокаТовары.VAT_TYPE = 2 Тогда 
						НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("БезНДС");
					Иначе 
						НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС18");
					КонецЕсли;
				КонецЕсли;
				РассчитатьСуммуВСтрокеТабличнойЧасти(ДокОбъект,НоваяСтрокаТЧ);
				
				РегистрыСведений.ТоварыПоставщиковВТТН.ЗаписатьВРегистрТоварыПоставщиковНД(СтрокаТовары);
			КонецЦикла;
		КонецЕсли;
		
		Попытка
			Если СтрокаТТН.INV_TYPE_NAME = Перечисления.РС_ТипыНД.ВнутреннееПеремещение И (НЕ ЗначениеЗаполнено(ДокОбъект.СтруктурнаяЕдиница) ИЛИ НЕ ЗначениеЗаполнено(ДокОбъект.СтруктурнаяЕдиницаПолучатель)) Тогда
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				впНоваяСтрокаДок = Объект.СозданныеДокументы.Добавить();
				впНоваяСтрокаДок.Документ	= ДокОбъект.Ссылка;
				впНоваяСтрокаДок.Проведен	= Ложь;
			Иначе
				Попытка
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
					впНоваяСтрокаДок = Объект.СозданныеДокументы.Добавить();
					впНоваяСтрокаДок.Документ	= ДокОбъект.Ссылка;
					впНоваяСтрокаДок.Проведен	= Истина;
				Исключение
					ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
					впНоваяСтрокаДок = Объект.СозданныеДокументы.Добавить();
					впНоваяСтрокаДок.Документ	= ДокОбъект.Ссылка;
					впНоваяСтрокаДок.Проведен	= Ложь;
				КонецПопытки;
			КонецЕсли;
			СтрокаТТН.Документ			= ДокОбъект.Ссылка;
			СтрокаТТН.Флаг				= Ложь;
			СтрокаТТН.ДокументПревязан 	= Истина;
			Если ЕстьУслуга И ЕстьТовар Тогда
				СтрокаТТН.СтатусСинхронизации	= "ნაწილობრივ ჩამოწერილი მომსახურებაში";
			ИначеЕсли ЕстьУслуга И НЕ ЕстьТовар Тогда
				СтрокаТТН.СтатусСинхронизации	= "ჩამოწერილი მომსახურებაში";
			Иначе
				СтрокаТТН.СтатусСинхронизации	= "სრულად სინქრონიზირებული";
			КонецЕсли;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;		
		
		СоздатьНалоговыйДокумент(СтрокаТТН,ДокОбъект,СтрокиТоваров);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьНалоговыйДокумент(Стр,ДокОбъект,СтрокиТоваров)
	
	НовДок = Документы.РС_НалоговыйДокумент.СоздатьДокумент();
	
	НоваяСтрока = НовДок.ДокументыОснования.Добавить();
	НоваяСтрока.ДокументОснование = ДокОбъект.Ссылка;
	
	НовДок.ЗаполнитьДанныеДляОбмена(ДокОбъект.Ссылка);
	НовДок.ID_НД                       = Стр.ID;
	НовДок.АдресДоставки               = Стр.TRANS_END_ADDRESS;
	НовДок.АдресОтправки               = Стр.TRANS_START_ADDRESS;
	НовДок.ВидТранспортировки          = ПолучитьТипТранспортировки(Стр.TRANS_NAME);
	
	Если НовДок.ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Прочее Тогда
		НовДок.ДругойТранспорт = Стр.TRANS_NAME;
	КонецЕсли;	
	
	НовДок.Организация = Организация;	
	
	Водитель = ПолучитьВодительПоСтроке(Стр.TRANS_DRIVER);
	НовДок.Водитель                    = Водитель;
	НовДок.НомерУдостоверения          = Водитель.ИНН;
	
	НовДок.ГосНомерАвтомобиля          = Стр.TRANS_CAR_NO;
	НовДок.ГосНомерПрицепа             = Стр.TRANS_TRAILER_NO;
	НовДок.ГрузоОтправитель            = Стр.Контрагент;
	НовДок.ГрузоПолучатель             = Организация;
	НовДок.Дата                        = ТекущаяДата();
	НовДок.ДатаАктивации               = Стр.ACTIVATE_DATE;
	НовДок.ДатаДоставкиНД              = Стр.DELIVERY_DATE;
	НовДок.ДатаНачалаТранспортировки   = Стр.TRANS_START_DATE;
	НовДок.КомментарийНД               = Стр.INV_COMMENT;
	НовДок.НазначениеНД                = Стр.INV_CATEGORY_NAME;
	НовДок.НомерНД                     = Стр.ID;
	НовДок.НомерУдостоверения          = Стр.TRANS_DRIVER;
	НовДок.Получен                     = Истина;
	
	Перевозчик = ПолучитьКонтрагентПоСтроке(Стр.TRANS_COMPANY,Неопределено);	
	НовДок.Перевозчик                  = Перевозчик;
	
	НовДок.ПлательщикТранспортировкиНД = ПолучитьПлательщикТранспортировки(Стр.TRANS_COST_PAYER);
	
	НовДок.Прицеп                      = Стр.TRANS_TRAILER_NO;
	НовДок.СтатусНД                    = Стр.ACTION;
	НовДок.ТипНД                       = Стр.INV_TYPE_NAME;
	
	Для Каждого СтрокаТовары Из СтрокиТоваров Цикл 
		
		НоваяСтрокаТЧ = НовДок.Товары.Добавить();
		
		НоваяСтрокаТЧ.Номенклатура			= СтрокаТовары.Номенклатура;
		НоваяСтрокаТЧ.НаименованиеДляРС     = СтрокаТовары.GOODS_NAME;
		НоваяСтрокаТЧ.ЕдиницаИзмерения      = СтрокаТовары.ЕдиницаИзмерения;
		НоваяСтрокаТЧ.Характеристика        = СтрокаТовары.Характеристика;
		НоваяСтрокаТЧ.Количество		  	= СтрокаТовары.QUANTITY;
		НоваяСтрокаТЧ.Цена				  	= ?(СтрокаТовары.QUANTITY = 0, 0, СтрокаТовары.AMOUNT/СтрокаТовары.QUANTITY);
		НоваяСтрокаТЧ.Сумма				 	= СтрокаТовары.AMOUNT;
		
		Если СтрокаТовары.VAT_TYPE = 1 Тогда 
			НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС0");
		ИначеЕсли СтрокаТовары.VAT_TYPE = 2 Тогда 
			НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("БезНДС");
		Иначе 
			НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС18");
		КонецЕсли;
		
		НоваяСтрокаТЧ.СуммаНДС = СтрокаТовары.VAT_AMOUNT;
		
	КонецЦикла;	
	
	НовДок.Записать();
	                                       
КонецПроцедуры	

&НаСервере
Функция ПолучитьТипТранспортировки(Строка)

	Если Строка = "საავტომობილო" Тогда		
		Возврат Перечисления.РС_ВидыТранспортировки.Автомобильная;		
	ИначеЕсли Строка = "გადამზიდავი საავტომობილო" Тогда		
		Возврат Перечисления.РС_ВидыТранспортировки.Перегрузчик_Автомобильная;		
	Иначе
		Возврат Перечисления.РС_ВидыТранспортировки.Прочее;		
	КонецЕсли;	
		
КонецФункции

&НаСервере
Функция ПолучитьПлательщикТранспортировки(Строка)

	Если Строка = "მყიდველი" Тогда		
		Возврат Перечисления.ПлательщикТранспортировкиТН.Покупатель;				
	Иначе
		Возврат Перечисления.ПлательщикТранспортировкиТН.Продавец;		
	КонецЕсли;	
		
КонецФункции


&НаСервере
Процедура СоздатьДокументы_Отправленные_НаСервере(ТаблицаСкладов,	ЕстьОшибки, СчетаУчета)
	
	ОтмеченныеСтроки = Объект.ТоварныеНакладныеНаПортале.НайтиСтроки(Новый Структура("Флаг, ЕстьОшибки, Полученный", Истина, Ложь, Ложь));
	Для Каждого СтрокаТТН Из ОтмеченныеСтроки Цикл
		//Создать документ
		Если СтрокаТТН.TYPE = Перечисления.РС_ТипыНД.ВнутреннееПеремещение ИЛИ СтрокаТТН.TYPE = Перечисления.РС_ТипыНД.Дистрибуция Тогда
			ДокОбъект = Документы.ПеремещениеЗапасов.СоздатьДокумент();
			ДокОбъект.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение;
		ИначеЕсли СтрокаТТН.TYPE = Перечисления.РС_ТипыНД.ВозвратОтПокупателя Тогда
			ДокОбъект = Документы.ПриходнаяНакладная.СоздатьДокумент();
			ДокОбъект.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя;
			Если ЗначениеЗаполнено(СтрокаТТН.Контрагент) Тогда
				ДокОбъект.Контрагент				= СтрокаТТН.Контрагент;
			Иначе
				Если СоздатьНовыйКонтрагентЕслиНеНайден Тогда
					СтрокаТТН.Контрагент = ПолучитьКонтрагентПоСтроке(СтрокаТТН.BUYER,СчетаУчета);
					ДокОбъект.Контрагент = СтрокаТТН.Контрагент;
				КонецЕсли;
			КонецЕсли;
			ДокОбъект.Договор 	 				= ДокОбъект.Контрагент.ДоговорПоУмолчанию;
			ДокОбъект.ВалютаДокумента	 		= НациональнаяВалюта;
		Иначе
			ДокОбъект = Документы.РасходнаяНакладная.СоздатьДокумент();
			ДокОбъект.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю;
			Если ЗначениеЗаполнено(СтрокаТТН.Контрагент) Тогда
				ДокОбъект.Контрагент				= СтрокаТТН.Контрагент;
			Иначе
				Если СоздатьНовыйКонтрагентЕслиНеНайден Тогда
					СтрокаТТН.Контрагент = ПолучитьКонтрагентПоСтроке(СтрокаТТН.BUYER,СчетаУчета);
					ДокОбъект.Контрагент = СтрокаТТН.Контрагент;
				КонецЕсли;
			КонецЕсли;
			ДокОбъект.Договор 	 				= ДокОбъект.Контрагент.ДоговорПоУмолчанию;
			ДокОбъект.ВалютаДокумента	 		= НациональнаяВалюта;
		КонецЕсли;
		
		//Шапка
		ДокОбъект.Дата 						= ?(ЗначениеЗаполнено(СтрокаТТН.OPERATION_DATE), СтрокаТТН.OPERATION_DATE, СтрокаТТН.ACTIVATE_DATE);
		ДокОбъект.Организация 				= Организация;
		ДокОбъект.Заполнить(Неопределено);
		Если СтрокаТТН.TYPE = Перечисления.РС_ТипыНД.Дистрибуция Тогда //Дистрибюция
			Если ЗначениеЗаполнено(СтрокаТТН.TRANS_START_ADDRESS) Тогда
				СтрокаСклада =  ТаблицаСкладов.Найти(СтрокаТТН.TRANS_START_ADDRESS, "Адрес");
				Если ЗначениеЗаполнено(СтрокаСклада) Тогда
					ДокОбъект.СтруктурнаяЕдиница	= СтрокаСклада.Склад;
				Иначе
					ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
				КонецЕсли;
			Иначе
				ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаТТН.TRANS_END_ADDRESS) Тогда
				СтрокаСклада =  ТаблицаСкладов.Найти(СтрокаТТН.TRANS_END_ADDRESS, "Адрес");
				Если ЗначениеЗаполнено(СтрокаСклада) Тогда
					ДокОбъект.СтруктурнаяЕдиницаПолучатель	= СтрокаСклада.Склад;
				Иначе
					ДокОбъект.СтруктурнаяЕдиницаПолучатель	= Неопределено;
				КонецЕсли;
			Иначе
				ДокОбъект.СтруктурнаяЕдиницаПолучатель	= Неопределено;
			КонецЕсли;
		ИначеЕсли СтрокаТТН.TYPE = Перечисления.РС_ТипыНД.ВозвратОтПокупателя Тогда  //Возврат от покупателя
			Если ЗначениеЗаполнено(СтрокаТТН.TRANS_START_ADDRESS) Тогда
				СтрокаСклада =  ТаблицаСкладов.Найти(СтрокаТТН.TRANS_END_ADDRESS, "Адрес");
				Если ЗначениеЗаполнено(СтрокаСклада) Тогда
					ДокОбъект.СтруктурнаяЕдиница	= СтрокаСклада.Склад;
				Иначе
					ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
				КонецЕсли;
			Иначе
				ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
			КонецЕсли;
		Иначе //Реализация
			Если ЗначениеЗаполнено(СтрокаТТН.TRANS_END_ADDRESS) Тогда
				СтрокаСклада =  ТаблицаСкладов.Найти(СтрокаТТН.TRANS_START_ADDRESS, "Адрес");
				Если ЗначениеЗаполнено(СтрокаСклада) Тогда
					ДокОбъект.СтруктурнаяЕдиница	= СтрокаСклада.Склад;
				Иначе
					ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
				КонецЕсли;
			Иначе
				ДокОбъект.СтруктурнаяЕдиница	= Неопределено;
			КонецЕсли;
		КонецЕсли;
		ДокОбъект.УстановитьНовыйНомер();
		ДокОбъект.НомерСФ	 				= СтрокаТТН.INV_NUMBER;
		ДокОбъект.IDСФ						= СтрокаТТН.ID;
		
		//Запасы-Услуги
		//СтрокиТоваров = Объект.ТоварыНаПортале.НайтиСтроки(Новый Структура("WAYBILL_NUMBER", СтрокаТТН.WAYBILL_NUMBER));
		СтрокиТоваров = Объект.ТоварыНаПортале.НайтиСтроки(Новый Структура("INVOICE_ID", СтрокаТТН.ID));
		Если СтрокаТТН.TYPE = Перечисления.РС_ТипыНД.ВнутреннееПеремещение ИЛИ СтрокаТТН.TYPE = Перечисления.РС_ТипыНД.Дистрибуция Тогда
			Для Каждого СтрокаТовары Из СтрокиТоваров Цикл
				НоваяСтрокаТЧ = ДокОбъект.Запасы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТовары);
				НоваяСтрокаТЧ.СтранаПроисхождения 	= НоваяСтрокаТЧ.Номенклатура.СтранаПроисхождения;
				НоваяСтрокаТЧ.НомерГТД			  	= Неопределено;
				НоваяСтрокаТЧ.Количество		  	= СтрокаТовары.QUANTITY;
				
				РегистрыСведений.ТоварыПоставщиковВТТН.ЗаписатьВРегистрТоварыПоставщиковНД(СтрокаТовары);
			КонецЦикла;
		ИначеЕсли СтрокаТТН.TYPE = Перечисления.РС_ТипыНД.ВозвратОтПокупателя Тогда
			Для Каждого СтрокаТовары Из СтрокиТоваров Цикл
				НоваяСтрокаТЧ = ДокОбъект.Запасы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТовары);
				НоваяСтрокаТЧ.СтранаПроисхождения 	= НоваяСтрокаТЧ.Номенклатура.СтранаПроисхождения;
				НоваяСтрокаТЧ.НеобходимостьВводаАкцизнойМарки	= НоваяСтрокаТЧ.Номенклатура.ВидАлкогольнойПродукции.Маркируемый;
				НоваяСтрокаТЧ.НомерГТД			  	= Неопределено;
				НоваяСтрокаТЧ.Количество		  	= СтрокаТовары.QUANTITY;
				НоваяСтрокаТЧ.Цена				  	= ?(СтрокаТовары.QUANTITY = 0, 0, СтрокаТовары.AMOUNT/СтрокаТовары.QUANTITY);
				НоваяСтрокаТЧ.Сумма				 	= СтрокаТовары.AMOUNT;
				Если СтрокаТовары.VAT_TYPE = 1 Тогда 
					НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС0");
				ИначеЕсли СтрокаТовары.VAT_TYPE = 2 Тогда 
					НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("БезНДС");
				Иначе 
					НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС18");
				КонецЕсли;
				РассчитатьСуммуВСтрокеТабличнойЧасти(ДокОбъект,НоваяСтрокаТЧ);
				
				РегистрыСведений.ТоварыПоставщиковВТТН.ЗаписатьВРегистрТоварыПоставщиковНД(СтрокаТовары);
			КонецЦикла;
		Иначе
			Для Каждого СтрокаТовары Из СтрокиТоваров Цикл
				//Если СтрокаТовары.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
				//	НоваяСтрокаТЧ = ДокОбъект.Расходы.Добавить();
				//	ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТовары);
				//	Если Не ЗначениеЗаполнено(ОсновноеПодразделение) Тогда
				//		ОсновноеПодразделение = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
				//	КонецЕсли;
				//	НоваяСтрокаТЧ.СтруктурнаяЕдиница = ОсновноеПодразделение;
				//Иначе
					НоваяСтрокаТЧ = ДокОбъект.Запасы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТовары);
					НоваяСтрокаТЧ.СтранаПроисхождения 				= СтрокаТовары.Номенклатура.СтранаПроисхождения;
					НоваяСтрокаТЧ.НомерГТД			  				= Неопределено;
				//КонецЕсли;
				НоваяСтрокаТЧ.Количество		  	= СтрокаТовары.QUANTITY;
				НоваяСтрокаТЧ.Цена				  	= ?(СтрокаТовары.QUANTITY = 0, 0, СтрокаТовары.AMOUNT/СтрокаТовары.QUANTITY);
				НоваяСтрокаТЧ.Сумма				 	= СтрокаТовары.AMOUNT;
				Если СтрокаТовары.VAT_TYPE = 1 Тогда 
					НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС0");
				ИначеЕсли СтрокаТовары.VAT_TYPE = 2 Тогда 
					НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("БезНДС");
				Иначе 
					НоваяСтрокаТЧ.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС18");
				КонецЕсли;
				РассчитатьСуммуВСтрокеТабличнойЧасти(ДокОбъект,НоваяСтрокаТЧ);
				
				РегистрыСведений.ТоварыПоставщиковВТТН.ЗаписатьВРегистрТоварыПоставщиковНД(СтрокаТовары);
			КонецЦикла;
		КонецЕсли;
		
		Попытка
			Если (СтрокаТТН.TYPE = Перечисления.РС_ТипыНД.ВнутреннееПеремещение ИЛИ СтрокаТТН.TYPE = Перечисления.РС_ТипыНД.Дистрибуция) И (НЕ ЗначениеЗаполнено(ДокОбъект.СтруктурнаяЕдиница) ИЛИ НЕ ЗначениеЗаполнено(ДокОбъект.СтруктурнаяЕдиницаПолучатель)) Тогда
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				впНоваяСтрокаДок = Объект.СозданныеДокументы.Добавить();
				впНоваяСтрокаДок.Документ	= ДокОбъект.Ссылка;
				впНоваяСтрокаДок.Проведен	= Ложь;
			Иначе
				Попытка
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
					впНоваяСтрокаДок = Объект.СозданныеДокументы.Добавить();
					впНоваяСтрокаДок.Документ	= ДокОбъект.Ссылка;
					впНоваяСтрокаДок.Проведен	= Истина;
				Исключение
					ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
					впНоваяСтрокаДок = Объект.СозданныеДокументы.Добавить();
					впНоваяСтрокаДок.Документ	= ДокОбъект.Ссылка;
					впНоваяСтрокаДок.Проведен	= Ложь;
				КонецПопытки;
			КонецЕсли;
			СтрокаТТН.Документ			= ДокОбъект.Ссылка;
			СтрокаТТН.Флаг				= Ложь;
			СтрокаТТН.ДокументПревязан	= Истина;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(ДокОбъект, СтрокаТабличнойЧасти = Неопределено)
	
	//СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	РассчитатьСуммуНДС(ДокОбъект,СтрокаТабличнойЧасти);
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(ДокОбъект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	
КонецПроцедуры // РассчитатьСуммуВСтрокеТабличнойЧасти()

&НаСервере
Процедура РассчитатьСуммуНДС(ДокОбъект,СтрокаТабличнойЧасти)
	
	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
	
	СтрокаТабличнойЧасти.СуммаНДС = ?(ДокОбъект.СуммаВключаетНДС, 
									  СтрокаТабличнойЧасти.Сумма - (СтрокаТабличнойЧасти.Сумма) / ((СтавкаНДС + 100) / 100),
									  СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварныеНакладныеНаПорталеПриАктивизацииСтроки(Элемент)
	впТекущаяСтрока = Элемент.ТекущиеДанные;
	
	Если впТекущаяСтрока <> Неопределено Тогда
		Элементы.ТоварыНаПортале.ОтборСтрок = Новый ФиксированнаяСтруктура("INVOICE_ID", впТекущаяСтрока.ID);
	Иначе 
		Элементы.ТоварыНаПортале.ОтборСтрок = Новый ФиксированнаяСтруктура("INVOICE_ID", "????");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьУпаковкуПоИмениЕдиницы(ИмяЕдиницы, ВладелецНоменклатура, ИзРегистра)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЕдиницыИзмерения.Ссылка КАК ЕдиницаИзмерения
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|ГДЕ
	|	ЕдиницыИзмерения.КодДляНалоговой = &ИмяЕдиницы");
	
	
	Запрос.УстановитьПараметр("ИмяЕдиницы", ИмяЕдиницы);
	Запрос.УстановитьПараметр("Владелец", ВладелецНоменклатура);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		//впУпаковка = Выборка.Упаковка;
		
		СтруктураЕдиниц = Новый Структура;
		СтруктураЕдиниц.Вставить("ЕдиницаИзмерения", ?(ЗначениеЗаполнено(Выборка.ЕдиницаИзмерения), Выборка.ЕдиницаИзмерения, Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка()));
		
		//Возврат ?(ЗначениеЗаполнено(впУпаковка), впУпаковка, Неопределено);
		Возврат СтруктураЕдиниц;
		
	КонецЕсли;
	СтруктураЕдиниц = Новый Структура;
	СтруктураЕдиниц.Вставить("ЕдиницаИзмерения", ВладелецНоменклатура.ЕдиницаИзмерения);
	Возврат СтруктураЕдиниц;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьНоменклатуру(Команда)
	ЗаполнитьНоменклатуруПолученные_НаСервере();
	ЗаполнитьНоменклатуруОтправленные_НаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНоменклатуруПолученные_НаСервере()
	СтрокиПриходов = Объект.ТоварыНаПортале.НайтиСтроки(Новый Структура("Полученный", Истина));
	Для Каждого СтрокаТЧ Из СтрокиПриходов Цикл
		РегистрыСведений.ТоварыПоставщиковВТТН.ЗаполнитьДанныеПоНоменклатуреПоставщикаНД(СтрокаТЧ);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНоменклатуруОтправленные_НаСервере()
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ЗаполнитьНоменклатуруНД_Отправленные(ИмяСоответствияНоменклатуры, Объект.ТоварыНаПортале);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСоответствиеНоменклатуры()
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ИмяСоответствияНоменклатуры = "Код";
	Иначе
		СоответствиеОтправленныхНоменклатур = Организация.СоответствиеПриВыгрузкеОтправленныхНоменклатур;
		Если	  СоответствиеОтправленныхНоменклатур = 0 Тогда
			ИмяСоответствияНоменклатуры = "Код";
		ИначеЕсли СоответствиеОтправленныхНоменклатур = 1 Тогда
			ИмяСоответствияНоменклатуры = "Артикул";
		ИначеЕсли СоответствиеОтправленныхНоменклатур = 2 Тогда
			ИмяСоответствияНоменклатуры = "ОсновнойШтрихКод";
		Иначе
			ИмяСоответствияНоменклатуры = "Наименование";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНаПорталеНоменклатураПриИзменении(Элемент)
	ТекДанные = Элементы.ТоварыНаПортале.ТекущиеДанные;
	ТекДанные.ЕдиницаИзмерения = РС_ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТекДанные.Номенклатура, "ЕдиницаИзмерения");
КонецПроцедуры


&НаСервере
Процедура ПроверитьПередСозданиемДокументов(ЕстьОшибки)
	
	НЕ_СоздатьНовыйКонтрагентЕслиНеНайден = НЕ СоздатьНовыйКонтрагентЕслиНеНайден;
	ОтмеченныеСтроки = Объект.ТоварныеНакладныеНаПортале.НайтиСтроки(Новый Структура("Флаг", Истина));
	Для Каждого СтрокаТТН Из ОтмеченныеСтроки Цикл
		СтрокаТТН.ЕстьОшибки = Ложь;//ეს საჭიროა შემოწმებამდე
		Если НЕ_СоздатьНовыйКонтрагентЕслиНеНайден Тогда
			Если НЕ СтрокаТТН.INV_TYPE_NAME = Перечисления.РС_ТипыНД.ВнутреннееПеремещение И НЕ СтрокаТТН.INV_TYPE_NAME = Перечисления.РС_ТипыНД.Дистрибуция И Не ЗначениеЗаполнено(СтрокаТТН.Контрагент) Тогда 
				Сообщение = Новый СообщениеПользователю;
				пНомерСтроки = Формат(СтрокаТТН.НомерСтроки-1, "ЧГ=0");
				Сообщение.Текст = "სტრიქონში ნომერი " + Формат(СтрокаТТН.НомерСтроки, "ЧГ=0") + " ზედნადებისთვის № " +СтрокаТТН.INV_NUMBER+ " არ არის შევსებული კონტრაგენტი";
				Сообщение.Поле =  "Объект.ТоварныеНакладныеНаПортале[" + пНомерСтроки + "].Контрагент";
				Сообщение.УстановитьДанные(Объект);
				Сообщение.Сообщить();
				СтрокаТТН.ЕстьОшибки = Истина;
				ЕстьОшибки = Истина;
			КонецЕсли;
		КонецЕсли;
		
		НомСтр = 0;
		
		СтрокиТоваров = Объект.ТоварыНаПортале.НайтиСтроки(Новый Структура("INVOICE_ID",	СтрокаТТН.ID));
		
		Если СтрокиТоваров.Количество() > 0 Тогда
			Для Каждого СтрокаТовары Из СтрокиТоваров Цикл
				НомСтр = НомСтр +1;
				Если НЕ ЗначениеЗаполнено(СтрокаТовары.Номенклатура) Тогда
					Сообщение = Новый СообщениеПользователю;
					пНомерСтроки 	= Формат(СтрокаТТН.НомерСтроки-1, 		"ЧГ=0");
					пНомерСтрокиТЧ	= Формат(СтрокаТовары.НомерСтроки-1,	"ЧГ=0");
					Сообщение.Текст = "ზედნადებისთვის № " +СтрокаТовары.INVOICE_ID + " საქონლის ცხრილში სტრიქონში ნომერი " + Формат(НомСтр, "ЧГ=0") + " არ არის შევსებული ნომენკლატურა";
					Сообщение.Поле =  "Объект.ТоварыНаПортале[" + пНомерСтрокиТЧ + "].Номенклатура";
					Сообщение.УстановитьДанные(Объект);
					Сообщение.Сообщить();
					СтрокаТТН.ЕстьОшибки = Истина;
					ЕстьОшибки = Истина;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Сообщение = Новый СообщениеПользователю;
			пНомерСтроки = Формат(СтрокаТТН.НомерСтроки-1, "ЧГ=0");
			Сообщение.Текст = "ზედნადებისთვის № " +СтрокаТТН.INV_NUMBER + " საქონლის ცხრილი ცარიელია";
			Сообщение.Поле =  "Объект.ТоварныеНакладныеНаПортале[" + пНомерСтроки + "].НомерСтроки";
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
			СтрокаТТН.ЕстьОшибки = Истина;
			ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекстПодсказки()
	
	Если ДанныеНеСоответствуютФильтру Тогда
		впТекстПодсказки = НСтр("en='The filter is not relevant, click the ""Update""';ka='ფილტრი არ არის აქტუალური, დააჭირეთ ღილაკს ""განახლება""';ru='Фильтр не актуален, нажмите кнопку ""Обновить""'");
		Элементы.ТоварныеНакладныеНаПортале.Подсказка 	= впТекстПодсказки;
		Элементы.ТоварыНаПортале.Подсказка 			= впТекстПодсказки;
	Иначе 
		Элементы.ТоварныеНакладныеНаПортале.Подсказка 	= "";
		Элементы.ТоварыНаПортале.Подсказка 			= "";
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура УстановитьСнятьФлажки(знч_Загружать)
	Если знч_Загружать Тогда
		Для Каждого Стр Из Объект.ТоварныеНакладныеНаПортале Цикл
			Если НЕ ЗначениеЗаполнено(Стр.Документ) Тогда
				Стр.Флаг = знч_Загружать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого Стр Из Объект.ТоварныеНакладныеНаПортале Цикл 
			Стр.Флаг = знч_Загружать;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура СнятьФлажки(Команда)
	УстановитьСнятьФлажки(Ложь);
КонецПроцедуры
&НаКлиенте
Процедура УстановитьФлажки(Команда)
	УстановитьСнятьФлажки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНаПорталеПриАктивизацииЯчейки(Элемент)
	ТекЭлемент = Элементы.ТоварыНаПортале.ТекущийЭлемент;
	Если ТекЭлемент.Имя = "ТоварыНаПорталеНоменклатура" Тогда
		ТекДанныеНакладной = Элементы.ТоварныеНакладныеНаПортале.ТекущиеДанные;
		Если НЕ ТекДанныеНакладной = Неопределено Тогда
			МассивТиповОперации = Новый Массив;
			Если ТекДанныеНакладной.INV_TYPE_NAME = ПредопределенноеЗначение("Перечисление.РС_ТипыНД.ВнутреннееПеремещение") 
				ИЛИ ТекДанныеНакладной.INV_TYPE_NAME = ПредопределенноеЗначение("Перечисление.РС_ТипыНД.Дистрибуция") 
				ИЛИ ТекДанныеНакладной.INV_TYPE_NAME = ПредопределенноеЗначение("Перечисление.РС_ТипыНД.ВозвратОтПокупателя") Тогда
				МассивТиповОперации.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас"));
			Иначе
				Если ТекДанныеНакладной.Состояние = "მიღებული" Тогда
					МассивТиповОперации.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас"));
					МассивТиповОперации.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга"));
				Иначе
					МассивТиповОперации.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас"));
				КонецЕсли;
			КонецЕсли;
			НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипНоменклатуры", Новый ФиксированныйМассив(МассивТиповОперации));
			НовыйМассив = Новый Массив;
			НовыйМассив.Добавить(НовыйПараметр);
			ТекЭлемент.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Группа5ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя = "Продавец" Тогда
		ТоварныеНакладныеНаПорталеПриАктивизацииСтроки(Элементы.ТоварныеНакладныеНаПортале);
	Иначе
		ТоварныеНакладныеНаПорталеПриАктивизацииСтроки(Элементы.ТоварныеНакладныеНаПортале1);
	КонецЕсли;
КонецПроцедуры


	