////////////////////////////////////////////////////////////////////////////////
// Подсистема "Текущие дела".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет список обработчиков текущих дел.
//
// Параметры:
//  Обработчики - Массив - массив ссылок на модули менеджеров или общие модули, в которых
//                         определена процедура ПриЗаполненииСпискаТекущихДел.
//
Процедура ПриОпределенииОбработчиковТекущихДел(Обработчики) Экспорт
	
	Обработчики.Добавить(Обработки.ПомощникВводаНачальныхОстатков);
	Обработчики.Добавить(Справочники.ЗаписиКалендаряПодготовкиОтчетности);
	Обработчики.Добавить(Документы.Событие);
	Обработчики.Добавить(Документы.ЗаданиеНаРаботу);
	
	// Заказ покупателя и заказ-наряд
	Обработчики.Добавить(Документы.ЗаказПокупателя);
	
	Обработчики.Добавить(Документы.ЗаказПоставщику);
	Обработчики.Добавить(Документы.ЗаказНаПроизводство);
	Обработчики.Добавить(Обработки.ЗакрытиеМесяца);
	
	// Напоминания пользователя
	Обработчики.Добавить(ОбщегоНазначения.ОбщийМодуль("ОбсужденияСервер"));
	
	// ИнтернетПоддержкаПользователей
	ИнтернетПоддержкаПользователей.ПриОпределенииОбработчиковТекущихДел(Обработчики);
	// Конец ИнтернетПоддержкаПользователей
	
	Обработчики.Добавить(Справочники.Организации);
	
КонецПроцедуры

// Получает список разделов командного интерфейса в заданном порядке.
//
// Параметры:
//  Разделы - Массив - массив разделов командного интерфейса.
//                     Задает начальный порядок разделов в панели текущих дел.
//
Процедура ПриОпределенииПорядкаРазделовКомандногоИнтерфейса(Разделы) Экспорт
	
	// УНФ Начало
	Разделы.Добавить(НСтр("ka='სამუშაოს დასაწყისი';ru='Начало работы';en='Beginning of work'"));
	Разделы.Добавить(НСтр("ka='გადასახადები და ანგარიშგებულობა';ru='Налоги и отчетность';en='Taxes and Reporting'"));
	Разделы.Добавить(НСтр("ka='მოვლენები';ru='События';en='Events'"));
	Разделы.Добавить(НСтр("ka='სამუშაო დავალება';ru='Задания на работу';en='Job to job'"));
	Разделы.Добавить(НСтр("ka='მყიდველთა შეკვეთები';ru='Заказы покупателей';en='Customer orders'"));
	Разделы.Добавить(НСтр("ka='შეკვეთა განწესი';ru='Заказ наряды';en='order outfits'"));
	Разделы.Добавить(НСтр("ka='შეკვეთები მომწოდებლებისადმი';ru='Заказы поставщикам';en='Supplier Order'"));
	Разделы.Добавить(НСтр("ka='საწარმოო შეკვეთები';ru='Заказы на производство';en='Orders for production'"));
	Разделы.Добавить(НСтр("ka='თვის დახურვა';ru='Закрытие месяца';en='month-end closing'"));
	Разделы.Добавить(НСтр("ka='შეხსენებები';ru='Напоминания';en='reminders'"));
	// УНФ Конец
	
	// ЭДО
	Разделы.Добавить(НСтр("ka='ედბ';ru='ЭДО';en='EDO'"));
	// Конец ЭДО
	
	Разделы.Добавить(Метаданные.Подсистемы.ЗарплатаИПерсонал);
	
	// ИнтернетПоддержкаПользователей
	ИнтернетПоддержкаПользователей.ПриОпределенииПорядкаРазделовКомандногоИнтерфейса(Разделы);
	// Конец ИнтернетПоддержкаПользователей
	
КонецПроцедуры

// Отключает текущие дела.
//
// Параметры:
//  ОтключаемыеДела - Массив - массив строк идентификаторов текущих дел, которые нужно отключать.
//
Процедура ПриОтключенииТекущихДел(ОтключаемыеДела) Экспорт
	
КонецПроцедуры

// Устанавливает общие параметры запросов для расчета текущих дел.
// См. ТекущиеДела.УстановитьОбщиеПараметрыЗапросов().
//
// Параметры:
//  Запрос - выполняемый запрос.
//  ОбщиеПараметрыЗапросов - Структура - общие значения для расчета текущих дел.
//
Процедура УстановитьОбщиеПараметрыЗапросов(Запрос, ОбщиеПараметрыЗапросов) Экспорт
	
	Запрос.УстановитьПараметр("СотрудникиПользователя", УправлениеНебольшойФирмойСервер.ПолучитьСотрудниковПользователя());
	
КонецПроцедуры

// Процедура-обработчик, вызываемая в форме расшифровки текущего дела.
// Устанавливает параметры открытия формы и необходимые отборы списка формы.
//
// Параметры:
//  Форма - УправляемаяФорма
//  Список - ДинамическийСписок
//
Процедура ПриСозданииНаСервере(Форма, Список) Экспорт
	
КонецПроцедуры

// Процедура-обработчик, вызываемая в форме расшифровки текущего дела.
// Позволяет заменить сохраненные значения реквизитов формы.
// Заменяет сохраненные значения реквизитов формы на свойства Форма.Параметры.СтруктураБыстрогоОтбора.
//
// Параметры:
//  Форма - УправляемаяФорма
//  Настройки - Соответствие
//
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Форма, Настройки) Экспорт

КонецПроцедуры

#КонецОбласти